Repository: openSUSE/packages-i18n
Catalog: */po/aspell.*.po
Languages: ca, fr, pt_br

source: An Indonesian (Bahasa Indonesia) dictionary for the aspell spell checker.
ca: Un diccionari indonesi (Bahasa Indonesia) per al corrector ortogràfic aspell.
fr: Un dictionnaire indonésien (Bahasa Indonesia) pour le correcteur orthographique ASpell.
pt_br: Um dicionário para Língua Indonésia (Bahasa Indonesia) para o corretor ortográfico aspell.

source: Icelandic (Íslenska) Dictionary for Aspell
ca: Diccionari islandès (Íslenska) per a l'Aspell
fr: Dictionnaire islandais (Íslenska) pour ASpell
pt_br: Dicionário Islandês (Íslenska) para Aspell

source: An Icelandic (Íslenska) dictionary for the aspell spell checker.
ca: Un diccionari islandès (Íslenska) per al corrector ortogràfic aspell.
fr: Un dictionnaire islandais (Íslenska) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Islandês (Íslenska) para o corretor ortográfico aspell.

source: GNU Aspell - Ispell compatibility
ca: GNU Aspell - Compatibilitat amb l'Ispell
fr: GNU Aspell - Compatibilité Ispell
pt_br: GNU Aspell - Compatibilidade com Ispell

source: GNU Aspell is a spell checker planned to eventually replace Ispell. It can be used as a library or as an independent spell checker. This package contains an ispell script for compatibility reasons so that programs that expect the "ispell" command will work correctly.
ca: GNU Aspell és un corrector ortogràfic planejat per reemplaçar Ispell. Es pot utilitzar com a biblioteca o com a corrector ortogràfic independent. Aquest paquet conté un script ispell per raons de compatibilitat de manera que els programes que esperen l'ordre «ispell» funcionaran correctament.
fr: GNU Aspell est un vérificateur d'orthographe conçu pour finalement remplacer Ispell. Il peut être utilisé comme une bibliothèque ou comme un vérificateur d'orthographe indépendant. Ce paquet contient un script ispell pour des raisons de compatibilité afin que les programmes qui s'attendent à la commande "ispell" puissent fonctionner correctement.
pt_br: GNU Aspell é um corretor ortográfico que eventualmente substituirá o Ispell. Pode ser utilizado como biblioteca ou como um corretor ortográfico independente. Este pacote contem um script ispell por motivos de compatibilidade, de modo que os programas que utilizam o comando "ispell" continuem funcionando corretamente.

source: Italian (italiano) Dictionary for Aspell
ca: Diccionari italià (italiano) per a Aspell
fr: Un dictionnaire italien (italiano) pour Aspell
pt_br: Dicionário Italiano para Aspell

source: An Italian (italiano) dictionary for the aspell spell checker.
ca: Un diccionari italià (italiano) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire italien (italiano) pour le correcteur orthographique ASpell.
pt_br: Um dicionário de Italiano para o corretor ortográfico aspell.

source: Kannada (ಕನ್ನಡ) Dictionary for Aspell
ca: Kannada ( Dictionary) Diccionari d'Aspell
fr: Un dictionnaire kannada (ಕನ್ನಡ) pour Aspell
pt_br: Dicionário Kannada (ಕನ್ನಡ) para Aspell

source: A Kannada (ಕನ್ನಡ) dictionary for the aspell spell checker.
ca: Un diccionari de Kannada ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire kannada (ಕನ್ನಡ) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Kannada (ಕನ್ನಡ) para o corretor ortográfico aspell.

source: Kurdi (Kurdî, كوردی‎) Dictionary for Aspell
ca: Kurdi (Kurd Dictionary, ) ) Diccionari d'Aspell
fr: Dictionnaire kurde (Kurdî, كوردی‎) pour ASpell
pt_br: Dicionário Curdo (Kurdî, كوردی‎) para Aspell

source: A Kurdi (Kurdî, كوردی‎) dictionary for the aspell spell checker.
ca: Un diccionari Kurdi (Kurd., .) per al corrector ortogràfic aspell.
fr: Un dictionnaire kurde (Kurdî, كوردی‎) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Curdo (Kurdî, كوردی‎) para o corretor ortográfico aspell.

source: Kirghiz (Кыргызча) Dictionary for Aspell
ca: Kirghiz ( Dictionary) Diccionari per a l'Aspell
fr: Dictionnaire kirghize (Кыргызча) pour ASpell
pt_br: Dicionário Quirguiz (Кыргызча) para Aspell

source: A Kirghiz (Кыргызча) dictionary for the aspell spell checker.
ca: Un diccionari de Kirghiz (.) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire kirghize (Кыргызча) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Quirguiz (Кыргызча) para o corretor ortográfico aspell.

source: Latin (latine) Dictionary for Aspell
ca: Diccionari llatí (llatí) per a l'Aspell
fr: Un dictionnaire latin (latine) pour Aspell
pt_br: Dicionário de Latim para Aspell

source: A Latin (latine) dictionary for the aspell spell checker.
ca: Un diccionari llatí (llatí) per al corrector ortogràfic aspell.
fr: Un dictionnaire latin (latine) pour le correcteur orthographique ASpell.
pt_br: Um dicionário de Latim para o corretor ortográfico aspell.

source: Lithuanian (lietuvių) Dictionary for Aspell
ca: Diccionari lituà (lietuvi)) per a l'Aspell
fr: Dictionnaire lituanien (lietuvių) pour ASpell
pt_br: Dicionário de Língua Lituana (lietuvių) para Aspell

source: A Lithuanian ((lietuvių) dictionary for the aspell spell checker.
ca: Un diccionari lituà ((lietuvi.) per al corrector ortogràfic aspell.
fr: Un dictionnaire lituanien (lietuvių) pour le correcteur orthographique ASpell.
pt_br: Um dicionário de Língua Lituana (lietuvių) para o corretor ortográfico aspell.

source: Latvian (latviešu) Dictionary for Aspell
ca: Diccionari letó (latvie)u) per a l'Aspell
fr: Un dictionnaire letton (latviešu) pour Aspell
pt_br: Dicionário de Língua Letã (latviešu) para Aspell

source: A Latvian (latviešu) dictionary for the aspell spell checker.
ca: Un diccionari letó (latvie.u) per al corrector ortogràfic aspell.
fr: Un dictionnaire letton (latviešu) pour le correcteur orthographique ASpell.
pt_br: Um dicionário de Língua Letã (latviešu) para o corretor ortográfico aspell.

source: Malagasy Dictionary for Aspell
ca: Diccionari malgaix per a Aspell
fr: Dictionnaire malgache pour ASpell
pt_br: Dicionário Malgaxe para Aspell

source: A Malagasy dictionary for the aspell spell checker.
ca: Un diccionari malgaix per al corrector ortogràfic d'aspell.
fr: Un dictionnaire malgache pour le correcteur orthographique ASpell.
pt_br: Um dicionário Malgaxe para o corretor ortográfico aspell.

source: Maori (Māori) Dictionary for Aspell
ca: Diccionari maori (M)ori) per a l'Aspell
fr: Un dictionnaire maori (Māori) pour Aspell
pt_br: Dicionário Maori (Māori) para Aspell

source: A Maori (Māori) dictionary for the aspell spell checker.
ca: Un diccionari maori (M dictionaryori) per al corrector ortogràfic aspell.
fr: Un dictionnaire maori (Māori) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Maori (Māori) para o corretor ortográfico aspell.

source: Macedonian (македонски) Dictionary for Aspell
ca: Diccionari macedoni ( Dictionary) per a l'Aspell
fr: Un dictionnaire macédonien (македонски) pour Aspell
pt_br: Dicionário de Língua Macedônica (македонски) para Aspell

source: A Macedonian (македонски) dictionary for the aspell spell checker.
ca: Un diccionari macedoni ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire macédonien (македонски) pour le correcteur orthographique ASpell.
pt_br: Um dicionário de Língua Macedônica (македонски) para o corretor ortográfico aspell.

source: Malayalam (മലയാളം) Dictionary for Aspell
ca: Malayalam ( Dictionary) Diccionari per a l'Aspell
fr: Dictionnaire malayalam (മലയാളം) pour Aspell
pt_br: Dicionário Malaialo (മലയാളം) para Aspell

source: A Malayalam (മലയാളം) dictionary for the aspell spell checker.
ca: Un diccionari malaiàlam ( dictionary) per al corrector ortogràfic aspell.
fr: Un dictionnaire malayalam (മലയാളം) pour le correcteur orthographique aspell.
pt_br: Um dicionário Malaialo (മലയാളം) para o corretor ortográfico aspell.

source: Mongolian (Монгол) Dictionary for Aspell
ca: Diccionari mongol ( Dictionary) per a l'Aspell
fr: Un dictionnaire mongol (Монгол) pour Aspell
pt_br: Dicionário de Lingua Mongol (Монгол) para Aspell

source: A Mongolian (Монгол) dictionary for the aspell spell checker.
ca: Un diccionari mongol ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire mongol (Монгол) pour le correcteur orthographique aspell.
pt_br: Um dicionário de Língua Mongol (Монгол) para o corretor ortográfico aspell.

source: Marathi (मराठी) Dictionary for Aspell
ca: Marathi ( Dictionary) Diccionari per a l'Aspell
fr: Un dictionnaire marathi (मराठी) pour Aspell
pt_br: Dicionário Marata (मराठी) para Aspell

source: A Marathi (मराठी) dictionary for the aspell spell checker.
ca: Un diccionari marathi ( dictionary) per al corrector ortogràfic aspell.
fr: Un dictionnaire marathi (मराठी) pour le correcteur orthographique aspell.
pt_br: Um dicionário Marata (मराठी) para o corretor ortográfico aspell.

source: Malay (bahasa Melayu, بهاس ملايو‎) Dictionary for Aspell
ca: Malai (bahasa Melayu, ) ) ) Diccionari d'Aspell
fr: Dictionnaire malais (bahasa Melayu, بهاس ملايو‎) pour Aspell
pt_br: Dicionário Malaio (bahasa Melayu, بهاس ملايو‎) para Aspell

source: A Malay (bahasa Melayu, بهاس ملايو‎) dictionary for the aspell spell checker.
ca: Un diccionari malai (bahasa Melayu, . .) per al corrector ortogràfic aspell.
fr: Un dictionnaire malais (bahasa Melayu, بهاس ملايو‎) pour le correcteur orthographique aspell.
pt_br: Um dicionário Malaio (bahasa Melayu, بهاس ملايو‎) para o corretor ortográfico aspell.

source: Maltese (Malti) Dictionary for Aspell
ca: Diccionari maltès (Malti) per a l'Aspell
fr: Un dictionnaire maltais (Malti) pour Aspell
pt_br: Dicionário de Língua Maltesa (Malti) para Aspell

source: A Maltese (Malti) dictionary for the aspell spell checker.
ca: Un diccionari maltès (Malti) per al corrector ortogràfic aspell.
fr: Un dictionnaire maltais (Malti) pour le correcteur orthographique aspell.
pt_br: Um dicionário de Língua Maltesa (Malti) para o corretor ortográfico aspell.

source: Norwegian Bokmaal (Norsk bokmål) Dictionary for Aspell
ca: Diccionari noruec Bokmaal (Norsk bokm)l) per a Aspell
fr: Un dictionnaire Norvégien bokmål (Norsk bokmål) pour Aspell
pt_br: Dicionário de Língua Bokmaal Norueguesa (Norsk bokmål) para Aspell

source: A Norwegian Bokmaal (Norsk bokmål) dictionary for the aspell spell checker.
ca: Un diccionari noruec bokmaal (Norsk bokmll) per al corrector ortogràfic aspell.
fr: Un dictionnaire Norvégien bokmål (Norsk bokmål) pour le correcteur orthographique aspell.
pt_br: Um dicionário de Língua Bokmaal Norueguesa (Norsk bokmål) para o corretor ortográfico aspell.

source: Low Saxon (Plattdüütsch) Dictionary for Aspell
ca: Diccionari de baix saxó (Plattdüütsch) per a Aspell
fr: Un dictionnaire bas saxon (Plattdüütsch) pour Aspell
pt_br: Dicionário de Baixo-Alemão (Plattdüütsch) para Aspell

source: A Low Saxon (Plattdüütsch) dictionary for the aspell spell checker.
ca: Un diccionari baix saxó (Plattdüütsch) per al corrector ortogràfic aspell.
fr: Un dictionnaire bas saxon (Plattdüütsch) pour le correcteur orthographique aspell.
pt_br: Um dicionário de Baixo-Alemão (Plattdüütsch) para o corretor ortográfico aspell.

source: Dutch (Nederlands) Dictionary for Aspell
ca: Diccionari holandès (Països Baixos) per a Aspell
fr: Un dictionnaire néerlandais (Nederlands) pour Aspell
pt_br: Dicionário Holandês para Aspell

source: A Dutch (Nederlands) dictionary for the aspell spell checker.
ca: Un diccionari holandès (Nederlands) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire néerlandais (Nederlands) pour le correcteur orthographique aspell.
pt_br: Um dicionário Holandês para o corretor ortográfico aspell.

source: Norwegian Nynorsk (Norsk nynorsk) Dictionary for Aspell
ca: Diccionari noruec Nynorsk (Norsk nynorsk) per a Aspell
fr: Un dictionnaire norvégien nynorsk (Norsk nynorsk) pour Aspell
pt_br: Dicionário de Novo Norueguês (Norsk nynorsk) para Aspell

source: A Norwegian Nynorsk (Norsk nynorsk) dictionary for the aspell spell checker.
ca: Un diccionari noruec de Nynorsk (Norsk nynorsk) per al corrector ortogràfic aspell.
fr: Un dictionnaire norvégien nynorsk (Norsk nynorsk) pour le correcteur orthographique aspell.
pt_br: Um dicionário de Novo Norueguês (Norsk nynorsk) para o corretor ortográfico aspell.

source: Chichewa Dictionary for Aspell
ca: Diccionari Chichewa per a l'Aspell
fr: Un dictionnaire chichewa pour Aspell
pt_br: Dicionário de Língua Nianja (Chichewa) para Aspell

source: A Chichewa dictionary for the aspell spell checker.
ca: Un diccionari Chichewa per al corrector ortogràfic aspell.
fr: Un dictionnaire chichewa pour le correcteur orthographique aspell.
pt_br: Um dicionário de Língua Nianja (Chichewa) para o corretor ortográfico aspell.

source: Oriya (ଓଡ଼ିଆ) Dictionary for Aspell
ca: Oriya ( Dictionary) Diccionari per a l'Aspell
fr: Un dictionnaire odia (ଓଡ଼ିଆ) pour Aspell
pt_br: Dicionário Oriá (ଓଡ଼ିଆ) para Aspell

source: An Oriya (ଓଡ଼ିଆ) dictionary for the aspell spell checker.
ca: Un diccionari Oriya ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire odia (ଓଡ଼ିଆ) pour le correcteur orthographique aspell.
pt_br: Um dicionário Oriá (ଓଡ଼ିଆ) para o corretor ortográfico aspell.

source: Punjabi (ਪੰਜਾਬੀ, پنجابی‎) Dictionary for Aspell
ca: Panjabi ( Dictionary, ) ) Diccionari per a l'Aspell
fr: Un dictionnaire pendjabi (ਪੰਜਾਬੀ, پنجابی) pour Aspell
pt_br: Dicionário Punjabi (ਪੰਜਾਬੀ, پنجابی‎) para Aspell

source: A Punjabi (ਪੰਜਾਬੀ, پنجابی‎) dictionary for the aspell spell checker.
ca: Un diccionari panjabi ( dictionary, . ) per al corrector ortogràfic aspell.
fr: Un dictionnaire pendjabi (ਪੰਜਾਬੀ, پنجابی‎) pour le correcteur orthographique aspell.
pt_br: Um dicionário Punjabi (ਪੰਜਾਬੀ, پنجابی‎) para o corretor ortográfico aspell.

source: Polish (polszczyzna) Dictionary for Aspell
ca: Diccionari polonès (polszczyzna) per a Aspell
fr: Un dictionnaire polonais (polszczyzna) pour Aspell
pt_br: Dicionário Polonês (polszczyzna) para Aspell

source: A Polish (polszczyzna) dictionary for the aspell spell checker.
ca: Un diccionari polonès (polszczyzna) per al corrector ortogràfic aspell.
fr: Un dictionnaire polonais (polszczyzna) pour le correcteur orthographique aspell.
pt_br: Um dicionário Polonês (polszczyzna) para o corretor ortográfico aspell.

source: Brazilian Portuguese (Português brasileira) Dictionary for Aspell
ca: Diccionari brasiler portuguès (Portugu)s brasileira) per a Aspell
fr: Un dictionnaire portugais brésilien (Português brasileira) pour Aspell
pt_br: Dicionário Português Brasileiro para Aspell

source: A Brazilian Portuguese (Português brasileira) dictionary for the aspell spell checker.
ca: Un diccionari portuguès brasiler (Portugu bras brasileira) per al corrector ortogràfic aspell.
fr: Un dictionnaire portugais brésilien (Português brasileira) pour le correcteur orthographique aspell.
pt_br: Um dicionário de Português Brasileiro para o corretor ortográfico aspell.

source: Portuguese (Português) Dictionary for Aspell
ca: Diccionari portuguès (Portugu)s) per Aspell
fr: Un dictionnaire portugais (Português) pour Aspell
pt_br: Dicionário Português para Aspell

source: A Portuguese (Português) dictionary for the aspell spell checker.
ca: Un diccionari portuguès (Portugu.s) per al corrector ortogràfic aspell.
fr: Un dictionnaire portugais (Português) pour le correcteur orthographique aspell.
pt_br: Um dicionário Português para o corretor ortográfico aspell.

source: Quechua (Runasimi (qheshwa)) Dictionary for Aspell
ca: quítxua (Runasimi (qheshwa)) Diccionari d'Aspell
fr: Un dictionnaire quechua (Runasimi (qheshwa)) pour Aspell
pt_br: Dicionário Quíchua (Runasimi (qheshwa)) para Aspell

source: A Quechua (Runasimi (qheshwa)) dictionary for the aspell spell checker.
ca: Un diccionari quítxua (Runasimi (qheshwa)) per al corrector ortogràfic aspell.
fr: Un dictionnaire quechua (Runasimi (qheshwa)) pour le correcteur orthographique aspell.
pt_br: Um dicionário Quíchua (Runasimi (qheshwa)) para o corretor ortográfico aspell.

source: Romanian (română) Dictionary for Aspell
ca: Diccionari romanès (romnn)) per a l'Aspell
fr: Un dictionnaire Roumain (română) pour Aspell
pt_br: Dicionário de Romeno (română) para Aspell

source: A Romanian (română) dictionary for the aspell spell checker.
ca: Un diccionari romanès (romnn.) per al corrector ortogràfic aspell.
fr: Un dictionnaire roumain (română) pour le correcteur orthographique aspell.
pt_br: Um dicionário de Romeno (română) para o corretor ortográfico aspell.

source: Russian (русский) Dictionary for Aspell
ca: Diccionari rus ( Dictionary) per a l'Aspell
fr: Un dictionnaire russe (русский) pour Aspell
pt_br: Dicionário Russo (русский) para Aspell

source: A Russian (русский) dictionary for the aspell spell checker.
ca: Un diccionari rus ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire russe (русский) pour le correcteur orthographique aspell.
pt_br: Um dicionário Russo (русский) para o corretor ortográfico aspell.

source: Kinyarwanda (Ikinyarwanda) Dictionary for Aspell
ca: Kinyarwanda (Ikinyarwanda) Diccionari d'Aspell
fr: Dictionnaire kinyarwanda (Ikinyarwanda) pour Aspell
pt_br: Dicionário de Quiniaruanda (Ikinyarwanda) para Aspell

source: A Kinyarwanda (Ikinyarwanda) dictionary for the aspell spell checker.
ca: Un diccionari kinyarwanda (Ikinyarwanda) per al corrector ortogràfic aspell.
fr: Un dictionnaire kinyarwanda (Ikinyarwanda) pour le correcteur orthographique aspell.
pt_br: Um dicionário de Quiniaruanda (Ikinyarwanda) para o corretor ortográfico aspell.

source: Sardinian (Sardu) Dictionary for Aspell
ca: Diccionari Sardenya (Sardu) per a l'Aspell
fr: Un dictionnaire sarde (sardu) pour Aspell
pt_br: Dicionário Sardenho (Sardu) para Aspell

source: A Sardinian (Sardu) dictionary for the aspell spell checker.
ca: Un diccionari sard (sardu) per al corrector ortogràfic aspell.
fr: Un dictionnaire sarde (sardu) pour le correcteur orthographique aspell.
pt_br: Um dicionário Sardenho (Sardu) para o corretor ortográfico aspell.

source: Slovak (slovenský) Dictionary for Aspell
ca: Diccionari eslovac (slovensk)) per a Aspell
fr: Un dictionnaire slovaque (slovenský) pour Aspell
pt_br: Dicionário de Língua Eslovaca (slovenský) para Aspell

source: A Slovak (slovenský) dictionary for the aspell spell checker.
ca: Un diccionari eslovac (slovensk.) per al corrector ortogràfic aspell.
fr: Un dictionnaire slovaque (slovenský) pour le correcteur orthographique aspell.
pt_br: Um dicionário de Língua Eslovaca (slovenský) para o corretor ortográfico aspell.

source: Slovenian (slovenski) Dictionary for Aspell
ca: Diccionari eslovè (slovenski) per a Aspell
fr: Un dictionnaire slovène (slovenski) pour Aspell
pt_br: Dicionário de Língua Eslovena (slovenski) para Aspell

source: A Slovenian (slovenski) dictionary for the aspell spell checker.
ca: Un diccionari eslovè (slovenski) per al corrector ortogràfic aspell.
fr: Un dictionnaire slovène (slovenski) pour le correcteur orthographique aspell.
pt_br: Um dicionário de Língua Eslovena (slovenski) para o corretor ortográfico aspell.

source: GNU Aspell - Spell compatibility
ca: GNU Aspell - Compatibilitat ortogràfica
fr: GNU Aspell - compatibilité avec spell
pt_br: GNU Aspell - Compatibilidade com Spell

source: GNU Aspell is a spell checker planned to eventually replace Ispell. It can be used as a library or as an independent spell checker. This package contains a spell script for compatibility reasons so that programs that expect the "spell" command will work correctly.
ca: GNU Aspell és un corrector ortogràfic planejat per reemplaçar Ispell. Es pot utilitzar com a biblioteca o com a corrector ortogràfic independent. Aquest paquet conté un script ortogràfic per raons de compatibilitat, de manera que els programes que esperen l'ordre «spell» funcionaran correctament.
fr: GNU Aspell est un vérificateur d'orthographe conçu pour finalement remplacer Ispell. Il peut être utilisé comme une bibliothèque ou comme un vérificateur d'orthographe indépendant. Ce paquet contient un script spell pour des raisons de compatibilité afin que les programmes qui s'attendent à la commande "spell" puissent fonctionner correctement.
pt_br: GNU Aspell é um corretor ortográfico que eventualmente substituirá o Ispell. Pode ser utilizado como uma biblioteca ou um corretor ortográfico independente. Este pacote contem um script spell por motivos de compatibilidade para que programas que utilizam o comando "spell" funcionem corretamente.

source: Serbian (српски) Dictionary for Aspell
ca: Diccionari serbi ( Dictionary) per a l'Aspell
fr: Un dictionnaire Serbe (српски) pour Aspell
pt_br: Dicionário sérvio (српски) para Aspell

source: A Serbian (српски) dictionary for the aspell spell checker.
ca: Un diccionari serbi ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire Serbe (српски) pour le correcteur orthographique aspell.
pt_br: Um dicionário sérvio (српски) para o corretor ortográfico aspell.

source: Swedish (Svenska) Dictionary for Aspell
ca: Diccionari suec (Svenska) per a Aspell
fr: Un dictionnaire suédois (Svenska) pour Aspell
pt_br: Dicionário sueco (Svenska) para Aspell

source: A Swedish (Svenska) dictionary for the aspell spell checker.
ca: Un diccionari suec (Svenska) per al corrector ortogràfic aspell.
fr: Un dictionnaire suédois (Svenska) pour le correcteur orthographique aspell.
pt_br: Um dicionário sueco (Svenska) para o corretor ortográfico aspell.

source: Swahili (Kiswahili) Dictionary for Aspell
ca: Diccionari suahili (Kiswahili) per a Aspell
fr: Dictionnaire swahili (Kiswahili) pour Aspell
pt_br: Dicionário suaíli (Kiswahili) para Aspell

source: A Swahili (Kiswahili) dictionary for the aspell spell checker.
ca: Un diccionari suahili (Kiswahili) per al corrector ortogràfic aspell.
fr: Un dictionnaire swahili (Kiswahili) pour le correcteur orthographique aspell.
pt_br: Um dicionário suaíli (Kiswahili) para o corretor ortográfico aspell.

source: Tamil (தமிழ்) Dictionary for Aspell
ca: Diccionari tàmil ( Dictionary) per a l'Aspell
fr: Un dictionnaire tamoul (தமிழ்) pour Aspell
pt_br: Dicionário tâmil (தமிழ்) para Aspell

source: A Tamil (தமிழ்) dictionary for the aspell spell checker.
ca: Un diccionari tàmil ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire tamoul (தமிழ்) pour le correcteur orthographique aspell.
pt_br: Um dicionário Tamil (தமிழ்) para o corretor ortográfico aspell.

source: Telugu (తెలుగు) Dictionary for Aspell
ca: Telugu ( Dictionary) Diccionari d'Aspell
fr: Dictionnaire télougou (తెలుగు) pour Aspell
pt_br: Dicionário telugu (తెలుగు) para Aspell

source: A Telugu (తెలుగు) dictionary for the aspell spell checker.
ca: Un diccionari de telugu ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire télougou (తెలుగు) pour le correcteur orthographique aspell.
pt_br: Um dicionário Telugu (తెలుగు) para o corretor ortográfico aspell.

source: Tetum (Tetun) Dictionary for Aspell
ca: Diccionari Tetum (Tetun) per a Aspell
fr: Un dictionnaire tétoum (Tetun) pour Aspell
pt_br: Dicionário Tetum (Tetun) para Aspell

source: A Tetum (Tetun) dictionary for the aspell spell checker.
ca: Un diccionari Tetum (Tetun) per al corrector ortogràfic aspell.
fr: Un dictionnaire tétoum (Tetun) pour le correcteur orthographique aspell.
pt_br: Um dicionário de tetum (tetum) para o corretor ortográfico aspell.

source: Turkmen (Türkmençe) Dictionary for Aspell
ca: Diccionari Turkmen (Türkmençe) per a Aspell
fr: Un dictionnaire turkmène (Türkmençe) pour Aspell
pt_br: Dicionário Turkmen (Türkmençe) para Aspell

source: A Turkmen (Türkmençe) dictionary for the aspell spell checker.
ca: Un diccionari turcman (Türkmençe) per al corrector ortogràfic aspell.
fr: Un dictionnaire turkmène (Türkmençe) pour le correcteur orthographique aspell.
pt_br: Um dicionário turcomano (Türkmençe) para o corretor ortográfico aspell.

source: Tagalog Dictionary for Aspell
ca: Diccionari tagal per a l'Aspell
fr: Dictionnaire tagalog pour Aspell
pt_br: Dicionário Tagalog para Aspell
