Repository: openSUSE/packages-i18n
Catalog: */po/aspell.*.po
Languages: ca, fr, pt_br

source: A Spell Checker
ca: Un corrector ortogràfic
fr: Un correcteur orthographique
pt_br: Um corretor ortográfico

source: GNU Aspell is a spell checker planned to eventually replace Ispell. It can be used as a library or as an independent spell checker. Its main feature is an improved method for finding possible suggestions for the English language, arguably surpassing Ispell and Microsoft Word. It also has many other technical enhancements over Ispell, such as using shared memory for dictionaries and intelligently handling personal dictionaries when more than one Aspell process is open at once.
ca: GNU Aspell és un corrector ortogràfic planejat per reemplaçar Ispell. Es pot utilitzar com a biblioteca o com a corrector ortogràfic independent. La seva característica principal és un mètode millorat per trobar possibles suggeriments per a la llengua anglesa, possiblement superant Ispell i Microsoft Word. També té moltes altres millores tècniques sobre Ispell, com ara utilitzar memòria compartida per als diccionaris i gestionar intel·ligentment els diccionaris personals quan més d'un procés d'Aspell està obert alhora.
fr: GNU Aspell est un vérificateur d'orthographe prévu pour finalement remplacer Ispell. Il peut être utilisé comme une bibliothèque ou comme un vérificateur d'orthographe indépendant. Sa caractéristique principale est une méthode améliorée pour trouver des suggestions possibles pour la langue anglaise, surpassant sans doute Ispell et Microsoft Word. Il a aussi beaucoup d'autres améliorations techniques par rapport à Ispell, comme l'utilisation de mémoire partagée pour les dictionnaires, et le traitement intelligent de dictionnaires personnels lorsque plus d'un processus d'Aspell est ouvert simultanément.
pt_br: GNU Aspell é um corretor ortográfico para, eventualmente, substituir o Ispell. Pode ser utilizado como uma biblioteca ou um corretor ortográfico independente. A sua característica principal é possuir um método melhor para encontrar sugestões possíveis para o Inglês, suplantando o Ispell e o Microsoft Word. Também possui outras melhorias técnicas em comparação com o Ispell, como memória compartilhada para os dicionários e a gestão inteligente dos dicionários pessoais quando há mais de um processo Aspell em execução.

source: Afrikaans Dictionary for Aspell
ca: Diccionari afrikaans per a l'Aspell
fr: Dictionnaire Afrikaans pour Aspell
pt_br: Dicionário Africâner para Aspell

source: An Afrikaans dictionary for the aspell spell checker.
ca: Un diccionari afrikaans per al corrector ortogràfic aspell.
fr: Un dictionnaire d'Afrikaans pour le vérificateur d'orthographe aspell.
pt_br: Um dicionário Africâner para o corretor ortográfico aspell.

source: Galician-portuguese (galego-portugués) Dictionary for Aspell
ca: Diccionari gallec-portuguès (galego-portugués) per a Aspell
fr: Un dictionnaire galaïco-portugais (galego-portugués) pour Aspell
pt_br: Dicionário Galego-português para Aspell

source: A Galician-portuguese (galego-portugués) dictionary for the aspell spell checker.
ca: Un diccionari gallec-portuguès (galego-portugués) per al corrector ortogràfic aspell.
fr: Un dictionnaire galaïco-portugais (galego-portugués) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Galego-português para o corretor ortográfico aspell.

source: Amharic (አማርኛ) Dictionary for Aspell
ca: Diccionari amhàric ( Dictionary) per a l'Aspell
fr: Un dictionnaire amharique (አማርኛ) pour Aspell
pt_br: Dicionário Amárico (አማርኛ) para Aspell

source: An Amharic (አማርኛ) dictionary for the aspell spell checker.
ca: Un diccionari amhàric ( dictionary) per al corrector ortogràfic aspell.
fr: Un dictionnaire amharique (አማርኛ) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Amárico (አማርኛ) para o corretor ortográfico aspell.

source: Arabic (العربية) Dictionary for Aspell
ca: Àrab ( Dictionary) Diccionari per a l'Aspell
fr: Dictionnaire arabe (العربية) pour Aspell
pt_br: Dicionário Arábico (العربية) para Aspell

source: An Arabic (العربية) dictionary for the aspell spell checker.
ca: Un diccionari àrab ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire arabe (العربية) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Arábico (العربية) para o corretor ortográfico aspell.

source: Asturian (asturianu) Dictionary for Aspell
ca: Diccionari asturià (asturianu) per a l'Aspell
fr: Un dictionnaire asturien (asturianu) pour Aspell
pt_br: Dicionário asturiano (asturianu) para Aspell

source: An Asturian (asturianu) dictionary for the aspell spell checker.
ca: Un diccionari asturià (asturianu) per al corrector ortogràfic aspell.
fr: Un dictionnaire asturien (asturianu) pour le correcteur orthographique ASpell.
pt_br: Um dicionário asturiano (asturianu) para o corretor ortográfico aspell.

source: Azerbaijani (تورکجه) Dictionary for Aspell
ca: àzeri ( Dictionary) Diccionari per a l'Aspell
fr: Un dictionnaire azéri (تورکجه) pour Aspell
pt_br: Dicionário Azerbaijano (تورکجه) para Aspell

source: An Azerbaijani (تورکجه) dictionary for the aspell spell checker.
ca: Un diccionari àzeri ( dictionary) per al corrector ortogràfic aspell.
fr: Un dictionnaire azéri (تورکجه) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Azerbaijano (تورکجه) para o corretor ortográfico do aspell.

source: Belarusian (беларуская мова) Dictionary for Aspell
ca: Bielorús ( Dictionary )) Diccionari d'Aspell
fr: Dictionnaire de Biélorusse (беларуская мова) pour Aspell
pt_br: Dicionário Bielorrusso para Aspell

source: A Belarusian (беларуская мова) dictionary for the aspell spell checker.
ca: Un diccionari bielorús ( dictionary .) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire biélarusse (беларуская мова) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Bielorrusso para o corretor ortográfico aspell.

source: Bulgarian (български) Dictionary for Aspell
ca: Diccionari búlgar ( Dictionary) per a l'Aspell
fr: Un dictionnaire bulgare (български) pour Aspell
pt_br: Dicionário Búlgaro para Aspell

source: A Bulgarian (български) dictionary for the aspell spell checker.
ca: Un diccionari búlgar ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire bulgare (български) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Búlgaro para o corretor ortográfico aspell.

source: Bengali (বাংলা) Dictionary for Aspell
ca: Diccionari bengalí ( Dictionary) per a l'Aspell
fr: Un dictionnaire bengali (বাংলা) pour Aspell
pt_br: Dicionário bengali (বাংলা) para Aspell

source: A Bengali (বাংলা) dictionary for the aspell spell checker.
ca: Un diccionari bengalí ( dictionary) per al corrector ortogràfic aspell.
fr: Un dictionnaire bengali (বাংলা) pour le correcteur orthographique ASpell.
pt_br: Um dicionário bengali (বাংলা) para o corretor ortográfico aspell.

source: Breton (brezhoneg) Dictionary for Aspell
ca: Diccionari bretó (brezhoneg) per a l'Aspell
fr: Un dictionnaire breton (brezhoneg) pour Aspell
pt_br: Dicionário Bretão para Aspell

source: A Breton (brezhoneg) dictionary for the aspell spell checker.
ca: Un diccionari bretó (brezhoneg) per al corrector ortogràfic aspell.
fr: Un dictionnaire breton (brezhoneg) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Bretão para o corretor ortográfico aspell.

source: Catalan (català) Dictionary for Aspell
ca: Diccionari català per a l'Aspell
fr: Un dictionnaire catalan (català) pour Aspell
pt_br: Dicionário Catalão (català) para Aspell

source: A Catalan (català) dictionary for the aspell spell checker.
ca: Diccionari català per al corrector ortogràfic d'aspell.
fr: Un dictionnaire catalan (català) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Catalão (català) para o corretor ortográfico aspell.

source: Czech (čeština) Dictionary for Aspell
ca: Diccionari txec ( Dictionarye)tina) per a l'Aspell
fr: Un dictionnaire tchèque (čeština) pour Aspell
pt_br: Dicionário Tcheco (čeština) para Aspell

source: A Czech (český) dictionary for the aspell spell checker.
ca: Un diccionari txec ( dictionaryesk.) per al corrector ortogràfic aspell.
fr: Un dictionnaire tchèque (český) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Tcheco (čeština) para o corretor ortográfico aspell.

source: Kashubian (kaszëbsczi) Dictionary for Aspell
ca: Diccionari caixubi (kasz)bsczi) per a l'Aspell
fr: Un dictionnaire kachoube (kaszëbsczi) pour Aspell
pt_br: Dicionário Kashubian (kaszëbsczi) para Aspell

source: A Kashubian (kaszëbsczi) dictionary for the aspell spell checker.
ca: Un diccionari caixubi (kaszbbsczi) per al corrector ortogràfic aspell.
fr: Un dictionnaire kachoube (kaszëbsczi) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Kashubian (kaszëbsczi) para o corretor ortográfico aspell.

source: Welsh (Cymraeg) Dictionary for Aspell
ca: Diccionari gal·lès (Cymraeg) per a Aspell
fr: Un dictionnaire Gallois (Cymraeg) pour Aspell
pt_br: Dicionário galês (Cymraeg) para Aspell

source: A Welsh (Cymraeg) dictionary for the aspell spell checker.
ca: Un diccionari gal·lès (Cymraeg) per al corrector ortogràfic aspell.
fr: Un dictionnaire gallois (Cymraeg) pour le correcteur orthographique ASpell.
pt_br: Um dicionário galês (Cymraeg) para o corretor ortográfico aspell.

source: Danish (dansk) Dictionary for Aspell
ca: Diccionari danès (dansk) per a Aspell
fr: Un dictionnaire danois (dansk) pour Aspell
pt_br: Dicionário dinamarquês (dansk) para Aspell

source: A Danish (dansk) dictionary for the aspell spell checker.
ca: Diccionari danès (dansk) per al corrector ortogràfic aspell.
fr: Un dictionnaire danois (dansk) pour le correcteur orthographique ASpell.
pt_br: Um dicionário dinamarquês (dansk) para o corretor ortográfico aspell.

source: German (deutsch) Dictionary for Aspell
ca: Diccionari alemany (deutsch) per a Aspell
fr: Dictionnaire Allemand (deutsch) pour Aspell
pt_br: Dicionário Alemão (Deutsch) para Aspell

source: A German (deutsch) dictionary for the aspell spell checker.
ca: Un diccionari alemany (deutsch) per al corrector ortogràfic aspell.
fr: Un dictionnaire allemand (deutsch) pour le correcteur orthographique aspell.
pt_br: Um dicionário alemão (deutsch) para o corretor ortográfico aspell.

source: Include Files and Libraries Mandatory for Development with aspell
ca: Inclou fitxers i biblioteques obligatoris per al desenvolupament amb aspell
fr: Fichiers d'entête et bibliothèques obligatoires pour le développement
pt_br: Incluir arquivos e bibliotecas obrigatórios para desenvolvimento com aspell

source: This package contains all necessary include files and libraries needed to develop applications that require aspell.
ca: Aquest paquet conté tots els fitxers d'inclusió i biblioteques necessaris per desenvolupar aplicacions que requereixen aspell.
fr: Ce paquet contient tous les fichiers d'entête et les bibliothèques nécessaires au développement d’applications qui utilisent aspell.
pt_br: Este pacote contém todos os arquivos e bibliotecas de inclusão necessários para desenvolver aplicativos que requerem aspell.

source: Greek (ελληνικά) Dictionary for Aspell
ca: Diccionari grec ( Dictionary) per a l'Aspell
fr: Un dictionnaire grecque (ελληνικά) pour Aspell
pt_br: Dicionário Grego (ελληνικά) para Aspell

source: A Greek (ελληνικά) dictionary for the aspell spell checker.
ca: Un diccionari grec ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire grecque (ελληνικά) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Grego (ελληνικά) para o corretor ortográfico aspell.

source: English Dictionaries for ASpell
ca: Diccionaris d'anglès per a ASpell
fr: Dictionnaires anglais pour ASpell
pt_br: Dicionários Inglês para ASpell

source: An English, Canadian English and British English dictionary for the ASpell spell checker.
ca: Un diccionari d'anglès, anglès canadenc i anglès britànic per al corrector ortogràfic ASpell.
fr: Un dictionnaire anglais, anglais canadien et anglais britannique pour le correcteur orthographique ASpell.
pt_br: Um dicionário de Inglês, Inglês Canadense e Inglês Britânico para o corretor ortográfico ASpell.

source: Esperanto Dictionary for Aspell
ca: Diccionari d'esperanto per a Aspell
fr: Un dictionnaire Esperanto pour Aspell
pt_br: Dicionário de Esperanto para Aspell

source: An Esperanto dictionary for the aspell spell checker.
ca: Un diccionari d'esperanto per al corrector ortogràfic d'aspell.
fr: Un dictionnaire esperanto pour le correcteur orthographique ASpell.
pt_br: Um dicionário de Esperanto para o corretor ortográfico aspell.

source: Spanish (español) Dictionary for Aspell
ca: Diccionari espanyol (espa)ol) per a Aspell
fr: Un dictionnaire espagnol (español) pour Aspell
pt_br: Dicionário Espanhol (español) para Aspell

source: A Spanish (español) dictionary for the aspell spell checker.
ca: Diccionari espanyol (espa.ol) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire espagnol (español) pour le correcteur orthographique ASpell.
pt_br: Um dicionário de Espanhol (español) para o corretor ortográfico aspell.

source: Estonian (eesti) Dictionary for Aspell
ca: Diccionari estonià (eesti) per a l'Aspell
fr: Un dictionnaire estonien (eesti) pour Aspell
pt_br: Dicionário estoniano (eesti) para Aspell

source: An Estonian (eesti) dictionary for the aspell spell checker.
ca: Un diccionari estonià (eesti) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire estonien (eesti) pour le correcteur orthographique ASpell.
pt_br: Um dicionário estoniano (eesti) para o corretor ortográfico aspell.

source: Persian (فارسی) Dictionary for Aspell
ca: Diccionari persa ( Dictionary) per a l'Aspell
fr: Dictionnaire persan (فارسی) pour MySpell
pt_br: Dicionário Persa (فارسی) para Aspell

source: A Persian (فارسی) dictionary for the aspell spell checker.
ca: Un diccionari persa ( dictionary) per al corrector ortogràfic aspell.
fr: Un dictionnaire persan (فارسی) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Persa (فارسی) para o corretor ortográfico aspell.

source: Finnish (suomi) Dictionary for Aspell
ca: Diccionari finès (suomi) per a Aspell
fr: Un dictionnaire finnois (suomi) pour Aspell
pt_br: Dicionário Finlandês (suomi) para Aspell

source: A Finnish (suomi) dictionary for the aspell spell checker.
ca: Un diccionari finès (suomi) per al corrector ortogràfic aspell.
fr: Un dictionnaire finnois (suomi) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Finlandês (suomi) para o corretor ortográfico aspell.

source: Faroese (føroyskt) Dictionary for Aspell
ca: Diccionari feroès (f)royskt) per a l'Aspell
fr: Un dictionnaire féroïen (føroyskt) pour Aspell
pt_br: Dicionário feroês (føroyskt) para Aspell

source: A Faroese (føroyskt) dictionary for the aspell spell checker.
ca: Un diccionari feroès (f.royskt) per al corrector ortogràfic aspell.
fr: Un dictionnaire féroïen (føroyskt) pour le correcteur orthographique ASpell.
pt_br: Um dicionário feroês (føroyskt) para o corretor ortográfico aspell.

source: French (français) Dictionary for Aspell
ca: Diccionari francès (français) per a Aspell
fr: Un dictionnaire français pour Aspell
pt_br: Dicionário Francês (français) para Aspell

source: A French (français) dictionary for the aspell spell checker.
ca: Un diccionari francès (français) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire français pour le correcteur orthographique ASpell.
pt_br: Um dicionário Francês (français) para o corretor ortográfico aspell.

source: Frisian (Frysk) Dictionary for Aspell
ca: Diccionari frisó (Frysk) per a Aspell
fr: Dictionnaire frison (frysk) pour ASpell
pt_br: Dicionário Frisian (Frysk) para Aspell

source: A Frisian (Frysk) dictionary for the aspell spell checker.
ca: Un diccionari frisó (Frysk) per al corrector ortogràfic aspell.
fr: Un dictionnaire frison (frysk) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Frisian (Frysk) para o corretor ortográfico aspell.

source: Irish (Gaeilge) Dictionary for Aspell
ca: Diccionari irlandès (Gaeilge) per a Aspell
fr: Un dictionnaire Irlandais (gaeilge) pour Aspell
pt_br: Dicionário Irlandês (Gaeilge) para Aspell

source: An Irish (Gaeilge) dictionary for the aspell spell checker.
ca: Un diccionari irlandès (Gaeilge) per al corrector ortogràfic aspell.
fr: Un dictionnaire irlandais (gaeilge) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Irlandês (Gaeilge) para o corretor ortográfico aspell.

source: Scottish (Gàidhlig) Gaelic Dictionary for Aspell
ca: Diccionari gaèlic escocès (Gàidhlig) per a Aspell
fr: Dictionnaire gaélique écossais (gàidhlig) pour ASpell
pt_br: Dicionário de Gaélico Escocês (Gàidhlig) para Aspell

source: A Scottish (Gàidhlig) Gaelic dictionary for the aspell spell checker.
ca: Un diccionari gaèlic escocès (Gàidhlig) per al corrector ortogràfic aspell.
fr: Un dictionnaire gaélique écossais (gàidhlig) pour le correcteur orthographique ASpell.
pt_br: Um dicionário de Gaélico Escocês (Gàidhlig) para o corretor ortográfico aspell.

source: Galician Gaelic (galego) Dictionary for Aspell
ca: Diccionari gallec en gaèlic (galego) per a l'Aspell
fr: Un dictionnaire galicien (galego) pour Aspell
pt_br: Dicionário Gaélico Galego (galego) para Aspell

source: A Galician Gaelic (galego) dictionary for the aspell spell checker.
ca: Un diccionari gallec en gaèlic (galego) per al corrector ortogràfic aspell.
fr: Un dictionnaire galicien (galego) pour le correcteur orthographique ASpell.
pt_br: Um dicionário de Gaélico Galego (galego) para o corretor ortográfico aspell.

source: Ancient Greek (Ἑλληνική) Dictionary for Aspell
ca: Diccionari grec antic ( Dictionary) per a l'Aspell
fr: Dictionnaire de Grec ancien (Ἑλληνική) pour Aspell
pt_br: Dicionário de Grego Antigo (Ἑλληνική) para Aspell

source: An Ancient Greek (Ἑλληνική) dictionary for the aspell spell checker.
ca: Un diccionari grec antic ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire de grec ancien (Ἑλληνική) pour le correcteur orthographique ASpell.
pt_br: Um dicionário de Grego Antigo (Ἑλληνική) para o corretor ortográfico aspell.

source: Gujarati (ગુજરાતી) Dictionary for Aspell
ca: Gujarati ( Dictionary) Diccionari d'Aspell
fr: Un dictionnaire gujarati (ગુજરાતી) pour Aspell
pt_br: Dicionário Gujarati (ગુજરાતી) para Aspell

source: A Gujarati (ગુજરાતી) dictionary for the aspell spell checker.
ca: Un diccionari de gujarati ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire gujarati (ગુજરાતી) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Gujarati (ગુજરાતી) para o corretor ortográfico aspell.

source: Manx Gaelic (Gaelg) Dictionary for Aspell
ca: Diccionari gaèlic manx (gaelg) per a Aspell
fr: Un dictionnaire mannois (gaelg) pour Aspell
pt_br: Dicionário de Gaélico Manx (Gaelg) para Aspell

source: A Manx Gaelic (Gaelg) dictionary for the aspell spell checker.
ca: Un diccionari en gaèlic manx (Gaelg) per al corrector ortogràfic aspell.
fr: Un dictionnaire mannois (gaelg) pour le correcteur orthographique ASpell.
pt_br: Um dicionário de Gaélico Manx (Gaelg) para o corretor ortográfico aspell.

source: Hebrew (עברית) Dictionary for Aspell
ca: Hebreu ( Dictionary) Diccionari per a l'Aspell
fr: Dictionnaire hébreu (עברית) pour ASpell
pt_br: Dicionário Hebraico (עברית) para Aspell

source: A Hebrew (עברית) dictionary for the aspell spell checker.
ca: Un diccionari hebreu ( dictionary) per al corrector ortogràfic aspell.
fr: Un dictionnaire hébreu (עברית) pour le correcteur orthographique ASpell.
pt_br: Um dicionário de Hebraico (עברית) para o corretor ortográfico aspell.

source: Hindi (हिंदी) Dictionary for Aspell
ca: Hindi ( Dictionary) Diccionari per a l'Aspell
fr: Un dictionnaire hindi (हिंदी) pour Aspell
pt_br: Dicionário Hindi (हिंदी) para Aspell

source: A Hindi (हिंदी) dictionary for the aspell spell checker.
ca: Un diccionari d'hindi ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire hindi (हिंदी) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Hindi (हिंदी) para o corretor ortográfico aspell.

source: Hiligaynon Dictionary for Aspell
ca: Diccionari Hiligaynon per a Aspell
fr: Un dictionnaire hiligaïnon pour Aspell
pt_br: Dicionário Hiligainón para Aspell

source: A Hiligaynon dictionary for the aspell spell checker.
ca: Un diccionari de Hiligaynon per al corrector ortogràfic d'aspell.
fr: Un dictionnaire hiligaïnon pour le correcteur orthographique ASpell.
pt_br: Um dicionário de Hiligainon para o corretor ortográfico aspell.

source: Croatian (hrvatski) Dictionary for Aspell
ca: Diccionari croat (hrvatski) per a Aspell
fr: Un dictionnaire croate (hrvatski) pour Aspell
pt_br: Dicionário Croata (hrvatski) para Aspell

source: A Croatian (hrvatski) dictionary for the aspell spell checker.
ca: Un diccionari croat (hrvatski) per al corrector ortogràfic aspell.
fr: Un dictionnaire croate (hrvatski) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Croata (hrvatski) para o corretor ortográfico aspell.

source: Upper Sorbian (hornjoserbsce) Dictionary for Aspell
ca: Diccionari alt sòrab (hornjoserbsce) per a Aspell
fr: Un dictionnaire haut-sorabe (hornjoserbsce) pour Aspell
pt_br: Dicionário sorábio superior (hornjoserbsce) para Aspell

source: An Upper Sorbian (hornjoserbsce) dictionary for the aspell spell checker.
ca: Un diccionari alt sòrab (hornjoserbsce) per al corrector ortogràfic aspell.
fr: Un dictionnaire haut-sorabe (hornjoserbsce) pour le correcteur orthographique ASpell.
pt_br: Um dicionário sorábio superior (hornjoserbsce) para o corretor ortográfico aspell.

source: Hungarian (magyar) Dictionary for Aspell
ca: Diccionari hongarès (magyar) per a Aspell
fr: Un dictionnaire hongrois (magyar) pour Aspell
pt_br: Dicionário Húngaro (magyar) para Aspell

source: A Hungarian (magyar) dictionary for the aspell spell checker.
ca: Un diccionari hongarès (magyar) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire hongrois (magyar) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Húngaro (magyar) para o corretor ortográfico aspell.

source: Huastec (wastek) dictionary for Aspell
ca: Diccionari de Huastec (wastek) per a Aspell
fr: Un dictionnaire huastèque (wastek) pour Aspell
pt_br: Dicionário Huasteco (wastek) para Aspell

source: A Huastec (wastek) dictionary for Aspell.
ca: Un diccionari huastec (wastek) per a l'Aspell.
fr: Un dictionnaire huastèque (wastek) pour Aspell.
pt_br: Um dicionário Huasteco (wastek) para Aspell.

source: Armenian (Հայերեն) Dictionary for Aspell
ca: Diccionari armeni ( Dictionary) per a Aspell
fr: Un dictionnaire arménien (Հայերեն) pour Aspell
pt_br: Dicionário Armênio (Հայերեն) para Aspell

source: An Armenian (Հայերեն) dictionary for the aspell spell checker.
ca: Un diccionari armeni ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire arménien (Հայերեն) pour le correcteur orthographique ASpell.
pt_br: Um dicionário Armênio (Հայերեն) para o corretor ortográfico aspell.

source: Interlingua Dictionary for Aspell
ca: Diccionari Interlingua per a Aspell
fr: Un dictionnaire interlingua pour Aspell
pt_br: Dicionário Interlíngua para Aspell

source: An Interlingua dictionary for the aspell spell checker.
ca: Un diccionari interlingua per al corrector ortogràfic d'aspell.
fr: Un dictionnaire interlingua pour le correcteur orthographique ASpell.
pt_br: Um dicionário Interlíngua para o corretor ortográfico aspell.

source: Indonesian (Bahasa Indonesia) Dictionary for Aspell
ca: Diccionari indonesi (Bahasa Indonesia) per a Aspell
fr: Un dictionnaire indonésien (Bahasa Indonesia) pour Aspell
pt_br: Dicionário para Língua Indonésia (Bahasa Indonesia) para Aspell
