Repository: openSUSE/packages-i18n
Catalog: */po/aspell.*.po
Languages: ca, fr, pt_br

source: A Tagalog dictionary for the aspell spell checker.
ca: Un diccionari tagal per al corrector ortogràfic aspell.
fr: Un dictionnaire tagalog pour le correcteur orthographique aspell.
pt_br: Um dicionário Tagalog para o corretor ortográfico aspell.

source: Setswana Dictionary for Aspell
ca: Diccionari Setswana per a Aspell
fr: Un dictionnaire tswana pour Aspell
pt_br: Dicionário Setswana para Aspell

source: A Setswana dictionary for the aspell spell checker.
ca: Un diccionari de Setswana per al corrector ortogràfic d'aspell.
fr: Un dictionnaire tswana pour le correcteur orthographique aspell.
pt_br: Um dicionário Setswana para o corretor ortográfico aspell.

source: Turkish (Türkçe) Dictionary for Aspell
ca: Diccionari turc (Türkçe) per a Aspell
fr: Dictionnaire turc (Türkçe) pour Aspell
pt_br: Dicionário turco (Türkçe) para Aspell

source: A Turkish (Türkçe) dictionary for the aspell spell checker.
ca: Un diccionari turc (Türkçe) per al corrector ortogràfic aspell.
fr: Un dictionnaire turc (Türkçe) pour le correcteur orthographique aspell.
pt_br: Um dicionário turco (Türkçe) para o corretor ortográfico aspell.

source: Ukrainian (українська) Dictionary for Aspell
ca: Ucraïnès ( Dictionary) Diccionari d'Aspell
fr: Un dictionnaire ukrainien (українська) pour Aspell
pt_br: Dicionário ucraniano (українська) para Aspell

source: An Ukrainian (українська) dictionary for the aspell spell checker.
ca: Un diccionari ucraïnès ( dictionary) per al corrector ortogràfic d'aspell.
fr: Un dictionnaire ukrainien (українська) pour le correcteur orthographique aspell.
pt_br: Um dicionário ucraniano (українська) para o verificador ortográfico aspell.

source: Uzbek (Ўзбекча) Dictionary for Aspell
ca: Uzbek ( Dictionary) Diccionari per a l'Aspell
fr: Un dictionnaire ouzbek (Ўзбекча) pour Aspell
pt_br: Dicionário usbeque (Ўзбекча) para o Aspell

source: An Uzbek (Ўзбекча) dictionary for the aspell spell checker.
ca: Un diccionari uzbek ( dictionary) per al corrector ortogràfic aspell.
fr: Un dictionnaire ouzbek (Ўзбекча) pour le correcteur orthographique aspell.
pt_br: Um dicionário usbeque (Ўзбекча) para o verificador ortográfico aspell.

source: Vietnamese (Tiếng Việt) Dictionary for Aspell
ca: Diccionari vietnamita (Tingng Vitt) per a Aspell
fr: Dictionnaire vietnamien (Tiếng Việt) pour Aspell
pt_br: Dicionário vietnamita (Tiếng Việt) para o Aspell

source: A Vietnamese (Tiếng Việt) dictionary for the aspell spell checker.
ca: Diccionari vietnamita (Tingng Vitt) per al corrector ortogràfic aspell.
fr: Un dictionnaire vietnamien (Tiếng Việt) pour le correcteur orthographique aspell.
pt_br: Um dicionário vietnamita (Tiếng Việt) para o verificador ortográfico aspell.

source: Walloon (walon) Dictionary for Aspell
ca: Diccionari Való (walon) per a Aspell
fr: Un dictionnaire wallon (walon) pour Aspell
pt_br: Dicionário Valão (walon) para Aspell

source: A Walloon (walon) Dictionarydictionary for the aspell spell checker.
ca: Un diccionari való (walon) per al corrector ortogràfic d'Aspell.
fr: Un dictionnaire wallon (walon) pour le correcteur orthographique aspell.
pt_br: Um dicionário valão (walon) para o corretor ortográfico aspell.

source: Yiddish (ייִדיש) Dictionary for Aspell
ca: Diccionari ídix ( Dictionary) per a l'Aspell
fr: Dictionnaire yiddish (ייִדיש) pour Aspell
pt_br: Dicionário Yiddish (ייִדיש) para Aspell

source: A Yiddish (ייִדיש) dictionary for the aspell spell checker.
ca: Un diccionari ídix ( dictionary) per al corrector ortogràfic aspell.
fr: Un dictionnaire yiddish (ייִדיש) pour le correcteur orthographique aspell.
pt_br: Um dicionário Yiddish (ייִדיש) para o corretor ortográfico aspell.

source: Zulu (isiZulu) Dictionary Package for Aspell
ca: Paquet de diccionari Zulu (isiZulu) per a l'Aspell
fr: Un dictionnaire zoulou (isiZulu) pour Aspell
pt_br: Pacote de dicionário Zulu (isiZulu) para Aspell

source: A Zulu (isiZulu) dictionary for the aspell spell checker.
ca: Un diccionari zulu (isiZulu) per al corrector ortogràfic aspell.
fr: Un dictionnaire zoulou (isiZulu) pour le correcteur orthographique aspell.
pt_br: Um dicionário Zulu (isiZulu) para o corretor ortográfico aspell.

source: GNU Aspell Library
ca: Biblioteca GNU Aspell
fr: Bibliothèque GNU Aspell
pt_br: Biblioteca GNU Aspell

source: GNU Aspell is a spell checker planned to eventually replace Ispell. It can be used as a library or as an independent spell checker. This package contains the aspell library.
ca: GNU Aspell és un corrector ortogràfic planejat per reemplaçar Ispell. Es pot utilitzar com a biblioteca o com a corrector ortogràfic independent. Aquest paquet conté la biblioteca aspell.
fr: GNU Aspell est un vérificateur d'orthographe conçu pour finalement remplacer Ispell. Il peut être utilisé comme une bibliothèque ou comme un vérificateur d'orthographe indépendant. Ce paquet contient la bibliothèque aspell.
pt_br: GNU Aspell é um corretor ortográfico planejado para eventualmente substituir o Ispell. Pode ser usado como biblioteca ou como corretor ortográfico independente. Este pacote contém a biblioteca aspell.

source: GNU Aspell - Pspell Compatibility Library
ca: GNU Aspell - Biblioteca de compatibilitat amb Pspell
fr: GNU Aspell - bibliothèque de compatibilité avec pspell
pt_br: GNU Aspell - Biblioteca de compatibilidade Pspell

source: GNU Aspell is a spell checker planned to eventually replace Ispell. It can be used as a library or as an independent spell checker. This package contains the pspell compatibility library.
ca: GNU Aspell és un corrector ortogràfic planejat per reemplaçar Ispell. Es pot utilitzar com a biblioteca o com a corrector ortogràfic independent. Aquest paquet conté la biblioteca de compatibilitat pspell.
fr: GNU Aspell est un vérificateur d'orthographe conçu pour finalement remplacer Ispell. Il peut être utilisé comme une bibliothèque ou comme un vérificateur d'orthographe indépendant. Ce paquet contient la bibliothèque de compatibilité pspell.
pt_br: GNU Aspell é um corretor ortográfico planejado para eventualmente substituir o Ispell. Pode ser usado como biblioteca ou como corretor ortográfico independente. Este pacote contém a biblioteca de compatibilidade pspell.
