Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: This package provides the Haskell terminal-size library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de mida terminal Haskell.

source: Haskell terminfo library
ca: Biblioteca terminfo de Haskell

source: This package provides the Haskell terminfo library.
ca: Aquest paquet proporciona la biblioteca terminfo de Haskell.

source: Haskell terminfo library development files
ca: Fitxers de desenvolupament de la biblioteca terminfo de Haskell

source: This package provides the Haskell terminfo library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca terminfo de Haskell.

source: Framework for running and organising tests, with HUnit and QuickCheck support
ca: Marc de treball per a executar i organitzar proves, amb suport HUnit i QuickCheck

source: Allows tests such as QuickCheck properties and HUnit test cases to be assembled into test groups, run in parallel (but reported in deterministic order, to aid diff interpretation) and filtered and controlled by command line options. All of this comes with colored test output, progress reporting and test statistics output.
ca: Permet que les proves com ara les propietats de QuickCheck i els casos de prova de HUnit es muntin en grups de prova, s'executin en paral·lel (però s'informa en ordre determinista, per ajudar a la interpretació de les diferències) i es filtren i controlen mitjançant les opcions de la línia d'ordres. Tot això ve amb la sortida de prova acolorida, l'informe de progrés i la sortida d'estadístiques de prova.

source: Haskell test-framework library development files
ca: Fitxers de desenvolupament de la biblioteca Test-framework del Haskell

source: This package provides the Haskell test-framework library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell test-framework.

source: HUnit support for the test-framework package
ca: Implementació de HUnit per al paquet «test-framework»

source: HUnit support for the test-framework package.
ca: Implementació de HUnit per al paquet «test-framework».

source: Haskell test-framework-hunit library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell test-framework-hunit

source: This package provides the Haskell test-framework-hunit library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell test-framework-hunit.

source: Haskell text library
ca: Biblioteca de text Haskell

source: This package provides the Haskell text library.
ca: Aquest paquet proporciona la biblioteca de text Haskell.

source: Safe conversions between textual types
ca: Conversions segures entre tipus de text

source: Safe conversions between textual types.
ca: Conversions segures entre tipus de text.

source: Haskell text-conversions library development files
ca: Fitxers de desenvolupament de la biblioteca de versions de text del Haskell

source: This package provides the Haskell text-conversions library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell text-conversions.

source: Haskell text library development files
ca: Fitxers de desenvolupament de la biblioteca de text Haskell

source: This package provides the Haskell text library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de text Haskell.

source: Text formatting
ca: Formatació del text

source: A text formatting library optimized for both ease of use and high performance.
ca: Una biblioteca de formatació de text optimitzada tant per a la facilitat d'ús com per a un alt rendiment.

source: Haskell text-format library development files
ca: Fitxers de desenvolupament de la biblioteca de format de text Haskell

source: This package provides the Haskell text-format library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca en format de text Haskell.

source: Bindings to the ICU library
ca: Vinculacions a la biblioteca de l'UCI

source: Haskell bindings to the International Components for Unicode (ICU) libraries. These libraries provide robust and full-featured Unicode services on a wide variety of platforms. Features include: * Both pure and impure bindings, to allow for fine control over efficiency and ease of use. * Breaking of strings on character, word, sentence, and line boundaries. * Access to the Unicode Character Database (UCD) of character metadata. * String collation functions, for locales where the conventions for lexicographic ordering differ from the simple numeric ordering of character codes. * Character set conversion functions, allowing conversion between Unicode and over 220 character encodings. * Unicode normalization. (When implementations keep strings in a normalized form, they can be assured that equivalent strings have a unique binary representation.) * Regular expression search and replace. * Security checks for visually confusable (spoofable) strings. * Bidirectional Unicode algorithm * Calendar objects holding dates and times. * Number and calendar formatting.
ca: Haskell enllaça amb les biblioteques International Components for Unicode (ICU). Aquestes biblioteques proporcionen serveis Unicode robustos i complets en una àmplia varietat de plataformes. Les característiques inclouen: * Enllaços tant purs com impurs, per permetre un control fi sobre l'eficiència i la facilitat d'ús. * Trencament de cadenes en els límits de caràcter, paraula, frase i línia. * Accés a la base de dades de caràcters Unicode (UCD) de metadades de caràcters. * Funcions de col·lació de cadenes, per a locales on les convencions per a l'ordenació lexicogràfica difereixen de la simple ordenació numèrica dels codis de caràcters. * Funcions de conversió de conjunts de caràcters, permetent la conversió entre Unicode i més de 220 codificacions de caràcters. * Normalització Unicode. (Quan les implementacions mantenen les cadenes en una forma normalitzada, es pot assegurar que les cadenes equivalents tenen una representació binària única.) * Cerca i substitució d'expressions regulars. * Comprovacions de seguretat per a cadenes visualment confusables (poofables). * Algorisme Unicode bidireccional * Objectes de calendari amb dates i horaris. * Formatació de números i calendaris.

source: Haskell text-icu library development files
ca: Fitxers de desenvolupament de la biblioteca de text-icu del Haskell

source: This package provides the Haskell text-icu library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell text-icu.

source: Case conversion, word boundary manipulation, and textual subjugation
ca: Conversió de majúscules i minúscules, manipulació de límits de paraules i subjugació textual

source: Manipulate identifiers and structurally non-complex pieces of text by delimiting word boundaries via a combination of whitespace, control-characters, and case-sensitivity. Has support for common idioms like casing of programmatic variable names, taking, dropping, and splitting by word, and modifying the first character of a piece of text. /Caution:/ this library makes heavy use of the <http://hackage.haskell.org/package/text text> library's internal loop optimisation framework. Since internal modules are not guaranteed to have a stable API there is potential for build breakage when the text dependency is upgraded. Consider yourself warned!.
ca: Manipula identificadors i peces de text estructuralment no complexes delimitant els límits de les paraules mitjançant una combinació d'espais en blanc, caràcters de control i sensibilitat de majúscules i minúscules. Té suport per a llenguatges comuns com la carcassa de noms de variables programàtiques, prendre, deixar anar i dividir per paraula, i modificar el primer caràcter d'un tros de text. /Caution:/ aquesta biblioteca fa un ús intensiu del marc d'optimització del bucle intern de la biblioteca <http://hackage.haskell.org/package/text text>. Atès que els mòduls interns no estan garantits per tenir una API estable, hi ha potencial per al trencament de la construcció quan la dependència de text s'actualitza. Considera't advertit!

source: Haskell text-manipulate library development files
ca: Haskell text-manipula els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell text-manipulate library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell manipulats per text.

source: Calculate various string metrics efficiently
ca: Calcula diverses mètriques de cadena de manera eficient

source: Calculate various string metrics efficiently.
ca: Calcular diverses mètriques de cadena de manera eficient.

source: Haskell text-metrics library development files
ca: Fitxers de desenvolupament de la biblioteca de mètriques de text del Haskell

source: This package provides the Haskell text-metrics library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de mètriques de text Haskell.

source: Memory-efficient representation of Unicode text strings
ca: Representació eficient de memòria de cadenes de text Unicode

source: This package provides the 'ShortText' type which is suitable for keeping many short strings in memory. This is similiar to how 'ShortByteString' relates to 'ByteString'. The main difference between 'Text' and 'ShortText' is that 'ShortText' uses UTF-8 instead of UTF-16 internally and also doesn't support zero-copy slicing (thereby saving 2 words). Consequently, the memory footprint of a (boxed) 'ShortText' value is 4 words (2 words when unboxed) plus the length of the UTF-8 encoded payload.
ca: Aquest paquet proporciona el tipus «ShortText» que és adequat per a mantenir moltes cadenes curtes a la memòria. Això és similiar a com es relaciona 'ShortByteString' amb 'ByteString'. La diferència principal entre 'Text' i 'ShortText' és que 'ShortText' utilitza UTF-8 en lloc d'UTF-16 internament i tampoc admet el tall de còpia zero (desant 2 paraules). En conseqüència, la petjada de memòria d'un valor de 'ShortText' (en caixa) és de 4 paraules (2 paraules quan no es troba a la caixa) més la longitud de la càrrega útil codificada en UTF-8.

source: Haskell text-short library development files
ca: Fitxers de desenvolupament de la biblioteca de text de Haskell

source: This package provides the Haskell text-short library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de text de Haskell.

source: A text editor zipper library
ca: Una biblioteca amb cremallera de l'editor de text

source: This library provides a zipper and API for editing text.
ca: Aquesta biblioteca proporciona una cremallera i una API per editar text.

source: Haskell text-zipper library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell amb cremallera de text

source: This package provides the Haskell text-zipper library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell amb cremallera de text.

source: High-quality splittable pseudorandom number generator
ca: Generador de nombres pseudoaleatoris d'alta qualitat

source: This package contains an implementation of a high-quality splittable pseudorandom number generator. The generator is based on a cryptographic hash function built on top of the ThreeFish block cipher. See the paper /Splittable Pseudorandom Number Generators Using Cryptographic Hashing/ by Claessen, Pałka for details and the rationale of the design. The package provides the following: * A splittable PRNG that implements the standard 'System.Random.RandomGen' class. * The generator also implements an alternative version of the 'System.Random.TF.Gen.RandomGen' class (exported from "System.Random.TF.Gen"), which requires the generator to return pseudorandom integers from the full 32-bit range, and contains an n-way split function. * An alternative version of the 'Random' class is provided, which is linked to the new 'RandomGen' class, together with 'Random' instances for some integral types. * Two functions for initialising the generator with a non-deterministic seed: one using the system time, and one using the '/dev/urandom' UNIX special file. The package uses an adapted version of the reference C implementation of ThreeFish from the reference package of the Skein hash function (<https://www.schneier.com/skein.html>), originally written by Doug Whiting. Please note that even though the generator provides very high-quality pseudorandom numbers, it has not been designed with cryptographic applications in mind.
ca: Aquest paquet conté una implementació d'un generador de nombres pseudoaleatoris d'alta qualitat. El generador es basa en una funció hash criptogràfica construïda sobre el xifratge de blocs de ThreeFish. Vegeu l'article /Splittable Pseudorandom Number Generators Using Cryptographic Hashing/ de Claessen, Pa.ka per als detalls i la lògica del disseny. El paquet proporciona el següent: * Un PRNG splittable que implementa el sistema estàndard 'System.Aleatòriament.Classe RandomGen. * El generador també implementa una versió alternativa del sistema.Aleatori.TF.Gen.Classe RandomGen (exportada des de "System.Aleatori.TF.Gen"), que requereix que el generador retorni enters pseudoaleatoris de l'interval complet de 32 bits, i conté una funció de divisió n-via. * Es proporciona una versió alternativa de la classe 'Random', que està vinculada a la nova classe 'RandomGen', juntament amb les instàncies 'Random' per a alguns tipus integrals. * Dues funcions per a inicialitzar el generador amb una llavor no determinista: una utilitzant l'hora del sistema, i una altra utilitzant el fitxer especial '/dev/urandom' UNIX. El paquet utilitza una versió adaptada de la implementació C de referència de ThreeFish del paquet de referència de la funció de hash de Skein (<https://www.schneier.com/skein.html>), originalment escrita per Doug Whiting. Tingueu en compte que tot i que el generador proporciona nombres pseudoaleatoris de molt alta qualitat, no s'ha dissenyat pensant en aplicacions criptogràfiques.

source: Haskell tf-random library development files
ca: Fitxers de desenvolupament de la biblioteca haskell tf-random

source: This package provides the Haskell tf-random library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell tf-random.

source: Nicer interface for reified information about data types
ca: Interfície més agradable per a la informació reificada sobre els tipus de dades

source: This package normalizes variations in the interface for inspecting datatype information via Template Haskell so that packages and support a single, easier to use informational datatype while supporting many versions of Template Haskell.
ca: Aquest paquet normalitza les variacions en la interfície per inspeccionar la informació del tipus de dades a través de la plantilla Haskell de manera que els paquets i admetin un únic tipus de dades d'informació més fàcil d'utilitzar, alhora que admet moltes versions de la plantilla Haskell.

source: Haskell th-abstraction library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell th-abstraction

source: This package provides the Haskell th-abstraction library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell th-abstraction.

source: Backward- (and forward-)compatible Quote and Code types
ca: Cotitzacions i tipus de codi compatibles cap enrere (i cap endavant)

source: This package defines a "Language.Haskell.TH.Syntax.Compat" module, which backports the 'Quote' and 'Code' types to work across a wide range of 'template-haskell' versions. On recent versions of 'template-haskell' (2.17.0.0 or later), this module simply reexports 'Quote' and 'Code' from "Language.Haskell.TH.Syntax". Refer to the Haddocks for "Language.Haskell.TH.Syntax.Compat" for examples of how to use this module.
ca: Aquest paquet defineix un "Llengua.Haskell.TH.Sintaxi.El mòdul Compat, que dona suport als tipus 'Quote' i 'Code' per treballar en una àmplia gamma de versions 'template-haskell'. En versions recents de «template-haskell» (2.17.0.0 o posterior), aquest mòdul simplement reexporta «Quote» i «Code» des de «Language.Haskell.TH.Syntax». Consulteu els Haddocks per a "Language.Haskell.TH.Sintaxi.Compat" per exemples de com utilitzar aquest mòdul.

source: Haskell th-compat library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell th-compat

source: This package provides the Haskell th-compat library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell th-compat.

source: Expands type synonyms in Template Haskell ASTs
ca: Expandeix els sinònims de tipus a la plantilla Haskell AST

source: Expands type synonyms in Template Haskell ASTs. As of version '0.4.9.0', this library is a small shim on top of the 'applySubstitution'/'resolveTypeSynonyms' functions from 'th-abstraction', so you may want to consider using 'th-abstraction' instead.
ca: Expandeix els sinònims de tipus a Template Haskell ASTs. A partir de la versió '0.4.9.0', aquesta biblioteca és un petit shim a la part superior de les funcions 'applySubstitution'/'resolveTypeSynonyms' de 'th-abstraction', de manera que potser voldreu considerar l'ús de 'th-abstraction'.

source: Haskell th-expand-syns library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell th-expand-syns

source: This package provides the Haskell th-expand-syns library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell th-expand-syns.

source: A grab bag of functions for use with Template Haskell
ca: Una bossa de funcions per a utilitzar amb la plantilla Haskell

source: A grab bag of functions for use with Template Haskell. This is basically the place I put all my ugly CPP hacks to support the ever-changing interface of the template haskell system by providing high-level operations and making sure they work on as many versions of Template Haskell as I can.
ca: Una bossa de funcions per utilitzar amb Template Haskell. Aquest és bàsicament el lloc on vaig posar tots els meus hacks de CPP lletjos per donar suport a la interfase canviant del sistema haskell de plantilles proporcionant operacions d'alt nivell i assegurant-me que funcionen en tantes versions de Template Haskell com pugui.

source: Haskell th-extras library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell th-extras

source: This package provides the Haskell th-extras library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell th-extras.

source: Derive Template Haskell's Lift class for datatypes
ca: Plantilla derivada classe d'elevació de Haskell per a tipus de dades

source: Derive Template Haskell's 'Lift' class for datatypes using 'TemplateHaskell'. The functionality in this package has largely been subsumed by the 'DeriveLift' language extension, which is available in GHC 8.0 and later versions. This package can still be useful as a uniform way to derive 'Lift' instances that is backwards-compatible with older GHCs. The following libraries are related: * The <https://hackage.haskell.org/package/th-orphans th-orphans> package provides instances for 'template-haskell' syntax types. * The <http://hackage.haskell.org/package/th-lift-instances th-lift-instances> package provides 'Lift' instances for types in 'base', 'text', 'bytestring', 'vector', etc. Some of these instances are only provided for old versions of their respective libraries, as the same 'Lift' instances are also present upstream on newer versions.
ca: Plantilla derivada de la classe «Lift» de Haskell per als tipus de dades utilitzant «TemplateHaskell». La funcionalitat d'aquest paquet ha estat subsumida en gran part per l'extensió de llenguatge 'DeriveLift', que està disponible en GHC 8.0 i versions posteriors. Aquest paquet encara pot ser útil com una manera uniforme de derivar instàncies de 'Lift' que sigui compatible amb els GHC més antics. Les biblioteques següents estan relacionades: * El paquet <https://hackage.haskell.org/package/th-orphans th-orphans> proporciona instàncies per als tipus de sintaxi «template-haskell». * El paquet <http://hackage.haskell.org/package/th-lift-instances th-lift-instances> proporciona instàncies 'Lift' per a tipus a 'base', 'text', 'bytestring', 'vector', etc. Algunes d'aquestes instàncies només es proporcionen per a versions antigues de les seves respectives biblioteques, ja que les mateixes instàncies «Lift» també estan presents en versions més noves.

source: Haskell th-lift library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell th-lift

source: This package provides the Haskell th-lift library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell th-lift.

source: Lift instances for template-haskell for common data types
ca: Instàncies d'elevació per a la plantilla-haskell per als tipus de dades habituals

source: Most data types in the haskell platform do not have Lift instances. This package provides orphan instances for containers, text, bytestring and vector. It also provides compat instances for older versions of 'template-haskell' Note that <https://hackage.haskell.org/package/th-lift th-lift> package provides Template Haskell based derivation of 'Lift' instances (when you cannot use 'DeriveLift' extension), and <https://hackage.haskell.org/package/th-orphans th-orphans> package provides instances for TH datatypes.
ca: La majoria dels tipus de dades de la plataforma haskell no tenen instàncies Lift. Aquest paquet proporciona instàncies òrfenes per a contenidors, text, proves i vector. També proporciona instàncies compat per a versions antigues de «template-haskell» Tingueu en compte que el paquet <https://hackage.haskell.org/package/th-lift th-lift> proporciona la derivació basada en la plantilla Haskell d'instàncies «Lift» (quan no podeu utilitzar l'extensió «DeriveLift»), i el paquet <https://hackage.haskell.org/package/th-orphans th-orphans> proporciona instàncies per als tipus de dades TH.

source: Haskell th-lift-instances library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell th-lift-instances

source: This package provides the Haskell th-lift-instances library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell th-lift-instances.

source: Orphan instances for TH datatypes
ca: Instàncies orfes per als tipus de dades TH

source: Orphan instances for TH datatypes. In particular, instances for Ord and Lift, as well as a few missing Show / Eq. These instances used to live in haskell-src-meta, and that's where the version number started.
ca: Instàncies òrfenes per als tipus de dades TH. En particular, els exemples d'Ord i Lift, així com alguns Show / Eq que falten. Aquestes instàncies solien viure en haskell-src-meta, i aquí és on va començar el número de versió.

source: Haskell th-orphans library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell th-orphans

source: This package provides the Haskell th-orphans library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell th-orphans.

source: Recurseively reify template haskell datatype info
ca: Retorna la informació del tipus de dades de la plantilla haskell
