Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: This library provides the core data types and functions for parsing commonmark (<https://spec.commonmark.org>). The parser is fully commonmark-compliant and passes the test suite. It is designed to be customizable and easily extensible. To customize the output, create an AST, or support a new output format, one need only define some new typeclass instances. It is also easy to add new syntax elements or modify existing ones. Accurate information about source positions is available for all block and inline elements. Thus the library can be used to create an accurate syntax highlighter or an editor with live preview. The parser has been designed for robust performance even in pathological cases that tend to cause stack overflows or exponential slowdowns in other parsers, with parsing speed that varies linearly with input length. Related packages: - commonmark-extensions (which defines a number of syntax extensions) - commonmark-pandoc (which allows using this parser to create a Pandoc structure) - commonmark-cli (a command-line tool for converting and syntax-highlighting commonmark documents).
ca: Aquesta biblioteca proporciona els tipus de dades i les funcions bàsiques per a l'anàlisi de Commonmark (<https://spec.commonmark.org>). L'analitzador és completament compatible amb commonmark i passa el conjunt de proves. Està dissenyat per ser personalitzable i fàcilment extensible. Per a personalitzar la sortida, crear un AST o admetre un nou format de sortida, només cal definir algunes noves instàncies de la classe de tipus. També és fàcil afegir nous elements de sintaxi o modificar els existents. Hi ha disponible informació precisa sobre les posicions d'origen per a tots els elements de bloc i en línia. Per tant, la biblioteca es pot utilitzar per crear un ressaltador de sintaxi precís o un editor amb vista prèvia en directe. L'analitzador ha estat dissenyat per a un rendiment robust fins i tot en casos patològics que tendeixen a causar desbordaments de pila o alentiments exponencials en altres analitzadors, amb velocitat d'anàlisi que varia linealment amb la longitud d'entrada. Paquets relacionats: - commonmark-extensions (que defineix un nombre d'extensions de sintaxi) - commonmark-pandoc (que permet utilitzar aquest analitzador per crear una estructura Pandoc) - commonmark-cli (una eina de línia d'ordres per a convertir i ressaltar la sintaxi de documents commonmark).

source: Haskell commonmark library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell commonmark

source: This package provides the Haskell commonmark library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell commonmark.

source: This library provides some useful extensions to core commonmark syntax: smart quotes, definition lists, tables, footnotes, math, and more.
ca: Aquesta biblioteca proporciona algunes extensions útils a la sintaxi bàsica de commonmark: cometes intel·ligents, llistes de definició, taules, notes a peu de pàgina, matemàtiques i més.

source: Haskell commonmark-extensions library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell commonmark-extensions

source: This package provides the Haskell commonmark-extensions library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell commonmark-extensions.

source: Bridge between commonmark and pandoc AST
ca: Pont entre commonmark i pandoc AST

source: This library provides typeclasses for rendering commonmark to Pandoc types.
ca: Aquesta biblioteca proporciona classes de tipus per a representar Commonmark als tipus Pandoc.

source: Haskell commonmark-pandoc library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell commonmark-pandoc

source: This package provides the Haskell commonmark-pandoc library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell commonmark-pandoc.

source: Comonads
ca: Comonades

source: Haskell comonad library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell comonad

source: This package provides the Haskell comonad library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell comonad.

source: GHC compiler and utilities
ca: Compilador i utilitats GHC

source: This package contains the GHC compiler, tools and utilities. The GHC libraries are provided by ghc-devel. To install all of GHC install package ghc.
ca: Aquest paquet conté el compilador GHC, eines i utilitats. Les biblioteques GHC són proporcionades per ghc-devel. Per a instal·lar tot el paquet d'instal·lació GHC ghc.

source: Typeclasses, functions, and data types for concurrency and STM
ca: Classes de tipus, funcions i tipus de dades per a concurrència i STM

source: A typeclass abstraction over much of Control.Concurrent (and some extras!). If you're looking for a general introduction to Haskell concurrency, you should check out the excellent Parallel and Concurrent Programming in Haskell, by Simon Marlow. If you are already familiar with concurrent Haskell, just change all the imports from Control.Concurrent.* to Control.Concurrent.Classy.* and fix the type errors.
ca: Una abstracció de classe tipogràfica sobre gran part de Control.Concurrent (i alguns extres!). Si busques una introducció general a la concurrència Haskell, hauries de consultar l'excel·lent Programació Paral·lela i Concurrent a Haskell, de Simon Marlow. Si ja esteu familiaritzat amb Haskell concurrent, només canvieu totes les importacions des de Control.Concurrent.* a Control.Concurrent.Classy.* i corregeix els errors de tipus.

source: Haskell concurrency library development files
ca: Fitxers de desenvolupament de la biblioteca de concurrència Haskell

source: This package provides the Haskell concurrency library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de concurrència Haskell.

source: Ungarble output from several threads or commands
ca: Sortida il·lustrada de diversos fils o ordres

source: Lets multiple threads and external processes concurrently output to the console, without it getting all garbled up. Built on top of that is a way of defining multiple output regions, which are automatically laid out on the screen and can be individually updated by concurrent threads. Can be used for progress displays etc. <<https://joeyh.name/code/concurrent-output/demo2.gif>>.
ca: Permet que múltiples fils i processos externs surtin simultàniament a la consola, sense que tot s'esquinça. Construït sobre això és una manera de definir múltiples regions de sortida, que es disposen automàticament a la pantalla i es poden actualitzar individualment mitjançant fils concurrents. Es pot utilitzar per a pantalles de progrés, etc. <<https://joeyh.name/code/concurrent-output/demo2.gif>..

source: Haskell concurrent-output library development files
ca: Fitxers de desenvolupament de la biblioteca de sortida concurrent de Haskell

source: This package provides the Haskell concurrent-output library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell concurrent-output.

source: Streaming data processing library
ca: Biblioteca de processament de dades en flux

source: `conduit` is a solution to the streaming data problem, allowing for production, transformation, and consumption of streams of data in constant memory. It is an alternative to lazy I/O which guarantees deterministic resource handling. For more information about conduit in general, and how this package in particular fits into the ecosystem, see [the conduit homepage](https://github.com/snoyberg/conduit#readme). Hackage documentation generation is not reliable. For up to date documentation, please see: <http://www.stackage.org/package/conduit>.
ca: El .conduit. és una solució al problema de dades de transmissió, que permet la producció, transformació i consum de fluxos de dades en memòria constant. És una alternativa a l'E/S mandrosa que garanteix el maneig determinista dels recursos. Per obtenir més informació sobre el conducte en general, i com aquest paquet en particular encaixa en l'ecosistema, vegeu [la pàgina d'inici del conducte](https://github.com/snoyberg/conduit).readme). La generació de documentació de Hackage no és fiable. Per obtenir documentació actualitzada, consulteu: <http://www.stackage.org/package/conduit>.

source: DEPRECATED Functionality merged into the conduit package itself
ca: Funcionalitat OBSOLETa fusionada amb el propi paquet de conductes

source: See docs and README at <http://www.stackage.org/package/conduit-combinators>.
ca: Vegeu documents i README a <http://www.stackage.org/package/conduit-combinators>.

source: Haskell conduit-combinators library development files
ca: Fitxers de desenvolupament de la biblioteca Conduit-combinators de Haskell

source: This package provides the Haskell conduit-combinators library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de conductes-combinadors Haskell.

source: Haskell conduit library development files
ca: Fitxers de desenvolupament de la biblioteca de conductes Haskell

source: This package provides the Haskell conduit library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de conductes Haskell.

source: Batteries included conduit: adapters for common libraries
ca: Bateries incloses: adaptadors per a biblioteques comunes

source: The conduit package itself maintains relative small dependencies. The purpose of this package is to collect commonly used utility functions wrapping other library dependencies, without depending on heavier-weight dependencies. The basic idea is that this package should only depend on haskell-platform packages and conduit.
ca: El paquet de conductes manté dependències relativament petites. El propòsit d'aquest paquet és recollir funcions d'utilitat d'ús comú que embolcallen altres dependències de la biblioteca, sense dependre de dependències de pes més pesat. La idea bàsica és que aquest paquet només hauria de dependre dels paquets i conductes de haskell-platform.

source: Haskell conduit-extra library development files
ca: Haskell conduit-extra biblioteca fitxers de desenvolupament

source: This package provides the Haskell conduit-extra library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell conduit-extra.

source: Conduit-based ZStd Compression
ca: Compressió ZStd basada en conductes

source: Zstandard compression packaged as a conduit. This is a very thin wrapper around the [official hs-zstd interface](https://github.com/facebookexperimental/hs-zstd/).
ca: Compressió estàndard Z empaquetada com a conducte. Aquest és un embolcall molt fi al voltant de la [interfície oficial hs-zstd](https://github.com/facebookexperimental/hs-zstd/).

source: Haskell conduit-zstd library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell conduit-zstd

source: This package provides the Haskell conduit-zstd library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell conduit-zstd.

source: A library for simple INI-based configuration files
ca: Una biblioteca per a fitxers de configuració simples basats en INI

source: The 'config-ini' library is a set of small monadic languages for writing simple configuration languages with convenient, human-readable error messages. > parseConfig :: IniParser (Text, Int, Bool) > parseConfig = section "NETWORK" $ do > user <- field "user" > port <- fieldOf "port" number > enc <- fieldFlagDef "encryption" True > return (user, port, enc).
ca: La biblioteca 'config-ini' és un conjunt de petits llenguatges monòdics per escriure llenguatges de configuració simples amb missatges d'error convenients i llegibles per l'home. ). parseConfig :: IniParser (Text, Int, Bool) ). parseConfig ). section "NETWORK" $ do ). user <- field "user" > port <- fieldOf "port" number > enc <- fieldFlagDef "encryption" True > return (user, port, enc).

source: Haskell config-ini library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell config-ini

source: This package provides the Haskell config-ini library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell config-ini.

source: Simple and easy network connections API
ca: API de connexions de xarxa simple i fàcil

source: Simple network library for all your connection need. Features: Really simple to use, SSL/TLS, SOCKS. This library provides a very simple api to create sockets to a destination with the choice of SSL/TLS, and SOCKS.
ca: Biblioteca de xarxa senzilla per a totes les necessitats de connexió. Característiques: Molt senzill d'utilitzar, SSL/TLS, SOCKS. Aquesta biblioteca proporciona un api molt senzill per crear sòcols a una destinació amb l'elecció de SSL/TLS i SOCKS.

source: Haskell connection library development files
ca: Fitxers de desenvolupament de la biblioteca de connexió Haskell

source: This package provides the Haskell connection library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de connexió Haskell.

source: Constraint manipulation
ca: Manipulació de restriccions

source: GHC 7.4 gave us the ability to talk about 'ConstraintKinds'. They stopped crashing the compiler in GHC 7.6. This package provides a vocabulary for working with them.
ca: El GHC 7.4 ens va donar la possibilitat de parlar de "ConstraintKinds". Van deixar de bloquejar el compilador en el GHC 7.6. Aquest paquet proporciona un vocabulari per treballar amb ells.

source: Haskell constraints library development files
ca: Fitxers de desenvolupament de la biblioteca de restriccions Haskell

source: This package provides the Haskell constraints library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de restriccions Haskell.

source: Haskell containers library
ca: Biblioteca de contenidors Haskell

source: This package provides the Haskell containers library.
ca: Aquest paquet proporciona la biblioteca de contenidors Haskell.

source: Haskell containers library development files
ca: Fitxers de desenvolupament de la biblioteca de contenidors Haskell

source: This package provides the Haskell containers library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de contenidors Haskell.

source: Continued fractions
ca: Fraccions continuades

source: A type and some functions for manipulating and evaluating continued fractions.
ca: Un tipus i algunes funcions per manipular i avaluar fraccions contínues.

source: Haskell continued-fractions library development files
ca: Fitxers de desenvolupament de la biblioteca de fraccions contínues de Haskell

source: This package provides the Haskell continued-fractions library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de fraccions contínues de Haskell.

source: Contravariant functors
ca: Functors contravariants

source: Contravariant functors.
ca: Functors contravariants.

source: Haskell contravariant library development files
ca: Fitxers de desenvolupament de la biblioteca contravariant Haskell

source: This package provides the Haskell contravariant library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca contravariant Haskell.

source: Free monads and monad transformers
ca: Mònades lliures i transformadors de monads

source: This package provides datatypes to construct Free monads, Free monad transformers, and useful instances. In addition it provides the constructs to avoid quadratic complexity of left associative bind, as explained in: * Janis Voigtlander, /Asymptotic Improvement of Computations over Free Monads, MPC'08/.
ca: Aquest paquet proporciona tipus de dades per construir monads lliures, transformadors de monads lliures i instàncies útils. A més, proporciona les construccions per evitar la complexitat quadràtica de l'enllaç associatiu esquerre, com s'explica a: * Janis Voigtlander, /Asymptotic Improvement of Computations over Free Monads, MPC'08/.

source: Haskell control-monad-free library development files
ca: Fitxers de desenvolupament de la biblioteca sense monedes de control Haskell

source: This package provides the Haskell control-monad-free library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell control-monad-free.

source: Limit operations for converging sequences
ca: Limita les operacions per a seqüències convergents

source: Limit operations for converging sequences. This is fairly simple right now. Changes in 0.1.0.1: Nothing except to enable -XSafe under GHC 7.2.1.
ca: Limita les operacions per a seqüències convergents. Això és bastant senzill ara mateix. Canvis en 0.1.0.1: Res més que habilitar -XSafe sota GHC 7.2.1.

source: Haskell converge library development files
ca: Haskell convergeu els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell converge library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell converge.

source: HTTP cookie parsing and rendering
ca: Anàlisi i representació de galetes HTTP

source: Hackage documentation generation is not reliable. For up to date documentation, please see: <https://www.stackage.org/package/cookie>.
ca: La generació de documentació de Hackage no és fiable. Per obtenir documentació actualitzada, consulteu: <https://www.stackage.org/package/cookie>.

source: Haskell cookie library development files
ca: Fitxers de desenvolupament de la biblioteca de galetes Haskell

source: This package provides the Haskell cookie library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de galetes Haskell.

source: Crypto Pseudo Random Number Generator using AES in counter mode
ca: Generador de nombres aleatoris pseudocriptat utilitzant AES en mode comptador

source: Simple crypto pseudo-random-number-generator with really good randomness property. Using ent, a randomness property maker on one 1Mb sample: Entropy = 7.999837 bits per byte. Optimum compression would reduce the size of this 1048576 byte file by 0 percent. Chi square distribution for 1048576 samples is 237.02 Arithmetic mean value of data bytes is 127.3422 (127.5 = random) Monte Carlo value for Pi is 3.143589568 (error 0.06 percent) Compared to urandom with the same sampling: Entropy = 7.999831 bits per byte. Optimum compression would reduce the size of this 1048576 byte file by 0 percent. Chi square distribution for 1048576 samples is 246.63 Arithmetic mean value of data bytes is 127.6347 (127.5 = random). Monte Carlo value for Pi is 3.132465868 (error 0.29 percent).
ca: Generador pseudoaleatori de cripto simple amb una propietat realment bona d'aleatorietat. Utilitzant ent, un fabricant de propietats d'aleatorietat en una mostra de 1Mb: Entropia 7 7.999837 bits per byte. La compressió òptima reduiria la mida d'aquest fitxer de 1048576 bytes en un 0 per cent. La distribució khi quadrat per a 1048576 mostres és 237,02 El valor mitjà aritmètic dels bytes de dades és 127.3422 (127.5 ) aleatori) El valor de Monte Carlo per a Pi és 3.143589568 (error 0,06 per cent) Comparat amb l'urandom amb el mateix mostreig: Entropia 7 7.999831 bits per byte. La compressió òptima reduiria la mida d'aquest fitxer de 1048576 bytes en un 0 per cent. La distribució khi quadrat per a 1048576 mostres és 246.63 El valor mitjà aritmètic dels bytes de dades és 127.6347 (127.5 ). aleatori). El valor de Montecarlo per a Pi és 3,32465868 (error 0,29 per cent).

source: Haskell cprng-aes library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell cprng-aes

source: This package provides the Haskell cprng-aes library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell cprng-aes.

source: Robust, reliable performance measurement and analysis
ca: Mesura i anàlisi de rendiment robust i fiable

source: This library provides a powerful but simple way to measure software performance. It provides both a framework for executing and analysing benchmarks and a set of driver functions that makes it easy to build and run benchmarks, and to analyse their results. The fastest way to get started is to read the <http://www.serpentine.com/criterion/tutorial.html online tutorial>, followed by the documentation and examples in the "Criterion.Main" module. For examples of the kinds of reports that criterion generates, see <http://www.serpentine.com/criterion the home page>.
ca: Aquesta biblioteca proporciona una manera potent però senzilla de mesurar el rendiment del programari. Proporciona tant un marc per a l'execució i l'anàlisi de benchmarks com un conjunt de funcions driver que faciliten la construcció i execució de benchmarks, i l'anàlisi dels seus resultats. La manera més ràpida de començar és llegir la <http://www.serpentine.com/criterion/tutorial.html online tutorial>, seguida de la documentació i exemples en el "criteri.Mòdul Main". Per exemples dels tipus d'informes que genera el criteri, vegeu <http://www.serpentine.com/criterion the home page>.

source: Haskell criterion library development files
ca: Fitxers de desenvolupament de la biblioteca de criteris de Haskell

source: This package provides the Haskell criterion library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de criteris Haskell.

source: Criterion measurement functionality and associated types
ca: Funcionalitat de mesura del criteri i tipus associats

source: Measurement-related functionality extracted from Criterion, with minimal dependencies. The rationale for this is to enable alternative analysis front-ends.
ca: Funcionalitat relacionada amb la mesura extreta de Criteri, amb dependències mínimes. La raó per a això és permetre l'anàlisi alternativa de front-ends.

source: Haskell criterion-measurement library development files
ca: Fitxers de desenvolupament de la biblioteca de mesura de criteris de Haskell

source: This package provides the Haskell criterion-measurement library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de mesura de criteris Haskell.

source: A generic interface for cryptographic operations
ca: Una interfície genèrica per a operacions criptogràfiques

source: A generic interface for cryptographic operations (hashes, ciphers, randomness). Maintainers of hash and cipher implementations are encouraged to add instances for the classes defined in Crypto.Classes. Crypto users are similarly encouraged to use the interfaces defined in the Classes module. Any concepts or functions of general use to more than one cryptographic algorithm (ex: padding) is within scope of this package.
ca: Una interfície genèrica per a operacions criptogràfiques (hashes, ciphers, randomness). S'anima als mantenidors d'implementacions de hash i xifratge a afegir instàncies per a les classes definides a Crypto.Classes. Els usuaris de cripto són encoratjats de manera similar a utilitzar les interfícies definides al mòdul Classes. Qualsevol concepte o funció d'ús general de més d'un algorisme criptogràfic (ex: farciment) està dins de l'abast d'aquest paquet.

source: Haskell crypto-api library development files
ca: Fitxers de desenvolupament de la biblioteca crypto-api de Haskell
