Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: Parsing of ISO 8601 dates, originally from aeson
ca: Anàlisi de les dates ISO 8601, originàries de l'esó

source: Parsing of ISO 8601 dates, originally from aeson.
ca: Analització de les dates ISO 8601, originàries de l'esó.

source: Haskell attoparsec-iso8601 library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell attoparsec-iso8601

source: This package provides the Haskell attoparsec-iso8601 library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell attoparsec-iso8601.

source: Library to authenticate with OAuth for Haskell web applications
ca: Biblioteca per autenticar-se amb OAuth per a aplicacions web Haskell

source: API docs and the README are available at <http://www.stackage.org/package/authenticate-oauth>.
ca: Els documents de l'API i el README estan disponibles a <http://www.stackage.org/package/authenticate-oauth>.

source: Haskell authenticate-oauth library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell authenticate-oauth

source: This package provides the Haskell authenticate-oauth library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell authenticate-oauth.

source: Efficiently run periodic, on-demand actions
ca: Executa de manera eficient accions periòdiques a demanda

source: API docs and the README are available at <http://www.stackage.org/package/auto-update>.
ca: Els documents de l'API i el README estan disponibles a <http://www.stackage.org/package/auto-update>.

source: Haskell auto-update library development files
ca: Actualitza automàticament els fitxers de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell auto-update library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'actualització automàtica de Haskell.

source: Amazon Web Services (AWS) for Haskell
ca: Amazon Web Services (AWS) per a Haskell

source: Bindings for Amazon Web Services (AWS), with the aim of supporting all AWS services. To see a high level overview of the library, see the README at <https://github.com/aristidb/aws/blob/master/README.md>.
ca: Vinculacions per a Amazon Web Services (AWS), amb l'objectiu de donar suport a tots els serveis d'AWS. Per veure una visió general d'alt nivell de la biblioteca, vegeu el README a <https://github.com/aristidb/aws/blob/master/README.md>.

source: Haskell aws library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell aws library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell aws.

source: Classes for working with types that can change clothes
ca: Classes per treballar amb tipus que poden canviar de roba

source: Types that are parametric on a functor are like Barbies that have an outfit for each role. This package provides the basic abstractions to work with them comfortably.
ca: Els tipus que són paramètrics en un functor són com els barbis que tenen un outfit per a cada rol. Aquest paquet proporciona les abstraccions bàsiques per treballar-hi còmodament.

source: Haskell barbies library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell barbies library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de barbies de Haskell.

source: Haskell base library
ca: Biblioteca base del Haskell

source: This package provides the Haskell base library.
ca: Aquest paquet proporciona la biblioteca base Haskell.

source: A compatibility layer for base
ca: Una capa de compatibilitat per a la base

source: Provides functions available in later versions of 'base' to a wider range of compilers, without requiring you to use CPP pragmas in your code. See the <https://github.com/haskell-compat/base-compat/blob/master/base-compat/README.markdown README> for what is covered. Also see the <https://github.com/haskell-compat/base-compat/blob/master/base-compat/CHANGES.markdown changelog> for recent changes. Note that 'base-compat' does not add any orphan instances. There is a separate package, '<http://hackage.haskell.org/package/base-orphans base-orphans>', for that. In addition, 'base-compat' does not backport any data types or type classes. See '<https://github.com/haskell-compat/base-compat/blob/master/base-compat/README.markdown#data-types-and-type-classes this section of the README>' for more info. 'base-compat' is designed to have zero dependencies. For a version of 'base-compat' that depends on compatibility libraries for a wider support window, see the '<http://hackage.haskell.org/package/base-compat-batteries base-compat-batteries>' package. Most of the modules in this library have the same names as in 'base-compat-batteries' to make it easier to switch between the two. There also exist versions of each module with the suffix '.Repl', which are distinct from anything in 'base-compat-batteries', to allow for easier use in GHCi.
ca: Proporciona funcions disponibles en versions posteriors de 'base' a una gamma més àmplia de compiladors, sense requerir que utilitzeu pragmes CPP al vostre codi. Vegeu el <https://github.com/haskell-compat/base-compat/blob/master/base-compat/README.markdown README> per a què està cobert. Vegeu també <https://github.com/haskell-compat/base-compat/blob/master/base-compat/CHANGES.markdown changelog> per als canvis recents. Tingueu en compte que «base-compat» no afegeix cap instància òrfena. Hi ha un paquet separat, «<http://hackage.haskell.org/package/base-orphans base-orphans>», per a això. A més, «base-compat» no porta enrere cap tipus de dades ni classes de tipus. Vegeu '<https://github.com/haskell-compat/base-compat/blob/master/base-compat/README.markdown#data-types-and-type-classes this section of the README>' per a més informació. «base-compat» està dissenyat per a tenir dependències zero. Per a una versió de «compat base» que depèn de les biblioteques de compatibilitat per a una finestra de suport més àmplia, vegeu el paquet «<http://hackage.haskell.org/package/base-compat-batteries base-compat-batteries>». La majoria dels mòduls d'aquesta biblioteca tenen els mateixos noms que a les "bateries base" per facilitar el canvi entre tots dos. També hi ha versions de cada mòdul amb el sufix '.Repl', que són diferents de qualsevol cosa en les "bateries de base", per permetre un ús més fàcil en GHCi.

source: Base-compat with extra batteries
ca: Base-compat amb bateries addicionals

source: Provides functions available in later versions of 'base' to a wider range of compilers, without requiring you to use CPP pragmas in your code. This package provides the same API as the '<http://hackage.haskell.org/package/base-compat base-compat>' library, but depends on compatibility packages (such as 'semigroups') to offer a wider support window than 'base-compat', which has no dependencies. Most of the modules in this library have the same names as in 'base-compat' to make it easier to switch between the two. There also exist versions of each module with the suffix '.Repl.Batteries', which are distinct from anything in 'base-compat', to allow for easier use in GHCi. See '<https://github.com/haskell-compat/base-compat/blob/master/base-compat/README.markdown#dependencies here>' for a more comprehensive list of differences between 'base-compat' and 'base-compat-batteries'.
ca: Proporciona funcions disponibles en versions posteriors de 'base' a una gamma més àmplia de compiladors, sense requerir que utilitzeu el pragmas CPP en el vostre codi. Aquest paquet proporciona la mateixa API que la biblioteca '<http://hackage.haskell.org/package/base-compat base-compat>', però depèn de paquets de compatibilitat (com ara 'semigrups') per oferir una finestra de suport més àmplia que 'base-compat', que no té dependències. La majoria dels mòduls d'aquesta biblioteca tenen els mateixos noms que a «base-compat» per a facilitar el canvi entre els dos. També hi ha versions de cada mòdul amb el sufix '.Repl.Les bateries, que són diferents de qualsevol cosa en el «compat de base», per a permetre un ús més fàcil en GHCi. Vegeu '<https://github.com/haskell-compat/base-compat/blob/master/base-compat/README.markdown#dependencies here>' per a una llista més completa de diferències entre 'compat-base' i 'base-compat-batteries'.

source: Haskell base-compat-batteries library development files
ca: Fitxers de desenvolupament de la biblioteca base-compat-batteries de Haskell

source: This package provides the Haskell base-compat-batteries library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell base-compat-batteries.

source: Haskell base-compat library development files
ca: Fitxers de desenvolupament de biblioteques compatibles amb la base del Haskell

source: This package provides the Haskell base-compat library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca compatibles amb la base de Haskell.

source: Haskell base library development files
ca: Fitxers de desenvolupament de la biblioteca base Haskell

source: This package provides the Haskell base library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca base Haskell.

source: "base" package sans "Prelude" module
ca: Mòdul "base" de paquets sans "Prelude"

source: This package simplifies defining custom "Prelude"s without having to use '-XNoImplicitPrelude' by re-exporting the full module-hierarchy of the [base-4.13.0.0](https://hackage.haskell.org/package/base-4.13.0.0) package /except/ for the "Prelude" module. An usage example for such a "Prelude"-replacement is available with the [Prelude](http://hackage.haskell.org/package/Prelude) package. Starting with GHC 7.10 & Cabal-1.22 this package makes use of the package-level 'reexported-modules' feature. Each version of 'base-noprelude' depends on a specific 'base'-version and thus mirrors 'base''s versioning (with the exception that 'base-noprelude' needs to add an /additional/ 5th version component in case of bug-fix releases). See <https://github.com/hvr/base-noprelude> for more information.
ca: Aquest paquet simplifica la definició de «Preludi» personalitzat sense haver d'utilitzar «-XNoImplicitPrelude» reexportant la jerarquia completa de mòduls del paquet [base-4.13.0.0](https://hackage.haskell.org/package/base-4.13.0.0) /except/ per al mòdul «Preludi». Hi ha disponible un exemple d'ús per a aquest reemplaçament «Preludi» amb el paquet [Preludi](http://hackage.haskell.org/package/Preludi). A partir del GHC 7.10 Cabal-1.22 aquest paquet fa ús de la característica de nivell de paquet 'reexported-modules'. Cada versió de 'base-noprelude' depèn d'una versió específica de 'base' i, per tant, reflecteix la versió de 'base' (amb l'excepció que 'base-noprelude' ha d'afegir un component de versió /additional/ 5a en cas de llançaments de correcció d'errors). Vegeu <https://github.com/hvr/base-noprelude> per a més informació.

source: Haskell base-noprelude library development files
ca: Fitxers de desenvolupament de la biblioteca de base nopreludi de Haskell

source: This package provides the Haskell base-noprelude library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell base-noprelude.

source: Backwards-compatible orphan instances for base
ca: Instàncies òrfenes compatibles amb el fons per a la base

source: 'base-orphans' defines orphan instances that mimic instances available in later versions of 'base' to a wider (older) range of compilers. 'base-orphans' does not export anything except the orphan instances themselves and complements '<http://hackage.haskell.org/package/base-compat base-compat>'. See the README for what instances are covered: <https://github.com/haskell-compat/base-orphans#readme>. See also the <https://github.com/haskell-compat/base-orphans#what-is-not-covered what is not covered> section.
ca: 'base-orphans' defineix les instàncies òrfenes que imiten les instàncies disponibles en versions posteriors de 'base' a una gamma més àmplia (més antiga) de compiladors. «base-orphans» no exporta res excepte les pròpies instàncies òrfenes i complementa «<http://hackage.haskell.org/package/base-compat base-compat>». Vegeu el README per a quines instàncies estan cobertes: <https://github.com/haskell-compat/base-orphans#readme>. Vegeu també la secció <https://github.com/haskell-compat/base-orphans#what-is-not-covered what is not covered>.

source: Haskell base-orphans library development files
ca: Fitxers de desenvolupament de la biblioteca base orphans de Haskell

source: This package provides the Haskell base-orphans library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell base-orphans.

source: The most complete prelude formed solely from the "base" package
ca: El preludi més complet format únicament a partir del paquet "base"

source: A library which aims to reexport all the non-conflicting and most general definitions from the "base" package. This includes APIs for applicatives, arrows, monoids, foldables, traversables, exceptions, generics, ST, MVars and STM. This package will never have any dependencies other than "base". /Versioning policy/ The versioning policy of this package deviates from PVP in the sense that its exports in part are transitively determined by the version of "base". Therefore it's recommended for the users of "base-prelude" to specify the bounds of "base" as well.
ca: Una biblioteca que té com a objectiu reexportar totes les definicions no conflictives i més generals del paquet "base". Això inclou APIs per a aplicacions, fletxes, monoides, plegables, traversables, excepcions, genèrics, ST, MVars i STM. Aquest paquet mai tindrà dependències diferents de «base». /Política de verificació/ La política de versionat d'aquest paquet es desvia del PVP en el sentit que les seves exportacions en part estan determinades transitivament per la versió de "base". Per tant, es recomana que els usuaris de "base-prelude" especifiquin també els límits de "base".

source: Haskell base-prelude library development files
ca: Fitxers de desenvolupament de la biblioteca de preludi base Haskell

source: This package provides the Haskell base-prelude library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de preludi base Haskell.

source: RFC 4648-compliant Base16 encodings for ByteStrings
ca: Codificacions Base16 compatibles amb RFC 4648 per a ByteStrings

source: This package provides support for encoding and decoding binary data according to 'base16' (see also <https://tools.ietf.org/html/rfc4648 RFC 4648>) for strict (see "Data.ByteString.Base16") and lazy 'ByteString's (see "Data.ByteString.Base16.Lazy"). See the <https://hackage.haskell.org/package/base16 base16> package which provides superior encoding and decoding performance as well as support for lazy, short, and strict variants of 'Text' and 'ByteString' values. Additionally, see the <https://hackage.haskell.org/package/base-encoding base-encoding> package which provides an uniform API providing conversion paths between more binary and textual types.
ca: Aquest paquet proporciona suport per a la codificació i descodificació de dades binàries segons 'base16' (vegeu també <https://tools.ietf.org/html/rfc4648 RFC 4648>) per a estricte (vegeu "Dades.ByteString.Base16") i lazy 'ByteString's (veure "Dades.ByteString.Base16.Mandrós"). Vegeu el paquet <https://hackage.haskell.org/package/base16 base16> que proporciona un rendiment de codificació i descodificació superior, així com suport per a variants mandroses, curtes i estrictes dels valors «Text» i «ByteString». A més, vegeu el paquet <https://hackage.haskell.org/package/base-encoding base-encoding> que proporciona una API uniforme que proporciona camins de conversió entre els tipus més binaris i textuals.

source: Haskell base16-bytestring library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell base16-bytestring

source: This package provides the Haskell base16-bytestring library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell base16-bytestring.

source: Implementation of BASE58 transcoding for ByteStrings
ca: Implementació de la transcodificació BASE58 per a ByteStrings

source: Implementation of BASE58 transcoding copy-pasted from haskoin package.
ca: Implementació de base58 transcodificació copiada del paquet haskoin.

source: Haskell base58-bytestring library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell base58 bytestring

source: This package provides the Haskell base58-bytestring library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell base58-bytestring.

source: A modern RFC 4648-compliant Base64 library
ca: Una moderna biblioteca Base64 compatible amb el RFC 4648

source: RFC 4648-compliant Base64 with an eye towards performance and modernity (additional support for RFC 7049 standards).
ca: Base64 compatible amb l'RFC 4648 amb un ull cap al rendiment i la modernitat (suport addicional per als estàndards RFC 7049).

source: Fast base64 encoding and decoding for ByteStrings
ca: Codificació i descodificació ràpida de base64 per a ByteStrings

source: This package provides support for encoding and decoding binary data according to 'base64' (see also <https://tools.ietf.org/html/rfc4648 RFC 4648>) for strict and lazy ByteStrings For a fuller-featured and better-performing Base64 library, see the <https://hackage.haskell.org/package/base64 base64> package.
ca: Aquest paquet proporciona suport per a la codificació i descodificació de dades binàries d'acord amb «base64» (vegeu també <https://tools.ietf.org/html/rfc4648 RFC 4648>) per a marques de bytes estrictes i mandroses Per obtenir una biblioteca Base64 més completa i amb millors resultats, vegeu el paquet <https://hackage.haskell.org/package/base64 base64>.

source: Haskell base64-bytestring library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell base64-bytestring

source: This package provides the Haskell base64-bytestring library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell base64-bytestring.

source: A newtype around ByteString, for base64 encoding
ca: Un nou tipus al voltant de ByteString, per a la codificació base64

source: A newtype around ByteString, for base64 encoding. Strict and lazy, normal and url alphabet variants.
ca: Un nou tipus al voltant de ByteString, per a la codificació base64. Variants d'alfabet estricte i mandrós, normal i url.

source: Haskell base64-bytestring-type library development files
ca: Fitxers de desenvolupament de biblioteques de tipus base64 de Haskell

source: This package provides the Haskell base64-bytestring-type library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de tipus Haskell base64-bytestring.

source: Haskell base64 library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell base64

source: This package provides the Haskell base64 library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell base64.

source: Foundation scrap box of array & string
ca: Quadre de selecció de base de la cadena de matriu

source: Foundation most basic primitives without any dependencies.
ca: Funda la majoria de primitives bàsiques sense cap dependència.

source: Haskell basement library development files
ca: Fitxers de desenvolupament de la biblioteca de soterrani Haskell

source: This package provides the Haskell basement library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de soterrani Haskell.

source: Implementation of the Bech32 cryptocurrency address format (BIP 0173)
ca: Implementació del format d'adreça de criptomonedes Bech32 (BIP 0173)

source: Implementation of the Bech32 cryptocurrency address format documented in the BIP (Bitcoin Improvement Proposal) 0173.
ca: Implementació del format d'adreça de criptomonedes Bech32 documentat en el BIP (Bitcoin Improvement Proposal) 0173.

source: Haskell bech32 library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell bech32

source: This package provides the Haskell bech32 library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell bech32.

source: Template Haskell extensions to the Bech32 library
ca: Plantilla d'extensions Haskell a la biblioteca Bech32

source: Template Haskell extensions to the Bech32 library, including quasi-quoters for compile-time checking of Bech32 string literals.
ca: Plantilla d'extensions Haskell a la biblioteca Bech32, incloent quasi-cometes per a la comprovació en temps de compilació de literals de cadena Bech32.

source: Haskell bech32-th library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell bech32-th

source: This package provides the Haskell bech32-th library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell bech32-th.

source: Parsers and printers for bencoded data
ca: Analitzadors i impressores per a dades bencodificades

source: Parsers and printers for bencoded data. Bencode (pronounced like B encode) is the encoding used by the peer-to-peer file sharing system BitTorrent for storing and transmitting loosely structured data.
ca: Analitzadors i impressores per a dades bencodificades. Bencode (pronunciat com B encode) és la codificació utilitzada pel sistema de compartició de fitxers peer-to-peer BitTorrent per emmagatzemar i transmetre dades vagament estructurades.

source: Haskell bencode library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell bencode

source: This package provides the Haskell bencode library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell bencode.

source: 🍱 Manage stateful components
ca: Gestiona els components d'estat

source: Bento manages stateful components.
ca: Bento gestiona components d'estat.

source: Haskell bento library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell bento

source: This package provides the Haskell bento library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell bento.

source: Collection Haskell 98 bifunctors, bifoldables and bitraversables
ca: Col·lecció Haskell 98 bifunctors, bifoldables i bitraversables

source: Bifunctor, bifoldable, and bitraversable instances for Haskell 98.
ca: Bifunctor, bifoldable, i bitraversable instàncies per Haskell 98.

source: Haskell bifunctors library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell bifunctors

source: This package provides the Haskell bifunctors library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell bifunctors.

source: Bidirectional mapping between two key types
ca: Mapatge bidireccional entre dos tipus de claus

source: A data structure representing a bidirectional mapping between two key types. Each value in the bimap is associated with exactly one value of the opposite type.
ca: Una estructura de dades que representa un mapatge bidireccional entre dos tipus de claus. Cada valor del bimapa s'associa exactament amb un valor del tipus oposat.

source: Haskell bimap library development files
ca: Fitxers de desenvolupament de la biblioteca bimap del Haskell
