Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: The Glorious Glasgow Haskell Compiler
ca: El Glorious Glasgow Haskell Compiler

source: Haskell is the standard purely functional programming language; the current language version is Haskell 98, agreed in December 1998. GHC is a state-of-the-art programming suite for Haskell. Included is an optimising compiler generating good code for a variety of platforms, together with an interactive system for convenient, quick development. The distribution includes space and time profiling facilities, a large collection of libraries, and support for various language extensions, including concurrency, exceptions, and foreign language interfaces (C, C++, etc). A wide variety of Haskell related resources (tutorials, libraries, specifications, documentation, compilers, interprbeters, references, contact information, links to research groups) are available from the Haskell home page at <http://www.haskell.org/>.
ca: Haskell és l'estàndard purament funcional llenguatge de programació; la versió actual del llenguatge és Haskell 98, acordat el desembre de 1998. GHC és una suite de programació d'última generació per a Haskell. S'inclou un compilador optimitzador que genera un bon codi per a una varietat de plataformes, juntament amb un sistema interactiu per a un desenvolupament còmode i ràpid. La distribució inclou instal·lacions d'elaboració de perfils d'espai i temps, una gran col·lecció de biblioteques i suport per a diverses extensions de llenguatge, incloent concurrència, excepcions i interfícies de llenguatge estranger (C, C++, etc.). Una àmplia varietat de recursos relacionats amb Haskell (tutorials, biblioteques, especificacions, documentació, compiladors, interprbeters, referències, informació de contacte, enllaços a grups de recerca) estan disponibles a la pàgina principal de Haskell a <http://www.haskell.org/>.

source: Haskell Cabal library
ca: Biblioteca Haskell Cabal

source: This package provides the Haskell Cabal library.
ca: Aquest paquet proporciona la biblioteca Haskell Cabal.

source: Haskell Cabal library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell Cabal

source: This package provides the Haskell Cabal library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell Cabal.

source: A library for working with .cabal files
ca: Una biblioteca per a treballar amb fitxers .cabal

source: This library provides tools for reading and manipulating the .cabal file format. Version 3.6 (unlike the following versions) is a dummy package that prevents module name clases between Cabal and Cabal-syntax if used together with a Cabal flag as described below. In Cabal-3.7 this package was split off. To avoid module name clashes, you can add this to your .cabal file: > flag Cabal-syntax > description: Use the new Cabal-syntax package > default: False > manual: False > > library > -- ... > if flag(Cabal-syntax) > build-depends: Cabal-syntax >= 3.7 > else > build-depends: Cabal < 3.7, Cabal-syntax < 3.7 This will default to the older build, but will allow consumers to opt-in to the newer libraries by requiring Cabal or Cabal-syntax >= 3.7.
ca: Aquesta biblioteca proporciona eines per llegir i manipular el format de fitxer .cabal. La versió 3.6 (a diferència de les versions següents) és un paquet fictici que evita els clases de nom del mòdul entre Cabal i la sintaxi de Cabal si s'utilitza juntament amb una bandera de Cabal com es descriu a continuació. A Cabal-3.7 aquest paquet es va separar. Per a evitar xocs de nom de mòdul, podeu afegir això al fitxer .cabal: the flag Cabal-syntax description: Use the new Cabal-syntax package the default: False manual manual: False ... ... library -- -- ... if flag(Cabal-syntax) build-depends: Cabal-syntax 3 3.7 else build-depends: Cabal 3 3.7, Cabal-syntax 3 3.7 Això per defecte a la construcció més antiga, però permetrà als consumidors optar a les biblioteques més noves requerint Cabal o Cabal-syntax 3 3.7.

source: Haskell Cabal-syntax library development files
ca: Fitxers de desenvolupament de la biblioteca de sintaxi de Haskell

source: This package provides the Haskell Cabal-syntax library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell Cabal-syntax.

source: RFC 4918 WebDAV support
ca: Implementació de WebDAV RFC 4918

source: This is a library for the Web Distributed Authoring and Versioning (WebDAV) extensions to HTTP. At present it supports a very small subset of client functionality. In addition, there is an executable, hdav, which can be used for command-line operation.
ca: Aquesta és una biblioteca per a les extensions Web Distributed Authoring and Versioning (WebDAV) a HTTP. En l'actualitat suporta un subconjunt molt petit de funcionalitat client. A més, hi ha un executable, hdav, que es pot utilitzar per a l'operació de la línia d'ordres.

source: Haskell DAV library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell DAV

source: This package provides the Haskell DAV library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell DAV.

source: Decimal numbers with variable precision
ca: Nombres decimals amb precisió variable

source: A decimal number has an integer mantissa and a negative exponent. The exponent can be interpreted as the number of decimal places in the value.
ca: Un nombre decimal té una mantissa entera i un exponent negatiu. L'exponent es pot interpretar com el nombre de decimals en el valor.

source: Haskell Decimal library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell Decimal

source: This package provides the Haskell Decimal library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell Decimal.

source: O(ND) diff algorithm in haskell
ca: Algorisme de diferències O(ND) en haskell

source: Implementation of the standard diff algorithm, and utilities for pretty printing.
ca: Implementació de l'algorisme diff estàndard, i utilitats per a una impressió bonica.

source: Haskell Diff library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell Diff

source: This package provides the Haskell Diff library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell Diff.

source: Globbing library
ca: Biblioteca Globbing

source: A library for globbing: matching patterns against file paths.
ca: Una biblioteca per a l'ombreig: patrons coincidents contra els camins dels fitxers.

source: Haskell Glob library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell Glob

source: This package provides the Haskell Glob library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell Glob.

source: A library for client-side HTTP
ca: Una biblioteca per al HTTP del costat del client

source: The HTTP package supports client-side web programming in Haskell. It lets you set up HTTP connections, transmitting requests and processing the responses coming back, all from within the comforts of Haskell. It's dependent on the network package to operate, but other than that, the implementation is all written in Haskell. A basic API for issuing single HTTP requests + receiving responses is provided. On top of that, a session-level abstraction is also on offer (the 'BrowserAction' monad); it taking care of handling the management of persistent connections, proxies, state (cookies) and authentication credentials required to handle multi-step interactions with a web server. The representation of the bytes flowing across is extensible via the use of a type class, letting you pick the representation of requests and responses that best fits your use. Some pre-packaged, common instances are provided for you ('ByteString', 'String'). Here's an example use: > > do > rsp <- Network.HTTP.simpleHTTP (getRequest "http://www.haskell.org/") > -- fetch document and return it (as a 'String'.) > fmap (take 100) (getResponseBody rsp) > > do > (_, rsp) > <- Network.Browser.browse $ do > setAllowRedirects True -- handle HTTP redirects > request $ getRequest "http://www.haskell.org/" > return (take 100 (rspBody rsp)) __Note:__ This package does not support HTTPS connections. If you need HTTPS, take a look at the following packages: * <http://hackage.haskell.org/package/http-streams http-streams> * <http://hackage.haskell.org/package/http-client http-client> (in combination with <http://hackage.haskell.org/package/http-client-tls http-client-tls>) * <http://hackage.haskell.org/package/req req> * <http://hackage.haskell.org/package/wreq wreq>.
ca: El paquet HTTP suporta la programació web del costat del client a Haskell. Permet configurar connexions HTTP, transmetent peticions i processant les respostes que tornen, tot des de dins de les comoditats de Haskell. Depèn del paquet de xarxa per funcionar, però a part d'això, la implementació està escrita a Haskell. Es proporciona una API bàsica per emetre sol·licituds HTTP individuals + rebre respostes. A més, també s'ofereix una abstracció a nivell de sessió (el monad 'BrowserAction'); s'encarrega de gestionar la gestió de connexions persistents, servidors intermediaris, credencials d'estat (cookies) i autenticació necessàries per gestionar interaccions multi-pas amb un servidor web. La representació dels bytes que flueixen és extensible mitjançant l'ús d'una classe de tipus, permetent-vos triar la representació de les peticions i respostes que millor s'ajustin al vostre ús. Es proporcionen algunes instàncies pre-empaquetades i comunes ('ByteString', 'String'). Aquí hi ha un exemple d'ús: . . fes . rsp <- Network.HTTP.simpleHTTP (getRequest "http://www.haskell.org/") > -- agafa el document i retorna'l (com a 'Ciutat'). . fmap (take 100) (getResponseBody rsp) . . do . (, rsp) . .- Xarxa.Navegador.browse $ do ) setAllowRedirects True -- handle HTTP redirects ) request $ getRequest "http://www.haskell.org/" ) return (take 100 (rspBody rsp)) Nota: Aquest paquet no admet connexions HTTPS. Si necessiteu HTTPS, feu un cop d'ull als paquets següents: * <http://hackage.haskell.org/package/http-streams http-streams> * <http://hackage.haskell.org/package/http-client http-client> (en combinació amb <http://hackage.haskell.org/package/http-client-tls http-client-tls>) * <http://hackage.haskell.org/package/req req> * <http://hackage.haskell.org/package/wreq wreq>.

source: Haskell HTTP library development files
ca: Fitxers de desenvolupament de la biblioteca HTTP Haskell

source: This package provides the Haskell HTTP library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca HTTP Haskell.

source: A unit testing framework for Haskell
ca: Un entorn de treball de prova unitari per a Haskell

source: HUnit is a unit testing framework for Haskell, inspired by the JUnit tool for Java, see: <http://www.junit.org>.
ca: HUnit és un marc de proves unitari per a Haskell, inspirat en l'eina JUnit per a Java, vegeu: <http://www.junit.org>.

source: Haskell HUnit library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell HUnit

source: This package provides the Haskell HUnit library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell HUnit.

source: Pure Haskell YAML 1.2 processor
ca: Pure Haskell YAML 1.2 processador

source: 'HsYAML' is a [YAML 1.2](http://yaml.org/spec/1.2/spec.html) processor, i.e. a library for parsing and serializing YAML documents. Features of 'HsYAML' include: * Pure Haskell implementation with small dependency footprint and emphasis on strict compliance with the [YAML 1.2 specification](http://yaml.org/spec/1.2/spec.html). * Direct decoding to native Haskell types via ('aeson'-inspired) typeclass-based API (see "Data.YAML"). * Allows round-tripping while preserving ordering, anchors, and comments at Event-level. * Support for constructing custom YAML node graph representation (including support for cyclic YAML data structures). * Support for the standard (untyped) /Failsafe/, (strict) /JSON/, and (flexible) /Core/ "schemas" providing implicit typing rules as defined in the YAML 1.2 specification (including support for user-defined custom schemas; see "Data.YAML.Schema"). * Support for emitting YAML using /Failsafe/, (strict) /JSON/, and (flexible) /Core/ "schemas" (including support for user-defined custom encoding schemas; see "Data.YAML.Schema"). * Event-based API resembling LibYAML's Event-based API (see "Data.YAML.Event"). * Low-level API access to lexical token-based scanner (see "Data.YAML.Token"). See also the <//hackage.haskell.org/package/HsYAML-aeson HsYAML-aeson> package which allows to decode and encode YAML by leveraging 'aeson''s 'FromJSON' and 'ToJSON' instances.
ca: «HsYAML» és un processador [YAML 1.2](http://yaml.org/spec/1.2/spec.html), és a dir, una biblioteca per a analitzar i serialitzar documents YAML. Les característiques de «HsYAML» inclouen: * Implementació pura de Haskell amb una petita petjada de dependència i èmfasi en el compliment estricte de l'[especificació YAML 1.2](http://yaml.org/spec/1.2/spec.html). * Descodificació directa a tipus nadius Haskell mitjançant API basada en classes tipogràfiques («aeson») (vegeu «Data.YAML»). * Permet l'arrodoniment mentre es conserva l'ordre, les àncores i els comentaris a nivell d'esdeveniment. * Suport per a la construcció de representació de nodes YAML personalitzats (inclosa la implementació per a estructures de dades YAML cícliques). * Suport per a l'estàndard (no tipificat) /Failsafe/, (stricte) /JSON/, i (flexible) /Core/ "schemas" proporcionant regles d'escriptura implícites tal com es defineixen a l'especificació YAML 1.2 (inclosa la implementació per a esquemes personalitzats definits per l'usuari; vegeu "Data.YAML.Esquema"). * Suport per a emetre YAML utilitzant /Failsafe/, (strict) /JSON/, i (flexible) /Core/ "schemas" (incloent suport per a esquemes de codificació personalitzats definits per l'usuari; vegeu "Data.YAML.Esquema"). * API basada en esdeveniments semblant a l'API basada en esdeveniments de LibYAML (vegeu "Data.YAML.Esdeveniment"). * Accés a l'API de baix nivell a l'escàner basat en tokens lèxic (veure "Data.YAML.Token"). Vegeu també el paquet <//hackage.haskell.org/package/HsYAML-aeson HsYAML-aeson> que permet descodificar i codificar YAML aprofitant les instàncies 'FromJSON' de 'aeson' i 'ToJSON'.

source: JSON to YAML Adapter
ca: Adaptador JSON a YAML

source: The [YAML 1.2](https://yaml.org/spec/1.2/spec.html) format provides a much richer data-model and feature-set than the [JavaScript Object Notation (JSON)](https://tools.ietf.org/html/rfc7159) format. However, sometimes it's desirable to ignore the extra capabilities and treat YAML as if it was merely a more convenient markup format for humans to write JSON data. To this end this module provides a compatibility layer atop [HsYAML](https://hackage.haskell.org/package/HsYAML) which allows decoding YAML documents in the more limited JSON data-model while also providing convenience by reusing [aeson](https://hackage.haskell.org/package/aeson)'s 'FromJSON' instances for decoding the YAML data into native Haskell data types.
ca: El format [YAML 1.2](https://yaml.org/spec/1.2/spec.html) proporciona un model de dades i un conjunt de característiques molt més ric que el format [JavaScript Object Notation (JSON)](https://tools.ietf.org/html/rfc7159). No obstant això, de vegades és desitjable ignorar les capacitats addicionals i tractar YAML com si fos simplement un format de marcatge més convenient per als humans per a escriure dades JSON. Per a això, aquest mòdul proporciona una capa de compatibilitat a la part superior de [HsYAML](https://hackage.haskell.org/package/HsYAML) que permet descodificar documents YAML en el mode de dades JSON més limitat, alhora que proporciona comoditat reutilitzant les instàncies «FromJSON» de [aeson](https://hackage.haskell.org/package/aeson) per a descodificar les dades YAML en tipus de dades Haskell nadius.

source: Haskell HsYAML-aeson library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell HsYAML-aeson

source: This package provides the Haskell HsYAML-aeson library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell HsYAML-aeson.

source: Haskell HsYAML library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell HsYAML

source: This package provides the Haskell HsYAML library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell HsYAML.

source: Anaphoric and miscellaneous useful control-flow
ca: Flux de control útil anafòric i divers

source: Anaphoric and miscellaneous useful control-flow.
ca: Flux de control útil anafòric i divers.

source: Haskell IfElse library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell IfElse

source: This package provides the Haskell IfElse library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell IfElse.

source: Picture loading/serialization (in png, jpeg, bitmap, gif, tga, tiff and radiance)
ca: Càrrega/serialització d'imatges (en png, jpeg, mapa de bits, gif, tga, tiff i radiance)

source: This library can load and store images in PNG,Bitmap, Jpeg, Radiance, Tiff and Gif images.
ca: Aquesta biblioteca pot carregar i emmagatzemar imatges en imatges PNG,Bitmap, Jpeg, Radiance, Tiff i Gif.

source: Haskell JuicyPixels library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell JuicyPixels

source: This package provides the Haskell JuicyPixels library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell JuicyPixels.

source: Generalized support for list-like structures
ca: Suport generalitzat per a estructures similars a llistes

source: Generalized support for list-like structures in Haskell. The ListLike module provides a common interface to the various Haskell types that are list-like. Predefined interfaces include standard Haskell lists, Arrays, ByteStrings, and lazy ByteStrings. Custom types can easily be made ListLike instances as well. ListLike also provides for String-like types, such as String and ByteString, for types that support input and output, and for types that can handle infinite lists.
ca: Suport generalitzat per a estructures similars a llistes a Haskell. El mòdul ListLike proporciona una interfície comuna als diversos tipus de Haskell que són similars a llistes. Les interfícies predefinides inclouen llistes Haskell estàndard, Arrays, ByteStrings i lazy ByteStrings. Els tipus personalitzats també es poden fer fàcilment instàncies ListLike. ListLike també proporciona tipus tipus String, com String i ByteString, per a tipus que admeten entrada i sortida, i per a tipus que poden gestionar llistes infinites.

source: Haskell ListLike library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell ListLike

source: This package provides the Haskell ListLike library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca ListLike de Haskell.

source: Random-number generation monad
ca: Mònada de generació de nombres aleatoris

source: Support for computations which consume random values.
ca: Suport per a càlculs que consumeixen valors aleatoris.

source: Haskell MonadRandom library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell MonadRandom

source: This package provides the Haskell MonadRandom library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell MonadRandom.

source: Provides a wrapper for deriving word types with fewer bits
ca: Proporciona un embolcall per a derivar tipus de paraules amb menys bits

source: Provdes the 'OddWord' type, which wraps an existing integer type and exposes a subset of its bits as a new narrower word type. Includes predefined type synonyms for all the odd sized words up to 63 bits.
ca: Provdes el tipus «OddWord», que embolcalla un tipus enter existent i exposa un subconjunt dels seus bits com un nou tipus de paraula més estreta. Inclou sinònims de tipus predefinits per a totes les paraules de mida senar fins a 63 bits.

source: Haskell OddWord library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell OddWord

source: This package provides the Haskell OddWord library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell OddWord.

source: Singleton Tuple
ca: Tupla de singleton

source: This package is a compatibility package for a singleton data type > data Solo a = Solo a Note: it's not a 'newtype' 'Solo' is available in 'base-4.16' (GHC-9.2).
ca: Aquest paquet és un paquet de compatibilitat per a un tipus de dades singleton dades Solo a Solo a Nota: no és un «newtype» «Solo» està disponible a «base-4.16» (GHC-9.2).

source: Haskell OneTuple library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell OneTuple

source: This package provides the Haskell OneTuple library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell OneTuple.

source: The 1-tuple type or single-value "collection"
ca: El tipus 1-tuple o «col·lecció» d'un sol valor

source: This package provides a canonical anonymous 1-tuple type missing from Haskell for attaching typeclass instances. NOTE: There is also the </package/OneTuple OneTuple package> which by using a boxed 'data'-type provides a 1-tuple type which has laziness properties which are more faithful to the ones of Haskell's native tuples; whereas the primary purpose of 'Only' is to provide the traditionally so named type-wrapper for attaching typeclass instances.
ca: Aquest paquet proporciona un tipus canònic anònim d'1-tuple que falta a Haskell per adjuntar instàncies de classe tipogràfica. NOTA: També hi ha el </package/OneTuple OneTuple package>, que mitjançant l'ús d'un tipus 'dades' enquadernat proporciona un tipus d'1-tuple que té propietats de mandra més fidels a les de les tuples natives de Haskell; mentre que el propòsit principal de 'Només' és proporcionar el tradicionalment anomenat 'wrapper' per adjuntar instàncies de classe-tipus.

source: Haskell Only library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell Only

source: This package provides the Haskell Only library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell Only.

source: Automatic testing of Haskell programs
ca: Prova automàtica de programes Haskell
