Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: This package provides extra instances for type-classes in the [indexed-traversable](https://hackage.haskell.org/package/indexed-traversable) package. The intention is to keep this package minimal; it provides instances that formely existed in 'lens' or 'optics-extra'. We recommend putting other instances directly into their defining packages. The 'indexed-traversable' package is light, having only GHC boot libraries as its dependencies.
ca: Aquest paquet proporciona instàncies addicionals per a les classes de tipus en el paquet [indexed-traversable](https://hackage.haskell.org/package/indexed-traversable). La intenció és mantenir aquest paquet mínim; proporciona exemples que van existir formely en «lens» o «optics-extra». Recomanem posar altres instàncies directament en els seus paquets definitoris. El paquet 'indexed-traversable' és lleuger, amb només biblioteques d'arrencada GHC com a dependències.

source: Haskell indexed-traversable-instances library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell indexats-traversables

source: This package provides the Haskell indexed-traversable-instances library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell indexed-traversable-instances.

source: Infer software license from a given license file
ca: Infereix la llicència de programari des d'un fitxer de llicència donat

source: Infer software license from a given license file.
ca: Infereix la llicència de programari des d'un fitxer de llicència determinat.

source: Haskell infer-license library development files
ca: Fitxers de desenvolupament de la biblioteca d'inferència de Haskell

source: This package provides the Haskell infer-license library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell infer-license.

source: Integer logarithms
ca: Logaritmes enters

source: "Math.NumberTheory.Logarithms" and "Math.NumberTheory.Powers.Integer" from the arithmoi package. Also provides "GHC.Integer.Logarithms.Compat" and "Math.NumberTheory.Power.Natural" modules, as well as some additional functions in migrated modules.
ca: "Math.NumberTheory.Logaritmes" i "Math.NumberTheory.Potències.Integer" del paquet arithmoi. També proporciona "GHC.Enter.Logaritmes.Compat" i "Math.NumberTheory.Poder.Mòduls naturals, així com algunes funcions addicionals en mòduls migrats.

source: Haskell integer-logarithms library development files
ca: Fitxers de desenvolupament de la biblioteca integer-logarithms de Haskell

source: This package provides the Haskell integer-logarithms library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell integer-logarithms.

source: Efficient hash-consing for arbitrary data types
ca: Còpia de resum eficient per a tipus de dades arbitraris

source: Efficient hash-consing for arbitrary data types.
ca: Còpia de hash eficient per a tipus de dades arbitraris.

source: Haskell intern library development files
ca: Fitxers de desenvolupament de la biblioteca interna Haskell

source: This package provides the Haskell intern library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca interna de Haskell.

source: Haskell98 invariant functors
ca: Functors invariants Haskell98

source: Haskell98 invariant functors (also known as exponential functors). For more information, see Edward Kmett's article "Rotten Bananas": <http://comonad.com/reader/2008/rotten-bananas/>.
ca: Functors invariants Haskell98 (també coneguts com a functors exponencials). Per a més informació, vegeu l'article d'Edward Kmett "Rotten Bananas": <http://comonad.com/reader/2008/rotten-bananas/>.

source: Haskell invariant library development files
ca: Fitxers de desenvolupament de biblioteques invariants de Haskell

source: This package provides the Haskell invariant library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca invariant de Haskell.

source: Simple, composable, and easy-to-use stream I/O
ca: E/S de flux senzill, compostable i fàcil d'utilitzar

source: /Overview/ The io-streams library contains simple and easy-to-use primitives for I/O using streams. Most users will want to import the top-level convenience module "System.IO.Streams", which re-exports most of the library: ' import System.IO.Streams (InputStream, OutputStream) import qualified System.IO.Streams as Streams ' For first-time users, 'io-streams' comes with an included tutorial, which can be found in the "System.IO.Streams.Tutorial" module. /Features/ The 'io-streams' user API has two basic types: 'InputStream a' and 'OutputStream a', and three fundamental I/O primitives: ' -- read an item from an input stream Streams.read :: InputStream a -> IO (Maybe a) -- push an item back to an input stream Streams.unRead :: a -> InputStream a -> IO () -- write to an output stream Streams.write :: Maybe a -> OutputStream a -> IO () ' Streams can be transformed by composition and hooked together with provided combinators: ' ghci> Streams.fromList [1,2,3::Int] >>= Streams.map (*10) >>= Streams.toList [10,20,30] ' Stream composition leaves the original stream accessible: ' ghci> input <- Streams.fromByteString "long string" ghci> wrapped <- Streams.takeBytes 4 input ghci> Streams.read wrapped Just "long" ghci> Streams.read wrapped Nothing ghci> Streams.read input Just " string" ' Simple types and operations in the IO monad mean straightforward and simple exception handling and resource cleanup using Haskell standard library facilities like 'Control.Exception.bracket'. 'io-streams' comes with: * functions to use files, handles, concurrent channels, sockets, lists, vectors, and more as streams. * a variety of combinators for wrapping and transforming streams, including compression and decompression using zlib, controlling precisely how many bytes are read from or written to a stream, buffering output using bytestring builders, folds, maps, filters, zips, etc. * support for parsing from streams using 'attoparsec'. * support for spawning processes and communicating with them using streams.
ca: /Vista general/ La biblioteca io-streams conté primitives simples i fàcils d'utilitzar per a E/S utilitzant fluxos. La majoria dels usuaris voldran importar el mòdul de conveniència de primer nivell "System.IO.Streams", que reexporta la major part de la biblioteca: ' import System.IO.Streams (InputStream, OutputStream) importa System.IO qualificat.Fluxos com a fluxos ' Per als primers usuaris, 'io-streams' ve amb un tutorial inclòs, que es pot trobar a la "System.IO.Fluxos.Mòdul Tutorial". /Features/ L'API d'usuari «io-streams» té dos tipus bàsics: «InputStream a» i «OutputStream a», i tres primitives fonamentals d'E/S: ' -- llegiu un element d'un flux d'entrada Streams.read :: InputStream a -) IO (Potser a) -- retorna un element a un flux d'entrada Streams.unRead :: a -) InputStream a -) IO () -- escriu a un flux de sortida Streams.write :: Potser a -) OutputStream a -) IO () ' Els corrents es poden transformar per composició i enganxar juntament amb els combinators proporcionats: ' ghci. Streams.fromList [1,2,3::Int] Streams.map (*10) Streams.toList [10,20,30] ' La composició del flux deixa accessible el flux original: ' entrada ghci { <- Streams.fromByteString "long string" ghci> ajustada <- Streams.takeBytes 4 input ghci> Fluxos.read ajustada Només "llarga" ghcis Fluxos.read ajustada Res ghcis Fluxos.read entrada Només "cadena" ' Tipus simples i operacions en la Mònada d'E/S signifiquen una gestió senzilla i simple d'excepcions i neteja de recursos utilitzant les instal·lacions de la biblioteca estàndard de Haskell com 'Control.Exception.bracket'. 'io-streams' ve amb: * funcions per utilitzar fitxers, manetes, canals concurrents, sòcols, llistes, vectors i més com a fluxos. * una varietat de combinators per embolicar i transformar fluxos, incloent la compressió i descompressió utilitzant zlib, controlant amb precisió quants bytes es llegeixen o s'escriuen a un flux, buidant la sortida utilitzant bytestring constructers, plecs, mapes, filtres, zips, etc. * Implementació per a l'anàlisi des de fluxos utilitzant «attoparsec». * Suport per a processos de fresa i comunicació amb ells mitjançant streams.

source: Haskell io-streams library development files
ca: Fitxers de desenvolupament de la biblioteca io-streams de Haskell

source: This package provides the Haskell io-streams library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca io-streams de Haskell.

source: HAProxy protocol 1.5 support for io-streams
ca: Implementació del protocol HAProxy 1.5 per a fluxos io

source: HAProxy protocol version 1.5 support (see <http://haproxy.1wt.eu/download/1.5/doc/proxy-protocol.txt>) for applications using io-streams. The proxy protocol allows information about a networked peer (like remote address and port) to be propagated through a forwarding proxy that is configured to speak this protocol.
ca: Implementació del protocol HAProxy versió 1.5 (vegeu <http://haproxy.1wt.eu/download/1.5/doc/proxy-protocol.txt>) per a aplicacions que utilitzen fluxos io. El protocol intermediari permet que la informació sobre un parell en xarxa (com l'adreça remota i el port) es propagui a través d'un servidor intermediari de reenviament que està configurat per a parlar aquest protocol.

source: Haskell io-streams-haproxy library development files
ca: Haskell io-streams-haproxy biblioteca fitxers de desenvolupament

source: This package provides the Haskell io-streams-haproxy library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell io-streams-haproxy.

source: IP Routing Table
ca: Taula d'encaminament IP

source: IP Routing Table is a tree of IP ranges to search one of them on the longest match base. It is a kind of TRIE with one way branching removed. Both IPv4 and IPv6 are supported.
ca: La Taula d'encaminament IP és un arbre d'intervals d'IP per cercar un d'ells a la base de coincidència més llarga. És una mena de TRIE amb ramificació d'una via eliminada. Tant IPv4 com IPv6 són compatibles.

source: Haskell iproute library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell iproute

source: This package provides the Haskell iproute library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell iproute.

source: Data structure for working with Jupyter notebooks (ipynb)
ca: Estructura de dades per treballar amb els quaderns de Jupyter (ipynb)

source: Ipynb defines a data structure for representing Jupyter notebooks, along with ToJSON and FromJSON instances for conversion to and from JSON .ipynb files.
ca: Ipynb defineix una estructura de dades per a representar els quaderns de Jupyter, juntament amb les instàncies ToJSON i FromJSON per a la conversió a i des de fitxers JSON .ipynb.

source: Haskell ipynb library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell ipynb

source: This package provides the Haskell ipynb library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell ipynb.

source: Convert to/from the ISO 8601 time format
ca: Converteix a/des del format horari ISO 8601

source: Conversion functions between Haskell time types and the ISO 8601 format, which is often used for printing times, e.g. JavaScript's 'new Date().toISOString()'.
ca: Funcions de conversió entre els tipus de temps Haskell i el format ISO 8601, que s'utilitza sovint per als temps d'impressió, p. ex. «new Date().toISOString()» de JavaScript.

source: Haskell iso8601-time library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell iso8601 time

source: This package provides the Haskell iso8601-time library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell iso8601-time.

source: Bindings for the iw C library
ca: Vinculacions per a la biblioteca iw C

source: A binding to the iw library for getting info about the current WiFi connection.
ca: Un enllaç a la biblioteca iw per obtenir informació sobre la connexió WiFi actual.

source: Haskell iwlib library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell iwlib

source: This package provides the Haskell iwlib library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell iwlib.

source: Handle Jira wiki markup
ca: Gestiona el marcatge del wiki de Jira

source: Parse jira wiki text into an abstract syntax tree for easy transformation to other formats.
ca: Analitza el text wiki de jira en un arbre de sintaxi abstracte per a una fàcil transformació a altres formats.

source: Haskell jira-wiki-markup library development files
ca: Fitxers de desenvolupament de la biblioteca jira-wiki-markup de Haskell

source: This package provides the Haskell jira-wiki-markup library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca jira-wiki-markup de Haskell.

source: Obtain minified chart.js code
ca: Obté el codi «minified chart.js»

source: This package bundles the minified <http://www.chartjs.org/ chart.js> code into a Haskell package, so it can be depended upon by Cabal packages. The first three components of the version number match the upstream chart.js version. The package is designed to meet the redistribution requirements of downstream users (e.g. Debian). This package is a fork of <https://hackage.haskell.org/package/js-flot js-flot> using chart.js instead of flot.
ca: Aquest paquet empaqueta el codi minificat <http://www.chartjs.org/ chart.js> en un paquet Haskell, de manera que pot ser depès dels paquets Cabal. Els tres primers components del número de versió coincideixen amb la versió de la taula de treball.js. El paquet està dissenyat per complir els requisits de redistribució dels usuaris de la font (per exemple, Debian). Aquest paquet és una bifurcació de <https://hackage.haskell.org/package/js-flot js-flot> utilitzant chart.js en lloc de flot.

source: Haskell js-chart library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell js-chart

source: This package provides the Haskell js-chart library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell js-chart.

source: Obtain minified jquery.dgtable code
ca: Obtenir codi jquery.dgtable minificat

source: This package bundles the minified <https://github.com/danielgindi/jquery.dgtable jquery.dgtable> code into a Haskell package, so it can be depended upon by Cabal packages. The first three components of the version number match the upstream jquery.dgtable version. The package is designed to meet the redistribution requirements of downstream users (e.g. Debian).
ca: Aquest paquet empaqueta el codi minificat <https://github.com/danielgindi/jquery.dgtable jquery.dgtable> en un paquet Haskell, de manera que pot ser depès dels paquets Cabal. Els tres primers components del número de versió coincideixen amb la versió jquery.dgtable. El paquet està dissenyat per complir els requisits de redistribució dels usuaris de la font (per exemple, Debian).

source: Haskell js-dgtable library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell js-dgtable

source: This package provides the Haskell js-dgtable library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell js-dgtable.

source: Obtain minified flot code
ca: Obté el codi de flotació minificat

source: This package bundles the minified <http://www.flotcharts.org/ Flot> code (a jQuery plotting library) into a Haskell package, so it can be depended upon by Cabal packages. The first three components of the version number match the upstream flot version. The package is designed to meet the redistribution requirements of downstream users (e.g. Debian).
ca: Aquest paquet empaqueta el codi minificat <http://www.flotcharts.org/ Flot> (una biblioteca de traçat jQuery) en un paquet Haskell, de manera que pot ser depenent dels paquets Cabal. Els tres primers components del número de versió coincideixen amb la versió del flot de la font. El paquet està dissenyat per complir els requisits de redistribució dels usuaris de la font (per exemple, Debian).

source: Haskell js-flot library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell js-flot

source: This package provides the Haskell js-flot library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca js-flot de Haskell.

source: Obtain minified jQuery code
ca: Obtenir codi jQuery minificat

source: This package bundles the minified <http://jquery.com/ jQuery> code into a Haskell package, so it can be depended upon by Cabal packages. The first three components of the version number match the upstream jQuery version. The package is designed to meet the redistribution requirements of downstream users (e.g. Debian).
ca: Aquest paquet empaqueta el codi minificat <http://jquery.com/ jQuery> en un paquet Haskell, de manera que pot ser depès dels paquets Cabal. Els tres primers components del número de versió coincideixen amb la versió jQuery. El paquet està dissenyat per complir els requisits de redistribució dels usuaris de la font (per exemple, Debian).

source: Haskell js-jquery library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell js-jquery

source: This package provides the Haskell js-jquery library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell js-jquery.

source: Kan extensions, Kan lifts, the Yoneda lemma, and (co)density (co)monads
ca: Extensions de Kan, elevacions de Kan, el lema de Yoneda, i (co)density (co)monads

source: Kan extensions, Kan lifts, various forms of the Yoneda lemma, and (co)density (co)monads.
ca: Extensions de Kan, elevacions de Kan, diverses formes del lemma de Yoneda, i (co)densitat (co)monads.

source: Haskell kan-extensions library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell kan-extensions

source: This package provides the Haskell kan-extensions library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell kan-extensions.

source: A structured logging framework
ca: Un marc de treball de registre estructurat

source: Katip is a structured logging framework. See README.md for more details.
ca: Katip és un marc de treball de registre estructurat. Vegeu README.md per a més detalls.

source: Haskell katip library development files
ca: Fitxers de desenvolupament de la biblioteca del katip del Haskell

source: This package provides the Haskell katip library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell katip.

source: Analysis and generation of C code
ca: Anàlisi i generació del codi C

source: Language C is a haskell library for the analysis and generation of C code. It features a complete, well tested parser and pretty printer for all of C99 and a large set of C11 and clang/GNU extensions.
ca: Language C és una biblioteca haskell per a l'anàlisi i la generació de codi C. Compta amb un analitzador complet i ben provat i una impressora bonica per a tot el C99 i un gran conjunt d'extensions C11 i clang/GNU.

source: Haskell language-c library development files
ca: Fitxers de desenvolupament de la biblioteca de llengua-c del Haskell

source: This package provides the Haskell language-c library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de llengua-c Haskell.

source: Parser for JavaScript
ca: Analitzador per a JavaScript

source: Parses Javascript into an Abstract Syntax Tree (AST). Initially intended as frontend to hjsmin. Note: Version 0.5.0 breaks compatibility with prior versions, the AST has been reworked to allow round trip processing of JavaScript.
ca: Analitza Javascript en un Arbre de Sintaxi Abstracta (AST). Inicialment pensat com a frontend per a hjsmin. Nota: La versió 0.5.0 trenca la compatibilitat amb versions anteriors, l'AST ha estat reelaborada per permetre el processament de viatges d'anada i tornada de JavaScript.

source: Haskell language-javascript library development files
ca: Fitxers de desenvolupament de la biblioteca llengua-javascript del Haskell

source: This package provides the Haskell language-javascript library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell language-javascript.

source: Provides Word128, Word192 and Word256 and a way of producing other large words if required
ca: Proporciona Word128, Word192 i Word256 i una manera de produir altres paraules grans si cal

source: Provides Word128, Word192 and Word256 and a way of producing other large words if required.
ca: Proporciona Word128, Word192 i Word256 i una manera de produir altres paraules grans si cal.

source: Haskell largeword library development files
ca: Fitxers de desenvolupament de la biblioteca de paraules grans Haskell

source: This package provides the Haskell largeword library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de paraules grans Haskell.

source: Lenses, Folds and Traversals
ca: Lents, plecs i traversals
