Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: This package provides strict versions of some standard Haskell data types (pairs, Maybe and Either). It also contains strict IO operations. It is common knowledge that lazy datastructures can lead to space-leaks. This problem is particularly prominent, when using lazy datastructures to store the state of a long-running application in memory. One common solution to this problem is to use 'seq' and its variants in every piece of code that updates your state. However a much easier solution is to use fully strict types to store such state values. By "fully strict types" we mean types for whose values it holds that, if they are in weak-head normal form, then they are also in normal form. Intuitively, this means that values of fully strict types cannot contain unevaluated thunks. To define a fully strict datatype, one typically uses the following recipe. 1. Make all fields of every constructor strict; i.e., add a bang to all fields. 2. Use only strict types for the fields of the constructors. The second requirement is problematic as it rules out the use of the standard Haskell 'Maybe', 'Either', and pair types. This library solves this problem by providing strict variants of these types and their corresponding standard support functions and type-class instances. Note that this library does currently not provide fully strict lists. They can be added if they are really required. However, in many cases one probably wants to use unboxed or strict boxed vectors from the 'vector' library (<http://hackage.haskell.org/package/vector>) instead of strict lists. Moreover, instead of 'String's one probably wants to use strict 'Text' values from the 'text' library (<http://hackage.haskell.org/package/text>). This library comes with batteries included; i.e., mirror functions and instances of the lazy versions in 'base'. It also includes instances for type-classes from the 'deepseq', 'binary', and 'hashable' packages.
ca: Aquest paquet proporciona versions estrictes d'alguns tipus de dades Haskell estàndard (parelles, Potser i qualsevol). També conté estrictes operacions d'E/S. És ben sabut que les estructures de dades mandroses poden conduir a espais buits. Aquest problema és especialment prominent quan s'utilitzen estructures de dades mandroses per emmagatzemar l'estat d'una aplicació de llarga durada en la memòria. Una solució comuna a aquest problema és utilitzar "seq" i les seves variants en cada codi que actualitza el vostre estat. No obstant això, una solució molt més fàcil és utilitzar tipus totalment estrictes per emmagatzemar aquests valors d'estat. Per "tipus totalment estrictes" volem dir tipus per als valors dels quals sosté que, si estan en forma normal de cap feble, llavors també estan en forma normal. Intuïtivament, això significa que els valors de tipus totalment estrictes no poden contenir thunks no avaluats. Per definir un tipus de dades completament estricte, normalment s'utilitza la següent recepta. 1. Fer estrictes tots els camps de cada constructor; és a dir, afegir un bang a tots els camps. 2. Utilitzeu només tipus estrictes per als camps dels constructors. El segon requisit és problemàtic, ja que descarta l'ús de l'estàndard Haskell 'Maybe', 'Either', i els tipus de parells. Aquesta biblioteca resol aquest problema proporcionant variants estrictes d'aquest tipus i les seves corresponents funcions de suport estàndard i instàncies de classe tipogràfica. Tingueu en compte que aquesta biblioteca no proporciona actualment llistes totalment estrictes. Es poden afegir si realment són necessàries. No obstant això, en molts casos probablement es vol utilitzar vectors de caixa sense bústia o estrictes de la biblioteca de 'vector' (<http://hackage.haskell.org/package/vector>) en lloc de llistes estrictes. A més, en lloc de «String», probablement es vol utilitzar valors estrictes de «Text» de la biblioteca «text» (<http://hackage.haskell.org/package/text>). Aquesta biblioteca ve amb bateries incloses; és a dir, funcions de mirall i instàncies de les versions mandroses a la "base". També inclou exemples de classes tipus dels paquets «deepseq», «binary» i «hashable».

source: Strict concurrency abstractions
ca: Abstraccions estrictes de concurrència

source: This package provides head normal form strict versions of some standard Haskell concurrency abstractions (MVars,Chans), which provide control over where evaluation takes place not offered by the default lazy types. This may be useful for deciding when and where evaluation occurs, leading to improved time or space use, depending on the circumstances.
ca: Aquest paquet proporciona una forma normal de cap versió estricta d'algunes abstraccions estàndard de concurrència de Haskell (MVars,Chans), que proporcionen el control sobre on té lloc l'avaluació no oferta pels tipus mandrosos per defecte. Això pot ser útil per decidir quan i on es produeix l'avaluació, el que condueix a un millor ús del temps o de l'espai, depenent de les circumstàncies.

source: Haskell strict-concurrency library development files
ca: Fitxers de desenvolupament de la biblioteca de concurrència estricta de Haskell

source: This package provides the Haskell strict-concurrency library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de concurrència estricta de Haskell.

source: Haskell strict library development files
ca: Fitxers estrictes de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell strict library development files.
ca: Aquest paquet proporciona els estrictes fitxers de desenvolupament de la biblioteca Haskell.

source: Standardized conversion between string types
ca: Conversió estandarditzada entre tipus de cadena

source: Avoids the need to remember many different functions for converting string types. Just use one universal function toS for all monomorphic string conversions.
ca: Evita la necessitat de recordar moltes funcions diferents per a convertir tipus de cadenes. Utilitzeu només un toS de funció universal per a totes les conversions de cadenes monomòrfiques.

source: Haskell string-conv library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell string-conv

source: This package provides the Haskell string-conv library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell string-conv.

source: Simplifies dealing with different types for strings
ca: Simplifica tractar amb diferents tipus per a les cadenes

source: Provides a simple type class for converting values of different string types into values of other string types.
ca: Proporciona una classe de tipus simple per a convertir valors de diferents tipus de cadenes en valors d'altres tipus de cadenes.

source: Haskell string-conversions library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell string-conversions

source: This package provides the Haskell string-conversions library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell string-conversions.

source: QuasiQuoter for non-interpolated strings, texts and bytestrings
ca: QuasiQuoter per a cadenes, textos i bytestring no interpolats

source: QuasiQuoter for non-interpolated strings, texts and bytestrings, useful for writing multi-line IsString literals.
ca: QuasiQuoter per a cadenes no interpolades, textos i bytestrings, útil per a l'escriptura de literals IsString multilínia.

source: Haskell string-qq library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell string-qq

source: This package provides the Haskell string-qq library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell string-qq.

source: Bindings to the sundown markdown library
ca: Vinculacions a la biblioteca de marques del sol

source: Bindings to GitHub's C markdown library: <https://github.com/vmg/sundown>. The Haskell code is in the public domain. For sundown's license, refer to its GitHub page.
ca: Vinculacions a la biblioteca de marques C de GitHub: <https://github.com/vmg/sundown>. El codi Haskell és de domini públic. Per obtenir la llicència de sundown, consulteu la seva pàgina de GitHub.

source: Haskell sundown library development files
ca: Fitxers de desenvolupament de la biblioteca Sundown del Haskell

source: This package provides the Haskell sundown library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell sundown.

source: Scrap Your Boilerplate
ca: Ajusteu la vostra placa caldera

source: This package contains the generics system described in the /Scrap Your Boilerplate/ papers (see <http://www.cs.uu.nl/wiki/GenericProgramming/SYB>). It defines the 'Data' class of types permitting folding and unfolding of constructor applications, instances of this class for primitive types, and a variety of traversals.
ca: Aquest paquet conté el sistema de genèrics descrit a /Scrap Your Boilerplate/ papers (vegeu <http://www.cs.uu.nl/wiki/GenericProgramming/SYB>). Defineix la classe 'Dades' de tipus que permeten plegar i desplegar aplicacions constructores, instàncies d'aquesta classe per a tipus primitius, i una varietat de traversals.

source: Haskell syb library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell syb

source: This package provides the Haskell syb library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell syb.

source: Consistent filesystem interaction across GHC versions (deprecated)
ca: Interacció coherent del sistema de fitxers entre versions GHC (obsolet)

source: Please see: https://plus.google.com/+MichaelSnoyman/posts/Ft5hnPqpgEx.
ca: Podeu consultar: https://plus.google.com/+MichaelSnoyman/posts/Ft5hnPqpgEx.

source: Haskell system-fileio library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell system-fileio

source: This package provides the Haskell system-fileio library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell system-fileio.

source: High-level, byte-based file and directory path manipulations (deprecated)
ca: Manipulacions de camins de fitxers i directoris d'alt nivell, basades en bytes (obsolet)

source: Haskell system-filepath library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell system-filepath

source: This package provides the Haskell system-filepath library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell system-filepath.

source: Systemd facilities (Socket activation, Notify)
ca: Instal·lacions del sistema (Activació de l'acoblador, Notifica)

source: A module for Systemd facilities.
ca: Un mòdul per a les instal·lacions de Systemd.

source: Haskell systemd library development files
ca: Fitxers de desenvolupament de la biblioteca del «systemd» del Haskell

source: This package provides the Haskell systemd library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell systemd.

source: Two-dimensional data tables with rendering functions
ca: Taules de dades bidimensionals amb funcions de representació

source: Tabular provides a Haskell representation of two-dimensional data tables, the kind that you might find in a spreadsheet or or a research report. It also comes with some default rendering functions for turning those tables into ASCII art, simple text with an arbitrary delimiter, CSV, HTML or LaTeX. Below is an example of the kind of output this library produces. The tabular package can group rows and columns, each group having one of three separators (no line, single line, double line) between its members. > || memtest 1 | memtest 2 || time test | time test 2 > ====++===========+===========++=============+============ > A 1 || hog | terrible || slow | slower > A 2 || pig | not bad || fast | slowest > ----++-----------+-----------++-------------+------------ > B 1 || good | awful || intolerable | bearable > B 2 || better | no chance || crawling | amazing > B 3 || meh | well... || worst ever | ok.
ca: Tabular proporciona una representació Haskell de taules de dades bidimensionals, el tipus que podeu trobar en un full de càlcul o en un informe de recerca. També ve amb algunes funcions de representació per defecte per convertir aquestes taules en art ASCII, text simple amb un delimitador arbitrari, CSV, HTML o LaTeX. A continuació es mostra un exemple del tipus de sortida que produeix aquesta biblioteca. El paquet tabular pot agrupar files i columnes, cada grup té un dels tres separadors (sense línia, una sola línia, doble línia) entre els seus membres. || memtest 1 memtest 2 time test time test 2 ++++ ++++++++ A 1 hog terrible slow slow slow A 2 pig not bad fast slowest ----++-------------------------------- . B 1 . bo . terrible . intolerable . suportable . B 2 . millor . sense possibilitat . sorprenent . B 3 . meh . bé... || el pitjor mai . bé.

source: Haskell tabular library development files
ca: Fitxers de desenvolupament de biblioteques tabulars del Haskell

source: This package provides the Haskell tabular library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca tabular Haskell.

source: Haskell 98 phantom types to avoid unsafely passing dummy arguments
ca: Haskell 98 tipus de fantasma per evitar passar de manera insegura arguments ficticis

source: Haskell 98 phantom types to avoid unsafely passing dummy arguments.
ca: Haskell 98 tipus de fantasma per evitar passar insegurament arguments ficticis.

source: Haskell tagged library development files
ca: Haskell ha etiquetat els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell tagged library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca etiquetats Haskell.

source: Parsing and extracting information from (possibly malformed) HTML/XML documents
ca: Anàlisi i extracció d'informació de documents HTML/XML (possiblement mal formats)

source: TagSoup is a library for parsing HTML/XML. It supports the HTML 5 specification, and can be used to parse either well-formed XML, or unstructured and malformed HTML from the web. The library also provides useful functions to extract information from an HTML document, making it ideal for screen-scraping. Users should start from the "Text.HTML.TagSoup" module.
ca: TagSoup és una biblioteca per analitzar HTML/XML. És compatible amb l'especificació HTML 5, i es pot utilitzar per analitzar tant XML ben format, com HTML no estructurat i mal format de la web. La biblioteca també proporciona funcions útils per extreure informació d'un document HTML, el que la fa ideal per a retallar la pantalla. Els usuaris haurien de començar des de "Text.HTML.Mòdul TagSoup".

source: Haskell tagsoup library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell tagsoup

source: This package provides the Haskell tagsoup library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell tagsoup.

source: Reading, writing and manipulating ".tar" archive files
ca: Lectura, escriptura i manipulació de fitxers d'arxiu ".tar"

source: This library is for working with "'.tar'" archive files. It can read and write a range of common variations of archive format including V7, POSIX USTAR and GNU formats. It provides support for packing and unpacking portable archives. This makes it suitable for distribution but not backup because details like file ownership and exact permissions are not preserved. It also provides features for random access to archive content using an index.
ca: Aquesta biblioteca és per a treballar amb fitxers d'arxiu «.tar». Pot llegir i escriure una sèrie de variacions comunes de format d'arxiu incloent els formats V7, POSIX USTAR i GNU. Proporciona suport per empaquetar i desempaquetar arxius portàtils. Això fa que sigui adequat per a la distribució però no per a la còpia de seguretat perquè no es conserven detalls com la propietat del fitxer i els permisos exactes. També proporciona característiques per a l'accés aleatori al contingut de l'arxiu utilitzant un índex.

source: Extract and create tar files using conduit for streaming
ca: Extreu i crea fitxers tar usant conducte per a la transmissió

source: Extract and create tar files using conduit for streaming.
ca: Extreu i crea fitxers tar utilitzant conducte per a la transmissió.

source: Haskell tar-conduit library development files
ca: Fitxers de desenvolupament de la biblioteca de conductes tar de Haskell

source: This package provides the Haskell tar-conduit library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de conductes tar de Haskell.

source: Haskell tar library development files
ca: Fitxers de desenvolupament de la biblioteca tar de Haskell

source: This package provides the Haskell tar library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca tar de Haskell.

source: Modern and extensible testing framework
ca: Marc de proves modern i extensible

source: Tasty is a modern testing framework for Haskell. It lets you combine your unit tests, golden tests, QuickCheck/SmallCheck properties, and any other types of tests into a single test suite.
ca: Tasty és un marc de proves modern per a Haskell. Permet combinar les proves unitàries, les proves daurades, les propietats QuickCheck/SmallCheck i qualsevol altre tipus de proves en un sol conjunt de proves.

source: Haskell tasty library development files
ca: Fitxers de desenvolupament de la biblioteca deliciosa del Haskell

source: This package provides the Haskell tasty library development files.
ca: Aquest paquet proporciona els arxius de desenvolupament de la biblioteca Haskell.

source: Integration for tasty and hedgehog
ca: Integració per a saborosos i eriçons

source: Integrates the <https://hackage.haskell.org/package/hedgehog hedgehog testing library> with the <https://hackage.haskell.org/package/tasty tasty testing framework>.
ca: Integra el <https://hackage.haskell.org/package/hedgehog hedgehog testing library> amb el <https://hackage.haskell.org/package/tasty tasty testing framework>.

source: Haskell tasty-hedgehog library development files
ca: Fitxers de desenvolupament de la biblioteca de haskell tasty-hedgehog

source: This package provides the Haskell tasty-hedgehog library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell tasty-hedgehog.

source: HUnit support for the Tasty test framework
ca: Implementació de HUnit per al marc de proves Tasty

source: HUnit support for the Tasty test framework. Note that this package does not depend on HUnit but implements the relevant subset of its API. The name is a legacy of the early versions of tasty-hunit and of test-framework-hunit, which did depend on HUnit.
ca: Suport de HUnit per al marc de proves Tasty. Tingueu en compte que aquest paquet no depèn de HUnit, però implementa el subconjunt rellevant de la seva API. El nom és una herència de les primeres versions de tasty-hunit i de test-framework-hunit, que depenien de HUnit.

source: Haskell tasty-hunit library development files
ca: Fitxers de desenvolupament de la biblioteca de Haskell tasty-hunit

source: This package provides the Haskell tasty-hunit library development files.
ca: Aquest paquet proporciona els arxius de desenvolupament de la biblioteca Haskell tasty-hunit.

source: QuickCheck support for the Tasty test framework
ca: Implementació de QuickCheck per al marc de proves Tasty

source: QuickCheck support for the Tasty test framework.
ca: Implementació de QuickCheck per al marc de proves Tasty.

source: Haskell tasty-quickcheck library development files
ca: Fitxers de desenvolupament de la biblioteca de Haskell tasty-quickcheck

source: This package provides the Haskell tasty-quickcheck library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell tasty-quickcheck.

source: Rerun only tests which failed in a previous test run
ca: Torna a executar només les proves que han fallat en una execució de prova anterior

source: This ingredient for the <https://hackage.haskell.org/package/tasty tasty> testing framework allows filtering a test tree depending on the outcome of the previous run. This may be useful in many scenarios, especially when a test suite grows large.
ca: Aquest ingredient per al marc de proves <https://hackage.haskell.org/package/tasty tasty> permet filtrar un arbre de proves en funció del resultat de l'execució anterior. Això pot ser útil en molts escenaris, especialment quan una suite de proves creix gran.

source: Haskell tasty-rerun library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell tasty-rerun

source: This package provides the Haskell tasty-rerun library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell tasty-rerun.

source: On-line accumulation of rank-based statistics
ca: Acumulació en línia d'estadístiques basades en rangs

source: A new data structure for accurate on-line accumulation of rank-based statistics such as quantiles and trimmed means. See original paper: "Computing extremely accurate quantiles using t-digest" by Ted Dunning and Otmar Ertl for more details <https://github.com/tdunning/t-digest/blob/07b8f2ca2be8d0a9f04df2feadad5ddc1bb73c88/docs/t-digest-paper/histo.pdf>.
ca: Una nova estructura de dades per a l'acumulació en línia precisa d'estadístiques basades en rangs, com ara quantils i mitjans retallats. Vegeu el document original: "Computing extremely accurate quantiles using t-digest" per Ted Dunning i Otmar Ertl per a més detalls <https://github.com/tdunning/t-digest/blob/07b8f2ca2be8d0a9f04df2feadad5ddc1bb73c88/docs/t-digest-paper/histo.pdf>.

source: Haskell tdigest library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell tdigest

source: This package provides the Haskell tdigest library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca tdigest de Haskell.

source: Haskell template-haskell library
ca: Biblioteca Haskell template-haskell

source: This package provides the Haskell template-haskell library.
ca: Aquest paquet proporciona la biblioteca Haskell template-haskell.

source: Haskell template-haskell library development files
ca: Fitxers de desenvolupament de la biblioteca de plantilla-haskell de Haskell

source: This package provides the Haskell template-haskell library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell template-haskell.

source: Portable temporary file and directory support
ca: Implementació de fitxers temporals i directoris portàtils

source: Functions for creating temporary files and directories.
ca: Funcions per a crear fitxers i directoris temporals.

source: Haskell temporary library development files
ca: Fitxers de desenvolupament de la biblioteca temporal Haskell

source: This package provides the Haskell temporary library development files.
ca: Aquest paquet proporciona els fitxers temporals de desenvolupament de la biblioteca Haskell.

source: Get terminal window height and width
ca: Obtén l'alçada i l'amplada de la finestra del terminal

source: Get terminal window height and width without ncurses dependency.
ca: Obtén l'alçada i l'amplada de la finestra del terminal sense la dependència de ncurses.

source: Haskell terminal-size library development files
ca: Fitxers de desenvolupament de la biblioteca de mida terminal Haskell
