Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: This package addresses the /configuration problem/ which is propagating configurations that are available at run-time, allowing multiple configurations to coexist without resorting to mutable global variables or 'System.IO.Unsafe.unsafePerformIO'. That package is an implementation of the ideas presented in the paper "Functional Pearl: Implicit Configurations" by Oleg Kiselyov and Chung-chieh Shan (<http://okmij.org/ftp/Haskell/tr-15-04.pdf original paper>). However, the API has been streamlined to improve performance. Austin Seipp's tutorial <https://www.schoolofhaskell.com/user/thoughtpolice/using-reflection Reflecting values to types and back> provides a summary of the approach taken by this library, along with more motivating examples.
ca: Aquest paquet aborda el problema /configuration/ que està propagant configuracions que estan disponibles en temps d'execució, permetent que múltiples configuracions coexisteixin sense recórrer a variables globals mutables o 'System.IO.Unsafe.unsafePerformIO'. Aquest paquet és una implementació de les idees presentades en el document "Functional Pearl: Implicit Configurations" d'Oleg Kiselyov i Chung-chieh Shan (<http://okmij.org/ftp/Haskell/tr-15-04.pdf original paper>). No obstant això, l'API s'ha racionalitzat per millorar el rendiment. La guia d'aprenentatge d'Austin Seipp <https://www.schoolofhaskell.com/user/thoughtpolice/using-reflection Reflecting values to types and back> proporciona un resum de l'enfocament adoptat per aquesta biblioteca, juntament amb exemples més motivadors.

source: Haskell reflection library development files
ca: Fitxers de desenvolupament de la biblioteca de reflexió Haskell

source: This package provides the Haskell reflection library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de reflexió Haskell.

source: Regex-based parsing with applicative interface
ca: Anàlisi basada en expressions regulars amb interfície d'aplicació

source: Regex-applicative is a Haskell library for parsing using regular expressions. Parsers can be built using Applicative interface.
ca: Regex-applicative és una biblioteca Haskell per a l'anàlisi mitjançant expressions regulars. Els analitzadors es poden construir utilitzant la interfície Applicative.

source: Haskell regex-applicative library development files
ca: Fitxers de desenvolupament de biblioteques d'aplicació regular de Haskell

source: This package provides the Haskell regex-applicative library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'aplicació regular Haskell.

source: Regex-applicative on text
ca: Regex-applicative en text

source: Wrapped regex-applicative primitives to work with Text.
ca: S'han esborrat les primitives d'aplicació de l'expressió regular per a treballar amb text.

source: Haskell regex-applicative-text library development files
ca: Fitxers de desenvolupament de la biblioteca regex-applicative-text de Haskell

source: This package provides the Haskell regex-applicative-text library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell regex-applicative-text.

source: Common "Text.Regex.*" API for Regex matching
ca: Text comú.API Regex.*" per a la coincidència de les expressions regulars

source: This package does not provide the ability to do regular expression matching. Instead, it provides the type classes that constitute the abstract API that is implemented by 'regex-*' backends such as: * <https://hackage.haskell.org/package/regex-posix regex-posix> * <https://hackage.haskell.org/package/regex-parsec regex-parsec> * <https://hackage.haskell.org/package/regex-dfa regex-dfa> * <https://hackage.haskell.org/package/regex-tdfa regex-tdfa> * <https://hackage.haskell.org/package/regex-pcre regex-pcre> See also <https://wiki.haskell.org/Regular_expressions> for more information.
ca: Aquest paquet no proporciona la capacitat de fer coincidències d'expressions regulars. En canvi, proporciona les classes tipus que constitueixen l'API abstracta que s'implementa amb dorsals 'regex-*' com ara: * <https://hackage.haskell.org/package/regex-posix regex-posix> * <https://hackage.haskell.org/package/regex-parsec regex-parsec> * <https://hackage.haskell.org/package/regex-dfa regex-dfa> * <https://hackage.haskell.org/package/regex-tdfa regex-tdfa> * <https://hackage.haskell.org/package/regex-pcre regex-pcre> Vegeu també <https://wiki.haskell.org/Regularexpressions> per a més informació.

source: Haskell regex-base library development files
ca: Fitxers de desenvolupament de la biblioteca regex-base de Haskell

source: This package provides the Haskell regex-base library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell regex-base.

source: Replaces/enhances "Text.Regex"
ca: Reemplaça/millora "Text.Regex"

source: One module compat layer over <//hackage.haskell.org/package/regex-posix regex-posix> to replace "Text.Regex". See also <https://wiki.haskell.org/Regular_expressions> for more information.
ca: Un mòdul compateix la capa sobre <//hackage.haskell.org/package/regex-posix regex-posix> per reemplaçar "Text.Regex». Vegeu també <https://wiki.haskell.org/Regularexpressions> per a més informació.

source: Haskell regex-compat library development files
ca: Fitxers de desenvolupament de biblioteques compatibles amb l'expressió regular de Haskell

source: This package provides the Haskell regex-compat library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell regex-compat.

source: PCRE Backend for "Text.Regex" (regex-base)
ca: Dorsal PCRE per a «Text.Regex" (regex-base)

source: This package provides a <http://pcre.org/ PCRE> backend for the <//hackage.haskell.org/package/regex-base regex-base> API. See also <https://wiki.haskell.org/Regular_expressions> for more information. Includes bundled code from www.pcre.org.
ca: Aquest paquet proporciona un dorsal <http://pcre.org/ PCRE> per a l'API <//hackage.haskell.org/package/regex-base regex-base>. Vegeu també <https://wiki.haskell.org/Regularexpressions> per a més informació. Inclou codi empaquetat de www.pcre.org.

source: Haskell regex-pcre-builtin library development files
ca: Fitxers de desenvolupament de la biblioteca regex-pcre-builtin de Haskell

source: This package provides the Haskell regex-pcre-builtin library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell regex-pcre-builtin.

source: POSIX Backend for "Text.Regex" (regex-base)
ca: Dorsal POSIX per a "Text.Regex" (regex-base)

source: The POSIX regex backend for <//hackage.haskell.org/package/regex-base regex-base>. The main appeal of this backend is that it's very lightweight due to its reliance on the ubiquitous <https://pubs.opengroup.org/onlinepubs/9699919799/basedefs/regex.h.html POSIX.2 regex> facility that is provided by the standard C library on most POSIX platforms. See also <https://wiki.haskell.org/Regular_expressions> for more information.
ca: El dorsal POSIX regex per a <//hackage.haskell.org/package/regex-base regex-base>. L'atractiu principal d'aquest dorsal és que és molt lleuger a causa de la seva dependència de l'ubiqua instal·lació <https://pubs.opengroup.org/onlinepubs/9699919799/basedefs/regex.h.html POSIX.2 regex> que proporciona la biblioteca C estàndard a la majoria de plataformes POSIX. Vegeu també <https://wiki.haskell.org/Regularexpressions> per a més informació.

source: Haskell regex-posix library development files
ca: Fitxers de desenvolupament de la biblioteca regex-posix de Haskell

source: This package provides the Haskell regex-posix library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell regex-posix.

source: This package provides a pure Haskell "Tagged" DFA regex engine for <//hackage.haskell.org/package/regex-base regex-base>. This implementation was inspired by the algorithm (and Master's thesis) behind the regular expression library known as <https://github.com/laurikari/tre/ TRE or libtre>. Please consult the "Text.Regex.TDFA" module for API documentation including a tutorial with usage examples; see also <https://wiki.haskell.org/Regular_expressions> for general information about regular expression support in Haskell.
ca: Aquest paquet proporciona un motor regular DFA Haskell "Tagged" pur per a <//hackage.haskell.org/package/regex-base regex-base>. Aquesta implementació es va inspirar en l'algoritme (i la tesi de màster) darrere de la biblioteca d'expressió regular coneguda com a <https://github.com/laurikari/tre/ TRE or libtre>. Consulteu el "Text.Mòdul Regex.TDFA" per a la documentació de l'API incloent un tutorial amb exemples d'ús; vegeu també <https://wiki.haskell.org/Regularexpressions> per a informació general sobre el suport d'expressions regulars a Haskell.

source: Haskell regex-tdfa library development files
ca: Fitxers de desenvolupament de la biblioteca regex-tdfa de Haskell

source: This package provides the Haskell regex-tdfa library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell regex-tdfa.

source: Memory reinterpretation casts for Float/Double and Word32/Word64
ca: Reinterpretacions de memòria per a Float/Double i Word32/Word64

source: Memory reinterpretation casts for Float/Double and Word32/Word64. The implementations in the '.Internal' package are different ways to tackle the problem; the 'array' method (current default) is about 5 times faster than the 'FFI' method.
ca: Reinterpretacions de memòria per a Float/Double i Word32/Word64. Les implementacions en el '.El paquet intern és diferent per a abordar el problema; el mètode «array» (predeterminat actual) és aproximadament 5 vegades més ràpid que el mètode «FFI».

source: Haskell reinterpret-cast library development files
ca: Fitxers de desenvolupament de la biblioteca de reinterpretació de Haskell

source: This package provides the Haskell reinterpret-cast library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de reinterpretació de Haskell.

source: Haskeline wrapper for GHCi-like REPL interfaces
ca: Embolcall Haskeline per a interfícies REPL semblants a GHCi

source: Haskeline wrapper for GHCi-like REPL interfaces. Composable with normal mtl transformers.
ca: Embolcall Haskeline per a interfícies REPL semblants a GHCi. Composable amb transformadors mtl normals.

source: Haskell repline library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell repline library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de relíquies Haskell.

source: Domain Name Service (DNS) lookup via the libresolv standard library routines
ca: Cerca del servei de noms de domini (DNS) a través de les rutines de la biblioteca estàndard de libresolv

source: This package implements an API for accessing the [Domain Name Service (DNS)](https://tools.ietf.org/html/rfc1035) resolver service via the standard 'libresolv' system library (whose API is often available directly via the standard 'libc' C library) on Unix systems. This package also includes support for decoding message record types as defined in the following RFCs: - [RFC 1035](https://tools.ietf.org/html/rfc1035): Domain Names - Implementation And Specification - [RFC 1183](https://tools.ietf.org/html/rfc1183): New DNS RR Definitions - [RFC 2782](https://tools.ietf.org/html/rfc2782): A DNS RR for specifying the location of services (DNS SRV) - [RFC 2915](https://tools.ietf.org/html/rfc2915): The Naming Authority Pointer (NAPTR) DNS Resource Record - [RFC 3596](https://tools.ietf.org/html/rfc3596): DNS Extensions to Support IP Version 6 - [RFC 4034](https://tools.ietf.org/html/rfc4034): Resource Records for the DNS Security Extensions - [RFC 4255](https://tools.ietf.org/html/rfc4255): Using DNS to Securely Publish Secure Shell (SSH) Key Fingerprints - [RFC 4408](https://tools.ietf.org/html/rfc4408): Sender Policy Framework (SPF) for Authorizing Use of Domains in E-Mail, Version 1 - [RFC 5155](https://tools.ietf.org/html/rfc5155): DNS Security (DNSSEC) Hashed Authenticated Denial of Existence - [RFC 6844](https://tools.ietf.org/html/rfc6844): DNS Certification Authority Authorization (CAA) Resource Record - [RFC 6891](https://tools.ietf.org/html/rfc6891): Extension Mechanisms for DNS (EDNS(0)) - [RFC 7553](https://tools.ietf.org/html/rfc7553): The Uniform Resource Identifier (URI) DNS Resource Record For Windows, the package [windns](https://hackage.haskell.org/package/windns) provides a compatible subset of this package's API.
ca: Aquest paquet implementa una API per accedir al servei de resolutor [Domain Name Service (DNS)](https://tools.ietf.org/html/rfc1035) a través de la biblioteca de sistema estàndard «libresolv» (l'API de la qual està disponible sovint directament a través de la biblioteca C estàndard «libc») en els sistemes Unix. Aquest paquet també inclou la implementació per a descodificar els tipus de registres de missatges tal com es defineixen en els següents RFC: - [RFC 1035](https://tools.ietf.org/html/rfc1035): Noms de domini - Implementació i especificació - [RFC 2782](https://tools.ietf.org/html/rfc2915): RR DNS per especificar la ubicació dels serveis (DNS SRV) - [RFC 2915](https://tools.ietf.org/html/rfc3596): Extensions DNS per admetre les extensions IP Versió 6 - [RFC 4255](https://tools.ietf.org/html/rfc4255) Key Fingerprints - [RFC 4408](https://tools.ietf.org/html/rfc5155): DNS Security (DNSSEC) Hashed Authenticated Denial of Existence - [RFC 6891](https://tools.ietf.org/html/rfc6891) - [RFC 7553](https://tools.ietf.org/html/rfc7553): Registre de recursos DNS Uniform Resource Identifier Per a Windows, el paquet [windns](https://hackage.haskell.org/package/windns) proporciona un subconjunt compatible de l'API d'aquest paquet.

source: Haskell resolv library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell resolv

source: This package provides the Haskell resolv library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell resolv.

source: A high-performance striped resource pooling implementation
ca: Implementació d'agrupament de recursos ratllats d'alt rendiment

source: A high-performance striped pooling abstraction for managing flexibly-sized collections of resources such as database connections.
ca: Una abstracció d'agrupament ratllat d'alt rendiment per gestionar col·leccions de recursos de mida flexible, com ara connexions de bases de dades.

source: Haskell resource-pool library development files
ca: Fitxers de desenvolupament de la biblioteca de recursos del Haskell

source: This package provides the Haskell resource-pool library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de recursos Haskell.

source: Deterministic allocation and freeing of scarce resources
ca: Assignació i alliberament determinístics dels escassos recursos

source: Hackage documentation generation is not reliable. For up to date documentation, please see: <http://www.stackage.org/package/resourcet>.
ca: La generació de documentació de Hackage no és fiable. Per obtenir documentació actualitzada, consulteu: <http://www.stackage.org/package/resourcet>.

source: Haskell resourcet library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell resourcet

source: This package provides the Haskell resourcet library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell resourcet.

source: Retry combinators for monadic actions that may fail
ca: Reintenta els combinadors per a les accions monàtiques que poden fallar

source: This package exposes combinators that can wrap arbitrary monadic actions. They run the action and potentially retry running it with some configurable delay for a configurable number of times. The purpose is to make it easier to work with IO and especially network IO actions that often experience temporary failure and warrant retrying of the original action. For example, a database query may time out for a while, in which case we should hang back for a bit and retry the query instead of simply raising an exception.
ca: Aquest paquet exposa combinators que poden embolcallar accions monàtiques arbitràries. Executen l'acció i potencialment tornen a intentar executar-la amb algun retard configurable per a un nombre configurable de vegades. L'objectiu és facilitar el treball amb IO i especialment les accions d'E/S de xarxa que sovint experimenten un fracàs temporal i garanteixen el reintent de l'acció original. Per exemple, una consulta a una base de dades pot excedir un temps, i en aquest cas hauríem de tornar a intentar-ho una mica i tornar a intentar-ho en lloc de simplement plantejar una excepció.

source: Haskell retry library development files
ca: Haskell reintenta els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell retry library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell retry.

source: Simple unicode collation as per RFC5051
ca: Col·lació unicode simple segons RFC5051

source: This library implements 'i;unicode-casemap', the simple, non locale-sensitive unicode collation algorithm described in RFC 5051 (<http://www.rfc-editor.org/rfc/rfc5051.txt>). Proper unicode collation can be done using text-icu, but that is a big dependency that depends on a large C library, and rfc5051 might be better for some purposes. Here is a list of strings sorted by the Prelude's 'sort' function: Abe Oeb abe ab&#233; oeb &#193;be &#196;be &#212;eb &#225;be &#228;be &#244;eb. Here is the same list sorted by 'sortBy compareUnicode': Abe abe ab&#233; &#193;be &#225;be &#196;be &#228;be Oeb oeb &#212;eb &#244;eb.
ca: Aquesta biblioteca implementa 'i;unicode-casemap', l'algorisme de col·lació unicode simple i no local que es descriu a RFC 5051 (<http://www.rfc-editor.org/rfc/rfc5051.txt>). La correcta col·lecció unicode es pot fer utilitzant text-icu, però aquesta és una gran dependència que depèn d'una gran biblioteca C, i rfc5051 podria ser millor per a alguns propòsits. Aquí hi ha una llista de cadenes ordenades per la funció «sort» del Preludi: Abe Oeb abe ab2233; oeb 19193;be 2196;be 2212;eb 2225;be 2228;be 2244;eb. Aquesta és la mateixa llista ordenada per «sortBy compareUnicode»: Abe abe ab2233; 19193;be 2225;be 19196;be 2228;be Oeb oeb .212;eb .244;eb.

source: Haskell rfc5051 library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell rfc5051

source: This package provides the Haskell rfc5051 library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell rfc5051.

source: A standard library for Haskell
ca: Una biblioteca estàndard per al Haskell

source: A standard library for Haskell.
ca: Una biblioteca estàndard per a Haskell.

source: Haskell rio library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell rio library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell rio.

source: Orphan instances for the RIO type in the rio package
ca: Instàncies orfes per al tipus RIO en el paquet rio

source: Orphan instances for the RIO type in the rio package.
ca: Instàncies òrfenes per al tipus RIO en el paquet rio.

source: Haskell rio-orphans library development files
ca: Fitxers de desenvolupament de la biblioteca de rio-orfans de Haskell

source: This package provides the Haskell rio-orphans library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell rio-orphans.

source: Pretty-printing for RIO
ca: Pretty-printing per a RIO

source: Combine RIO's log capabilities with pretty printing.
ca: Combina les capacitats de registre de RIO amb una impressió bonica.

source: Haskell rio-prettyprint library development files
ca: Fitxers de desenvolupament de la biblioteca de rio-prettyprint de Haskell

source: This package provides the Haskell rio-prettyprint library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell rio-prettyprint.

source: RPM Macros for building packages for GHC
ca: Macros RPM per construir paquets per a GHC

source: A set of macros for building GHC packages following the openSUSE Haskell Guidelines. ghc needs to be installed in order to make use of these macros.
ca: Un conjunt de macros per a la construcció de paquets GHC seguint les directrius d'openSUSE Haskell. El ghc s'ha d'instal·lar per fer ús d'aquestes macros.

source: Extra RPM macros for building Haskell packages with several libs
ca: Macros RPM addicionals per construir paquets Haskell amb diversos libs

source: Extra macros used for subpackaging of Haskell libraries, for example in ghc and haskell-platform.
ca: Macros addicionals utilitzades per al subpaquet de les biblioteques Haskell, per exemple en ghc i haskell-platform.

source: Library of safe (exception free) functions
ca: Funcions de la biblioteca de caixa forta (excepte gratuïta)

source: A library wrapping 'Prelude'/'Data.List' functions that can throw exceptions, such as 'head' and '!!'. Each unsafe function has up to four variants, e.g. with 'tail': * 'tail :: [a] -> [a]', raises an error on 'tail []'. * 'tailMay :: [a] -> /Maybe/ [a]', turns errors into 'Nothing'. * 'tailDef :: /[a]/ -> [a] -> [a]', takes a default to return on errors. * 'tailNote :: /String/ -> [a] -> [a]', takes an extra argument which supplements the error message. * 'tailSafe :: [a] -> [a]', returns some sensible default if possible, '[]' in the case of 'tail'. This package is divided into three modules: * "Safe" contains safe variants of 'Prelude' and 'Data.List' functions. * "Safe.Foldable" contains safe variants of 'Foldable' functions. * "Safe.Exact" creates crashing versions of functions like 'zip' (errors if the lists are not equal) and 'take' (errors if there are not enough elements), then wraps them to provide safe variants.
ca: Una biblioteca que embolcalla «Preludi»/«Dades».Funcions de llista que poden llançar excepcions, com ara «head» i «!!». Cada funció insegura té fins a quatre variants, per exemple, amb «cua»: * 'tail :: [a] -. [a]', planteja un error a 'tail []'. * 'tailMay :: [a] -. /Maybe/ [a]', converteix els errors en 'Res'. * 'tailDef :: /[a]/ -. [a] -. [a]', pren un valor per defecte per a retornar els errors. * 'tailNote :: /String/ -. [a] -. [a]', pren un argument addicional que complementa el missatge d'error. * 'tailSafe :: [a] -. [a]', retorna algun valor per defecte sensible si és possible, '[]' en el cas de 'tail'. Aquest paquet es divideix en tres mòduls: * "Safe" conté variants segures de 'Preludi' i 'Dades.Funcions de la llista. * "Seguretat.Foldable" conté variants segures de les funcions «Foldable». * "Seguretat.Exact" crea versions fallants de funcions com 'zip' (errors si les llistes no són iguals) i 'take' (errors si no hi ha prou elements), després les ajusta per a proporcionar variants segures.

source: Haskell safe library development files
ca: Fitxers segurs de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell safe library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament segur de la biblioteca Haskell.

source: Safe, consistent, and easy exception handling
ca: Maneig segur, coherent i fàcil d'excepcions

source: Safe, consistent, and easy exception handling.
ca: Maneig d'excepcions segur, coherent i fàcil.
