Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: Validating an email address string against RFC 5322.
ca: Validar una cadena d'adreça de correu electrònic contra l'RFC 5322.

source: Haskell email-validate library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell amb validació per correu electrònic

source: This package provides the Haskell email-validate library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell amb validació per correu electrònic.

source: Conversion between emoji characters and their names
ca: Conversió entre els caràcters emoji i els seus noms

source: This package provides functions for converting emoji names to emoji characters and vice versa. How does it differ from the 'emoji' package? - It supports a fuller range of emojis, including all those supported by GitHub - It supports lookup of emoji aliases from emoji - It uses Text rather than String - It has a lighter dependency footprint: in particular, it does not require aeson - It does not require TemplateHaskell.
ca: Aquest paquet proporciona funcions per convertir els noms dels emojis a caràcters emojis i viceversa. Com es diferencia del paquet «emoji»? - Suporta una gamma més completa d'emojis, incloent-hi tots els suportats per GitHub - Suporta la cerca d'àlies d'emojis d'emoji - Utilitza Text en lloc de String - Té una petjada de dependència més lleugera: en particular, no requereix asó - No requereix TemplateHaskell.

source: Haskell emojis library development files
ca: Fitxers de desenvolupament de la biblioteca d'emojis Haskell

source: This package provides the Haskell emojis library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'emojis Haskell.

source: Catching all exceptions from within an enclosed computation
ca: S'estan capturant totes les excepcions des d'un càlcul tancat

source: Catching all exceptions raised within an enclosed computation, while remaining responsive to (external) asynchronous exceptions. For more information on the technique, please see: <https://www.fpcomplete.com/user/snoyberg/general-haskell/exceptions/catching-all-exceptions>.
ca: Atrapar totes les excepcions plantejades dins d'un càlcul tancat, mentre es manté sensible a excepcions asíncrones (externes). Per a més informació sobre la tècnica, consulteu: <https://www.fpcomplete.com/user/snoyberg/general-haskell/exceptions/catching-all-exceptions>.

source: Haskell enclosed-exceptions library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell amb excepcions tancades

source: This package provides the Haskell enclosed-exceptions library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'excepcions tancades de Haskell.

source: A platform independent entropy source
ca: Una font d'entropia independent de plataforma

source: A mostly platform independent method to obtain cryptographically strong entropy (RDRAND, urandom, CryptAPI, and patches welcome) Users looking for cryptographically strong (number-theoretically sound) PRNGs should see the 'DRBG' package too.
ca: Un mètode independent majoritàriament de plataforma per obtenir entropia criptogràficament forta (RDRAND, urandom, CryptAPI, i pedaços benvinguts) Els usuaris que busquin PRNGs criptogràficament forts (en teoria numèrica) també haurien de veure el paquet 'DRBG'.

source: Haskell entropy library development files
ca: Fitxers de desenvolupament de la biblioteca d'entropia Haskell

source: This package provides the Haskell entropy library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'entropia Haskell.

source: The error function, erf, and related functions
ca: La funció d'error, erf i funcions relacionades

source: A type class for the error function, erf, and related functions. Instances for Float and Double.
ca: Una classe de tipus per a la funció d'error, erf i funcions relacionades. Instàncies per a Float i Doble.

source: Haskell erf library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell erf

source: This package provides the Haskell erf library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell erf.

source: Simplified error-handling
ca: Gestió d'errors simplificada

source: The one-stop shop for all your error-handling needs! Just import "Control.Error". This library encourages an error-handling style that directly uses the type system, rather than out-of-band exceptions.
ca: La finestreta única per a totes les teves necessitats de gestió d'errors! Només importa "Control.Error». Aquesta biblioteca fomenta un estil de gestió d'errors que utilitza directament el sistema de tipus, en lloc d'excepcions fora de banda.

source: Haskell errors library development files
ca: Fitxers de desenvolupament de la biblioteca d'errors del Haskell

source: This package provides the Haskell errors library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'errors Haskell.

source: Haskell exceptions library
ca: Biblioteca d'excepcions del Haskell

source: This package provides the Haskell exceptions library.
ca: Aquest paquet proporciona la biblioteca d'excepcions Haskell.

source: Haskell exceptions library development files
ca: Fitxers de desenvolupament de la biblioteca d'excepcions del Haskell

source: This package provides the Haskell exceptions library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'excepcions Haskell.

source: Extensible exceptions
ca: Extensibles excepcions

source: This package provides extensible exceptions for both new and old versions of GHC (i.e., < 6.10).
ca: Aquest paquet proporciona excepcions extensibles tant per a versions noves com antigues de GHC (és a dir, 6 6.10).

source: Haskell extensible-exceptions library development files
ca: Fitxers de desenvolupament de la biblioteca d'excepcions extensibles de Haskell

source: This package provides the Haskell extensible-exceptions library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'excepcions extensibles de Haskell.

source: Extra functions I use
ca: Funcions addicionals que faig servir

source: A library of extra functions for the standard Haskell libraries. Most functions are simple additions, filling out missing functionality. A few functions are available in later versions of GHC, but this package makes them available back to GHC 7.2. The module "Extra" documents all functions provided by this library. Modules such as "Data.List.Extra" provide extra functions over "Data.List" and also reexport "Data.List". Users are recommended to replace "Data.List" imports with "Data.List.Extra" if they need the extra functionality.
ca: Una biblioteca de funcions addicionals per a les biblioteques Haskell estàndard. La majoria de funcions són simples addicions, omplint la funcionalitat que falta. Algunes funcions estan disponibles en versions posteriors de GHC, però aquest paquet les fa disponibles de nou a GHC 7.2. El mòdul "Extra" documenta totes les funcions proporcionades per aquesta biblioteca. Mòduls com "Dades.Llista.Extra" proporciona funcions addicionals sobre "Dades.Llista" i també reexporta "Dades.Llista". Es recomana als usuaris que reemplacin "Dades.Llista" importa amb "Dades.Llista.Extra" si necessiten la funcionalitat extra.

source: Haskell extra library development files
ca: Fitxers de desenvolupament de biblioteques addicionals del Haskell

source: This package provides the Haskell extra library development files.
ca: Aquest paquet proporciona els fitxers addicionals de desenvolupament de la biblioteca Haskell.

source: Forward-compatible MonadFail class
ca: Classe MonadFail compatible amb reenviament

source: This package contains the "Control.Monad.Fail" module providing the <https://prime.haskell.org/wiki/Libraries/Proposals/MonadFail MonadFail> class that became available in <https://hackage.haskell.org/package/base-4.9.0.0 base-4.9.0.0> for older 'base' package versions. This package turns into an empty package when used with GHC versions which already provide the "Control.Monad.Fail" module to make way for GHC's own "Control.Monad.Fail" module.
ca: Aquest paquet conté el «Control.Monad.Fail" mòdul que proporciona la classe <https://prime.haskell.org/wiki/Libraries/Proposals/MonadFail MonadFail> que es va posar a disposició en <https://hackage.haskell.org/package/base-4.9.0.0 base-4.9.0.0> per a versions de paquets 'base' més antigues. Aquest paquet es converteix en un paquet buit quan s'utilitza amb versions GHC que ja proporcionen el "Control.Monad.Mòdul fallit per donar pas al propi control de GHC.Monad.Mòdul Fail".

source: Haskell fail library development files
ca: Haskell ha fallat en els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell fail library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'errors Haskell.

source: A fast logging system
ca: Un sistema de registre ràpid

source: A fast logging system for Haskell.
ca: Un sistema de registre ràpid per a Haskell.

source: Haskell fast-logger library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell fast-logger

source: This package provides the Haskell fast-logger library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell fast-logger.

source: Desktop Notifications client
ca: Client de notificacions d'escriptori

source: A library for issuing notifications using FreeDesktop.org's Desktop Notifications protcol. This protocol is supported by services such as Ubuntu's NotifyOSD.
ca: Una biblioteca per emetre notificacions utilitzant el protcol de notificacions d'escriptori de FreeDesktop.org. Aquest protocol està suportat per serveis com NotifyOSD d'Ubuntu.

source: Haskell fdo-notify library development files
ca: Fitxers de desenvolupament de la biblioteca «fdo-notify» del Haskell

source: This package provides the Haskell fdo-notify library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca «fdo-notify» de Haskell.

source: Interfacing with RSS (v 0.9x, 2.x, 1.0) + Atom feeds
ca: Interfacing with RSS (v 0.9x, 2.x, 1.0) + Canals Atom

source: Interfacing with RSS (v 0.9x, 2.x, 1.0) + Atom feeds. To help working with the multiple feed formats we've ended up with, this set of modules provides parsers, pretty printers and some utility code for querying and just generally working with a concrete representation of feeds in Haskell. See here for an example of how to create an Atom feed: <https://github.com/bergmark/feed/blob/master/tests/Example/CreateAtom.hs> For basic reading and editing of feeds, consult the documentation of the Text.Feed.* hierarchy.
ca: Interfacing with RSS (v 0.9x, 2.x, 1.0) + Atom feeds. Per ajudar a treballar amb els múltiples formats d'alimentació amb els quals hem acabat, aquest conjunt de mòduls proporciona analitzadors, impressores boniques i algun codi d'utilitat per a la consulta i, en general, treballa amb una representació concreta de fonts a Haskell. Vegeu aquí un exemple de com crear un canal Atom: <https://github.com/bergmark/feed/blob/master/tests/Example/CreateAtom.hs> Per a la lectura i edició bàsica de feeds, consulteu la documentació del Text.Jerarquització del canal.*.

source: Haskell feed library development files
ca: Fitxers de desenvolupament de la biblioteca del canal Haskell

source: This package provides the Haskell feed library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de canals Haskell.

source: Martin Erwig's Functional Graph Library
ca: Biblioteca de Gràfic Funcional de Martin Erwig

source: An inductive representation of manipulating graph data structures. Original website can be found at <http://web.engr.oregonstate.edu/~erwig/fgl/haskell>.
ca: Una representació inductiva de la manipulació de les estructures de dades gràfiques. El lloc web original es pot trobar a <http://web.engr.oregonstate.edu/erwig/fgl/haskell>.

source: Haskell fgl library development files
ca: Fitxers de desenvolupament de la biblioteca «fgl» del Haskell

source: This package provides the Haskell fgl library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca «fgl» de Haskell.

source: Use Template Haskell to embed file contents directly
ca: Usa la plantilla Haskell per incrustar directament el contingut del fitxer

source: Use Template Haskell to read a file or all the files in a directory, and turn them into (path, bytestring) pairs embedded in your Haskell code.
ca: Utilitzeu la plantilla Haskell per a llegir un fitxer o tots els fitxers d'un directori i convertir-los en parelles (camí, provant) incrustades en el vostre codi Haskell.

source: Haskell file-embed library development files
ca: Fitxers de desenvolupament de la biblioteca amb fitxers Haskell

source: This package provides the Haskell file-embed library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca integrats per fitxers Haskell.

source: Portable interface to file locking (flock / LockFileEx)
ca: Interfície portable al bloqueig de fitxers (flock / LockFileEx)

source: This package provides an interface to Windows and Unix file locking functionalities.
ca: Aquest paquet proporciona una interfície per a les funcionalitats de bloqueig de fitxers Windows i Unix.

source: Haskell filelock library development files
ca: Fitxers de desenvolupament de la biblioteca de bloqueig de fitxers Haskell

source: This package provides the Haskell filelock library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de bloqueig de fitxers Haskell.

source: Expressive file and directory manipulation for Haskell
ca: Manipulació expressiva de fitxers i directoris per al Haskell

source: A Haskell library for working with files and directories. Includes code for pattern matching, finding files, modifying file contents, and more.
ca: Una biblioteca Haskell per treballar amb fitxers i directoris. Inclou el codi per a la coincidència de patrons, la cerca de fitxers, la modificació del contingut del fitxer i molt més.

source: Haskell filemanip library development files
ca: Fitxers Haskell de gestió de fitxers de la biblioteca de desenvolupament

source: This package provides the Haskell filemanip library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell filemanip.

source: Haskell filepath library
ca: Biblioteca del camí de fitxers Haskell

source: This package provides the Haskell filepath library.
ca: Aquest paquet proporciona la biblioteca Haskell filepath.

source: Library for manipulating RawFilePaths in a cross platform way
ca: Biblioteca per a manipular RawFilePaths de forma transversal

source: This package provides functionality for manipulating 'RawFilePath' values. It can be used as a drop in replacement for the filepath library to get the benefits of using ByteStrings. It provides three modules: * "System.FilePath.Posix.ByteString" manipulates POSIX/Linux style 'RawFilePath' values (with '/' as the path separator). * "System.FilePath.Windows.ByteString" manipulates Windows style 'RawFilePath' values (with either '\' or '/' as the path separator, and deals with drives). * "System.FilePath.ByteString" is an alias for the module appropriate to your platform. All three modules provide the same API, and the same documentation (calling out differences in the different variants).
ca: Aquest paquet proporciona funcionalitat per a manipular els valors «RawFilePath». Es pot utilitzar com a substitut de la biblioteca filepath per obtenir els beneficis d'utilitzar ByteStrings. Proporciona tres mòduls: * "Sistema.FilePath.Posix.ByteString" manipula els valors «RawFilePath» d'estil POSIX/Linux (amb «/» com a separador de camins). * "Sistema.FilePath.Windows.ByteString" manipula els valors de l'estil de Windows «RawFilePath» (amb «\» o «/» com a separador de camins, i tracta amb les unitats). * "Sistema.FilePath.ByteString" és un àlies per al mòdul adequat a la teva plataforma. Els tres mòduls proporcionen la mateixa API i la mateixa documentació (diferències en les diferents variants).

source: Haskell filepath-bytestring library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell filepath-bytestring

source: This package provides the Haskell filepath-bytestring library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell filepath-bytestring.

source: Haskell filepath library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell filepath

source: This package provides the Haskell filepath library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell filepath.

source: File path glob-like matching
ca: Coincidència del camí del fitxer com a glob

source: A library for matching files using patterns such as '"src/**/*.png"' for all '.png' files recursively under the 'src' directory. Features: * All matching is /O(n)/. Most functions precompute some information given only one argument. * See "System.FilePattern" and '?==' simple matching and semantics. * Use 'match' and 'substitute' to extract suitable strings from the '*' and '**' matches, and substitute them back into other patterns. * Use 'step' and 'matchMany' to perform bulk matching of many patterns against many paths simultaneously. * Use "System.FilePattern.Directory" to perform optimised directory traverals using patterns. Originally taken from the <https://hackage.haskell.org/package/shake Shake library>.
ca: Una biblioteca per a coincidir fitxers utilitzant patrons com ara «src/**/*.png» per a tots els fitxers «.png» recursivament sota el directori «src». Característiques: * Totes les coincidències són /O(n)/. La majoria de les funcions precomputen alguna informació donada només un argument. * Veure "Sistema.FilePattern" i '?.' simple aparellament i semàntica. * Utilitzeu 'aparellar' i 'substituir' per extreure les cadenes adequades de les coincidències '*' i '**', i substituir-les de nou en altres patrons. * Utilitzeu 'step' i 'matchMany' per realitzar la coincidència massiva de molts patrons contra molts camins simultàniament. * Utilitzar "Sistema.FitxerPatró.Directori" per realitzar traverals de directori optimitzats utilitzant patrons. Originalment extret del <https://hackage.haskell.org/package/shake Shake library>.

source: Haskell filepattern library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell filepattern library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell Filepattern.

source: Class of filtrable containers
ca: Classe de contenidors filtrables

source: See "Data.Filtrable".
ca: Vegeu "Dades.Filtrable».

source: Haskell filtrable library development files
ca: Fitxers de desenvolupament de la biblioteca filtrable Haskell

source: This package provides the Haskell filtrable library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca filtrable Haskell.

source: Generic finger-tree structure, with example instances
ca: Estructura genèrica dels dits-arbres, amb exemples

source: A general sequence representation with arbitrary annotations, for use as a base for implementations of various collection types, with examples, as described in section 4 of * Ralf Hinze and Ross Paterson, "Finger trees: a simple general-purpose data structure", /Journal of Functional Programming/ 16:2 (2006) pp 197-217. <http://staff.city.ac.uk/~ross/papers/FingerTree.html> For a tuned sequence type, see 'Data.Sequence' in the 'containers' package, which is a specialization of this structure.
ca: Una representació de seqüència general amb anotacions arbitràries, per al seu ús com a base per a implementacions de diversos tipus de col·lecció, amb exemples, tal com es descriu a la secció 4 de * Ralf Hinze i Ross Paterson, "Finger trees: a simple general-purpose data structure", /Journal of Functional Programming/ 16:2 (2006) pp 197-217. <http://staff.city.ac.uk/ross/papers/FingerTree.html> Per a un tipus de seqüència ajustada, vegeu 'Dades.Seqüència en el paquet de "contenidors", que és una especialització d'aquesta estructura.

source: Haskell fingertree library development files
ca: Fitxers de desenvolupament de la biblioteca de fingertree de Haskell

source: This package provides the Haskell fingertree library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de fingertree de Haskell.

source: Write more understandable Haskell
ca: Escriu el Haskell més comprensible

source: Flow provides operators for writing more understandable Haskell.
ca: Flow proporciona operadors per escriure Haskell més comprensible.

source: Haskell flow library development files
ca: Fitxers de desenvolupament de la biblioteca de flux Haskell

source: This package provides the Haskell flow library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell flow.

source: FoldMap lists
ca: Llistes FoldMap

source: FoldMap lists are lists represented by their foldMap function. FoldMap lists have O(1) cons, snoc and append, just like DLists, but other operations might have favorable performance characteristics as well. These wild claims are still completely unverified though.
ca: Les llistes FoldMap són llistes representades per la seva funció foldMap. Les llistes FoldMap tenen contres O(1), snoc i annex, igual que les llistes DL, però altres operacions també poden tenir característiques de rendiment favorables. Aquestes afirmacions salvatges encara no estan verificades.

source: Haskell fmlist library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell fmlist

source: This package provides the Haskell fmlist library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca «fmlist» de Haskell.

source: A new formatting library
ca: Una biblioteca de formatació nova
