Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: MinTTY is a Windows-specific terminal emulator for the widely used Cygwin and MSYS projects, which provide Unix-like environments for Windows. MinTTY consoles behave differently from native Windows consoles (such as 'cmd.exe' or PowerShell) in many ways, and in some cases, these differences make it necessary to treat MinTTY consoles differently in code. The 'mintty' library provides a simple way to detect if your code in running in a MinTTY console on Windows. It exports 'isMinTTY', which does the right thing 90% of the time (by checking if standard error is attached to MinTTY), and it also exports 'isMinTTYHandle' for the other 10% of the time (when you want to check is some arbitrary handle is attached to MinTTY). As you might expect, both of these functions will simply return 'False' on any non-Windows operating system.
ca: MinTTY és un emulador de terminal específic per a Windows per als projectes Cygwin i MSYS, que proporcionen entorns similars a Unix per a Windows. Les consoles MinTTY es comporten de manera diferent a les consoles natives de Windows (com ara «cmd.exe» o PowerShell) de moltes maneres, i en alguns casos, aquestes diferències fan necessari tractar les consoles MinTTY de manera diferent en el codi. La biblioteca «mintty» proporciona una manera senzilla de detectar si el vostre codi s'està executant en una consola MinTTY al Windows. Exporta 'isMinTTY', que fa el correcte el 90% del temps (comprovant si l'error estàndard s'adjunta a MinTTY), i també exporta 'isMinTTYHandle' per l'altre 10% del temps (quan es vol comprovar que alguna nansa arbitrària s'adjunta a MinTTY). Com podeu esperar, aquestes dues funcions simplement tornaran «False» en qualsevol sistema operatiu que no sigui Windows.

source: Haskell mintty library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell mintty library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la llibreria Haskell mintty.

source: Monad morphisms
ca: Morfismes de Monad

source: This library provides monad morphism utilities, most commonly used for manipulating monad transformer stacks.
ca: Aquesta biblioteca proporciona utilitats de morfisme de mònada, més comunament utilitzades per manipular piles de transformadors de mònada.

source: Haskell mmorph library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell mmorph

source: This package provides the Haskell mmorph library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell mmorph.

source: Lift control operations, like exception catching, through monad transformers
ca: Operacions de control d'elevacions, com la captura d'excepcions, a través de transformadors de monad

source: This package defines the type class 'MonadBaseControl', a subset of 'MonadBase' into which generic control operations such as 'catch' can be lifted from 'IO' or any other base monad. Instances are based on monad transformers in 'MonadTransControl', which includes all standard monad transformers in the 'transformers' library except 'ContT'. See the <http://hackage.haskell.org/package/lifted-base lifted-base> package which uses 'monad-control' to lift 'IO' operations from the 'base' library (like 'catch' or 'bracket') into any monad that is an instance of 'MonadBase' or 'MonadBaseControl'. Note that this package is a rewrite of Anders Kaseorg's 'monad-peel' library. The main difference is that this package provides CPS style operators and exploits the 'RankNTypes' and 'TypeFamilies' language extensions to simplify and speedup most definitions.
ca: Aquest paquet defineix la classe de tipus 'MonadBaseControl', un subconjunt de 'MonadBase' en el qual les operacions de control genèriques, com ara 'catch', es poden eliminar de 'IO' o qualsevol altra mònada base. Les instàncies es basen en transformadors de monad a 'MonadTransControl', que inclou tots els transformadors de monad estàndard a la biblioteca de 'transformers' excepte 'ContT'. Vegeu el paquet <http://hackage.haskell.org/package/lifted-base lifted-base> que utilitza 'monad-control' per aixecar les operacions 'IO' de la biblioteca 'base' (com 'catch' o 'bracket') a qualsevol mònada que sigui una instància de 'MonadBase' o 'MonadBaseControl'. Tingueu en compte que aquest paquet és una reescriptura de la biblioteca 'monad-peel' d'Anders Kaseorg. La diferència principal és que aquest paquet proporciona operadors d'estil CPS i explota les extensions de llenguatge 'RankNTypes' i 'TypeFamilies' per simplificar i accelerar la majoria de definicions.

source: Haskell monad-control library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell monad-control

source: This package provides the Haskell monad-control library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell monad-control.

source: A class of monads which can log messages
ca: Una classe de mònades que poden registrar missatges

source: A class of monads which can log messages.
ca: Una classe de mònades que poden registrar missatges.

source: Haskell monad-logger library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell monad-logger

source: This package provides the Haskell monad-logger library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell monad-logger.

source: Monadic loops
ca: Bucles monàdics

source: Some useful control operators for looping. New in 0.4: STM loop operators have been split into a new package instead of being conditionally-built. New in 0.3.2.0: various functions for traversing lists and computing minima/maxima using arbitrary procedures to compare or score the elements.
ca: Alguns operadors de control útils per al bucle. Nou en 0.4: els operadors de bucles STM s'han dividit en un paquet nou en lloc de ser construïts condicionalment. Nou en 0.3.2.0: diverses funcions per a travessar llistes i calcular minima/màxima utilitzant procediments arbitraris per a comparar o puntuar els elements.

source: Haskell monad-loops library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell monad-loops

source: This package provides the Haskell monad-loops library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell monad-loops.

source: A library for parallel programming based on a monad
ca: Una biblioteca per a la programació paral·lela basada en una mònada

source: The 'Par' monad offers a simple API for parallel programming. The library works for parallelising both pure and 'IO' computations, although only the pure version is deterministic. The default implementation provides a work-stealing scheduler and supports forking tasks that are much lighter weight than IO-threads. For complete documentation see "Control.Monad.Par". Some examples of use can be found in the 'examples/' directory of the source package. Other related packages: * 'abstract-par' provides the type classes that abstract over different implementations of the 'Par' monad. * 'monad-par-extras' provides extra combinators and monad transformers layered on top of the 'Par' monad. Changes in 0.3.4 relative to 0.3: * Fix bugs that cause "thread blocked indefinitely on MVar" crashes. * Added "Control.Monad.Par.IO".
ca: La mònada 'Par' ofereix una API senzilla per a la programació paral·lela. La biblioteca treballa per paral·lelitzar càlculs purs i 'IO', encara que només la versió pura és determinista. La implementació per defecte proporciona un programador de treball i suporta tasques de forquilla que tenen un pes molt més lleuger que els fils d'E/S. Per a una documentació completa, consulteu "Control.Monad.Par». Alguns exemples d'ús es poden trobar al directori «exemples/» del paquet d'origen. Altres paquets relacionats: * 'abstract-par' proporciona les classes tipus que resumeixen sobre diferents implementacions de la mònada 'Par'. * 'monad-par-extras' proporciona combinators i transformadors de monads addicionals en capes sobre la 'Mònada de por'. Canvis en 0.3.4 en relació a 0.3: * Soluciona errors que causen fallades de «fil bloquejat indefinidament a MVar». * S'ha afegit "Control.Monad.Par.IO».

source: Haskell monad-par library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell monad-par

source: This package provides the Haskell monad-par library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell monad-par.

source: Combinators and extra features for Par monads
ca: Combinadors i característiques addicionals per a Par monads

source: The modules below provide additional data structures, and other added capabilities layered on top of the 'Par' monad.
ca: Els mòduls següents proporcionen estructures de dades addicionals, i altres capacitats afegides en capes sobre la mònada 'Par'.

source: Haskell monad-par-extras library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell monad-par-extras

source: This package provides the Haskell monad-par-extras library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell monad-par-extras.

source: A class for monads which can keep a monadic call trace
ca: Una classe per a monads que poden mantenir una traça de crida monòdica

source: This package defines a class for monads which can keep a monadic call trace. * See the blog post <http://pepeiborra.wordpress.com/2009/11/01/monadic-stack-traces-that-make-a-lot-of-sense> for more information. A preprocessor is available (see the package monadloc-pp) which inserts calls to "Control.Monad.Loc.withLoc" before every monadic statement in a module. To invoke the preprocessor, add the pragma 'OPTIONS_GHC -F -pgmF MonadLoc' at the top of your Haskell files together with an import for the "Control.Monad.Loc" module This package provides no implementation of the "Control.Monad.Loc.MonadLoc" interface. Currently the only package that does so is 'control-monad-exception', but any other package can implement it and provide monadic call traces. /Changes/: * 0.7 - Extracted Template Haskell macro to separate module to allow 'Control.Monad.Loc' to be Safe. (thanks to Deian Stefan) * 0.6 - Extracted the preprocessor to a separate package 'monadloc-pp' to minimize the set of dependencies.
ca: Aquest paquet defineix una classe per a les mònades que poden mantenir una traça de crida monacal. * Vegeu l'entrada del blog <http://pepeiborra.wordpress.com/2009/11/01/monadic-stack-traces-that-make-a-lot-of-sense> per a més informació. Hi ha disponible un preprocessador (vegeu el paquet monadloc-pp) que insereix crides a "Control.Monad.Loc.withLoc" abans de cada declaració monòdica en un mòdul. Per a invocar el preprocessador, afegiu el pragma 'OPTIONSGHC -F -pgmF MonadLoc' a la part superior dels fitxers Haskell juntament amb una importació per al "Control.Monad.Mòdul Loc" Aquest paquet no proporciona cap implementació del "Control.Monad.Loc.Interfície MonadLoc". Actualment l'únic paquet que ho fa és 'control-monad-exception', però qualsevol altre paquet pot implementar-lo i proporcionar rastres de trucades monàtiques. /Canvis/: * 0.7 - S'ha extret la plantilla de la macro Haskell per separar el mòdul per permetre 'Control.Monad.Que sigui segur. (Gràcies a Deian Stefan) * 0.6 - S'ha extret el preprocessador a un paquet separat 'monadloc-pp' per minimitzar el conjunt de dependències.

source: Haskell monadloc library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell monadloc

source: This package provides the Haskell monadloc library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell monadloc.

source: Type classes for mapping, folding, and traversing monomorphic containers
ca: Tipus de classes per a cartografiar, plegar i travessar contenidors monomòrfics

source: Type classes for mapping, folding, and traversing monomorphic containers.
ca: Tipus de classes per mapejar, plegar i travessar contenidors monomòrfics.

source: Haskell mono-traversable library development files
ca: Fitxers de desenvolupament de biblioteques monotraversables de Haskell

source: This package provides the Haskell mono-traversable library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca mono-traversables de Haskell.

source: Genetic algorithm library
ca: Biblioteca d'algorismes genètics

source: Moo library provides building blocks to build custom genetic algorithms in Haskell. They can be used to find solutions to optimization and search problems. Variants supported out of the box: binary (using bit-strings) and continuous (real-coded). Potentially supported variants: permutation, tree, hybrid encodings (require customizations). Binary GAs: binary and Gray encoding; point mutation; one-point, two-point, and uniform crossover. Continuous GAs: Gaussian mutation; BLX-α, UNDX, and SBX crossover. Selection operators: roulette, tournament, and stochastic universal sampling (SUS); with optional niching, ranking, and scaling. Replacement strategies: generational with elitism and steady state. Constrained optimization: random constrained initialization, death penalty, constrained selection without a penalty function. Multi-objective optimization: NSGA-II and constrained NSGA-II.
ca: La biblioteca Moo proporciona blocs de construcció per construir algorismes genètics personalitzats a Haskell. Es poden utilitzar per trobar solucions a problemes d'optimització i cerca. Variants suportades fora de la caixa: binàries (utilitzant cadenes de bits) i contínues (codificades realment). Variants suportades potencialment: permutació, arbre, codificacions híbrides (requereix personalitzacions). GA binaris: codificació binària i grisa; mutació puntual; creuament d'un punt, dos punts i uniforme. GAs continus: mutació gaussiana; encreuament BLX-α, UNDX i SBX. Operadors de selecció: roulette, torneig i mostreig universal estocàstic (SUS); amb nínxol, classificació i escalat opcionals. Estratègies de substitució: generacionals amb elitisme i estat estacionari. Optimització restringida: inicialització limitada aleatòria, pena de mort, selecció restringida sense funció de penalització. Optimització multi-objectiva: NSGA-II i NSGA-II restringit.

source: Haskell moo library development files
ca: Fitxers de desenvolupament de la biblioteca moo Haskell

source: This package provides the Haskell moo library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca moo Haskell.

source: List mount points
ca: Llista els punts de muntatge

source: Lists currently mounted filesystems. Works on: Linux, BSD, Mac OS X, Android.
ca: Llista els sistemes de fitxers muntats actualment. Funciona en: Linux, BSD, Mac OS X, Android.

source: Haskell mountpoints library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell mountpoints library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell mountpoints.

source: Haskell mtl library
ca: Biblioteca Haskell mtl

source: This package provides the Haskell mtl library.
ca: Aquest paquet proporciona la biblioteca Haskell mtl.

source: Backported Control.Monad.Except module from mtl
ca: Control retroportat.Monad.Excepte el mòdul de mtl

source: This package backports the "Control.Monad.Except" module from 'mtl' (if using 'mtl-2.2.0.1' or earlier), which reexports the 'ExceptT' monad transformer and the 'MonadError' class. This package should only be used if there is a need to use the 'Control.Monad.Except' module specifically. If you just want the 'mtl' class instances for 'ExceptT', use 'transformers-compat' instead, since 'mtl-compat' does nothing but reexport the instances from that package. Note that unlike how 'mtl-2.2' or later works, the "Control.Monad.Except" module defined in this package exports all of 'ExceptT''s monad class instances. Therefore, you may have to declare 'import Control.Monad.Except ()' at the top of your file to get all of the 'ExceptT' instances in scope.
ca: Aquest paquet porta enrere el «Control.Monad.Excepte" mòdul de 'mtl' (si s'utilitza 'mtl-2.2.0.1' o anterior), que reexporta el transformador de mònada 'ExceptT' i la classe 'MonadError'. Aquest paquet només s'ha d'utilitzar si és necessari utilitzar el 'Control.Monad.Excepte el mòdul específic. Si només voleu les instàncies de classe «mtl» per a «ExceptT», utilitzeu «transformers-compat», ja que «mtl-compat» no fa més que reexportar les instàncies des d'aquest paquet. Tingueu en compte que a diferència de com funciona 'mtl-2.2' o posterior, el "Control.Monad.Excepte" mòdul definit en aquest paquet exporta totes les instàncies de classe monad 'ExceptT'. Per tant, és possible que hagi de declarar 'control d'importació.Monad.Excepte ()' a la part superior del fitxer per a obtenir totes les instàncies «ExceptT» en l'àmbit.

source: Haskell mtl-compat library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell mtl-compat

source: This package provides the Haskell mtl-compat library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell mtl-compat.

source: Haskell mtl library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell mtl

source: This package provides the Haskell mtl library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell mtl.

source: A mustache template parser library
ca: Una biblioteca d'analitzador de plantilles de bigache

source: Allows parsing and rendering template files with mustache markup. See the mustache <http://mustache.github.io/mustache.5.html language reference>. Implements the mustache spec version 1.1.3. /Note/: Versions including and beyond 0.4 are compatible with ghc 7.8 again.
ca: Permet analitzar i renderitzar fitxers de plantilla amb el marcatge del bigache. Vegeu el bigoti <http://mustache.github.io/mustache.5.html language reference>. Implementa l'especificació del bigoti versió 1.1.3. /Nota/: Les versions incloent i més enllà de 0.4 són compatibles amb ghc 7.8 de nou.

source: Haskell mustache library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell mustache

source: This package provides the Haskell mustache library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell mustache.

source: Fast, high quality pseudo random number generation
ca: Generació de nombres pseudoaleatoris d'alta qualitat ràpida

source: This package contains code for generating high quality random numbers that follow either a uniform or normal distribution. The generated numbers are suitable for use in statistical applications. The uniform PRNG uses Marsaglia's MWC256 (also known as MWC8222) multiply-with-carry generator, which has a period of 2^8222 and fares well in tests of randomness. It is also extremely fast, between 2 and 3 times faster than the Mersenne Twister. Compared to the mersenne-random package, this package has a more convenient API, is faster, and supports more statistical distributions.
ca: Aquest paquet conté codi per generar nombres aleatoris d'alta qualitat que segueixen una distribució uniforme o normal. Els nombres generats són adequats per al seu ús en aplicacions estadístiques. El PRNG uniforme utilitza el MWC256 de Marsaglia (també conegut com a MWC8222) generador de multiplicació amb transport, que té un període de 2828222 i va bé en proves d'aleatorietat. També és extremadament ràpid, entre 2 i 3 vegades més ràpid que el Mersenne Twister. Comparat amb el paquet mersenne-random, aquest paquet té una API més convenient, és més ràpid, i suporta distribucions més estadístiques.

source: Haskell mwc-random library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell mwc-random

source: This package provides the Haskell mwc-random library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell mwc-random.

source: A quasiquoter for neat and simple multiline text interpolation
ca: Un quasiquoter per a la interpolació de text prolix i simple multilínia

source: A quasiquoter for producing Text values with support for a simple interpolation of input values. It removes the excessive indentation from the input and accurately manages the indentation of all lines of the interpolated variables.
ca: Un quasiquoter per a produir valors de text amb suport per a una interpolació simple dels valors d'entrada. Elimina el sagnat excessiu de l'entrada i gestiona amb precisió el sagnat de totes les línies de les variables interpolades.

source: Haskell neat-interpolation library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell neat-interpolation

source: This package provides the Haskell neat-interpolation library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell neat-interpolation.

source: Netlink communication for Haskell
ca: Comunicació de Netlink per al Haskell

source: Library to comminicate with Linux kernel via Netlink.
ca: Biblioteca per a comminicar amb el nucli Linux a través de Netlink.

source: Haskell netlink library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell netlink

source: This package provides the Haskell netlink library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell netlink.

source: Low-level networking interface
ca: Interfície de xarxa de baix nivell

source: This package provides a low-level networking interface. === High-Level Packages Other packages provide higher level interfaces: * connection * hookup * network-simple === Extended Packages 'network' seeks to provide a cross-platform core for networking. As such some APIs live in extended libraries. Packages in the 'network' ecosystem are often prefixed with 'network-'. ==== 'network-bsd' In 'network-3.0.0.0' the 'Network.BSD' module was split off into its own package, 'network-bsd-3.0.0.0'. ==== 'network-uri' In 'network-2.6' the 'Network.URI' module was split off into its own package, 'network-uri-2.6'. If you're using the 'Network.URI' module you can automatically get it from the right package by adding this to your '.cabal' file: > library > build-depends: network-uri-flag.
ca: Aquest paquet proporciona una interfície de xarxa de baix nivell. s Paquets d'alt nivell Altres paquets proporcionen interfícies de nivell superior: * connexió * ganxo * network-simple . Ampliació de paquets 'xarxa' busca proporcionar un nucli multiplataforma per a la xarxa. Com a tals, algunes API viuen en biblioteques esteses. Els paquets de l'ecosistema «xarxa» sovint es prefixen amb «xarxa-». . 'network-bsd' A 'network-3.0.0.0' el mòdul 'Network.BSD' es va dividir en el seu propi paquet, 'network-bsd-3.0.0.0'. . 'network-uri' A 'network-2.6' el mòdul 'Network.URI' es va dividir en el seu propi paquet, 'network-uri-2.6'. Si esteu utilitzant el mòdul 'Network.URI' podreu obtenir-lo automàticament des del paquet adequat afegint-lo al fitxer '.cabal': . biblioteca . build-depends: network-uri-flag.

source: POSIX network database (<netdb.h>) API
ca: POSIX base de dades de xarxa (<netdb.h>) API
