Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: This package provides the Haskell process library.
ca: Aquest paquet proporciona la biblioteca de processos Haskell.

source: Haskell process library development files
ca: Fitxers de desenvolupament de la biblioteca de processos Haskell

source: This package provides the Haskell process library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de processos Haskell.

source: Process extras
ca: Processa extras

source: Extends <http://hackage.haskell.org/package/process>. Read process input and output as ByteStrings or Text, or write your own ProcessOutput instance. Lazy process input and output. ProcessMaker class for more flexibility in the process creation API.
ca: S'estén <http://hackage.haskell.org/package/process>. Llegeix l'entrada i sortida del procés com ByteStrings o Text, o escriu la teva pròpia instància de ProcessOutput. Entrada i sortida del procés mandrós. Classe ProcessMaker per a més flexibilitat en l'API de creació de processos.

source: Haskell process-extras library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell process-extras

source: This package provides the Haskell process-extras library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell process-extras.

source: Haskell profunctors library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell profunctors

source: This package provides the Haskell profunctors library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell profunctors.

source: Prometheus Haskell Client
ca: Client Prometheus Haskell

source: [Prometheus Haskell Client] A simple and modern, type safe, performance focused, idiomatic Haskell client for <http://prometheus.io Prometheus> monitoring. Specifically there is no use of unsafe IO or manual ByteString construction from lists of bytes. Batteries-included web server. A key design element of this library is that the RegistryT monad transformer is only required for registering new time series. Once the time series is registered, new data samples may just be added in the IO monad. Note: Version 0.* supports Prometheus v1.0 and version 2.* supports Prometheus v2.0. [Usage Example] > module Example where > > import Control.Monad.IO.Class (liftIO) > import System.Metrics.Prometheus.Http.Scrape (serveMetricsT) > import System.Metrics.Prometheus.Concurrent.RegistryT > import System.Metrics.Prometheus.Metric.Counter (inc) > import System.Metrics.Prometheus.MetricId > > main :: IO () > main = runRegistryT $ do > -- Labels can be defined as lists or added to an empty label set > connectSuccessGauge <- registerGauge "example_connections" (fromList [("login", "success")]) > connectFailureGauge <- registerGauge "example_connections" (addLabel "login" "failure" mempty) > connectCounter <- registerCounter "example_connection_total" mempty > latencyHistogram <- registerHistogram "example_round_trip_latency_ms" mempty [10, 20..100] > > liftIO $ inc connectCounter -- increment a counter > > -- [...] pass metric handles to the rest of the app > > serveMetricsT 8080 ["metrics"] -- http://localhost:8080/metric server > [Advanced Usage] A `Registry` and `StateT`-based `RegistryT` are available for unit testing or generating lists of `[IO a]` actions that can be `sequenced` and returned from pure code to be applied.
ca: [Prometheus Haskell Client] Un client Haskell senzill i modern, tipus segur, enfocat al rendiment, idiomàtic per a la monitorització <http://prometheus.io Prometheus>. Específicament no hi ha cap ús de construcció insegura d'E/S ni de ByteString manual a partir de llistes de bytes. Servidor web integrat per bateries. Un element clau de disseny d'aquesta biblioteca és que el transformador de monads RegistryT només és necessari per registrar noves sèries temporals. Una vegada registrades les sèries temporals, es poden afegir noves mostres de dades a la mònada d'IO. Nota: La versió 0.* suporta Prometheus v1.0 i la versió 2.* suporta Prometheus v2.0. [Usage Example] . Mòdul Exemple on . . control d'importació.Monad.IO.Classe (liftIO) . Sistema d'importació.Mètrica.Prometeu.Http.Scrape (serveMetricsT) . Sistema d'importació.Mètrica.Prometeu.Concurrent.RegistryT . Sistema d'importació.Mètrica.Prometeu.Mètrica.Comptador (inc) . sistema d'importació.Mètrica.Prometeu.MetricId the the main :: IO () main the runRegistryT $ do -- -- Les etiquetes es poden definir com a llistes o afegir a un conjunt d'etiquetes buit the connectSuccessGauge <- registerGauge "exampleconnections" (fromList [("login", "success")]) > connectFailureGauge <- registerGauge "exampleconnections" (addLabel "login" "failure" mempty) > connectCounter <- registerCounter "exampleconnectiontotal" mempty > connectncyHistogram <- registerHistogram "exampleroundtriplatencyms" mempty [10, 20..100] > the liftIO $ inc connectCounter -- incrementa un comptador the -- pass serveMetricsT 8080 ["metrics"] -- http://localhost:8080/metric server -- [Usatge avançat] Un .Registry. i un .RegistryT. basat en .StateT. estan disponibles per a provar o generar llistes d'accions [[IO a]. que es poden .seqüenciar. i retornar del codi pur per a aplicar-les.

source: Haskell prometheus library development files
ca: Fitxers de desenvolupament de la biblioteca prometheus de Haskell

source: This package provides the Haskell prometheus library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell prometheus.

source: A small prelude
ca: Un petit preludi

source: A sensible set of defaults for writing custom Preludes.
ca: Un conjunt sensible de valors per defecte per a l'escriptura de preludis personalitzats.

source: Haskell protolude library development files
ca: Fitxers de desenvolupament de la biblioteca protoludi Haskell

source: This package provides the Haskell protolude library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca del protoludi Haskell.

source: Pure priority search queues
ca: Cues de cerca prioritàries pures

source: The psqueues package provides <http://en.wikipedia.org/wiki/Priority_queue Priority Search Queues> in three different flavors. * 'OrdPSQ k p v', which uses the 'Ord k' instance to provide fast insertion, deletion and lookup. This implementation is based on Ralf Hinze's <http://citeseer.ist.psu.edu/hinze01simple.html A Simple Implementation Technique for Priority Search Queues>. Hence, it is similar to the <http://hackage.haskell.org/package/PSQueue PSQueue> library, although it is considerably faster and provides a slightly different API. * 'IntPSQ p v' is a far more efficient implementation. It fixes the key type to 'Int' and uses a <http://en.wikipedia.org/wiki/Radix_tree radix tree> (like 'IntMap') with an additional min-heap property. * 'HashPSQ k p v' is a fairly straightforward extension of 'IntPSQ': it simply uses the keys' hashes as indices in the 'IntPSQ'. If there are any hash collisions, it uses an 'OrdPSQ' to resolve those. The performance of this implementation is comparable to that of 'IntPSQ', but it is more widely applicable since the keys are not restricted to 'Int', but rather to any 'Hashable' datatype. Each of the three implementations provides the same API, so they can be used interchangeably. The benchmarks show how they perform relative to one another, and also compared to the other Priority Search Queue implementations on Hackage: <http://hackage.haskell.org/package/PSQueue PSQueue> and <http://hackage.haskell.org/package/fingertree-psqueue fingertree-psqueue>. <<http://i.imgur.com/KmbDKR6.png>> <<http://i.imgur.com/ClT181D.png>> Typical applications of Priority Search Queues include: * Caches, and more specifically LRU Caches; * Schedulers; * Pathfinding algorithms, such as Dijkstra's and A*.
ca: El paquet psqueues proporciona <http://en.wikipedia.org/wiki/Priorityqueue Priority Search Queues> en tres sabors diferents. * 'OrdPSQ k p v', que utilitza la instància 'Ord k' per proporcionar una inserció, supressió i cerca ràpida. Aquesta implementació es basa en el de Ralf Hinze <http://citeseer.ist.psu.edu/hinze01simple.html A Simple Implementation Technique for Priority Search Queues>. Per tant, és similar a la biblioteca <http://hackage.haskell.org/package/PSQueue PSQueue>, encara que és considerablement més ràpida i proporciona una API lleugerament diferent. * 'IntPSQ p v' és una implementació molt més eficient. Esmena el tipus de clau a 'Int' i utilitza un <http://en.wikipedia.org/wiki/Radixtree radix tree> (com 'IntMap') amb una propietat min-heap addicional. * 'HashPSQ k p v' és una extensió bastant senzilla de 'IntPSQ': simplement utilitza els hashes de claus com a índexs en el 'IntPSQ'. Si hi ha col·lisions d'haixix, utilitza un 'OrdPSQ' per resoldre-les. El rendiment d'aquesta implementació és comparable al d''IntPSQ', però és més àmpliament aplicable, ja que les claus no estan restringides a 'Int', sinó a qualsevol tipus de dades 'Hashable'. Cadascuna de les tres implementacions proporciona la mateixa API, de manera que es poden utilitzar indistintament. Els punts de referència mostren com es realitzen entre si, i també comparats amb les altres implementacions de la cua de cerca prioritària en Hackage: <http://hackage.haskell.org/package/PSQueue PSQueue> i <http://hackage.haskell.org/package/fingertree-psqueue fingertree-psqueue>. <<http://i.imgur.com/KmbDKR6.png> <<http://i.imgur.com/ClT181D.png> Les aplicacions típiques de les cues de cerca prioritàries inclouen: * Caches, i més concretament LRU Caches; * Planificadors; * Algorismes de cerca de camins, com el de Dijkstra i el d'A*.

source: Haskell psqueues library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell psqueues

source: This package provides the Haskell psqueues library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell psqueues.

source: Generic typeclasses for generating arbitrary ADTs
ca: Classes de tipus genèriques per a generar ADT arbitraris

source: Improve arbitrary value generation for ADTs.
ca: Millora la generació arbitrària de valors per als ADT.

source: Haskell quickcheck-arbitrary-adt library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell quickcheck-arbitrary-adt

source: This package provides the Haskell quickcheck-arbitrary-adt library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell quickcheck-arbitrary-adt.

source: Common quickcheck instances
ca: Instàncies habituals de comprovació ràpida

source: QuickCheck instances. The goal is to supply QuickCheck instances for types provided by the Haskell Platform. Since all of these instances are provided as orphans, I recommend that you do not use this library within another library module, so that you don't impose these instances on down-stream consumers of your code. For information on writing a test-suite with Cabal see <https://www.haskell.org/cabal/users-guide/developing-packages.html#test-suites>.
ca: Instàncies del QuickCheck. L'objectiu és subministrar instàncies de QuickCheck per als tipus proporcionats per la Plataforma Haskell. Com que totes aquestes instàncies es proporcionen com a orfes, us recomano que no utilitzeu aquesta biblioteca dins d'un altre mòdul de la biblioteca, de manera que no imposeu aquestes instàncies als consumidors del codi. Per obtenir informació sobre com escriure un test-suite amb Cabal vegeu <https://www.haskell.org/cabal/users-guide/developing-packages.html#test-suites>.

source: Haskell quickcheck-instances library development files
ca: Fitxers de desenvolupament de la biblioteca de comprovació ràpida de Haskell

source: This package provides the Haskell quickcheck-instances library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell quickcheck-instances.

source: Use HUnit assertions as QuickCheck properties
ca: Usa les assercions de HUnit com a propietats del QuickCheck

source: This package provides an orphan instance that allows you to use HUnit assertions as QuickCheck properties.
ca: Aquest paquet proporciona una instància òrfena que permet utilitzar les assercions HUnit com a propietats QuickCheck.

source: Haskell quickcheck-io library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell quickcheck-io

source: This package provides the Haskell quickcheck-io library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell quickcheck-io.

source: Generic deriving of Read/Show with no record labels
ca: Obtenció genèrica de Read/Show sense etiquetes de registre

source: Generic deriving of Read/Show with no record labels.
ca: Conducció genèrica de Read/Show sense segells discogràfics.

source: Haskell quiet library development files
ca: Fitxers de desenvolupament de la biblioteca silenciosa Haskell

source: This package provides the Haskell quiet library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca silenciosa Haskell.

source: Pseudo-random number generation
ca: Generació de nombres pseudoaleatòria

source: This package provides basic pseudo-random number generation, including the ability to split random number generators. == "System.Random": pure pseudo-random number interface In pure code, use 'System.Random.uniform' and 'System.Random.uniformR' from "System.Random" to generate pseudo-random numbers with a pure pseudo-random number generator like 'System.Random.StdGen'. As an example, here is how you can simulate rolls of a six-sided die using 'System.Random.uniformR': >>> let roll = uniformR (1, 6) :: RandomGen g => g -> (Word, g) >>> let rolls = unfoldr (Just . roll) :: RandomGen g => g -> [Word] >>> let pureGen = mkStdGen 42 >>> take 10 (rolls pureGen) :: [Word] [1,1,3,2,4,5,3,4,6,2] See "System.Random" for more details. == "System.Random.Stateful": monadic pseudo-random number interface In monadic code, use 'System.Random.Stateful.uniformM' and 'System.Random.Stateful.uniformRM' from "System.Random.Stateful" to generate pseudo-random numbers with a monadic pseudo-random number generator, or using a monadic adapter. As an example, here is how you can simulate rolls of a six-sided die using 'System.Random.Stateful.uniformRM': >>> let rollM = uniformRM (1, 6) :: StatefulGen g m => g -> m Word >>> let pureGen = mkStdGen 42 >>> runStateGen_ pureGen (replicateM 10 . rollM) :: [Word] [1,1,3,2,4,5,3,4,6,2] The monadic adapter 'System.Random.Stateful.runStateGen_' is used here to lift the pure pseudo-random number generator 'pureGen' into the 'System.Random.Stateful.StatefulGen' context. The monadic interface can also be used with existing monadic pseudo-random number generators. In this example, we use the one provided in the <https://hackage.haskell.org/package/mwc-random mwc-random> package: >>> import System.Random.MWC as MWC >>> let rollM = uniformRM (1, 6) :: StatefulGen g m => g -> m Word >>> monadicGen <- MWC.create >>> replicateM 10 (rollM monadicGen) :: IO [Word] [2,3,6,6,4,4,3,1,5,4] See "System.Random.Stateful" for more details.
ca: Aquest paquet proporciona una generació de nombres pseudoaleatoris bàsica, inclosa la capacitat de dividir generadors de nombres aleatoris. == "Sistema.Aleatori: interfície de nombres pseudoaleatoris pura En codi pur, utilitzeu 'Sistema.Aleatori.uniforme' i 'Sistema.Random.uniformR' de "System.Aleatori" per generar nombres pseudoaleatoris amb un generador de nombres pseudoaleatoris pur com 'System.Aleatòriament.StdGen. Com a exemple, aquí teniu com podeu simular rotllos d'un dau de sis cares utilitzant el sistema.Random.uniformR': . Let roll . uniformR (1, 6) :: RandomGen g . g -. (Word, g) . Let rolls . unfoldr (Just . roll) :: RandomGen g ) g - g [Word] let pureGen ) mkStdGen 42 ) take 10 (rolls pureGen) :: [Word] [1,1,3,2,4,5,3,4,6,2] Vegeu "Sistema.Aleatori" per a més detalls. == "Sistema.Aleatòriament.Stateful: interfície monòdica de nombres pseudoaleatoris En el codi monòdic, utilitzeu 'Sistema.Aleatòriament.Stateful.uniformM i Sistema.Aleatòriament.Stateful.uniformRM' de "System.Aleatòriament.Stateful" per generar nombres pseudoaleatoris amb un generador de nombres pseudoaleatoris monòdics, o utilitzant un adaptador monòdic. Com a exemple, aquí teniu com podeu simular rotllos d'un dau de sis cares utilitzant el sistema.Aleatòriament.Stateful.uniformRM': . Let rollM . uniformRM (1, 6) :: StatefulGen g m . g - Word m Word . let pureGen . mkStdGen 42 . runStateGen pureGen (replicateM 10 . rollM) :: [Word] [1,1,3,2,4,5,3,4,6,2] L'adaptador monacal 'System.Aleatòriament.Stateful.runStateGen s'utilitza aquí per a elevar el generador de nombres pseudoaleatoris pur «pureGen» al «Sistema».Aleatòriament.Declarat.Context de StatefulGen. La interfície monòdica també es pot utilitzar amb els generadors de nombres pseudoaleatoris monòdics existents. En aquest exemple, utilitzem el que es proporciona en el paquet <https://hackage.haskell.org/package/mwc-random mwc-random>: . Sistema d'importació.Random.MWC as MWC ) let rollM ) uniformRM (1, 6) :: StatefulGen g m g - Word m Word ) monadicGen <- MWC.create >) replicateM 10 (rollM monadicGen) :: IO [Word] [2,3,6,6,4,4,3,1,5,4] Vegeu "Sistema.Aleatòriament.Stateful" per a més detalls.

source: Haskell random library development files
ca: Fitxers de desenvolupament de la biblioteca aleatòria Haskell

source: This package provides the Haskell random library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca aleatòria Haskell.

source: Random shuffle implementation
ca: Implementació aleatòria de barreja

source: Random shuffle implementation, on immutable lists. Based on `perfect shuffle' implementation by Oleg Kiselyov, available on http://okmij.org/ftp/Haskell/perfect-shuffle.txt.
ca: Implementació aleatòria a barreja, en llistes immutables. Basat en la implementació de .perfect shuffle' per Oleg Kiselyov, disponible a http://okmij.org/ftp/Haskell/perfect-shuffle.txt.

source: Haskell random-shuffle library development files
ca: Haskell aleatòriament barreja els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell random-shuffle library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de barreja aleatòria Haskell.

source: Reading from Text and ByteString
ca: Lectura des del text i ByteString

source: Provides a Readable type class for reading data types from ByteString and Text. Also includes efficient implementations for common data types.
ca: Proporciona una classe de tipus llegible per llegir els tipus de dades de ByteString i Text. També inclou implementacions eficients per a tipus de dades comuns.

source: Haskell readable library development files
ca: Fitxers de desenvolupament de biblioteques llegibles Haskell

source: This package provides the Haskell readable library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca llegibles per Haskell.

source: Representing common recursion patterns as higher-order functions
ca: Representació de patrons de recursivitat comuns com a funcions d'ordre superior

source: Many recursive functions share the same structure, e.g. pattern-match on the input and, depending on the data constructor, either recur on a smaller input or terminate the recursion with the base case. Another one: start with a seed value, use it to produce the first element of an infinite list, and recur on a modified seed in order to produce the rest of the list. Such a structure is called a recursion scheme. Using higher-order functions to implement those recursion schemes makes your code clearer, faster, and safer. See README for details.
ca: Moltes funcions recursives comparteixen la mateixa estructura, per exemple, la coincidència de patrons en l'entrada i, depenent del constructor de dades, es repeteixen en una entrada més petita o acaben la recursió amb el cas base. Una altra: començar amb un valor de llavor, utilitzar-la per produir el primer element d'una llista infinita, i repetir sobre una llavor modificada per produir la resta de la llista. Aquesta estructura s'anomena esquema de recursivitat. L'ús de funcions d'ordre superior per implementar aquests esquemes de recursivitat fa que el codi sigui més clar, ràpid i segur. Vegeu README per a més detalls.

source: Haskell recursion-schemes library development files
ca: Fitxers de desenvolupament de la biblioteca recursion-schemes de Haskell

source: This package provides the Haskell recursion-schemes library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell recursion-schemes.

source: Semigroups, specialized containers and a general map/reduce framework
ca: Semigrups, contenidors especialitzats i un marc general de mapa/reduir

source: Semigroups, specialized containers and a general map/reduce framework.
ca: Semigrups, contenidors especialitzats i un marc general de mapa/reduir.

source: Haskell reducers library development files
ca: Fitxers de desenvolupament de la biblioteca de reductors de Haskell

source: This package provides the Haskell reducers library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell reducers.

source: Specify refactorings to perform with apply-refact
ca: Especifiqueu les refactoritzacions a realitzar amb «application-refact»

source: This library provides a datatype which can be interpreted by apply-refact. It exists as a seperate library so that applications can specify refactorings without depending on GHC.
ca: Aquesta biblioteca proporciona un tipus de dades que es pot interpretar per «application-refact». Existeix com una biblioteca seperada de manera que les aplicacions poden especificar refactories sense dependre del GHC.

source: Haskell refact library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell refact library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell refact.

source: Reifies arbitrary terms into types that can be reflected back into terms
ca: Reassigna els termes arbitraris en tipus que es poden reflectir de nou en termes
