Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: Wadler/Leijen pretty printer with support for annotations and modernized API. Annotations are useful for coloring. See wl-pprint-console.
ca: Impressora bonica Wadler/Leijen amb suport per a anotacions i API modernitzada. Les anotacions són útils per acolorir. Vegeu wl-pprint-console.

source: Haskell wl-pprint-annotated library development files
ca: Fitxers de desenvolupament de biblioteques anotades amb wl-pprint de Haskell

source: This package provides the Haskell wl-pprint-annotated library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca anotats per Haskell wl-pprint.

source: A Wadler/Leijen Pretty Printer for Text values
ca: Una impressora Wadler/Leijen Pretty per als valors de text

source: A clone of wl-pprint for use with the text library.
ca: Un clon de wl-pprint per utilitzar amb la biblioteca de text.

source: Haskell wl-pprint-text library development files
ca: Fitxers de desenvolupament de la biblioteca wl-pprint-text de Haskell

source: This package provides the Haskell wl-pprint-text library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell wl-pprint-text.

source: A library for word-wrapping
ca: Una biblioteca per a l'ajust de paraules

source: A library for wrapping long lines of text.
ca: Una biblioteca per a ajustar línies llargues de text.

source: Haskell word-wrap library development files
ca: Fitxers de desenvolupament de la biblioteca d'ajust de paraules Haskell

source: This package provides the Haskell word-wrap library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'ajust de paraules Haskell.

source: Word8 library
ca: Biblioteca Word8

source: Word8 library to be used with Data.ByteString.
ca: Biblioteca Word8 que s'utilitzarà amb Data.ByteString.

source: Haskell word8 library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell word8

source: This package provides the Haskell word8 library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell word8.

source: An easy-to-use HTTP client library
ca: Una biblioteca de clients HTTP fàcil d'utilitzar

source: A web client library that is designed for ease of use. Tutorial: <http://www.serpentine.com/wreq/tutorial.html> Features include: * Simple but powerful `lens`-based API * A solid test suite, and built on reliable libraries like http-client and lens * Session handling includes connection keep-alive and pooling, and cookie persistence * Automatic response body decompression * Powerful multipart form and file upload handling * Support for JSON requests and responses, including navigation of schema-less responses * Basic and OAuth2 bearer authentication * Early TLS support via the tls package.
ca: Una biblioteca de client web dissenyada per facilitar-ne l'ús. Guia d'aprenentatge: <http://www.serpentine.com/wreq/tutorial.html> Les característiques inclouen: * API simple però potent basada en -lens- * Un conjunt de proves sòlid, i construït sobre biblioteques fiables com http-client i lents * La gestió de la sessió inclou la connexió en viu i la posada en comú, i la persistència de galetes * Descompressió automàtica del cos de resposta * Potent maneig del formulari multipart i la càrrega de fitxers * Suport per a sol·licituds i respostes JSON, inclosa la navegació de respostes sense esquemes * Autenticació bàsica i de portador OAuth2 * Suport TLS primerenc a través del paquet tls.

source: Haskell wreq library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell wreq

source: This package provides the Haskell wreq library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell wreq.

source: X509 reader and writer
ca: Lector i escriptor X509

source: X509 reader and writer. please see README.
ca: X509 lector i escriptor. Si us plau, vegeu README.

source: Haskell x509 library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell x509

source: This package provides the Haskell x509 library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell x509.

source: X.509 collection accessing and storing methods
ca: Mètodes d'accés i emmagatzematge de la col·lecció X.509

source: X.509 collection accessing and storing methods for certificate, crl, exception list.
ca: X.509 col·lecció accés i emmagatzematge de mètodes per a certificat, crl, llista d'excepcions.

source: Haskell x509-store library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell x509-store

source: This package provides the Haskell x509-store library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell x509-store.

source: Handle per-operating-system X.509 accessors and storage
ca: Gestiona els accessors i l'emmagatzematge per sistema operatiu X.509

source: System X.509 handling for accessing operating system dependents store and other storage methods.
ca: Maneig del sistema X.509 per accedir a la botiga dependent del sistema operatiu i altres mètodes d'emmagatzematge.

source: Haskell x509-system library development files
ca: Fitxers de desenvolupament de la biblioteca del sistema Haskell x509

source: This package provides the Haskell x509-system library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell x509-system.

source: X.509 Certificate and CRL validation
ca: Certificat X.509 i validació CRL

source: X.509 Certificate and CRL validation. please see README.
ca: Certificat X.509 i validació CRL. Si us plau, vegeu README.

source: Haskell x509-validation library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell x509-validation

source: This package provides the Haskell x509-validation library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell x509-validació.

source: Haskell xhtml library
ca: Biblioteca xhtml de Haskell

source: This package provides the Haskell xhtml library.
ca: Aquest paquet proporciona la biblioteca xhtml de Haskell.

source: Haskell xhtml library development files
ca: Fitxers de desenvolupament de la biblioteca xhtml de Haskell

source: This package provides the Haskell xhtml library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca xhtml de Haskell.

source: A simple XML library
ca: Una biblioteca XML senzilla

source: A simple XML library.
ca: Una biblioteca XML senzilla.

source: Pure-Haskell utilities for dealing with XML with the conduit package
ca: Utilitats de Pure-Haskell per tractar amb XML amb el paquet de conductes

source: Hackage documentation generation is not reliable. For up to date documentation, please see: <http://www.stackage.org/package/xml-conduit>.
ca: La generació de documentació de Hackage no és fiable. Per obtenir documentació actualitzada, consulteu: <http://www.stackage.org/package/xml-conduit>.

source: Haskell xml-conduit library development files
ca: Fitxers de desenvolupament de la biblioteca «xml-conduit» del Haskell

source: This package provides the Haskell xml-conduit library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell xml-conduit.

source: Haskell xml library development files
ca: Fitxers de desenvolupament de la biblioteca xml de Haskell

source: This package provides the Haskell xml library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca xml de Haskell.

source: Hamlet-style quasiquoter for XML content
ca: Quasiquoter d'estil Hamlet per al contingut XML

source: Hamlet-style quasiquoter for XML content.
ca: Quasiquoter a l'estil Hamlet per al contingut XML.

source: Haskell xml-hamlet library development files
ca: Fitxers de desenvolupament de la biblioteca «xml-hamlet» del Haskell

source: This package provides the Haskell xml-hamlet library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell xml-hamlet.

source: Basic types for representing XML
ca: Tipus bàsics per a representar XML

source: Basic types for representing XML. The idea is to have a full set of appropriate types, which various XML libraries can share. Instead of having equivalent-but-incompatible types for every binding, parser, or client, they all share the same types can can thus interoperate easily. This library contains complete types for most parts of an XML document, including the prologue, node tree, and doctype. Some basic combinators are included for common tasks, including traversing the node tree and filtering children.
ca: Tipus bàsics per a representar XML. La idea és tenir un conjunt complet de tipus adequats, que diverses biblioteques XML poden compartir. En lloc de tenir tipus equivalents però incompatibles per a cada enllaç, analitzador o client, tots comparteixen els mateixos tipus poden, per tant, interoperar fàcilment. Aquesta biblioteca conté tipus complets per a la majoria de parts d'un document XML, incloent-hi el pròleg, l'arbre de nodes i el doctype. Alguns combinators bàsics s'inclouen per a tasques comunes, com ara travessar l'arbre de nodes i filtrar els fills.

source: Haskell xml-types library development files
ca: Fitxers de desenvolupament de la biblioteca de tipus xml de Haskell

source: This package provides the Haskell xml-types library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de tipus xml de Haskell.

source: Community-maintained extensions extensions for xmonad
ca: Extensions comunitàries per a xmonad

source: Community-maintained tiling algorithms and extension modules for xmonad, an X11 tiling window manager. For an introduction to building, configuring and using xmonad extensions, see "XMonad.Doc". In particular: "XMonad.Doc.Configuring", a guide to configuring xmonad "XMonad.Doc.Extending", using the contributed extensions library "XMonad.Doc.Developing", introduction to xmonad internals and writing your own extensions.
ca: Algorismes i mòduls d'extensió de tessel·lació mantinguts per la comunitat per a xmonad, un gestor de finestres de tessel·lació X11. Per a una introducció a la construcció, configuració i ús d'extensions xmonad, vegeu "XMonad.Doc». En particular: "XMonad.Doc.Configuring", una guia per configurar xmonad "XMonad.Doc.Extending", utilitzant la biblioteca d'extensions aportades "XMonad.Doc.Developing", introducció a xmonad internals i escriptura de les vostres pròpies extensions.

source: Haskell xmonad-contrib library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell xmonad-contrib

source: This package provides the Haskell xmonad-contrib library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell xmonad-contrib.

source: Sanitize untrusted HTML to prevent XSS attacks
ca: Saneja l'HTML no fiable per evitar atacs XSS

source: Run untrusted HTML through Text.HTML.SanitizeXSS.sanitizeXSS to prevent XSS attacks. see README.md <http://github.com/yesodweb/haskell-xss-sanitize> for more details.
ca: Executa HTML no de confiança a través de Text.HTML.SanitizeXSS.sanitizeXSS per evitar atacs XSS. Vegeu README.md <http://github.com/yesodweb/haskell-xss-sanitize> per a més detalls.

source: Haskell xss-sanitize library development files
ca: Haskell xss-sanitize fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell xss-sanitize library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell xss-sanitize.

source: Support for parsing and rendering YAML documents
ca: Implementació per a analitzar i representar documents YAML

source: README and API documentation are available at <https://www.stackage.org/package/yaml>.
ca: La documentació de README i API està disponible a <https://www.stackage.org/package/yaml>.

source: Haskell yaml library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell yaml

source: This package provides the Haskell yaml library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell yaml.

source: Creation of type-safe, RESTful web applications
ca: Creació d'aplicacions web segures i RESTful

source: API docs and the README are available at <http://www.stackage.org/package/yesod>.
ca: Els documents de l'API i el README estan disponibles a <http://www.stackage.org/package/yesod>.

source: API docs and the README are available at <http://www.stackage.org/package/yesod-core>.
ca: Els documents de l'API i el README estan disponibles a <http://www.stackage.org/package/yesod-core>.

source: Haskell yesod-core library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell yesod-core

source: This package provides the Haskell yesod-core library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell yesod-core.

source: Haskell yesod library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell yesod

source: This package provides the Haskell yesod library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell Yesod.

source: Form handling support for Yesod Web Framework
ca: Implementació de la gestió de formularis per al Framework web Yesod

source: API docs and the README are available at <http://www.stackage.org/package/yesod-form>. Third-party packages which you can find useful: <http://hackage.haskell.org/package/yesod-form-richtext yesod-form-richtext> - richtext form fields (currntly it provides only Summernote support).
ca: Els documents de l'API i el README estan disponibles a <http://www.stackage.org/package/yesod-form>. Paquets de tercers que podeu trobar útils: <http://hackage.haskell.org/package/yesod-form-richtext yesod-form-richtext> - camps de formulari de text enriquit (normalment només proporciona suport de Summernote).

source: Haskell yesod-form library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell yesod-form

source: This package provides the Haskell yesod-form library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell yesod-form.

source: Some helpers for using Persistent from Yesod
ca: Alguns ajudants per utilitzar Persistent de Yesod

source: API docs and the README are available at <http://www.stackage.org/package/yesod-persistent>.
ca: Els documents de l'API i el README estan disponibles a <http://www.stackage.org/package/yesod-persistent>.

source: Haskell yesod-persistent library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell iod-persistent

source: This package provides the Haskell yesod-persistent library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell persistents a un sínode.

source: Static file serving subsite for Yesod Web Framework
ca: Fitxer estàtic que serveix el subseu del Framework web Yesod

source: API docs and the README are available at <http://www.stackage.org/package/yesod-static>.
ca: Els documents de l'API i el README estan disponibles a <http://www.stackage.org/package/yesod-static>.

source: Haskell yesod-static library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell yesod-static

source: This package provides the Haskell yesod-static library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell yesod-static.

source: Operations on zip archives
ca: Operacions en arxius zip

source: Operations on zip archives.
ca: Operacions en arxius zip.

source: Library for creating and modifying zip archives
ca: Biblioteca per a crear i modificar arxius zip

source: The zip-archive library provides functions for creating, modifying, and extracting files from zip archives. The zip archive format is documented in <http://www.pkware.com/documents/casestudies/APPNOTE.TXT>. Certain simplifying assumptions are made about the zip archives: in particular, there is no support for strong encryption, zip files that span multiple disks, ZIP64, OS-specific file attributes, or compression methods other than Deflate. However, the library should be able to read the most common zip archives, and the archives it produces should be readable by all standard unzip programs. Archives are built and extracted in memory, so manipulating large zip files will consume a lot of memory. If you work with large zip files or need features not supported by this library, a better choice may be <http://hackage.haskell.org/package/zip zip>, which uses a memory-efficient streaming approach. However, zip can only read and write archives inside instances of MonadIO, so zip-archive is a better choice if you want to manipulate zip archives in "pure" contexts. As an example of the use of the library, a standalone zip archiver and extracter is provided in the source distribution.
ca: La biblioteca zip-archive proporciona funcions per crear, modificar i extreure fitxers dels arxius zip. El format d'arxiu zip està documentat en <http://www.pkware.com/documents/casestudies/APPNOTE.TXT>. Es fan certes suposicions simplificadores sobre els arxius zip: en particular, no hi ha suport per a un encriptatge fort, fitxers zip que abastin múltiples discs, ZIP64, atributs de fitxer específics del sistema operatiu, o mètodes de compressió diferents de Deflate. No obstant això, la biblioteca hauria de ser capaç de llegir els arxius zip més comuns, i els arxius que produeix haurien de ser llegibles per tots els programes deszip estàndard. Els arxius es construeixen i s'extreuen en memòria, de manera que manipular fitxers zip grans consumirà molta memòria. Si treballeu amb fitxers zip grans o necessiteu característiques que no siguin compatibles amb aquesta biblioteca, una millor opció pot ser <http://hackage.haskell.org/package/zip zip>, que utilitza un enfocament de flux eficient en memòria. No obstant això, el zip només pot llegir i escriure arxius dins d'instàncies de MonadIO, de manera que el zip-archive és una millor opció si voleu manipular arxius zip en contextos "purs". Com a exemple de l'ús de la biblioteca, es proporciona un arxivador i extractor ZIP independent a la distribució d'origen.

source: Haskell zip-archive library development files
ca: Fitxers de desenvolupament de la biblioteca zip-archive de Haskell

source: This package provides the Haskell zip-archive library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca zip de Haskell.

source: Haskell zip library development files
ca: Fitxers de desenvolupament de la biblioteca zip del Haskell

source: This package provides the Haskell zip library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca zip Haskell.

source: Compression and decompression in the gzip and zlib formats
ca: Compressió i descompressió en els formats gzip i zlib

source: This package provides a pure interface for compressing and decompressing streams of data represented as lazy 'ByteString's. It uses the <https://en.wikipedia.org/wiki/Zlib zlib C library> so it has high performance. It supports the "zlib", "gzip" and "raw" compression formats. It provides a convenient high level API suitable for most tasks and for the few cases where more control is needed it provides access to the full zlib feature set.
ca: Aquest paquet proporciona una interfície pura per a comprimir i descomprimir fluxos de dades representats com a «ByteString» mandrós. Utilitza la <https://en.wikipedia.org/wiki/Zlib zlib C library>, per la qual cosa té un alt rendiment. Suporta els formats de compressió «zlib», «gzip» i «raw». Proporciona una API d'alt nivell convenient i adequada per a la majoria de tasques i per als pocs casos en què es necessita més control proporciona accés al conjunt complet de característiques zlib.

source: Low-level bindings to the zlib package
ca: Vinculacions de baix nivell al paquet zlib

source: Low-level bindings to the zlib package.
ca: Vinculacions de baix nivell al paquet zlib.

source: Haskell zlib-bindings library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell zlib-bindings

source: This package provides the Haskell zlib-bindings library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell zlib-bindings.

source: Haskell zlib library development files
ca: Fitxers de desenvolupament de la biblioteca zlib de Haskell

source: This package provides the Haskell zlib library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca zlib de Haskell.

source: Haskell bindings to the Zstandard compression algorithm
ca: Haskell vincula a l'algorisme de compressió estàndard Z

source: A fast lossless compression algorithm, targeting real-time compression scenarios at zlib-level and better compression ratios.
ca: Un algorisme ràpid de compressió sense pèrdua, dirigit a escenaris de compressió en temps real a nivell de zlib i millors proporcions de compressió.

source: Haskell zstd library development files
ca: Fitxers de desenvolupament de la biblioteca zstd de Haskell

source: This package provides the Haskell zstd library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca zstd de Haskell.

source: GHCi based bare bones IDE
ca: IDE d'ossos nus basats en GHCi

source: Either "GHCi as a daemon" or "GHC + a bit of an IDE". A very simple Haskell development tool which shows you the errors in your project and updates them whenever you save. Run 'ghcid --topmost --command=ghci', where '--topmost' makes the window on top of all others (Windows only) and '--command' is the command to start GHCi on your project (defaults to 'ghci' if you have a '.ghci' file, or else to 'cabal repl').
ca: Ja sigui "GHCi com a dimoni" o "GHC + una mica d'IDE". Una eina de desenvolupament Haskell molt senzilla que et mostra els errors del teu projecte i els actualitza sempre que els desis. Executeu «ghcid --topmost --command).ghci», on «--topmost» fa la finestra a sobre de tots els altres (només Windows) i «--command» és l'ordre d'iniciar GHCi al vostre projecte (per defecte és «ghci» si teniu un fitxer «.ghci», o bé «cabal repl»).

source: Guess changes between package versions from their changelog
ca: Endevina els canvis entre les versions dels paquets des del seu registre de canvis

source: Given two versions of a package, this utility will find the changelog file in each respective version, determine the changes, and write an appropriate change log entry to stdout that can be used in an openSUSE *.changes file to describe the update.
ca: Donades dues versions d'un paquet, aquesta utilitat trobarà el fitxer de registre de canvis en cada versió respectiva, determinarà els canvis i escriurà una entrada de registre de canvis adequada a la sortida estàndard que es pot utilitzar en un fitxer openSUSE *.changes per descriure l'actualització.

source: Featureful preludes formed solely from the "base" package
ca: Preludis destacats formats únicament a partir del paquet "base"
