Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: In Haskell you very often acquire values using the 'with...' idiom using functions of type '(a -> IO r) -> IO r'. This idiom forms a 'Monad', which is a special case of the 'ContT' monad (from 'transformers') or the 'Codensity' monad (from 'kan-extensions'). The main purpose behind this package is to provide a restricted form of these monads specialized to this unusually common case. The reason this package defines a specialized version of these types is to: * be more beginner-friendly, * simplify inferred types and error messages, and: * provide some additional type class instances that would otherwise be orphan instances.
ca: A Haskell sovint adquireixes valors utilitzant l'expressió 'amb...' utilitzant funcions de tipus '(a -. IO r) -. IO r'. Aquest llenguatge forma una 'Monad', que és un cas especial de la 'mònada de 'ContT' (de 'transformadors') o la 'mònada de la 'Codensitat' (de 'can-extensions'). El principal propòsit d'aquest paquet és proporcionar una forma restringida d'aquestes mònades especialitzades en aquest cas inusualment comú. La raó per la qual aquest paquet defineix una versió especialitzada d'aquests tipus és per: * sigues més apte per a principiants, * Simplifica els tipus inferits i els missatges d'error, i: * proporciona algunes instàncies de classe de tipus addicionals que d'altra manera serien instàncies òrfenes.

source: Haskell managed library development files
ca: Haskell gestiona els fitxers de desenvolupament de les biblioteques

source: This package provides the Haskell managed library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca gestionada per Haskell.

source: Collection of tools for numeric computations
ca: Col·lecció d'eines per a càlculs numèrics

source: This library contain collection of various utilities for numerical computing. So far there're special mathematical functions, compensated summation algorithm, summation of series, root finding for real functions, polynomial summation and Chebyshev polynomials.
ca: Aquesta biblioteca conté una col·lecció de diverses utilitats per a la computació numèrica. Fins ara hi ha funcions matemàtiques especials, algorisme de suma compensat, suma de sèries, cerca d'arrels per a funcions reals, suma polinòmica i polinomis de Chebyshev.

source: Haskell math-functions library development files
ca: Fitxers de desenvolupament de la biblioteca de funcions matemàtiques de Haskell

source: This package provides the Haskell math-functions library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de funcions matemàtiques Haskell.

source: Monadic parser combinators
ca: Combinadors d'analitzador monàdic

source: This is an industrial-strength monadic parser combinator library. Megaparsec is a feature-rich package that tries to find a nice balance between speed, flexibility, and quality of parse errors.
ca: Aquesta és una biblioteca combinadora d'analitzadors monòdics de força industrial. Megaparsec és un paquet ric en característiques que intenta trobar un bon equilibri entre la velocitat, la flexibilitat i la qualitat dels errors d'anàlisi.

source: Haskell megaparsec library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell megaparsec

source: This package provides the Haskell megaparsec library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell megaparsec.

source: Memory and related abstraction stuff
ca: Memòria i material d'abstracció relacionat

source: Chunk of memory, polymorphic byte array management and manipulation * A polymorphic byte array abstraction and function similar to strict ByteString. * Different type of byte array abstraction. * Raw memory IO operations (memory set, memory copy, ..) * Aliasing with endianness support. * Encoding : Base16, Base32, Base64. * Hashing : FNV, SipHash.
ca: Tros de memòria, gestió i manipulació de matrius de bytes polimòrfiques * Una abstracció polimòrfica de matriu de bytes i funció similar a l'estricta ByteString. * Diferents tipus d'abstracció de matriu de bytes. * Operacions d'E/S de memòria RAW (conjunt de memòria, còpia de memòria, ..) * Aliant amb suport endian. * Codificació : Base16, Base32, Base64. * Hashing : FNV, SipHash.

source: Haskell memory library development files
ca: Fitxers de desenvolupament de la biblioteca de memòria Haskell

source: This package provides the Haskell memory library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de memòria Haskell.

source: Generate high quality pseudorandom numbers purely using a Mersenne Twister
ca: Genera nombres pseudoaleatoris d'alta qualitat purament utilitzant un Twister de Mersenne

source: The Mersenne twister is a pseudorandom number generator developed by Makoto Matsumoto and Takuji Nishimura that is based on a matrix linear recurrence over a finite binary field. It provides for fast generation of very high quality pseudorandom numbers. The source for the C code can be found here: <http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/emt64.html> This library provides a purely functional binding to the 64 bit classic mersenne twister, along with instances of RandomGen, so the generator can be used with System.Random. The generator should typically be a few times faster than the default StdGen (but a tad slower than the impure 'mersenne-random' library based on SIMD instructions and destructive state updates.
ca: El Mersenne twister és un generador de nombres pseudoaleatori desenvolupat per Makoto Matsumoto i Takuji Nishimura que es basa en una recurrència lineal matricial sobre un camp binari finit. Proporciona una generació ràpida de nombres pseudoaleatoris de molt alta qualitat. La font del codi C es pot trobar aquí: <http://www.math.sci.hiroshima-u.ac.jp/m-mat/MT/emt64.html> Aquesta biblioteca proporciona una unió purament funcional al torçador de mersenne clàssic de 64 bits, juntament amb les instàncies de RandomGen, de manera que el generador es pot utilitzar amb System.Aleatòriament. El generador hauria de ser típicament unes quantes vegades més ràpid que el StdGen per defecte (però un tad més lent que la impura biblioteca 'mersenne-random' basada en instruccions SIMD i actualitzacions d'estat destructives.

source: Haskell mersenne-random-pure64 library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell mersenne-random-pure64

source: This package provides the Haskell mersenne-random-pure64 library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell mersenne-random-pure64.

source: A tiny lens library with no dependencies
ca: Una petita biblioteca de lents sense dependències

source: NOTE: If you're writing an app, you probably want <http://hackage.haskell.org/package/microlens-platform microlens-platform> – it has the most features. <http://hackage.haskell.org/package/microlens microlens> is intended more for library writers who want a tiny lens library (after all, lenses are pretty useful for everything, not just for updating records!). This library is an extract from <http://hackage.haskell.org/package/lens lens> (with no dependencies). It's not a toy lenses library, unsuitable for “real world”, but merely a small one. It is compatible with lens, and should have same performance. It also has better documentation. There's a longer readme <https://github.com/monadfix/microlens#readme on Github>. It has a migration guide for lens users, a description of other packages in the family, a discussion of other lens libraries you could use instead, and so on. Here are some usecases for this library: * You want to define lenses or traversals in your own library, but don't want to depend on lens. Having lenses available often make working with a library more pleasant. * You just want to be able to use lenses to transform data (or even just use 'over _1' to change the first element of a tuple). * You are new to lenses and want a small library to play with. However, don't use this library if: * You need 'Iso's, 'Prism's, indexed traversals, or actually anything else which isn't defined here (though some indexed functions are available elsewhere – containers and vector provide them for their types, and <http://hackage.haskell.org/package/ilist ilist> provides indexed functions for lists). * You want a library with a clean, understandable implementation (in which case you're looking for <http://hackage.haskell.org/package/lens-simple lens-simple>). As already mentioned, if you're writing an application which uses lenses more extensively, look at <http://hackage.haskell.org/package/microlens-platform microlens-platform> – it combines features of most other microlens packages (<http://hackage.haskell.org/package/microlens-mtl microlens-mtl>, <http://hackage.haskell.org/package/microlens-th microlens-th>, <http://hackage.haskell.org/package/microlens-ghc microlens-ghc>). If you want to export getters or folds and don't mind the <http://hackage.haskell.org/package/contravariant contravariant> dependency, please consider using <http://hackage.haskell.org/package/microlens-contra microlens-contra>. If you haven't ever used lenses before, read <http://hackage.haskell.org/package/lens-tutorial/docs/Control-Lens-Tutorial.html this tutorial>. (It's for lens, but it applies to microlens just as well.) Note that microlens has no dependencies starting from GHC 7.10 (base-4.8). Prior to that, it depends on transformers-0.2 or above.
ca: NOTA: Si estàs escrivint una aplicació, probablement vols <http://hackage.haskell.org/package/microlens-platform microlens-platform> - té més funcions. <http://hackage.haskell.org/package/microlens microlens> està pensat més per als escriptors de biblioteques que volen una petita biblioteca de lents (al cap i a la fi, les lents són molt útils per a tot, no només per actualitzar registres!). Aquesta biblioteca és un extracte de <http://hackage.haskell.org/package/lens lens> (sense dependències). No és una biblioteca de lents de joguina, inadequada per a “món real”, sinó simplement una petita. És compatible amb la lent, i ha de tenir el mateix rendiment. També té millor documentació. Hi ha un readme més llarg <https://github.com/monadfix/microlens#readme on Github>. Disposa d'una guia de migració per als usuaris de lents, una descripció d'altres paquets en la família, una discussió d'altres biblioteques de lents que es podrien utilitzar en el seu lloc, i així successivament. Aquí hi ha alguns casos d'ús per a aquesta biblioteca: * Voleu definir lents o traversals a la vostra pròpia biblioteca, però no voleu dependre de la lent. Tenir lents disponibles sovint fa que treballar amb una biblioteca sigui més agradable. * Només voleu ser capaç d'utilitzar lents per transformar dades (o fins i tot simplement utilitzar 'més d'1' per canviar el primer element d'una tupla). * Ets nou per a lents i vols que una petita biblioteca jugui amb ella. No obstant això, no utilitzeu aquesta biblioteca si: * Necessiteu 'Iso's, 'Prism's, traversals indexats, o qualsevol altra cosa que no estigui definida aquí (tot i que algunes funcions indexades estan disponibles en altres llocs - contenidors i vectors els proporcionen per als seus tipus, i <http://hackage.haskell.org/package/ilist ilist> proporciona funcions indexades per a llistes). * Voleu una biblioteca amb una implementació neta i comprensible (en aquest cas esteu cercant <http://hackage.haskell.org/package/lens-simple lens-simple>). Com ja s'ha esmentat, si esteu escrivint una aplicació que utilitza lents més extensament, mireu <http://hackage.haskell.org/package/microlens-platform microlens-platform> - combina característiques de la majoria d'altres paquets de microlents (<http://hackage.haskell.org/package/microlens-mtl microlens-mtl>, <http://hackage.haskell.org/package/microlens-th microlens-th>, <http://hackage.haskell.org/package/microlens-ghc microlens-ghc>). Si voleu exportar «getters» o «folds» i no us importa la dependència <http://hackage.haskell.org/package/contravariant contravariant>, considereu utilitzar <http://hackage.haskell.org/package/microlens-contra microlens-contra>. Si no heu utilitzat mai lents, llegiu <http://hackage.haskell.org/package/lens-tutorial/docs/Control-Lens-Tutorial.html this tutorial>. (És per a lents, però s'aplica a microlens també.) Tingueu en compte que la microlens no té dependències a partir del GHC 7.10 (base-4.8). Abans d'això, depèn dels transformadors-0.2 o superior.

source: Haskell microlens library development files
ca: Fitxers de desenvolupament de la biblioteca de microlens Haskell

source: This package provides the Haskell microlens library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de microlens Haskell.

source: Microlens + array, bytestring, containers, transformers
ca: Microlens + array, bytestring, contenidors, transformadors

source: Use this package instead of <http://hackage.haskell.org/package/microlens microlens> if you don't mind depending on all dependencies here – 'Lens.Micro.GHC' reexports everything from 'Lens.Micro' and additionally provides orphan instances of microlens classes for packages coming with GHC (<http://hackage.haskell.org/package/array array>, <http://hackage.haskell.org/package/bytestring bytestring>, <http://hackage.haskell.org/package/containers containers>, <http://hackage.haskell.org/package/transfromers transformers>). The minor and major versions of microlens-ghc are incremented whenever the minor and major versions of microlens are incremented, so you can depend on the exact version of microlens-ghc without specifying the version of microlens you need. This package is a part of the <http://hackage.haskell.org/package/microlens microlens> family; see the readme <https://github.com/monadfix/microlens#readme on Github>.
ca: Utilitzeu aquest paquet en lloc de <http://hackage.haskell.org/package/microlens microlens> si no us importa dependre de totes les dependències aquí – 'Lens.Micro.GHC' ho reexporta tot des de 'Lens.Micro' i addicionalment proporciona instàncies orfes de classes de microlens per als paquets que venen amb GHC (<http://hackage.haskell.org/package/array array>, <http://hackage.haskell.org/package/bytestring bytestring>, <http://hackage.haskell.org/package/containers containers>, <http://hackage.haskell.org/package/transfromers transformers>). Les versions menor i major de microlens-ghc s'incrementen cada vegada que s'incrementen les versions menor i major de microlens, de manera que podeu dependre de la versió exacta de microlens-ghc sense especificar la versió de microlens que necessiteu. Aquest paquet forma part de la família <http://hackage.haskell.org/package/microlens microlens>; vegeu el readme <https://github.com/monadfix/microlens#readme on Github>.

source: Haskell microlens-ghc library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell microlens-ghc

source: This package provides the Haskell microlens-ghc library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell microlens-ghc.

source: Microlens support for Reader/Writer/State from mtl
ca: Implementació de microlens per a Reader/Writer/State des de mtl

source: This package contains functions (like 'view' or '+=') which work on 'MonadReader', 'MonadWriter', and 'MonadState' from the mtl package. This package is a part of the <http://hackage.haskell.org/package/microlens microlens> family; see the readme <https://github.com/monadfix/microlens#readme on Github>.
ca: Aquest paquet conté funcions (com ara «view» o «+'») que funcionen a «MonadReader», «MonadWriter» i «MonadState» del paquet mtl. Aquest paquet forma part de la família <http://hackage.haskell.org/package/microlens microlens>; vegeu el readme <https://github.com/monadfix/microlens#readme on Github>.

source: Haskell microlens-mtl library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell microlens-mtl

source: This package provides the Haskell microlens-mtl library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell microlens-mtl.

source: Microlens + all batteries included (best for apps)
ca: Microlens + totes les bateries incloses (millor per a aplicacions)

source: This package exports a module which is the recommended starting point for using <http://hackage.haskell.org/package/microlens microlens> if you aren't trying to keep your dependencies minimal. By importing 'Lens.Micro.Platform' you get all functions and instances from <http://hackage.haskell.org/package/microlens microlens>, <http://hackage.haskell.org/package/microlens-th microlens-th>, <http://hackage.haskell.org/package/microlens-mtl microlens-mtl>, <http://hackage.haskell.org/package/microlens-ghc microlens-ghc>, as well as instances for 'Vector', 'Text', and 'HashMap'. The minor and major versions of microlens-platform are incremented whenever the minor and major versions of any other microlens package are incremented, so you can depend on the exact version of microlens-platform without specifying the version of microlens (microlens-mtl, etc) you need. This package is a part of the <http://hackage.haskell.org/package/microlens microlens> family; see the readme <https://github.com/monadfix/microlens#readme on Github>.
ca: Aquest paquet exporta un mòdul que és el punt de partida recomanat per utilitzar <http://hackage.haskell.org/package/microlens microlens> si no esteu intentant mantenir les dependències mínimes. Important 'Lens.Micro.Plataforma' s'obtenen totes les funcions i instàncies de <http://hackage.haskell.org/package/microlens microlens>, <http://hackage.haskell.org/package/microlens-th microlens-th>, <http://hackage.haskell.org/package/microlens-mtl microlens-mtl>, <http://hackage.haskell.org/package/microlens-ghc microlens-ghc>, així com les instàncies de «Vector», «Text» i «HashMap». Les versions menor i major de la microlens-plataforma s'incrementen sempre que s'incrementen les versions menor i major de qualsevol altre paquet de microlens, de manera que podeu dependre de la versió exacta de la microlens-plataforma sense especificar la versió de microlens (microlens-mtl, etc) que necessiteu. Aquest paquet forma part de la família <http://hackage.haskell.org/package/microlens microlens>; vegeu el readme <https://github.com/monadfix/microlens#readme on Github>.

source: Haskell microlens-platform library development files
ca: Fitxers de desenvolupament de la biblioteca de microlens-plataforma de Haskell

source: This package provides the Haskell microlens-platform library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de microlens-plataforma de Haskell.

source: Automatic generation of record lenses for microlens
ca: Generació automàtica de lents de registre per a microlens

source: This package lets you automatically generate lenses for data types; code was extracted from the lens package, and therefore generated lenses are fully compatible with ones generated by lens (and can be used both from lens and microlens). This package is a part of the <http://hackage.haskell.org/package/microlens microlens> family; see the readme <https://github.com/monadfix/microlens#readme on Github>.
ca: Aquest paquet permet generar lents automàticament per als tipus de dades; el codi s'ha extret del paquet de lents, i per tant les lents generades són totalment compatibles amb les generades per la lent (i es poden utilitzar tant a partir de la lent com de la microlens). Aquest paquet forma part de la família <http://hackage.haskell.org/package/microlens microlens>; vegeu el readme <https://github.com/monadfix/microlens#readme on Github>.

source: Haskell microlens-th library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell microlens-th

source: This package provides the Haskell microlens-th library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell microlens-th.

source: Mustache templates for Haskell
ca: Plantilles Mustache per a Haskell

source: Mustache templates for Haskell. Based on 'stache' library, which uses 'megaparsec'. This library uses 'parsec', thus the name: 'microstache'.
ca: Plantilles de Mustache per a Haskell. Basat en la biblioteca «stache», que utilitza «megaparsec». Aquesta biblioteca utilitza «parsec», així el nom: «microstache».

source: Haskell microstache library development files
ca: Fitxers de desenvolupament de la biblioteca de microstache Haskell

source: This package provides the Haskell microstache library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de microstache Haskell.

source: Compose MIME email messages
ca: Redacta els missatges de correu MIME

source: Hackage documentation generation is not reliable. For up to date documentation, please see: <http://www.stackage.org/package/mime-mail>.
ca: La generació de documentació de Hackage no és fiable. Per obtenir documentació actualitzada, consulteu: <http://www.stackage.org/package/mime-mail>.

source: Haskell mime-mail library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell mime-mail

source: This package provides the Haskell mime-mail library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell mime-mail.

source: Basic mime-type handling types and functions
ca: Tipus i funcions bàsiques de gestió de tipus MIME

source: API docs and the README are available at <http://www.stackage.org/package/mime-types>.
ca: Els documents de l'API i el README estan disponibles a <http://www.stackage.org/package/mime-types>.

source: Haskell mime-types library development files
ca: Fitxers de desenvolupament de la biblioteca de tipus MIME de Haskell

source: This package provides the Haskell mime-types library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de tipus MIME Haskell.

source: A reliable way to detect the presence of a MinTTY console on Windows
ca: Una manera fiable de detectar la presència d'una consola MinTTY al Windows
