Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: This package provides the Haskell crypto-api library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca crypto-api de Haskell.

source: Generic cryptography cipher types
ca: Tipus de xifratge de criptografia genèrica

source: Generic cryptography cipher types.
ca: Tipus de xifratge de criptografia genèrica.

source: Haskell crypto-cipher-types library development files
ca: Fitxers de desenvolupament de la biblioteca crypto-cipher-types de Haskell

source: This package provides the Haskell crypto-cipher-types library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca crypto-cipher-types Haskell.

source: Generic cryptography Public keys algorithm types
ca: Criptografia genèrica Tipus d'algorismes de claus públiques

source: Generic cryptography public keys algorithm types.
ca: Tipus genèrics d'algorismes de claus públiques.

source: Haskell crypto-pubkey-types library development files
ca: Fitxers de desenvolupament de la biblioteca crypto-pubkey-types del Haskell

source: This package provides the Haskell crypto-pubkey-types library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca crypto-pubkey-types de Haskell.

source: Simple cryptographic random related types
ca: Tipus criptogràfics aleatoris senzills

source: Simple cryptographic random related types.
ca: Tipus criptogràfics senzills relacionats a l'atzar.

source: Haskell crypto-random library development files
ca: Fitxers de desenvolupament de biblioteques criptoaleatòries de Haskell

source: This package provides the Haskell crypto-random library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca criptoaleatorial Haskell.

source: Collection of crypto hashes, fast, pure and practical
ca: Col·lecció de xifrats, ràpids, purs i pràctics

source: DEPRECATED: this library is still fully functional, but please use cryptonite for new projects and convert old one to use cryptonite. This is where things are at nowadays. A collection of crypto hashes, with a practical incremental and one-pass, pure APIs, with performance close to the fastest implementations available in other languages. The implementations are made in C with a haskell FFI wrapper that hide the C implementation. Simple examples using the unified API: > import Crypto.Hash > > sha1 :: ByteString -> Digest SHA1 > sha1 = hash > > hexSha3_512 :: ByteString -> String > hexSha3_512 bs = show (hash bs :: Digest SHA3_512) Simple examples using the module API: > import qualified Crypto.Hash.SHA1 as SHA1 > > main = putStrLn $ show $ SHA1.hash (Data.ByteString.pack [0..255]) > import qualified Crypto.Hash.SHA3 as SHA3 > > main = putStrLn $ show $ digest > where digest = SHA3.finalize ctx > ctx = foldl' SHA3.update iCtx (map Data.ByteString.pack [ [1,2,3], [4,5,6] ] > iCtx = SHA3.init 224.
ca: OBSOLETA: aquesta biblioteca encara és completament funcional, però utilitzeu la criptonita per a projectes nous i convertiu l'antiga per a utilitzar la criptonita. Aquí és on estan les coses avui dia. Una col·lecció d'haixix cripto, amb una pràctica API incremental i d'un sol pas, pures, amb un rendiment proper a les implementacions més ràpides disponibles en altres idiomes. Les implementacions es realitzen en C amb un embolcall FFI de haskell que amaga la implementació de C. Exemples simples utilitzant l'API unificada: . importar Crypto.Hash sha1 :: ByteString - Digest SHA1 > sha1 = hash > hexSha3512 :: ByteString -> String hexSha3512 bs show (hash bs :: Digest SHA3512) Exemples simples utilitzant el mòdul API: . importar Crypto qualificat.Hash.SHA1 as SHA1 . . main . putStrLn $ show $ SHA1.hash (Data.ByteString.pack [0..255]) . importar Crypto qualificat.Hash.SHA3 as SHA3 . . main . putStrLn $ show $ digest . where digest . SHA3.finalize ctx . ctx . foldl' SHA3.update iCtx (map Data.ByteString.pack [ [1,2,3], [4,5,6] ] ] iCtx SHA3.init 224.

source: Support all the 'cryptohash' package using conduits from the 'conduit' package.
ca: Suporta tot el paquet «cryptohash» utilitzant conductes del paquet «conduit».

source: Haskell cryptohash-conduit library development files
ca: Fitxers de desenvolupament de la biblioteca de criptohash-conduit de Haskell

source: This package provides the Haskell cryptohash-conduit library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca cryptohash-conduit de Haskell.

source: Haskell cryptohash library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell cryptohash

source: This package provides the Haskell cryptohash library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca cryptohash de Haskell.

source: Fast, pure and practical MD5 implementation
ca: Implementació ràpida, pura i pràctica de MD5

source: A practical incremental and one-pass, pure API to the <https://en.wikipedia.org/wiki/MD5 MD5 hash algorithm> (including <https://en.wikipedia.org/wiki/HMAC HMAC> support) with performance close to the fastest implementations available in other languages. The implementation is made in C with a haskell FFI wrapper that hides the C implementation. NOTE: This package has been forked off 'cryptohash-0.11.7' because the 'cryptohash' package has been deprecated and so this package continues to satisfy the need for a lightweight package providing the MD5 hash algorithm without any dependencies on packages other than 'base' and 'bytestring'. Consequently, this package can be used as a drop-in replacement for 'cryptohash''s "Crypto.Hash.MD5" module, though with a clearly smaller footprint.
ca: Una API pràctica incremental i d'un sol pas, pura a la <https://en.wikipedia.org/wiki/MD5 MD5 hash algorithm> (incloent-hi el suport <https://en.wikipedia.org/wiki/HMAC HMAC>) amb un rendiment proper a les implementacions més ràpides disponibles en altres idiomes. La implementació es realitza en C amb un embolcall FFI de haskell que amaga la implementació de C. NOTA: Aquest paquet s'ha forjat des de «cryptohash-0.11.7» perquè el paquet «cryptohash» ha quedat obsolet i, per tant, aquest paquet continua satisfent la necessitat d'un paquet lleuger que proporcioni l'algorisme de resum MD5 sense cap dependència de paquets diferents de «base» i «bytestring». En conseqüència, aquest paquet es pot utilitzar com a substitut de "Crypto" de "cryptohash".Mòdul Hash.MD5", encara que amb una petjada clarament més petita.

source: Haskell cryptohash-md5 library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell cryptohash-md5

source: This package provides the Haskell cryptohash-md5 library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell cryptohash-md5.

source: Fast, pure and practical SHA-1 implementation
ca: Implementació ràpida, pura i pràctica de SHA-1

source: A practical incremental and one-pass, pure API to the <https://en.wikipedia.org/wiki/SHA-1 SHA-1 hash algorithm> (including <https://en.wikipedia.org/wiki/HMAC HMAC> support) with performance close to the fastest implementations available in other languages. The implementation is made in C with a haskell FFI wrapper that hides the C implementation. NOTE: This package has been forked off 'cryptohash-0.11.7' because the 'cryptohash' package has been deprecated and so this package continues to satisfy the need for a lightweight package providing the SHA1 hash algorithm without any dependencies on packages other than 'base' and 'bytestring'. Consequently, this package can be used as a drop-in replacement for 'cryptohash''s "Crypto.Hash.SHA1" module, though with a clearly smaller footprint.
ca: Una API pràctica incremental i d'un sol pas, pura a la <https://en.wikipedia.org/wiki/SHA-1 SHA-1 hash algorithm> (incloent-hi el suport <https://en.wikipedia.org/wiki/HMAC HMAC>) amb un rendiment proper a les implementacions més ràpides disponibles en altres idiomes. La implementació es realitza en C amb un embolcall FFI de haskell que amaga la implementació de C. NOTA: Aquest paquet s'ha desmarcat de «cryptohash-0.11.7» perquè el paquet «cryptohash» ha quedat obsolet i, per tant, aquest paquet continua satisfent la necessitat d'un paquet lleuger que proporcioni l'algorisme de resum SHA1 sense cap dependència de paquets diferents de «base» i «bytestring». En conseqüència, aquest paquet es pot utilitzar com a substitut de "Crypto" de "cryptohash".Mòdul Hash.SHA1", encara que amb una petjada clarament més petita.

source: Haskell cryptohash-sha1 library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell cryptohash-sha1

source: This package provides the Haskell cryptohash-sha1 library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell cryptohash-sha1.

source: Fast, pure and practical SHA-256 implementation
ca: Implementació ràpida, pura i pràctica de SHA-256

source: A practical incremental and one-pass, pure API to the [SHA-256 cryptographic hash algorithm](https://en.wikipedia.org/wiki/SHA-2) according to [FIPS 180-4](http://dx.doi.org/10.6028/NIST.FIPS.180-4) with performance close to the fastest implementations available in other languages. The core SHA-256 algorithm is implemented in C and is thus expected to be as fast as the standard [sha256sum(1) tool](https://linux.die.net/man/1/sha256sum); for instance, on an /Intel Core i7-3770/ at 3.40GHz this implementation can compute a SHA-256 hash over 230 MiB of data in under one second. (If, instead, you require a pure Haskell implementation and performance is secondary, please refer to the [SHA package](https://hackage.haskell.org/package/SHA).) Additionally, this package provides support for - HMAC-SHA-256: SHA-256-based [Hashed Message Authentication Codes](https://en.wikipedia.org/wiki/HMAC) (HMAC) - HKDF-SHA-256: [HMAC-SHA-256-based Key Derivation Function](https://en.wikipedia.org/wiki/HKDF) (HKDF) conforming to [RFC6234](https://tools.ietf.org/html/rfc6234), [RFC4231](https://tools.ietf.org/html/rfc4231), [RFC5869](https://tools.ietf.org/html/rfc5869), et al.. === Relationship to the 'cryptohash' package and its API This package has been originally a fork of 'cryptohash-0.11.7' because the 'cryptohash' package had been deprecated and so this package continues to satisfy the need for a lightweight package providing the SHA-256 hash algorithm without any dependencies on packages other than 'base' and 'bytestring'. The API exposed by 'cryptohash-sha256-0.11.*''s "Crypto.Hash.SHA256" module is guaranteed to remain a compatible superset of the API provided by the 'cryptohash-0.11.7''s module of the same name. Consequently, this package is designed to be used as a drop-in replacement for 'cryptohash-0.11.7''s "Crypto.Hash.SHA256" module, though with a [clearly smaller footprint by almost 3 orders of magnitude](https://www.reddit.com/r/haskell/comments/5lxv75/psa_please_use_unique_module_names_when_uploading/dbzegx3/).
ca: Una API pràctica incremental i d'una sola passada, pura a l'[algorisme criptogràfic de resum SHA-256](https://en.wikipedia.org/wiki/SHA-2) segons [FIPS 180-4](http://dx.doi.org/10.6028/NIST.FIPS.180-4) amb un rendiment proper a les implementacions més ràpides disponibles en altres idiomes. El nucli de l'algorisme SHA-256 s'implementa en C i, per tant, s'espera que sigui tan ràpid com l'eina estàndard [sha256sum(1)](https://linux.die.net/man/1/sha256sum); per exemple, en un /Intel Core i7-3770/ a 3.40 GHz aquesta implementació pot calcular un resum SHA-256 de més de 230 MiB de dades en menys d'un segon. (Si, en canvi, necessiteu una implementació i un rendiment de Haskell purs són secundaris, consulteu el [paquet SHA](https://hackage.haskell.org/package/SHA).) A més, aquest paquet proporciona suport per a - HMAC-SHA-256: [Codis d'autenticació de missatges desats](https://ca.wikipedia.org/wiki/HMAC) (HMAC) - HKDF-SHA-256: [Funció de derivació de claus basada en HMAC-SHA-256](https://ca.wikipedia.org/wiki/HKDF) (HKDF) S'ajusta a [RFC6234](https://tools.ietf.org/html/rfc6234), [RFC4231](https://tools.ietf.org/html/rfc5869), i altres. the Relació amb el paquet 'cryptohash' i la seva API Aquest paquet ha estat originalment una bifurcació de 'cryptohash-0.11.7' perquè el paquet 'cryptohash' havia quedat obsolet i, per tant, aquest paquet continua satisfent la necessitat d'un paquet lleuger que proporcioni l'algorisme hash SHA-256 sense cap dependència de paquets diferents de 'base' i 'bytestring'. L'API exposada per "Crypto" de 'cryptohash-sha256-0.11.*'.Es garanteix que el mòdul Hash.SHA256" és un superconjunt compatible de l'API proporcionada pel mòdul 'cryptohash-0.11.7' del mateix nom. En conseqüència, aquest paquet està dissenyat per a ser utilitzat com a substitut de "Crypto" de 'cryptohash-0.11.7'.Mòdul Hash.SHA256", encara que amb una [empremta clarament més petita en gairebé 3 ordres de magnitud](https://www.reddit.com/r/haskell/comments/5lxv75/psapleaseuseuniquemodulenameswhenuploading/dbzegx3/).

source: Haskell cryptohash-sha256 library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell cryptohash-sha256

source: This package provides the Haskell cryptohash-sha256 library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell cryptohash-sha256.

source: Cryptography Primitives sink
ca: Criptografia Moll de Primitives

source: A repository of cryptographic primitives. * Symmetric ciphers: AES, DES, 3DES, CAST5, Blowfish, Twofish, Camellia, RC4, Salsa, XSalsa, ChaCha. * Hash: SHA1, SHA2, SHA3, SHAKE, MD2, MD4, MD5, Keccak, Skein, Ripemd, Tiger, Whirlpool, Blake2 * MAC: HMAC, KMAC, Poly1305 * Asymmetric crypto: DSA, RSA, DH, ECDH, ECDSA, ECC, Curve25519, Curve448, Ed25519, Ed448 * Key Derivation Function: PBKDF2, Scrypt, HKDF, Argon2, BCrypt, BCryptPBKDF * Cryptographic Random generation: System Entropy, Deterministic Random Generator * Data related: Anti-Forensic Information Splitter (AFIS) If anything cryptographic related is missing from here, submit a pull request to have it added. This package strives to be a cryptographic kitchen sink that provides cryptography for everyone. Evaluate the security related to your requirements before using. Read "Crypto.Tutorial" for a quick start guide.
ca: Un repositori de primitives criptogràfiques. * Xifratges simètrics: AES, DES, 3DES, CAST5, Blowfish, Twofish, Camellia, RC4, Salsa, XSalsa, ChaCha. * Hash: SHA1, SHA2, SHA3, SHAKE, MD2, MD4, MD5, Keccak, Skein, Ripemd, Tiger, Whirlpool, Blake2 * MAC: HMAC, KMAC, Poly1305 * Xifrat asimètric: DSA, RSA, DH, ECDH, ECDSA, ECC, Curve25519, Curve448, Ed25519, Ed448 * Funció de derivació de clau: PBKDF2, Scrypt, HKDF, Argon2, BCrypt, BCryptPBKDF * Generació criptogràfica aleatòria: Entropia del sistema, Generador aleatòria determinista * Dades relacionades: Divisor d'informació anti-Forense (AFIS) Si falta alguna cosa criptogràfica relacionada des d'aquí, envieu una sol·licitud de pull per a afegir-la. Aquest paquet s'esforça per ser una pica criptogràfica de cuina que proporciona criptografia per a tothom. Avaluar la seguretat relacionada amb els teus requisits abans d'utilitzar. Llegeix "Crypto.Tutorial" per a una guia ràpida d'inici.

source: Cryptonite conduit
ca: Conduit de criptotonita

source: Conduit bridge for cryptonite For now only provide a conduit version for hash and hmac, but with contribution, this could provide cipher conduits too, and probably other things.
ca: Pont de conductes per a la criptonita De moment només proporciona una versió de conducte per a hash i hmac, però amb la seva contribució, això també podria proporcionar conductes de xifratge, i probablement altres coses.

source: Haskell cryptonite-conduit library development files
ca: Fitxers de desenvolupament de la biblioteca de criptonita-conduit de Haskell

source: This package provides the Haskell cryptonite-conduit library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de criptonita-conducte Haskell.

source: Haskell cryptonite library development files
ca: Fitxers de desenvolupament de la biblioteca de criptonització Haskell

source: This package provides the Haskell cryptonite library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de criptònies Haskell.

source: CSS parser and renderer
ca: Analitzador i renderitzador CSS

source: CSS parser and renderer.
ca: Analitzador i renderitzador CSS.

source: Haskell css-text library development files
ca: Fitxers de desenvolupament de la biblioteca css-text de Haskell

source: This package provides the Haskell css-text library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca css-text de Haskell.

source: CSV loader and dumper
ca: Carregador i moderador CSV

source: CSV loader and dumper This library parses and dumps documents that are formatted according to RFC 4180, "The common Format and MIME Type for Comma-Separated Values (CSV) Files". This format is used, among many other things, as a lingua franca for spreadsheets, and for certain web services.
ca: Carregador i moderador CSV Aquesta biblioteca analitza i bolca documents que es formaten segons RFC 4180, "El format comú i el tipus MIME per als fitxers de valors separats per comes (CSV)". Aquest format s'utilitza, entre moltes altres coses, com a lingua franca per a fulls de càlcul, i per a determinats serveis web.

source: Haskell csv library development files
ca: Fitxers de desenvolupament de la biblioteca csv Haskell

source: This package provides the Haskell csv library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca csv Haskell.

source: Simple functional ring type
ca: Tipus d'anell funcional simple

source: Simple functional bidirectional ring type. Given that the ring terminiology clashes with certain mathematical branches, we're using the term CList or CircularList instead.
ca: Tipus d'anell bidireccional funcional simple. Atès que la terminiologia de l'anell xoca amb certes branques matemàtiques, en el seu lloc estem utilitzant el terme Clist o CircularList.

source: Haskell data-clist library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell data-clist

source: This package provides the Haskell data-clist library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell data-clist.

source: A class for types with a default value
ca: Una classe per a tipus amb un valor predeterminat

source: A class for types with a default value.
ca: Una classe per a tipus amb un valor predeterminat.

source: Haskell data-default-class library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell data-default-class

source: This package provides the Haskell data-default-class library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell data-default-class.

source: Haskell data-default library development files
ca: Fitxers de desenvolupament de la biblioteca per defecte de dades Haskell

source: This package provides the Haskell data-default library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca per defecte de dades Haskell.

source: Default instances for types in containers
ca: Instàncies predeterminades per als tipus als contenidors

source: Default instances for types in containers.
ca: Instàncies predeterminades per als tipus en contenidors.

source: Haskell data-default-instances-containers library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell data-default-instances-containers

source: This package provides the Haskell data-default-instances-containers library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell data-default-instances-containers.

source: Default instances for types in dlist
ca: Instàncies predeterminades per als tipus a la llista

source: Default instances for types in dlist.
ca: Instàncies predeterminades per als tipus a la llista.

source: This package provides the Haskell data-default-instances-dlist library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell data-default-instances-dlist.

source: Default instances for types in old-locale
ca: Instàncies predeterminades per als tipus a la localització antiga

source: Default instances for types in old-locale.
ca: Instàncies predeterminades per als tipus a la localització antiga.

source: Haskell data-default-instances-old-locale library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell data-default-instances-old-locale

source: This package provides the Haskell data-default-instances-old-locale library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell data-default-instances-old-locale.

source: Fixpoint data types
ca: Tipus de dades del punt fix

source: Fixpoint types and recursion schemes. If you define your AST as fixpoint type, you get fold and unfold operations for free. Thanks for contribution to: Matej Kollar, Herbert Valerio Riedel.
ca: Tipus de punts fixos i esquemes de recursivitat. Si definiu el vostre AST com a tipus de punt fix, podreu plegar i desplegar operacions de forma gratuïta. Gràcies per la seva contribució a: Matej Kollar, Herbert Valerio Riedel.

source: Haskell data-fix library development files
ca: Fitxers de desenvolupament de la biblioteca de correcció de dades Haskell

source: This package provides the Haskell data-fix library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell data-fix.

source: A client library for the D-Bus IPC system
ca: Una biblioteca de client per al sistema IPC D-Bus
