Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: Haskell safe-exceptions library development files
ca: Fitxers de desenvolupament de la biblioteca amb excepcions segures del Haskell

source: This package provides the Haskell safe-exceptions library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'excepcions segures de Haskell.

source: Data encoding library
ca: Biblioteca de codificació de dades

source: Reasonably fast data encoding library.
ca: Biblioteca de codificació de dades raonablement ràpida.

source: Haskell sandi library development files
ca: Fitxers de desenvolupament de la biblioteca de sandi del Haskell

source: This package provides the Haskell sandi library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell sandi.

source: Numbers represented using scientific notation
ca: Nombres representats mitjançant notació científica

source: "Data.Scientific" provides the number type 'Scientific'. Scientific numbers are arbitrary precision and space efficient. They are represented using <http://en.wikipedia.org/wiki/Scientific_notation scientific notation>. The implementation uses a coefficient 'c :: 'Integer'' and a base-10 exponent 'e :: 'Int''. A scientific number corresponds to the 'Fractional' number: ''fromInteger' c * 10 '^^' e'. Note that since we're using an 'Int' to represent the exponent these numbers aren't truly arbitrary precision. I intend to change the type of the exponent to 'Integer' in a future release. The main application of 'Scientific' is to be used as the target of parsing arbitrary precision numbers coming from an untrusted source. The advantages over using 'Rational' for this are that: * A 'Scientific' is more efficient to construct. Rational numbers need to be constructed using '%' which has to compute the 'gcd' of the 'numerator' and 'denominator'. * 'Scientific' is safe against numbers with huge exponents. For example: '1e1000000000 :: 'Rational'' will fill up all space and crash your program. Scientific works as expected: >>> read "1e1000000000" :: Scientific 1.0e1000000000 * Also, the space usage of converting scientific numbers with huge exponents to ''Integral's' (like: 'Int') or ''RealFloat's' (like: 'Double' or 'Float') will always be bounded by the target type.
ca: "Dades.Scientific" proporciona el tipus de número 'Scientific'. Els nombres científics són de precisió arbitrària i eficients en l'espai. Es representen utilitzant <http://en.wikipedia.org/wiki/Scientificnotation scientific notation>. La implementació utilitza un coeficient 'c :: 'Integer' i un exponent base-10 'e : 'Int'. Un nombre científic correspon al nombre 'Fractional': ''fromInteger' c * 10 '.' e'. Tingueu en compte que, com que estem utilitzant una "Ment" per representar l'exponent, aquests nombres no són una precisió realment arbitrària. Tinc la intenció de canviar el tipus de l'exponent a "enter" en un llançament futur. L'aplicació principal de "científic" s'ha d'utilitzar com a objectiu d'analitzar nombres de precisió arbitraris procedents d'una font no fiable. Els avantatges sobre l'ús de 'Racional' per a això són: * Un 'científic' és més eficient de construir. Els nombres racionals s'han de construir utilitzant «%» que ha de calcular el «gcd» del «numerador» i el «denominador». * 'Científic' és segur contra números amb exponents enormes. Per exemple: '1e1000000000 :: 'Rational'' omplirà tot l'espai i bloquejarà el vostre programa. Treballs científics com s'espera: " read "1e1000000000" :: Scientific 1.0e1000000000 * A més, l'ús de l'espai de convertir nombres científics amb exponents enormes a ''Integral's' (com: 'Int') o ''RealFloat' (com: 'Double' o 'Float') sempre estarà limitat pel tipus d'objectiu.

source: Haskell scientific library development files
ca: Fitxers de desenvolupament de la biblioteca científica Haskell

source: This package provides the Haskell scientific library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca científica Haskell.

source: Stronger password hashing via sequential memory-hard functions
ca: Resum de contrasenya més fort a través de funcions seqüencials de memòria-dura

source: This package provides bindings to Colin Percival's `scrypt` implementation (<http://www.tarsnap.com/scrypt.html>). Scrypt is a key derivation function designed to be far more secure against hardware brute-force attacks than alternative functions such as PBKDF2 or bcrypt. Details of the scrypt key derivation function are given in a paper by Colin Percival, Stronger Key Derivation via Sequential Memory-Hard Functions: <http://www.tarsnap.com/scrypt/scrypt.pdf>.
ca: Aquest paquet proporciona enllaços a la implementació cryptscrypt). de Colin Percival (<http://www.tarsnap.com/scrypt.html>). Scrypt és una funció de derivació clau dissenyada per ser molt més segura contra atacs de força bruta de maquinari que funcions alternatives com PBKDF2 o bcrypt. Els detalls de la funció de derivació de la clau d'encriptatge es donen en un article de Colin Percival, Stronger Key Derivation via Sequential Memory-Hard Functions: <http://www.tarsnap.com/scrypt/scrypt.pdf>.

source: Haskell scrypt library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell scrypt library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell scrypt.

source: Abstraction to an auto scrubbing and const time eq, memory chunk
ca: Abstracció a una eq de temps de neteja automàtica i const, fragment de memòria

source: SecureMem is similar to ByteString, except that it provides a memory chunk that will be auto-scrubbed after it run out of scope.
ca: SecureMem és similar a ByteString, excepte que proporciona un fragment de memòria que serà rentat automàticament després que s'exhaureixi l'abast.

source: Haskell securemem library development files
ca: Fitxers de desenvolupament de la biblioteca securemem de Haskell

source: This package provides the Haskell securemem library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell securemem.

source: Align and Zip type-classes from the common Semialign ancestor
ca: Classes de tipus Alinea i Zip des de l'avantpassat comú de semialineació

source: The major use of 'These' of this is provided by the 'align' member of 'Semialign' class, representing a generalized notion of "zipping with padding" that combines structures without truncating to the size of the smaller input. It turns out that 'zip' operation fits well the 'Semialign' class, forming lattice-like structure.
ca: L'ús més important d'aquests és proporcionat pel membre 'alineat' de la classe 'Semialign', que representa una noció generalitzada de "comprimir amb farciment" que combina estructures sense truncar a la mida de l'entrada més petita. Resulta que l'operació «zip» s'adapta bé a la classe «Semialign», formant una estructura semblant a la xarxa.

source: Haskell semialign library development files
ca: Haskell semialinea els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell semialign library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de semialineació Haskell.

source: Semigroupoids: Category sans id
ca: Semigrupoides: Id de la categoria sans

source: Provides a wide array of (semi)groupoids and operations for working with them. A 'Semigroupoid' is a 'Category' without the requirement of identity arrows for every object in the category. A 'Category' is any 'Semigroupoid' for which the Yoneda lemma holds. When working with comonads you often have the '<*>' portion of an 'Applicative', but not the 'pure'. This was captured in Uustalu and Vene's "Essence of Dataflow Programming" in the form of the 'ComonadZip' class in the days before 'Applicative'. Apply provides a weaker invariant, but for the comonads used for data flow programming (found in the streams package), this invariant is preserved. Applicative function composition forms a semigroupoid. Similarly many structures are nearly a comonad, but not quite, for instance lists provide a reasonable 'extend' operation in the form of 'tails', but do not always contain a value. We describe the relationships between the type classes defined in this package and those from `base` (and some from `contravariant`) in the diagram below. Thick-bordered nodes correspond to type classes defined in this package; thin-bordered ones correspond to type classes from elsewhere. Solid edges indicate a subclass relationship that actually exists; dashed edges indicate a subclass relationship that /should/ exist, but currently doesn't. <<https://raw.githubusercontent.com/ekmett/semigroupoids/master/img/classes.svg Relationships among type classes from this package and others>> Apply, Bind, and Extend (not shown) give rise the Static, Kleisli and Cokleisli semigroupoids respectively. This lets us remove many of the restrictions from various monad transformers as in many cases the binding operation or '<*>' operation does not require them. Finally, to work with these weaker structures it is beneficial to have containers that can provide stronger guarantees about their contents, so versions of 'Traversable' and 'Foldable' that can be folded with just a 'Semigroup' are added.
ca: Proporciona una àmplia gamma de (semi)grupoides i operacions per treballar amb ells. Un semigrupoide és una «categoria» sense el requisit de fletxes d'identitat per a cada objecte de la categoria. Una «categoria» és qualsevol «semigrupoide» per al qual es manté el lema de Yoneda. Quan treballeu amb comonads, sovint teniu la porció «<*>» d'un «Aplicació», però no la «pura». Això va ser capturat a Uustalu i Vene "Essence of Dataflow Programming" en la forma de la classe 'ComonadZip' en els dies anteriors a 'Applicative'. Aplica proporciona un invariant més feble, però per a les comonades utilitzades per a la programació de flux de dades (trobats en el paquet de fluxos), aquest invariant es conserva. La composició de la funció aplicada forma un semigrupoide. De la mateixa manera, moltes estructures són gairebé una comonad, però no del tot, per exemple, les llistes proporcionen una operació raonable d'extensió en forma de "cues", però no sempre contenen un valor. Descrivim les relacions entre les classes de tipus definides en aquest paquet i les de .base. (i algunes de .contravariant.) en el diagrama de sota. Els nodes amb vores gruixudes corresponen a classes de tipus definides en aquest paquet; els amb vores fines corresponen a classes de tipus d'altres llocs. Les arestes sòlides indiquen una relació de subclasse que realment existeix; les arestes discontínues indiquen una relació de subclasse que /should/ existeix, però actualment no existeix. <<https://raw.githubusercontent.com/ekmett/semigroupoids/master/img/classes.svg Relationships among type classes from this package and others> Aplica, Enquadra i Estén (no es mostra) donen lloc als semigrups Static, Kleisli i Cokleisli respectivament. Això ens permet eliminar moltes de les restriccions de diversos transformadors de mònada, ja que en molts casos l'operació de vinculació o l'operació '<*>' no les requereix. Finalment, per treballar amb aquestes estructures més febles és beneficiós disposar de contenidors que puguin oferir garanties més sòlides sobre el seu contingut, per la qual cosa s'afegeixen versions de 'Traversable' i 'Foldable' que es poden plegar amb només un 'Semigroup'.

source: Haskell semigroupoids library development files
ca: Fitxers de desenvolupament de la biblioteca de semigrups Haskell

source: This package provides the Haskell semigroupoids library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell semigroupoids.

source: Anything that associates
ca: Qualsevol cosa que s'associï

source: In mathematics, a semigroup is an algebraic structure consisting of a set together with an associative binary operation. A semigroup generalizes a monoid in that there might not exist an identity element. It also (originally) generalized a group (a monoid with all inverses) to a type where every element did not have to have an inverse, thus the name semigroup.
ca: En matemàtiques, un semigrup és una estructura algebraica que consisteix en un conjunt juntament amb una operació binària associativa. Un semigrup generalitza un monoide en el sentit que pot ser que no existeixi un element d'identitat. També va generalitzar (originalment) un grup (un monoide amb tots els inversos) a un tipus on cada element no havia de tenir un invers, per tant el nom semigrup.

source: Haskell semigroups library development files
ca: Fitxers de desenvolupament de la biblioteca de semigrups Haskell

source: This package provides the Haskell semigroups library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de semigrups Haskell.

source: A binary serialisation library for Haskell values
ca: Una biblioteca de serialització binària per als valors de Haskell

source: This package (formerly 'binary-serialise-cbor') provides pure, efficient serialization of Haskell values directly into 'ByteString's for storage or transmission purposes. By providing a set of type class instances, you can also serialise any custom data type you have as well. The underlying binary format used is the 'Concise Binary Object Representation', or CBOR, specified in RFC 7049. As a result, serialised Haskell values have implicit structure outside of the Haskell program itself, meaning they can be inspected or analyzed without custom tools. An implementation of the standard bijection between CBOR and JSON is provided by the [cborg-json](/package/cborg-json) package. Also see [cbor-tool](/package/cbor-tool) for a convenient command-line utility for working with CBOR data.
ca: Aquest paquet (anteriorment 'binary-serialise-cbor') proporciona una serialització pura i eficient dels valors de Haskell directament a 'ByteString' per a finalitats d'emmagatzematge o transmissió. En proporcionar un conjunt d'instàncies de classe de tipus, també podeu serialitzar qualsevol tipus de dades personalitzades que tingueu. El format binari subjacent utilitzat és la 'Concise Binary Object Representation', o CBOR, especificat en RFC 7049. Com a resultat, els valors Haskell serialitzats tenen una estructura implícita fora del propi programa Haskell, el que significa que es poden inspeccionar o analitzar sense eines personalitzades. Una implementació de la bijecció estàndard entre CBOR i JSON és proporcionada pel paquet [cborg-json](/package/cborg-json). Vegeu també l'[cbor-tool](/package/cbor-tool) per a una utilitat de línia d'ordres convenient per a treballar amb les dades del CBOR.

source: Haskell serialise library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell serialise

source: This package provides the Haskell serialise library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell serialise.

source: A family of combinators for defining webservices APIs
ca: Una família de combinadors per definir les API de serveis web

source: A family of combinators for defining webservices APIs and serving them You can learn about the basics in the <http://docs.servant.dev/en/stable/tutorial/index.html tutorial>. <https://github.com/haskell-servant/servant/blob/master/servant/CHANGELOG.md CHANGELOG>.
ca: Una família de combinadors per definir les API de serveis web i servir-les Podeu aprendre sobre els conceptes bàsics en el <http://docs.servant.dev/en/stable/tutorial/index.html tutorial>. <https://github.com/haskell-servant/servant/blob/master/servant/CHANGELOG.md CHANGELOG>.

source: Automatic derivation of querying functions for servant
ca: Derivació automàtica de funcions de consulta per al servidor

source: This library lets you derive automatically Haskell functions that let you query each endpoint of a <http://hackage.haskell.org/package/servant servant> webservice. See <http://docs.servant.dev/en/stable/tutorial/Client.html the client section of the tutorial>. <https://github.com/haskell-servant/servant/blob/master/servant-client/CHANGELOG.md CHANGELOG>.
ca: Aquesta biblioteca us permet derivar automàticament funcions Haskell que us permeten consultar cada extrem d'un servei web <http://hackage.haskell.org/package/servant servant>. Vegeu <http://docs.servant.dev/en/stable/tutorial/Client.html the client section of the tutorial>. <https://github.com/haskell-servant/servant/blob/master/servant-client/CHANGELOG.md CHANGELOG>.

source: Core functionality and class for client function generation for servant APIs
ca: Funcionalitat bàsica i classe per a la generació de funcions del client per a les API del servidor

source: This library provides backend-agnostic generation of client functions. For more information, see the README.
ca: Aquesta biblioteca proporciona una generació agnòstica del dorsal de les funcions del client. Per a més informació, consulteu el README.

source: Haskell servant-client-core library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell servant-client-core

source: This package provides the Haskell servant-client-core library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell servant-client-core.

source: Haskell servant-client library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell servant-client

source: This package provides the Haskell servant-client library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell servant-client.

source: Haskell servant library development files
ca: Fitxers de desenvolupament de la biblioteca del servidor Haskell

source: This package provides the Haskell servant library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell servant.

source: A family of combinators for defining webservices APIs and serving them
ca: Una família de combinadors per definir les API de serveis web i servir-les

source: A family of combinators for defining webservices APIs and serving them You can learn about the basics in the <http://docs.servant.dev/en/stable/tutorial/index.html tutorial>. <https://github.com/haskell-servant/servant/blob/master/servant-server/example/greet.hs Here> is a runnable example, with comments, that defines a dummy API and implements a webserver that serves this API, using this package. <https://github.com/haskell-servant/servant/blob/master/servant-server/CHANGELOG.md CHANGELOG>.
ca: Una família de combinadors per definir les API de serveis web i servir-les Podeu aprendre sobre els conceptes bàsics en el <http://docs.servant.dev/en/stable/tutorial/index.html tutorial>. <https://github.com/haskell-servant/servant/blob/master/servant-server/example/greet.hs Here> és un exemple executable, amb comentaris, que defineix una API fictícia i implementa un servidor web que serveix aquesta API, utilitzant aquest paquet. <https://github.com/haskell-servant/servant/blob/master/servant-server/CHANGELOG.md CHANGELOG>.

source: Haskell servant-server library development files
ca: Fitxers de desenvolupament de la biblioteca del servidor Haskell

source: This package provides the Haskell servant-server library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de servidors de Haskell.

source: A cross-platform library for setting environment variables
ca: Una biblioteca multiplataforma per establir les variables d'entorn

source: A cross-platform library for setting environment variables Note: Since 'base-4.7.0.0' the functions 'setEnv' and 'unsetEnv' are provided by 'System.Environment'. 'System.SetEnv' merily re-exports those functions when built with 'base >= 4.7'.
ca: Una biblioteca multiplataforma per establir les variables d'entorn Nota: Des de 'base-4.7.0.0' les funcions 'setEnv' i 'unsetEnv' són proporcionades per 'System.Medi ambient". "Sistema.SetEnv' reexporta merly aquestes funcions quan es construeix amb 'base . 4.7'.

source: Haskell setenv library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell setenv

source: This package provides the Haskell setenv library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell setenv.

source: Haskell bindings to setlocale
ca: Vinculacions de Haskell a «setlocale»

source: Haskell bindings to setlocale.
ca: Vinculacions de Haskell a «setlocale».

source: Haskell setlocale library development files
ca: Fitxers de desenvolupament de la biblioteca «setlocale» del Haskell

source: This package provides the Haskell setlocale library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca «setlocale» de Haskell.

source: A toolkit for making compile-time interpolated templates
ca: Un joc d'eines per fer plantilles interpolades en temps de compilació

source: Shakespeare is a family of type-safe, efficient template languages. Shakespeare templates are expanded at compile-time, ensuring that all interpolated variables are in scope. Variables are interpolated according to their type through a typeclass. Shakespeare templates can be used inline with a quasi-quoter or in an external file. Note there is no dependency on haskell-src-extras. Instead Shakespeare believes logic should stay out of templates and has its own minimal Haskell parser. Packages that use this: xml-hamlet Please see the documentation at <http://www.yesodweb.com/book/shakespearean-templates> for more details.
ca: Shakespeare és una família de llenguatges de plantilla segurs i eficients. Les plantilles de Shakespeare s'expandeixen en temps de compilació, assegurant que totes les variables interpolades tenen abast. Les variables s'interpolen segons el seu tipus a través d'una classe de tipus. Les plantilles de Shakespeare es poden utilitzar en línia amb una quasi-cometes o en un fitxer extern. Nota: no hi ha dependència de haskell-src-extras. En canvi, Shakespeare creu que la lògica hauria de mantenir-se fora de les plantilles i té el seu propi analitzador Haskell mínim. Paquets que utilitzen això: xml-hamlet Per a més detalls, vegeu la documentació <http://www.yesodweb.com/book/shakespearean-templates>.

source: Haskell shakespeare library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell shakespeare

source: This package provides the Haskell shakespeare library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell shakespeare.

source: Shell-like (systems) programming in Haskell
ca: Programació similar a Shell (sistemes) a Haskell
