Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: QuickCheck is a library for random testing of program properties. The programmer provides a specification of the program, in the form of properties which functions should satisfy, and QuickCheck then tests that the properties hold in a large number of randomly generated cases. Specifications are expressed in Haskell, using combinators provided by QuickCheck. QuickCheck provides combinators to define properties, observe the distribution of test data, and define test data generators. Most of QuickCheck's functionality is exported by the main "Test.QuickCheck" module. The main exception is the monadic property testing library in "Test.QuickCheck.Monadic". If you are new to QuickCheck, you can try looking at the following resources: * The <http://www.cse.chalmers.se/~rjmh/QuickCheck/manual.html official QuickCheck manual>. It's a bit out-of-date in some details and doesn't cover newer QuickCheck features, but is still full of good advice. * <https://begriffs.com/posts/2017-01-14-design-use-quickcheck.html>, a detailed tutorial written by a user of QuickCheck. The <https://hackage.haskell.org/package/quickcheck-instances quickcheck-instances> companion package provides instances for types in Haskell Platform packages at the cost of additional dependencies.
ca: QuickCheck és una biblioteca per a proves aleatòries de les propietats del programa. El programador proporciona una especificació del programa, en forma de propietats que les funcions haurien de satisfer, i QuickCheck després prova que les propietats es mantenen en un gran nombre de casos generats aleatòriament. Les especificacions s'expressen en Haskell, utilitzant combinadors proporcionats per QuickCheck. QuickCheck proporciona combinadors per definir propietats, observar la distribució de dades de prova i definir generadors de dades de prova. La major part de la funcionalitat de QuickCheck és exportada pel mòdul principal "Test.QuickCheck". L'excepció principal és la biblioteca de proves de propietats monàtiques a "Test.QuickCheck.Monadic». Si ets nou a QuickCheck, pots provar de buscar els següents recursos: * El <http://www.cse.chalmers.se/rjmh/QuickCheck/manual.html official QuickCheck manual>. Està una mica desfasat en alguns detalls i no cobreix les noves funcions de QuickCheck, però encara està ple de bons consells. * <https://begriffs.com/posts/2017-01-14-design-use-quickcheck.html>, un tutorial detallat escrit per un usuari de QuickCheck. El paquet d'acompanyants <https://hackage.haskell.org/package/quickcheck-instances quickcheck-instances> proporciona instàncies per als tipus en els paquets de la Plataforma Haskell a costa de dependències addicionals.

source: Haskell QuickCheck library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell QuickCheck

source: This package provides the Haskell QuickCheck library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell QuickCheck.

source: Implementation of RSA, using the padding schemes of PKCS#1 v2.1
ca: Implementació de RSA, utilitzant els esquemes de farciment de PKCS11 v2.1

source: This library implements the RSA encryption and signature algorithms for arbitrarily-sized ByteStrings. While the implementations work, they are not necessarily the fastest ones on the planet. Particularly key generation. The algorithms included are based of RFC 3447, or the Public-Key Cryptography Standard for RSA, version 2.1 (a.k.a, PKCS#1 v2.1).
ca: Aquesta biblioteca implementa els algorismes de xifratge i signatura RSA per a ByteStrings de mida arbitrària. Tot i que les implementacions funcionen, no són necessàriament les més ràpides del planeta. Generació especialment clau. Els algorismes inclosos es basen en RFC 3447, o l'estàndard de criptografia de clau pública per a RSA, versió 2.1 (també conegut com a PKCS11 v2.1).

source: Haskell RSA library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell RSA

source: This package provides the Haskell RSA library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell RSA.

source: Binding to libSDL
ca: Vinculació a la libSDL

source: Simple DirectMedia Layer (libSDL) is a cross-platform multimedia library designed to provide low level access to audio, keyboard, mouse, joystick, 3D hardware via OpenGL, and 2D video framebuffer. It is used by MPEG playback software, emulators, and many popular games, including the award winning Linux port of "Civilization: Call To Power.".
ca: Simple DirectMedia Layer (libSDL) és una biblioteca multimèdia multiplataforma dissenyada per proporcionar accés de baix nivell a àudio, teclat, ratolí, joystick, maquinari 3D via OpenGL, i framebuffer de vídeo 2D. És utilitzat per programari de reproducció MPEG, emuladors, i molts jocs populars, incloent el premi guanyador del port de Linux de "Civilization: Call To Power.".

source: Haskell SDL library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell SDL

source: This package provides the Haskell SDL library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell SDL.

source: Binding to libSDL_image
ca: Vinculació a libSDLimage

source: SDL_image is an image file loading library. It loads images as SDL surfaces, and supports the following formats: BMP, GIF, JPEG, LBM, PCX, PNG, PNM, TGA, TIFF, XCF, XPM, XV.
ca: SDLimage és una biblioteca de càrrega de fitxers d'imatge. Carrega imatges com a superfícies SDL, i suporta els següents formats: BMP, GIF, JPEG, LBM, PCX, PNG, PNM, TGA, TIFF, XCF, XPM, XV.

source: Haskell SDL-image library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell SDL-image

source: This package provides the Haskell SDL-image library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell SDL-image.

source: Binding to libSDL_mixer
ca: Vinculació a libSDLmixer

source: SDL_mixer is a sample multi-channel audio mixer library. It supports any number of simultaneously playing channels of 16 bit stereo audio, plus a single channel of music, mixed by the popular MikMod MOD, Timidity MIDI, Ogg Vorbis, and SMPEG MP3 libraries.
ca: El SDLmixer és una biblioteca de mescla d'àudio multicanal de mostra. És compatible amb qualsevol nombre de canals de reproducció simultània d'àudio estèreo de 16 bits, a més d'un únic canal de música, barrejat per les populars biblioteques MikMod MOD, Timidity MIDI, Ogg Vorbis i SMPEG MP3.

source: Haskell SDL-mixer library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell SDL-mixer

source: This package provides the Haskell SDL-mixer library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell SDL-mixer.

source: Implementations of the SHA suite of message digest functions
ca: Implementacions del conjunt SHA de funcions de resum de missatges

source: This library implements the SHA suite of message digest functions, according to NIST FIPS 180-2 (with the SHA-224 addendum), as well as the SHA-based HMAC routines. The functions have been tested against most of the NIST and RFC test vectors for the various functions. While some attention has been paid to performance, these do not presently reach the speed of well-tuned libraries, like OpenSSL.
ca: Aquesta biblioteca implementa el conjunt SHA de funcions de resum de missatges, d'acord amb NIST FIPS 180-2 (amb l'addició SHA-224), així com les rutines HMAC basades en SHA. Les funcions s'han provat amb la majoria dels vectors de prova NIST i RFC per a les diverses funcions. Tot i que s'ha prestat una mica d'atenció al rendiment, actualment no arriben a la velocitat de les biblioteques ben afinades, com OpenSSL.

source: Haskell SHA library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell SHA

source: This package provides the Haskell SHA library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell SHA.

source: Much safer replacement for QSemN, QSem, and SampleVar
ca: Substitució molt més segura per a QSemN, QSem i SampleVar

source: This provides a much safer semaphore than the QSem, QSemN, SampleVar in base. Those base modules are not exception safe and can be broken by killThread. See <https://github.com/ChrisKuklewicz/SafeSemaphore> for more details.
ca: Això proporciona un semàfor molt més segur que el QSem, QSemN, SampleVar a la base. Aquests mòduls de base no són segurs d'excepció i es poden trencar mitjançant killThread. Vegeu <https://github.com/ChrisKuklewicz/SafeSemaphore> per a més detalls.

source: Haskell SafeSemaphore library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell SafeSemaphore

source: This package provides the Haskell SafeSemaphore library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell SafeSemaphore.

source: State variables
ca: Variables d'estat

source: This package contains state variables, which are references in the IO monad, like IORefs or parts of the OpenGL state.
ca: Aquest paquet conté variables d'estat, que són referències a la mònada d'E/S, com IORefs o parts de l'estat OpenGL.

source: Haskell StateVar library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell StateVar

source: This package provides the Haskell StateVar library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell StateVar.

source: It provides the functionality like unix "uniq" utility
ca: Proporciona la funcionalitat com la utilitat unix "uniq"

source: Library provides the functions to find unique and duplicate elements in the list.
ca: La biblioteca proporciona les funcions per trobar elements únics i duplicats a la llista.

source: Haskell Unique library development files
ca: Haskell Fitxers únics de desenvolupament de biblioteca

source: This package provides the Haskell Unique library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell Unique.

source: A binding to the X11 graphics library
ca: Una vinculació a la biblioteca de gràfics X11

source: A Haskell binding to the X11 graphics library. The binding is a direct translation of the C binding; for documentation of these calls, refer to "The Xlib Programming Manual", available online at <http://tronche.com/gui/x/xlib/>.
ca: Una vinculació Haskell a la biblioteca de gràfics X11. L'enquadernació és una traducció directa de l'enquadernació C; per a la documentació d'aquestes crides, consulteu "El manual de programació Xlib", disponible en línia a <http://tronche.com/gui/x/xlib/>.

source: Haskell X11 library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell X11

source: This package provides the Haskell X11 library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell X11.

source: Bindings to the Xft and some Xrender parts
ca: Vinculacions a les parts Xft i Xrender

source: A Haskell bindings to the X Font library. With it, Haskell X11 applications can access high quality font renderings and provide fonts with anti-aliasing and subpixel rendering. The bindings also provide minimal bindings to Xrender parts.
ca: Un Haskell vincula a la biblioteca X Font. Amb ell, les aplicacions Haskell X11 poden accedir a renderitzacions de tipus de lletra d'alta qualitat i proporcionar fonts amb antialiàsing i renderització de subpíxels. Les vinculacions també proporcionen vinculacions mínimes a les parts de Xrender.

source: Haskell X11-xft library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell X11-xft

source: This package provides the Haskell X11-xft library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell X11-xft.

source: Abstract, parameterized interface to mutable Deques
ca: Resum, interfície parametritzada per a preguntes mutables

source: An abstract interface to highly-parameterizable queues/deques. Background: There exists a feature space for queues that extends between: * simple, single-ended, non-concurrent, bounded queues * double-ended, threadsafe, growable queues ... with important points inbetween (such as the queues used for work-stealing). This package includes an interface for Deques that allows the programmer to use a single API for all of the above, while using the type-system to select an efficient implementation given the requirements (using type families). This package also includes a simple reference implementation based on 'IORef' and "Data.Sequence".
ca: Una interfície abstracta a cues/deques altament parametritzables. Fons: Hi ha un espai de característiques per a les cues que s'estén entre: * cues simples, d'un sol extrem, no concurrents i fitades * cues de doble terminació, sense fils, cultivables ... amb punts importants entremig (com les cues usades per a la feina). Aquest paquet inclou una interfície per a Deques que permet al programador utilitzar una única API per a tot l'anterior, mentre utilitza el sistema de tipus per seleccionar una implementació eficient donades les necessitats (utilitzant famílies de tipus). Aquest paquet també inclou una implementació de referència senzilla basada en 'IORef' i "Data.Seqüència».

source: Haskell abstract-deque library development files
ca: Fitxers de desenvolupament de la biblioteca abstract-deque de Haskell

source: This package provides the Haskell abstract-deque library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell abstract-deque.

source: Type classes generalizing the functionality of the 'monad-par' library
ca: Tipus de classes generalitzant la funcionalitat de la biblioteca 'monad-par'

source: The 'Par' monad offers a parallel programming API based on dataflow programming. To use the `Par` monad, install the 'monad-par' package, which includes this package as a dependency. This package is an abstract interface only. It provides a number of type clasess, but not an implementation. The type classes separate different levels of 'Par' functionality. See the "Control.Monad.Par.Class" module for more details.
ca: La mònada 'Par' ofereix una API de programació paral·lela basada en la programació de flux de dades. Per a utilitzar la monMònada Par., instal·leu el paquet 'monad-par', que inclou aquest paquet com a dependència. Aquest paquet és només una interfície abstracta. Proporciona una sèrie de tipus de clasess, però no una implementació. Les classes de tipus separen diferents nivells de la funcionalitat «Par». Vegeu el "Control.Monad.Par.Mòdul Classe" per a més detalls.

source: Haskell abstract-par library development files
ca: Fitxers de desenvolupament de la biblioteca abstract-par de Haskell

source: This package provides the Haskell abstract-par library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell abstract-par.

source: Adjunctions and representable functors
ca: Adjuncions i functors representables

source: Adjunctions and representable functors.
ca: Adjuncions i functors representables.

source: Haskell adjunctions library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell adjunts

source: This package provides the Haskell adjunctions library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell adjunctions.

source: Fast JSON parsing and encoding
ca: Anàlisi i codificació JSON ràpida

source: A JSON parsing and encoding library optimized for ease of use and high performance. To get started, see the documentation for the 'Data.Aeson' module below. (A note on naming: in Greek mythology, Aeson was the father of Jason.).
ca: Una biblioteca d'anàlisi i codificació JSON optimitzada per a facilitat d'ús i alt rendiment. Per començar, consulteu la documentació de les dades.Mòdul d'Aeson a sota. (Una nota sobre el nom: a la mitologia grega, Aeson era el pare de Jason.).

source: Haskell aeson library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell aeson

source: This package provides the Haskell aeson library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell aeson.

source: JSON pretty-printing library and command-line tool
ca: Biblioteca JSON d'impressió bonica i eina de línia d'ordres

source: A JSON pretty-printing library compatible with aeson as well as a command-line tool to improve readabilty of streams of JSON data. The /library/ provides the function "encodePretty". It is a drop-in replacement for aeson's "encode" function, producing JSON-ByteStrings for human readers. The /command-line tool/ reads JSON from stdin and writes prettified JSON to stdout. It also offers a complementary "compact"-mode, essentially the opposite of pretty-printing. If you specify '-flib-only' like this > cabal install -flib-only aeson-pretty the command-line tool will NOT be installed.
ca: Una biblioteca JSON d'impressió bonica compatible amb aeson, així com una eina de línia d'ordres per millorar la readaptació dels fluxos de dades JSON. La /library/ proporciona la funció "encodePretty". És un substitut de la funció de "codi" d'eson, produint JSON-ByteStrings per a lectors humans. L'eina /command-line/ llegeix JSON des de stdin i escriu JSON pretificat a stdout. També ofereix un mode "compacte" complementari, essencialment l'oposat a la impressió bonica. Si especifiqueu «-flib-only» com aquest cabal install -flib-only aeson-pretty NO s'instal·larà l'eina de la línia d'ordres.

source: Haskell aeson-pretty library development files
ca: Fitxers de desenvolupament de la biblioteca Aeson-pretty de Haskell

source: This package provides the Haskell aeson-pretty library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell aeson-pretty.

source: Output any Aeson value as YAML (pure Haskell library)
ca: Sortida de qualsevol valor d'Aeson com a YAML (biblioteca pura Haskell)

source: This library exposes functions for encoding any Aeson value as YAML. There is also support for encoding multiple values into YAML "documents". This library is pure Haskell, and does not depend on C FFI with libyaml. It is also licensed under the BSD3 license.
ca: Aquesta biblioteca exposa funcions per a codificar qualsevol valor d'Aeson com YAML. També hi ha suport per a codificar múltiples valors en «documents» YAML. Aquesta biblioteca és pura Haskell, i no depèn de C FFI amb libyaml. També està llicenciat sota la llicència BSD3.

source: Haskell aeson-yaml library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell aeson-yaml

source: This package provides the Haskell aeson-yaml library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell aeson-yaml.

source: A library for algebraic graph construction and transformation
ca: Una biblioteca per a la construcció i transformació de grafs algebraics
