Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: This package transparently supplies the "GHC.ByteOrder" API as provided in 'base-4.11.0.0' for legacy GHC releases which didn't provide it yet (i.e. GHC 7.0 through GHC 8.2). This release reexports [GHC.ByteOrder from base](https://hackage.haskell.org/package/base-4.11.1.0/docs/GHC-ByteOrder.html) via Cabal's 'reexported-modules' mechanism. For GHC 8.2 and earlier a different release of 'ghc-byteorder' (with the same minor version) is eligible by the Cabal solver with a backported "GHC.ByteOrder" module. In order to use this compatibility layer, simply declare a dependency on 'ghc-byteorder' in your '.cabal' package description like so > build-depends: ghc-byteorder ^>= 4.11.0.0 And your code will be able to access this respective API version of the module via the usual > import GHC.ByteOrder mechanism.
ca: Aquest paquet subministra de manera transparent el "GHC.ByteOrder" API proporcionada a 'base-4.11.0.0' per als llançaments antics de GHC que encara no ho han proporcionat (és a dir, GHC 7.0 a GHC 8.2). Aquest llançament reexporta [GHC.ByteOrder de base](https://hackage.haskell.org/package/base-4.11.1.0/docs/GHC-ByteOrder.html) mitjançant el mecanisme «reexported-modules» de Cabal. Per al GHC 8.2 i anteriors un llançament diferent de 'ghc-byteorder' (amb la mateixa versió menor) és elegible pel solucionador Cabal amb un backported "GHC.Mòdul ByteOrder". Per a utilitzar aquesta capa de compatibilitat, simplement declareu una dependència de «ghc-byteorder» a la descripció del paquet «.cabal» així : build-depends: ghc-byteorder : 4.11.0.0 I el vostre codi podrà accedir a aquesta versió respectiva de l'API del mòdul a través de l'habitual . importar GHC.ByteOrder mecanisme.

source: Haskell ghc-byteorder library development files
ca: Fitxers de desenvolupament de la biblioteca ghc-byteorder de Haskell

source: This package provides the Haskell ghc-byteorder library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca ghc-byteorder de Haskell.

source: Haskell ghc-compact library
ca: Biblioteca Haskell ghc-compact

source: This package provides the Haskell ghc-compact library.
ca: Aquest paquet proporciona la biblioteca Haskell ghc-compact.

source: Haskell ghc-compact library development files
ca: Fitxers de desenvolupament de biblioteques compatibles amb ghc de Haskell

source: This package provides the Haskell ghc-compact library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell ghc-compact.

source: Haskell ghc library development files
ca: Fitxers de desenvolupament de la biblioteca ghc de Haskell

source: This package provides the Haskell ghc library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca ghc Haskell.

source: Haskell ghc-heap library
ca: Biblioteca Haskell ghc-heap

source: This package provides the Haskell ghc-heap library.
ca: Aquest paquet proporciona la biblioteca Haskell ghc-heap.

source: Haskell ghc-heap library development files
ca: Fitxers de desenvolupament de la biblioteca ghc-heap de Haskell

source: This package provides the Haskell ghc-heap library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca ghc-heap de Haskell.

source: Algorithms on GHC parse trees
ca: Algorismes en arbres d'anàlisi de GHC

source: Algorithms on GHC parse trees.
ca: Algorismes en arbres d'anàlisi de GHC.

source: Haskell ghc-lib-parser-ex library development files
ca: Haskell ghc-lib-parser-ex fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell ghc-lib-parser-ex library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca ghc-lib-parser-ex de Haskell.

source: Knowledge of GHC's installation directories
ca: Coneixement dels directoris d'instal·lació de GHC

source: Knowledge of GHC's installation directories.
ca: Coneixement dels directoris d'instal·lació de GHC.

source: Haskell ghc-paths library development files
ca: Fitxers de desenvolupament de la biblioteca ghc-paths de Haskell

source: This package provides the Haskell ghc-paths library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca ghc-paths de Haskell.

source: Haskell ghci library
ca: Biblioteca Haskell ghci

source: This package provides the Haskell ghci library.
ca: Aquest paquet proporciona la biblioteca Haskell ghci.

source: Haskell ghci library development files
ca: Fitxers de desenvolupament de la biblioteca ghci de Haskell

source: This package provides the Haskell ghci library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca ghci de Haskell.

source: Haskell ghcid library
ca: Biblioteca Haskell ghcid

source: This package provides the Haskell ghcid shared library.
ca: Aquest paquet proporciona la biblioteca compartida Haskell ghcid.

source: Haskell ghcid library development files
ca: Fitxers de desenvolupament de la biblioteca ghcid de Haskell

source: This package provides the Haskell ghcid library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell ghcid.

source: Git-lfs protocol
ca: Protocol Git-lfs

source: An implementation of the git-lfs protocol.
ca: Una implementació del protocol git-lfs.

source: Haskell git-lfs library development files
ca: Fitxers de desenvolupament de la biblioteca git-lfs de Haskell

source: This package provides the Haskell git-lfs library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca git-lfs de Haskell.

source: Compile git revision info into Haskell projects
ca: Compila la informació de revisió de git als projectes de Haskell

source: Compile git revision info into Haskell projects.
ca: Compila la informació de revisió de git als projectes Haskell.

source: Haskell githash library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell githash

source: This package provides the Haskell githash library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell githash.

source: Some handy Template Haskell splices for including the current git hash and branch in the code of your project. Useful for including in panic messages, '--version' output, or diagnostic info for more informative bug reports.
ca: Algunes plantilles útils de splices Haskell per a incloure el hash i la branca git actual en el codi del vostre projecte. Útil per incloure en missatges de pànic, sortida «--version», o informació de diagnòstic per a informes d'error més informatius.

source: Haskell gitrev library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell gitrev

source: This package provides the Haskell gitrev library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell gitrev.

source: Gray code encoder/decoder
ca: Codificador/descodificador de codi gris

source: Gray code is a binary numeral system where two successive numbers differ in only one bit. This package allows to convert numbers to one of the possible Gray codes and back. Two binary representations of a number are supported: '[Bool]' and types of 'FiniteBits' type class. 'FiniteBits' is the default implementation.
ca: El codi de gris és un sistema de numeració binària on dos nombres successius difereixen en només un bit. Aquest paquet permet convertir números a un dels possibles codis de gris i tornar. S'admeten dues representacions binàries d'un nombre: «[Bool]» i tipus de classe de tipus «FiniteBits». «FiniteBits» és la implementació per defecte.

source: Haskell gray-code library development files
ca: Fitxers de desenvolupament de la biblioteca de codi gris de Haskell

source: This package provides the Haskell gray-code library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de codi gris de Haskell.

source: Groups
ca: Grups

source: A group is a monoid with invertibility.
ca: Un grup és un monoide amb invertibilitat.

source: Haskell groups library development files
ca: Fitxers de desenvolupament de la biblioteca de grups Haskell

source: This package provides the Haskell groups library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de grups Haskell.

source: Hackage security library
ca: Biblioteca de seguretat Hackage

source: The hackage security library provides both server and client utilities for securing the Hackage package server (<http://hackage.haskell.org/>). It is based on The Update Framework (<http://theupdateframework.com/>), a set of recommendations developed by security researchers at various universities in the US as well as developers on the Tor project (<https://www.torproject.org/>). The current implementation supports only index signing, thereby enabling untrusted mirrors. It does not yet provide facilities for author package signing. The library has two main entry points: "Hackage.Security.Client" is the main entry point for clients (the typical example being 'cabal'), and "Hackage.Security.Server" is the main entry point for servers (the typical example being 'hackage-server').
ca: La biblioteca de seguretat de hackage proporciona utilitats tant del servidor com del client per assegurar el servidor de paquets Hackage (<http://hackage.haskell.org/>). Es basa en The Update Framework (<http://theupdateframework.com/>), un conjunt de recomanacions desenvolupades per investigadors de seguretat de diverses universitats dels Estats Units, així com desenvolupadors del projecte Tor (<https://www.torproject.org/>). La implementació actual només admet la signatura de l'índex, habilitant d'aquesta manera miralls no de confiança. Encara no proporciona facilitats per a la signatura de paquets d'autors. La biblioteca té dos punts d'entrada principals: "Hackage.Seguretat.Client" és el principal punt d'entrada per als clients (l'exemple típic és 'cabal'), i "Hackage.Seguretat.Servidor" és el principal punt d'entrada per als servidors (l'exemple típic és 'hackage-server').

source: Haskell hackage-security library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hackage-security

source: This package provides the Haskell hackage-security library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hackage-security.

source: Library exposing some functionality of Haddock
ca: Biblioteca exposant algunes funcionalitats de Haddock

source: Haddock is a documentation-generation tool for Haskell libraries. These modules expose some functionality of it without pulling in the GHC dependency. Please note that the API is likely to change so be sure to specify upper bounds in your projects. For interacting with Haddock itself, see the [haddock package](https://hackage.haskell.org/package/haddock).
ca: Haddock és una eina de generació de documentació per a les biblioteques de Haskell. Aquests mòduls exposen alguna funcionalitat d'ell sense estirar en la dependència del GHC. Tingueu en compte que és probable que l'API canviï, així que assegureu-vos d'especificar límits superiors als vostres projectes. Per a interactuar amb el propi Haddock, vegeu el [paquet haddock](https://hackage.haskell.org/package/haddock).

source: Haskell haddock-library library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell haddock

source: This package provides the Haskell haddock-library library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell haddock-library.

source: Half-precision floating-point
ca: Mitja precisió coma flotant

source: Half-precision floating-point.
ca: Punt flotant de mitja precisió.

source: Haskell half library development files
ca: Fitxers de desenvolupament de la meitat de la biblioteca Haskell

source: This package provides the Haskell half library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la meitat de la biblioteca Haskell.

source: A class for types that can be converted to a hash value
ca: Una classe per als tipus que es poden convertir en un valor hash

source: This package defines a class, 'Hashable', for types that can be converted to a hash value. This class exists for the benefit of hashing-based data structures. The package provides instances for basic types and a way to combine hash values.
ca: Aquest paquet defineix una classe, 'Hashable', per a tipus que es poden convertir en un valor hash. Aquesta classe existeix en benefici de les estructures de dades basades en hashing. El paquet proporciona instàncies per als tipus bàsics i una manera de combinar valors hash.

source: Haskell hashable library development files
ca: Fitxers de desenvolupament de la biblioteca haskell hashable

source: This package provides the Haskell hashable library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca haskell hashable.

source: Mutable hash tables in the ST monad
ca: Taules hash mutables a la monada ST

source: This package provides a couple of different implementations of mutable hash tables in the ST monad, as well as a typeclass abstracting their common operations, and a set of wrappers to use the hash tables in the IO monad. /QUICK START/: documentation for the hash table operations is provided in the "Data.HashTable.Class" module, and the IO wrappers (which most users will probably prefer) are located in the "Data.HashTable.IO" module. This package currently contains three hash table implementations: 1. "Data.HashTable.ST.Cuckoo" contains an implementation of "cuckoo hashing" as introduced by Pagh and Rodler in 2001 (see <http://en.wikipedia.org/wiki/Cuckoo_hashing>). Cuckoo hashing has worst-case /O(1)/ lookups and can reach a high "load factor", in which the table can perform acceptably well even when approaching 90% full. Randomized testing shows this implementation of cuckoo hashing to be slightly faster on insert and slightly slower on lookup than "Data.HashTable.ST.Basic", while being more space efficient by about a half-word per key-value mapping. Cuckoo hashing, like the basic hash table implementation using linear probing, can suffer from long delays when the table is resized. 2. "Data.HashTable.ST.Basic" contains a basic open-addressing hash table using linear probing as the collision strategy. On a pure speed basis it should currently be the fastest available Haskell hash table implementation for lookups, although it has a higher memory overhead than the other tables and can suffer from long delays when the table is resized because all of the elements in the table need to be rehashed. 3. "Data.HashTable.ST.Linear" contains a linear hash table (see <http://en.wikipedia.org/wiki/Linear_hashing>), which trades some insert and lookup performance for higher space efficiency and much shorter delays when expanding the table. In most cases, benchmarks show this table to be currently slightly faster than 'Data.HashTable' from the Haskell base library. It is recommended to create a concrete type alias in your code when using this package, i.e.: > import qualified Data.HashTable.IO as H > > type HashTable k v = H.BasicHashTable k v > > foo :: IO (HashTable Int Int) > foo = do > ht <- H.new > H.insert ht 1 1 > return ht Firstly, this makes it easy to switch to a different hash table implementation, and secondly, using a concrete type rather than leaving your functions abstract in the HashTable class should allow GHC to optimize away the typeclass dictionaries. This package accepts a couple of different cabal flags: * 'unsafe-tricks', default /ON/. If this flag is enabled, we use some unsafe GHC-specific tricks to save indirections (namely 'unsafeCoerce#' and 'reallyUnsafePtrEquality#'. These techniques rely on assumptions about the behaviour of the GHC runtime system and, although they've been tested and should be safe under normal conditions, are slightly dangerous. Caveat emptor. In particular, these techniques are incompatible with HPC code coverage reports. * 'sse42', default /OFF/. If this flag is enabled, we use some SSE 4.2 instructions (see <http://en.wikipedia.org/wiki/SSE4>, first available on Intel Core 2 processors) to speed up cache-line searches for cuckoo hashing. * 'bounds-checking', default /OFF/. If this flag is enabled, array accesses are bounds-checked. * 'debug', default /OFF/. If turned on, we'll rudely spew debug output to stdout. * 'portable', default /OFF/. If this flag is enabled, we use only pure Haskell code and try not to use unportable GHC extensions. Turning this flag on forces 'unsafe-tricks' and 'sse42' /OFF/. Please send bug reports to <https://github.com/gregorycollins/hashtables/issues>.
ca: Aquest paquet proporciona un parell d'implementacions diferents de taules hash mutables a la mònada ST, així com una classe tipogràfica que resumeix les seves operacions comunes, i un conjunt d'embolcalls per utilitzar les taules hash a la mònada IO. /QUICK START/: la documentació per a les operacions de la taula hash es proporciona a l'apartat "Dades.HashTable.El mòdul Classe", i els embolcalls IO (que probablement la majoria d'usuaris preferiran) es troben a les "Dades.Mòdul HashTable.IO". Aquest paquet conté actualment tres implementacions de taules hash: 1. "Dades.HashTable.ST.Cuckoo" conté una implementació de "cuckoo hashing" tal com van introduir Pagh i Rodler el 2001 (vegeu <http://en.wikipedia.org/wiki/Cuckoohashing>). Cuckoo hashing té les cerques /O(1)/ pitjors casos i pot arribar a un alt "factor de càrrega", en el qual la taula pot funcionar acceptablement bé fins i tot quan s'aproxima al 90% plena. Les proves aleatòries mostren que aquesta implementació de l'haixix del cucut és lleugerament més ràpida en la inserció i lleugerament més lenta en la cerca que "Dades.HashTable.ST.Bàsic", tot i ser més eficient en l'espai per aproximadament una mitja paraula per mapatge de valors clau. El hashing de Cuckoo, igual que la implementació bàsica de la taula de hash mitjançant sonda lineal, pot patir de llargs retards quan la taula es redimensiona. 2. "Dades.HashTable.ST.Basic" conté una taula de hash bàsica d'adreça oberta que utilitza el sondeig lineal com a estratègia de col·lisió. Sobre una base de velocitat pura, hauria de ser actualment la implementació de la taula hash Haskell més ràpida disponible per a les cerques, encara que té una càrrega de memòria més alta que les altres taules i pot patir retards llargs quan la taula es redimensiona perquè cal reajustar tots els elements de la taula. 3. "Dades.HashTable.ST.Lineal" conté una taula de resum lineal (vegeu <http://en.wikipedia.org/wiki/Linearhashing>), que comercialitza alguns resultats d'inserció i cerca per a una major eficiència de l'espai i retards molt més curts en expandir la taula. En la majoria dels casos, les referències comparatives mostren que aquesta taula és actualment una mica més ràpida que les dades.HashTable' de la biblioteca base de Haskell. Es recomana crear un àlies de tipus concret en el codi quan s'utilitzi aquest paquet, és a dir: . importar dades qualificades.HashTable.IO com a H . . tipus HashTable k v . H.BasicHashTable k v v ) foo :: IO (HashTable Int Int) foo ) do ) ht <- H.new > H.insert ht 1 1 return ht En primer lloc, això fa que sigui fàcil canviar a una implementació diferent de la taula d'haixix, i en segon lloc, utilitzar un tipus concret en lloc de deixar les funcions abstractes a la classe HashTable hauria de permetre a GHC optimitzar els diccionaris de la classe de tipus. Aquest paquet accepta un parell de banderes de cabal diferents: * «insafe-tricks», per defecte /ON/. Si aquesta marca està activada, utilitzarem alguns trucs específics de GHC insegurs per a desar les indirectes (concretament «unsafeCoerce.» i «reallyUnsafePtrEquality.»). Aquestes tècniques es basen en suposicions sobre el comportament del sistema d'execució de GHC i, tot i que han estat provades i haurien de ser segures en condicions normals, són lleugerament perilloses. Caveat emptor. En particular, aquestes tècniques són incompatibles amb els informes de cobertura de codi HPC. * 'sse42', per defecte /OFF/. Si aquesta marca està activada, utilitzem algunes instruccions SSE 4.2 (vegeu <http://en.wikipedia.org/wiki/SSE4>, primer disponible en els processadors Intel Core 2) per accelerar les cerques de la línia de la memòria cau per al hashing de cucut. * 'bounds-checking', per defecte /OFF/. Si aquesta marca està habilitada, els accessos de matriu estan marcats amb límits. * 'debug', per defecte /OFF/. Si s'activa, escamparem la sortida de depuració de manera rude a stdout. * 'portable', per defecte /OFF/. Si aquesta marca està habilitada, només fem servir el codi Haskell pur i intentem no utilitzar extensions GHC no portàtils. Engegar aquesta bandera en força 'problemes insegurs' i 'sse42' /OFF/. Envieu informes d'error a <https://github.com/gregorycollins/hashtables/issues>.

source: Haskell hashtables library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hashtables

source: This package provides the Haskell hashtables library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hashtables.

source: Haskell haskeline library
ca: Biblioteca Haskell haskeline

source: This package provides the Haskell haskeline library.
ca: Aquest paquet proporciona la biblioteca Haskell haskeline.

source: Haskell haskeline library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell haskeline

source: This package provides the Haskell haskeline library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell haskeline.

source: A fully compliant Haskell 98 lexer
ca: Un lexer Haskell 98 totalment compatible

source: A fully compliant Haskell 98 lexer.
ca: Un lexer Haskell 98 totalment compatible.

source: Haskell haskell-lexer library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell haskell-lexer

source: This package provides the Haskell haskell-lexer library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell haskell-lexer.

source: Asymptotically optimal Brodal/Okasaki heaps
ca: Asimptòticament òptim Brodal/Okasaki munts

source: Asymptotically optimal Brodal/Okasaki bootstrapped skew-binomial heaps from the paper <http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.48.973 "Optimal Purely Functional Priority Queues">, extended with a 'Foldable' interface.
ca: Asimptomàticament òptim Brodal/Okasaki va arrencar munts binomials esbiaixats del paper <http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.48.973 "Optimal Purely Functional Priority Queues">, ampliat amb una interfície 'Foldable'.

source: Haskell heaps library development files
ca: Haskell munta els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell heaps library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell heaps.

source: Release with confidence
ca: Allibera amb confiança
