Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: This package comes "Batteries Included" with many useful lenses for the types commonly used from the Haskell Platform, and with tools for automatically generating lenses and isomorphisms for user-supplied data types. The combinators in 'Control.Lens' provide a highly generic toolbox for composing families of getters, folds, isomorphisms, traversals, setters and lenses and their indexed variants. An overview, with a large number of examples can be found in the <https://github.com/ekmett/lens#lens-lenses-folds-and-traversals README>. An introductory video on the style of code used in this library by Simon Peyton Jones is available from <http://skillsmatter.com/podcast/scala/lenses-compositional-data-access-and-manipulation Skills Matter>. A video on how to use lenses and how they are constructed is available on <http://youtu.be/cefnmjtAolY?hd=1 youtube>. Slides for that second talk can be obtained from <http://comonad.com/haskell/Lenses-Folds-and-Traversals-NYC.pdf comonad.com>. More information on the care and feeding of lenses, including a brief tutorial and motivation for their types can be found on the <https://github.com/ekmett/lens/wiki lens wiki>. A small game of 'pong' and other more complex examples that manage their state using lenses can be found in the <https://github.com/ekmett/lens/blob/master/examples/ example folder>. /Lenses, Folds and Traversals/ With some signatures simplified, the core of the hierarchy of lens-like constructions looks like: <<http://i.imgur.com/ALlbPRa.png>> <images/Hierarchy.png (Local Copy)> You can compose any two elements of the hierarchy above using '(.)' from the 'Prelude', and you can use any element of the hierarchy as any type it linked to above it. The result is their lowest upper bound in the hierarchy (or an error if that bound doesn't exist). For instance: * You can use any 'Traversal' as a 'Fold' or as a 'Setter'. * The composition of a 'Traversal' and a 'Getter' yields a 'Fold'. /Minimizing Dependencies/ If you want to provide lenses and traversals for your own types in your own libraries, then you can do so without incurring a dependency on this (or any other) lens package at all. /e.g./ for a data type: > data Foo a = Foo Int Int a You can define lenses such as > -- bar :: Lens' (Foo a) Int > bar :: Functor f => (Int -> f Int) -> Foo a -> f (Foo a) > bar f (Foo a b c) = fmap (a' -> Foo a' b c) (f a) > -- quux :: Lens (Foo a) (Foo b) a b > quux :: Functor f => (a -> f b) -> Foo a -> f (Foo b) > quux f (Foo a b c) = fmap (Foo a b) (f c) without the need to use any type that isn't already defined in the 'Prelude'. And you can define a traversal of multiple fields with 'Control.Applicative.Applicative': > -- traverseBarAndBaz :: Traversal' (Foo a) Int > traverseBarAndBaz :: Applicative f => (Int -> f Int) -> Foo a -> f (Foo a) > traverseBarAndBaz f (Foo a b c) = Foo <$> f a <*> f b <*> pure c What is provided in this library is a number of stock lenses and traversals for common haskell types, a wide array of combinators for working them, and more exotic functionality, (/e.g./ getters, setters, indexed folds, isomorphisms).
ca: Aquest paquet ve "Batteries incloses" amb moltes lents útils per als tipus utilitzats habitualment des de la Plataforma Haskell, i amb eines per generar automàticament lents i isomorfismes per als tipus de dades subministrats per l'usuari. Els combinators a 'Control.La lent proporciona una caixa d'eines altament genèrica per a la composició de famílies de gàmetes, plecs, isomorfismes, traversals, col·locadors i lents i les seves variants indexades. Una visió general, amb un gran nombre d'exemples es pot trobar en el <https://github.com/ekmett/lens#lens-lenses-folds-and-traversals README>. Un vídeo introductori sobre l'estil de codi utilitzat en aquesta biblioteca per Simon Peyton Jones està disponible des de <http://skillsmatter.com/podcast/scala/lenses-compositional-data-access-and-manipulation Skills Matter>. Un vídeo sobre com utilitzar lents i com es construeixen està disponible a <http://youtu.be/cefnmjtAolY?hd=1 youtube>. Les diapositives per a aquesta segona xerrada es poden obtenir a partir de <http://comonad.com/haskell/Lenses-Folds-and-Traversals-NYC.pdf comonad.com>. Més informació sobre la cura i l'alimentació de les lents, incloent un breu tutorial i motivació per als seus tipus es pot trobar a la <https://github.com/ekmett/lens/wiki lens wiki>. Un petit joc de 'pong' i altres exemples més complexos que gestionen el seu estat utilitzant lents es poden trobar en el <https://github.com/ekmett/lens/blob/master/examples/ example folder>. /Lents, plecs i traversals/ Amb algunes signatures simplificades, el nucli de la jerarquia de construccions similars a lents sembla: <<http://i.imgur.com/ALlbPRa.png> <images/Hierarchy.png (Local Copy)> Podeu compondre dos elements qualssevol de la jerarquia de dalt utilitzant «(.)» del «Preludi», i podeu utilitzar qualsevol element de la jerarquia com a qualsevol tipus que enllaçi a sobre. El resultat és el seu límit superior més baix a la jerarquia (o un error si aquest límit no existeix). Per exemple: * Pots utilitzar qualsevol 'Traversal' com a 'Fold' o com a 'Setter'. * La composició d'un 'Traversal' i un 'Getter' dona un 'Fold'. /Minimització de dependències/ Si voleu proporcionar lents i traversals per als vostres propis tipus a les vostres pròpies biblioteques, podeu fer-ho sense incórrer en cap dependència d'aquest (o de qualsevol altre) paquet de lents. /e.g./ per a un tipus de dades: dades Foo a Foo Int Int a Podeu definir lents com ara ) -- bar :: Lents' (Foo a) Int ) bar :: Functor f ) (Int - f f Int) - Fo Foo a - f (Foo a) bar f (Foo a b c) ) fmap (a' -) Foo a' b c) (f a) ) -- quux :: Lents (Foo a) (Foo b) a b ) quux :: Functor f ) (a - f f b) - Fo Foo a -) f (Foo b) ) quux f (Foo a b c) ) fmap (Foo a b) (f c) sense la necessitat d'utilitzar cap tipus que no estigui definit en el 'Preludi'. I podeu definir una travessa de múltiples camps amb 'Control.Aplicació.Aplicatiu': ) -- traverseBarAndBaz :: Traversal' (Foo a) Int > traverseBarAndBaz :: Applicative f ) (Int - f f Int) -> Foo a - f f (Foo a) traverseBarAndBaz f (Foo a b c) Foo <$> f a <*> f b <*> pure c El que es proporciona en aquesta biblioteca és una sèrie de lents d'estoc i traversals per a tipus d'haixell comuns, una àmplia gamma de combinators per treballar-los, i funcionalitat més exòtica, (/p. ex./ ganxers, col·locadors, plecs indexats, isomorfismes).

source: Law-abiding lenses for aeson
ca: Lents respectuoses amb la llei per a l'esó

source: Law-abiding lenses for aeson.
ca: Lents respectuoses amb la llei per a l'eson.

source: Haskell lens-aeson library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell lens-aeson

source: This package provides the Haskell lens-aeson library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell lens-aeson.

source: Haskell lens library development files
ca: Fitxers de desenvolupament de la biblioteca de lents Haskell

source: This package provides the Haskell lens library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de lents Haskell.

source: Haskell 2022 Lens Families
ca: Famílies de lents Haskell 2022

source: This package provides first class(†) functional references in Van Laarhoven style supporting the following optics: * Lenses (view, over) * Traversals (toListOf, matching, over) * Setters (over) * Grates (zipWithOf, under, review) * Resetters (under) * Adapters (view, review) * Grids (toListOf, over / under, review) * Prisms (matching, over / under, review) * Getters (view) * Folders (toListOf) * Reviewers (review) (†) For optimal first-class support use the 'lens-family' package with rank 2 / rank N polymorphism. "Lens.Family.Clone" allows for first-class support of lenses and traversals for those who cannot support rank 2 polymorphism.
ca: Aquest paquet proporciona referències funcionals de primera classe( the) en l'estil Van Laarhoven que suporten les següents òptiques: * Lents (visualització, superació) * Traversals (toListOf, matching, over) * Ajustadors (sobre) * Qualificacions (zipWithOf, under, review) * Reiniciadors (sota) * Adaptadors (visualització, revisió) * Graelles (toListOf, over / under, review) * Prismes (aparellament, superació / sota, revisió) * Getters (vista) * Carpetes (toListOf) * Revisors (revisat) (.) Per a un suport òptim de primera classe, utilitzeu el paquet 'lens-family' amb polimorfisme de rang 2 / rang N. "Lens.Família.Clone" permet el suport de primera classe de lents i traversals per a aquells que no poden suportar el polimorfisme de rang 2.

source: Haskell lens-family-core library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell lens-family-core

source: This package provides the Haskell lens-family-core library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell lens-family-core.

source: Haskell libiserv library
ca: Biblioteca de la libiserv de Haskell

source: This package provides the Haskell libiserv library.
ca: Aquest paquet proporciona la biblioteca Haskell libiserv.

source: Haskell libiserv library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell libiserv

source: This package provides the Haskell libiserv library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell libiserv.

source: An MPD client library
ca: Una biblioteca de client MPD

source: A client library for MPD, the Music Player Daemon.
ca: Una biblioteca de client per a MPD, el dimoni del reproductor de música.

source: Haskell libmpd library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell libmpd

source: This package provides the Haskell libmpd library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell libmpd.

source: GHC development libraries meta package
ca: Metapaquet de les biblioteques de desenvolupament GHC

source: This is a meta-package for all the development library packages in GHC except the ghc library, which is installed by the toplevel ghc metapackage.
ca: Aquest és un meta-paquet per a tots els paquets de la biblioteca de desenvolupament a GHC excepte la biblioteca ghc, que està instal·lada pel metapaquet ghc de nivell superior.

source: Haskell bindings to libsystemd-journal
ca: Vinculacions del Haskell a la «libsystemd-journal»

source: Haskell bindings to libsystemd-journal.
ca: Haskell vincula a libsystemd-journal.

source: Haskell libsystemd-journal library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell libsystemd-journal

source: This package provides the Haskell libsystemd-journal library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell libsystemd-journal.

source: Bindings for the libXML2 SAX interface
ca: Vinculacions per a la interfície SAX de la libXML2

source: Bindings for the libXML2 SAX interface.
ca: Vinculacions per a la interfície SAX de libXML2.

source: Haskell libxml-sax library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell libxml-sax

source: This package provides the Haskell libxml-sax library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell libxml-sax.

source: Low-level, streaming YAML interface
ca: Interfície YAML de baix nivell

source: README and API documentation are available at <https://www.stackage.org/package/libyaml>.
ca: La documentació de README i API està disponible a <https://www.stackage.org/package/libyaml>.

source: Haskell libyaml library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell libyaml

source: This package provides the Haskell libyaml library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell libyaml.

source: Lift a type from a Typeable constraint to a Template Haskell type
ca: Apuja un tipus des d'una restricció teclejable a un tipus Haskell de plantilla

source: Lift your types from a Typeable constraint to a Template Haskell type.
ca: Aixeca els teus tipus d'una restricció teclejable a un tipus Haskell de plantilla.

source: Haskell lift-type library development files
ca: Fitxers de desenvolupament de la biblioteca de tipus elevador Haskell

source: This package provides the Haskell lift-type library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de tipus elevador Haskell.

source: Run lifted IO operations asynchronously and wait for their results
ca: Executa les operacions d'E/S aixecades asincrònicament i espera els seus resultats

source: This package provides IO operations from 'async' package lifted to any instance of 'MonadBase' or 'MonadBaseControl'.
ca: Aquest paquet proporciona operacions d'E/S des del paquet «async» aixecat a qualsevol instància de «MonadBase» o «MonadBaseControl».

source: Haskell lifted-async library development files
ca: Haskell fitxers de desenvolupament de la biblioteca de sincronització elevada

source: This package provides the Haskell lifted-async library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell lifted-async.

source: Lifted IO operations from the base library
ca: Operacions d'E/S aixecades des de la biblioteca base

source: 'lifted-base' exports IO operations from the base library lifted to any instance of 'MonadBase' or 'MonadBaseControl'. Note that not all modules from 'base' are converted yet. If you need a lifted version of a function from 'base', just ask me to add it or send me a patch. The package includes a copy of the 'monad-peel' testsuite written by Anders Kaseorg The tests can be performed using 'cabal test'.
ca: «lifted-base» exporta operacions d'E/S des de la biblioteca base aixecada a qualsevol instància de «MonadBase» o «MonadBaseControl». Tingueu en compte que encara no tots els mòduls de «base» s'han convertit. Si necessiteu una versió aixecada d'una funció de «base», demaneu-me que l'afegeixi o envieu-me un pedaç. El paquet inclou una còpia del testuit 'monad-peel' escrit per Anders Kaseorg Les proves es poden realitzar utilitzant 'cabal test'.

source: Haskell lifted-base library development files
ca: Haskell fitxers de desenvolupament de biblioteques de base elevada

source: This package provides the Haskell lifted-base library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell lifted-base.

source: A backtracking logic-programming monad
ca: Una monad de programació lògica retrocés

source: Adapted from the paper <http://okmij.org/ftp/papers/LogicT.pdf Backtracking, Interleaving, and Terminating Monad Transformers> by Oleg Kiselyov, Chung-chieh Shan, Daniel P. Friedman, Amr Sabry.
ca: Adaptat del diari <http://okmij.org/ftp/papers/LogicT.pdf Backtracking, Interleaving, and Terminating Monad Transformers> per Oleg Kiselyov, Chung-chieh Shan, Daniel P. Friedman, Amr Sabry.

source: Haskell logict library development files
ca: Fitxers de desenvolupament de la biblioteca de lògica Haskell

source: This package provides the Haskell logict library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de lògica Haskell.

source: Fast loops (for when GHC can't optimize forM_)
ca: Bucles ràpids (per quan GHC no pot optimitzar forM)

source: This package provides a convenient and fast alternative to the common `forM_ [1..n]` idiom, which in many cases GHC cannot fuse to efficient code. See <https://ghc.haskell.org/trac/ghc/ticket/8763>.
ca: Aquest paquet proporciona una alternativa còmoda i ràpida a l'idioma comú [forM [1..n]., que en molts casos GHC no pot fusionar-se amb codi eficient. Vegeu <https://ghc.haskell.org/trac/ghc/ticket/8763>.

source: Haskell loop library development files
ca: Fitxers de desenvolupament de la biblioteca de bucles Haskell

source: This package provides the Haskell loop library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de bucles Haskell.

source: LPeg – Parsing Expression Grammars For Lua
ca: LPeg – Anàlisi de la gramàtica d'expressió per a Lua

source: This package contains the C sources of LPeg, as well as some tiny Haskell helper to load the package. <http://www.inf.puc-rio.br/~roberto/lpeg/>.
ca: Aquest paquet conté les fonts C de LPeg, així com un petit ajudant Haskell per carregar el paquet. <http://www.inf.puc-rio.br/roberto/lpeg/>.

source: Haskell lpeg library development files
ca: Fitxers de desenvolupament de la biblioteca LPEG de Haskell

source: This package provides the Haskell lpeg library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca lpeg de Haskell.

source: Lua, an embeddable scripting language
ca: Lua, un llenguatge de script incrustable

source: This package provides bindings and types to bridge Haskell and <https://www.lua.org/ Lua>. The full Lua interpreter version 5.3.6 is included. Alternatively, a system-wide Lua installation can be linked instead.
ca: Aquest paquet proporciona vinculacions i tipus per pontar Haskell i <https://www.lua.org/ Lua>. S'inclou la versió completa de l'intèrpret de Lua 5.3.6. Alternativament, es pot enllaçar una instal·lació Lua a tot el sistema.

source: Haskell lua library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell lua

source: This package provides the Haskell lua library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell lua.

source: Clear to write, read and edit DSL for HTML
ca: Neteja escriure, llegir i editar DSL per a HTML

source: Clear to write, read and edit DSL for HTML. * Names are consistent, and do not conflict with base or are keywords (all have suffix '_') * Same combinator can be used for attributes and elements (e.g. 'style_') * For more, read <https://chrisdone.com/posts/lucid the blog post> See the "Lucid" module for more documentation.
ca: Neteja escriure, llegir i editar DSL per a HTML. * Els noms són coherents, i no entren en conflicte amb la base o són paraules clau (totes tenen el sufix '') * El mateix combinador es pot utilitzar per a atributs i elements (p. ex. «style») * Per a més informació, llegiu <https://chrisdone.com/posts/lucid the blog post> Vegeu el mòdul "Lucid" per a més documentació.

source: Haskell lucid library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell lucid

source: This package provides the Haskell lucid library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Lucid Haskell.

source: File locking
ca: Bloqueig de fitxers

source: This package provides access to platform dependent file locking APIs: * <https://www.gnu.org/software/libc/manual/html_node/Open-File-Description-Locks.html Open file descriptor locking> on Linux ("Lukko.OFD") * BSD-style 'flock(2)' locks on UNIX platforms ("Lukko.FLock") * Windows locking via <https://docs.microsoft.com/en-us/windows/win32/api/fileapi/nf-fileapi-lockfilee LockFileEx> ("Lukko.Windows") * No-op locking, which throws exceptions ("Lukko.NoOp") * "Lukko" module exports the best option for the target platform with uniform API. There are alternative file locking packages: * "GHC.IO.Handle.Lock" in 'base >= 4.10' is good enough for most use cases. However, uses only 'Handle's so these locks cannot be used for intra-process locking. (You should use e.g. 'MVar' in addition). * <https://hackage.haskell.org/package/filelock filelock> doesn't support OFD locking. /Lukko/ means lock in Finnish. Submodules "Lukko.OFD", "Lukko.Windows" etc are available based on following conditions. ' if os(windows) cpp-options: -DHAS_WINDOWS_LOCK elif (os(linux) && flag(ofd-locking)) cpp-options: -DHAS_OFD_LOCKING cpp-options: -DHAS_FLOCK elif !(os(solaris) || os(aix)) cpp-options: -DHAS_FLOCK ' "Lukko.FLock" is available on not (Windows or Solaris or AIX). "Lukko.NoOp" is always available.
ca: Aquest paquet proporciona accés a les API de bloqueig de fitxers dependents de la plataforma: * <https://www.gnu.org/software/libc/manual/htmlnode/Open-File-Description-Locks.html Open file descriptor locking> en Linux ("Lukko.OFD") * BSD-style 'flock(2)' locks en plataformes UNIX ("Lukko.FLock") * Windows locking via <https://docs.microsoft.com/en-us/windows/win32/api/fileapi/nf-fileapi-lockfilee LockFileEx> ("Lukko.Windows") * Bloqueig sense opció, que llança excepcions ("Lukko.NoOp") * El mòdul "Lukko" exporta la millor opció per a la plataforma de destinació amb API uniforme. Hi ha paquets alternatius de bloqueig de fitxers: * "GHC.IO.Manipular.Bloquejar" a 'base 4 4.10' és prou bo per a la majoria de casos d'ús. No obstant això, només utilitza «Handle», de manera que aquests panys no es poden utilitzar per al bloqueig intraprocés. (Hauríeu d'utilitzar, per exemple, «MVar» a més). * <https://hackage.haskell.org/package/filelock filelock> no admet el bloqueig OFD. /Lukko/ significa pany en finès. Submòduls "Lukko.OFD", "Lukko.Windows", etc, estan disponibles en funció de les condicions següents. ' if os(windows) cpp-options: -DHASWINDOWSLOCK elif (os(linux) flag(ofd-locking)) cpp-options: -DHASOFDLOCKING cpp-options: -DHASFLOCK elif !(os(solaris) ) os(aix)) cpp-options: -DHASFLOCK ' "Lukko.FLock" està disponible en not (Windows o Solaris o AIX). "Lukko.NoOp" sempre està disponible.

source: Haskell lukko library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell lukko

source: This package provides the Haskell lukko library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell lukko.

source: Interface to C file/magic library
ca: Interfície al fitxer C/biblioteca gràfica

source: This package provides a Haskell interface to the C libmagic library. With it, you can determine the type of a file by examining its contents rather than its name. The Haskell interface provides a full-featured binding.
ca: Aquest paquet proporciona una interfície Haskell a la biblioteca libmagic C. Amb ell, podeu determinar el tipus d'un fitxer examinant el seu contingut en lloc del seu nom. La interfície Haskell proporciona una vinculació amb totes les característiques.

source: Haskell magic library development files
ca: Fitxers de desenvolupament de la biblioteca màgica Haskell

source: This package provides the Haskell magic library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca màgica Haskell.

source: A monad for managed values
ca: Una mònada per als valors gestionats
