Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: This package provides the Haskell case-insensitive library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca sense distingir majúscules i minúscules Haskell.

source: Convert between various source code casing conventions
ca: Converteix entre diverses convencions d'enquadernació de codi font

source: Converts between camelCase, PascalCase, kebab-case, and three flavors of snake_case.
ca: Converteix entre camellCasa, PascalCasa, kebab-case, i tres sabors de serpcase.

source: Haskell casing library development files
ca: Fitxers de desenvolupament de la biblioteca de capçalera Haskell

source: This package provides the Haskell casing library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la llibreria Haskell.

source: A CSV parsing and encoding library
ca: Una biblioteca d'anàlisi i codificació CSV

source: 'cassava' is a library for parsing and encoding [RFC 4180](https://tools.ietf.org/html/rfc4180) compliant [comma-separated values (CSV)](https://en.wikipedia.org/wiki/Comma-separated_values) data, which is a textual line-oriented format commonly used for exchanging tabular data. 'cassava''s API includes support for - Index-based record-conversion - Name-based record-conversion - Typeclass directed conversion of fields and records - Built-in field-conversion instances for standard types - Customizable record-conversion instance derivation via GHC generics - Low-level [bytestring](https://hackage.haskell.org/package/bytestring) builders (see "Data.Csv.Builder") - Incremental decoding and encoding API (see "Data.Csv.Incremental") - Streaming API for constant-space decoding (see "Data.Csv.Streaming") Moreover, this library is designed to be easy to use; for instance, here's a very simple example of encoding CSV data: >>> Data.Csv.encode [("John",27),("Jane",28)] "John,27rnJane,28rn" Please refer to the documentation in "Data.Csv" and the included [README](#readme) for more usage examples.
ca: «cassava» és una biblioteca per a analitzar i codificar les dades [RFC 4180](https://tools.ietf.org/html/rfc4180) compatibles amb els [valors separats per comes (CSV)](https://ca.wikipedia.org/wiki/valors separats per comes), que és un format orientat a la línia textual que s'utilitza comunament per a l'intercanvi de dades tabulars. L'API de «cassava» inclou suport per a - Conversió de registres basada en l'índex - Conversió de registres basada en el nom - Conversió dirigida de camps i registres Tipusclass - Instàncies de conversió de camps integrats per a tipus estàndard - Derivació d'instàncies de conversió de registres personalitzable a través de genèrics GHC - Generadors de baix nivell [bytestring](https://hackage.haskell.org/package/bytestring) (vegeu «Data.Csv.Builder") - API de descodificació i codificació incremental (vegeu "Dades.Csv.Incremental") - API de flux per a la descodificació d'espai constant (vegeu "Dades.Csv.Streaming") A més, aquesta biblioteca està dissenyada per ser fàcil d'utilitzar; per exemple, aquí hi ha un exemple molt simple de codificació de dades CSV: Dades.Csv.encode [("John",27),("Jane",28)] "John,27rnJane,28rn" Consulteu la documentació a "Dades.Csv" i el [README](.readme) inclòs per a més exemples d'ús.

source: Haskell cassava library development files
ca: Fitxers de desenvolupament de la biblioteca de cassava Haskell

source: This package provides the Haskell cassava library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell cassava.

source: Megaparsec parser of CSV files that plays nicely with Cassava
ca: Analitzador Megaparsec de fitxers CSV que es reprodueixen bé amb Cassava

source: Megaparsec parser of CSV files that plays nicely with Cassava.
ca: Analitzador Megaparsec de fitxers CSV que es reprodueixen bé amb Cassava.

source: Haskell cassava-megaparsec library development files
ca: Fitxers de desenvolupament de la biblioteca de cassava-megaparsec de Haskell

source: This package provides the Haskell cassava-megaparsec library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell cassava-megaparsec.

source: Concise Binary Object Representation (CBOR)
ca: Representació d'objecte binari concisa (CBOR)

source: This package provides an efficient implementation of the Concise Binary Object Representation (CBOR), as specified by [RFC 7049](https://tools.ietf.org/html/rfc7049). If you are looking for a library for serialisation of Haskell values, have a look at the [serialise](/package/serialise) package, which is built upon this library. An implementation of the standard bijection between CBOR and JSON is provided by the [cborg-json](/package/cborg-json) package. Also see [cbor-tool](/package/cbor-tool) for a convenient command-line utility for working with CBOR data. This package was formerly known as 'binary-serialise-cbor'.
ca: Aquest paquet proporciona una implementació eficient de la representació d'objectes binaris concisos (CBOR), segons l'especificat per [RFC 7049](https://tools.ietf.org/html/rfc7049). Si esteu cercant una biblioteca per a la serialització dels valors de Haskell, feu una ullada al paquet [serialise](/package/serialise), que es construeix sobre aquesta biblioteca. Una implementació de la bijecció estàndard entre CBOR i JSON és proporcionada pel paquet [cborg-json](/package/cborg-json). Vegeu també l'[cbor-tool](/package/cbor-tool) per a una utilitat de línia d'ordres convenient per a treballar amb les dades del CBOR. Aquest paquet es coneixia anteriorment com a «binary-serialise-cbor».

source: Haskell cborg library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell cborg

source: This package provides the Haskell cborg library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell cborg.

source: A library for encoding JSON as CBOR
ca: Una biblioteca per a codificar el JSON com a CBOR

source: This package implements the bijection between JSON and CBOR defined in the CBOR specification, RFC 7049.
ca: Aquest paquet implementa la bijecció entre JSON i CBOR definida a l'especificació CBOR, RFC 7049.

source: Haskell cborg-json library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell cborg-json

source: This package provides the Haskell cborg-json library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell cborg-json.

source: A binary serialization library
ca: Una biblioteca de serialització binària

source: A binary serialization library, similar to binary, that introduces an isolate primitive for parser isolation, and labeled blocks for better error messages.
ca: Una biblioteca de serialització binària, similar a la binària, que introdueix una primitiva aïllada per a l'aïllament de l'analitzador, i blocs etiquetats per a millors missatges d'error.

source: Haskell cereal library development files
ca: Fitxers de desenvolupament de la biblioteca de cereals Haskell

source: This package provides the Haskell cereal library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de cereals Haskell.

source: Fast unicode character sets based on complemented PATRICIA tries
ca: Conjunts de caràcters unicode ràpids basats en proves de PATRICIA complementades

source: Fast unicode character sets based on complemented PATRICIA tries.
ca: Ràpids conjunts de caràcters unicode basats en proves complementades de PATRICIA.

source: Haskell charset library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell charset

source: This package provides the Haskell charset library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell charset.

source: A solution to boolean blindness
ca: Una solució a la ceguesa booleana

source: A solution to boolean blindness.
ca: Una solució a la ceguesa booleana.

source: Haskell choice library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell choice

source: This package provides the Haskell choice library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell choice.

source: Fast AES cipher implementation with advanced mode of operations
ca: Implementació ràpida del xifratge AES amb mode avançat d'operacions

source: Fast AES cipher implementation with advanced mode of operations. The modes of operations available are ECB (Electronic code book), CBC (Cipher block chaining), CTR (Counter), XTS (XEX with ciphertext stealing), GCM (Galois Counter Mode). The AES implementation uses AES-NI when available (on x86 and x86-64 architecture), but fallback gracefully to a software C implementation. The software implementation uses S-Boxes, which might suffer for cache timing issues. However do notes that most other known software implementations, including very popular one (openssl, gnutls) also uses similar implementation. If it matters for your case, you should make sure you have AES-NI available, or you'll need to use a different implementation.
ca: Implementació ràpida del xifratge AES amb mode avançat d'operacions. Els modes d'operació disponibles són BCE (Electronic code book), CBC (Cipher block chaining), CTR (Counter), XTS (XEX with ciphertext STEALing), GCM (Galois Counter Mode). La implementació d'AES utilitza AES-NI quan està disponible (en arquitectura x86 i x86-64), però es basa amb gràcia en una implementació de programari C. La implementació de programari utilitza S-Boxes, que poden patir problemes de temps de la memòria cau. No obstant això, cal assenyalar que la majoria d'altres implementacions de programari conegudes, incloent-hi una molt popular (openssl, gnutls) també utilitza una implementació similar. Si és important per al teu cas, has d'assegurar-te de tenir l'AES-NI disponible, o hauràs d'utilitzar una implementació diferent.

source: Haskell cipher-aes library development files
ca: Fitxers de desenvolupament de la biblioteca de xifratge Haskell

source: This package provides the Haskell cipher-aes library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de xifratge Haskell.

source: Generates citations and bibliography from CSL styles
ca: Genera cites i bibliografia a partir d'estils CSL

source: Citeproc parses CSL style files and uses them to generate a list of formatted citations and bibliography entries. For more information about CSL, see <https://citationstyles.org/>.
ca: Citeproc analitza els fitxers d'estil CSL i els utilitza per generar una llista de cites formatades i entrades de bibliografia. Per a més informació sobre CSL, vegeu <https://citationstyles.org/>.

source: Haskell citeproc library development files
ca: Fitxers de desenvolupament de la biblioteca de citeproc de Haskell

source: This package provides the Haskell citeproc library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca citeproc de Haskell.

source: CSS preprocessor as embedded Haskell
ca: Preprocessador CSS com a Haskell incrustat

source: Clay is a CSS preprocessor like LESS and Sass, but implemented as an embedded domain specific language (EDSL) in Haskell. This means that all CSS selectors and style rules are first class Haskell functions, which makes reuse and composability easy. The project is described on <http://fvisser.nl/clay>. The API documentation can be found in the top level module "Clay".
ca: Clay és un preprocessador CSS com LESS i Sass, però implementat com un llenguatge específic de domini incrustat (EDSL) a Haskell. Això significa que tots els selectors CSS i regles d'estil són funcions Haskell de primera classe, el que fa que la reutilització i la composició siguin fàcils. El projecte es descriu el <http://fvisser.nl/clay>. La documentació de l'API es pot trobar al mòdul de nivell superior "Clay".

source: Haskell clay library development files
ca: Fitxers de desenvolupament de la biblioteca d'argila Haskell

source: This package provides the Haskell clay library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell clay.

source: Securely store session data in a client-side cookie
ca: Emmagatzema de forma segura les dades de sessió en una cookie del costat del client

source: Achieves security through AES-CTR encryption and Skein-MAC-512-256 authentication. Uses Base64 encoding to avoid any issues with characters.
ca: Aconsegueix seguretat mitjançant l'encriptació AES-CTR i l'autenticació Skein-MAC-512-256. Utilitza la codificació Base64 per evitar problemes amb els caràcters.

source: Haskell clientsession library development files
ca: Fitxers de desenvolupament de la biblioteca de sessió del Haskell

source: This package provides the Haskell clientsession library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell clientsession.

source: High-resolution clock functions: monotonic, realtime, cputime
ca: Funcions de rellotge d'alta resolució: monotònic, en temps real, cputime

source: A package for convenient access to high-resolution clock and timer functions of different operating systems via a unified API. POSIX code and surface API was developed by Cetin Sert in 2009. Windows code was contributed by Eugene Kirpichov in 2010. FreeBSD code was contributed by Finn Espen Gundersen on 2013-10-14. OS X code was contributed by Gerolf Seitz on 2013-10-15. Derived 'Generic', 'Typeable' and other instances for 'Clock' and 'TimeSpec' was contributed by Mathieu Boespflug on 2014-09-17. Corrected dependency listing for 'GHC < 7.6' was contributed by Brian McKenna on 2014-09-30. Windows code corrected by Dimitri Sabadie on 2015-02-09. Added 'timeSpecAsNanoSecs' as observed widely-used by Chris Done on 2015-01-06, exported correctly on 2015-04-20. Imported Control.Applicative operators correctly for Haskell Platform on Windows on 2015-04-21. Unit tests and instance fixes by Christian Burger on 2015-06-25. Removal of fromInteger : Integer -> TimeSpec by Cetin Sert on 2015-12-15. New Linux-specific Clocks: MonotonicRaw, Boottime, MonotonicCoarse, RealtimeCoarse by Cetin Sert on 2015-12-15. Reintroduction fromInteger : Integer -> TimeSpec by Cetin Sert on 2016-04-05. Fixes for older Linux build failures introduced by new Linux-specific clocks by Mario Longobardi on 2016-04-18. Refreshment release in 2019-04 after numerous contributions. Refactoring for Windows, Mac implementation consistence by Alexander Vershilov on 2021-01-16. [Version Scheme] Major-'/R/'-ewrite . New-'/F/'-unctionality . '/I/'-mprovementAndBugFixes . '/P/'-ackagingOnly * 'PackagingOnly' changes are made for quality assurance reasons.
ca: Un paquet per a un accés còmode a les funcions de rellotge i temporitzador d'alta resolució de diferents sistemes operatius a través d'una API unificada. POSIX code and surface API va ser desenvolupat per Cetin Sert el 2009. El codi Windows va ser contribuït per Eugene Kirpichov el 2010. El codi FreeBSD va ser aportat per Finn Espen Gundersen el 14 d'octubre de 2013. El codi OS X va ser aportat per Gerolf Seitz el 15 d'octubre de 2013. Mathieu Boespflug va contribuir amb el terme «Genèric», «Tipusable» i altres exemples de «Clock» i «TimeSpec» el 17 de setembre de 2014. El llistat de dependències corregides per a 'GHC 7 7.6' va ser contribuït per Brian McKenna el 30 de setembre de 2014. Codi Windows corregit per Dimitri Sabadie el 9 de febrer de 2015. S'ha afegit el «timeSpecAsNanoSecs» tal com va ser àmpliament utilitzat per Chris Done el 2015-01-06, exportat correctament el 2015-04-20. Control importat.Operadors d'aplicació correctament per a la plataforma Haskell a Windows el 21-04-2015. Proves unitàries i correccions d'instàncies per Christian Burger el 25-06-2015. Eliminació de fromInteger : Integer -. TimeSpec per Cetin Sert el 2015-12-15. Nous Rellotges específics de Linux: MonotonicRaw, Boottime, MonotonicCoarse, RealtimeCoarse per Cetin Sert el 2015-12-15. Reintroduction fromInteger : Integer -. TimeSpec de Cetin Sert el 2016-04-05. Correcció de les fallades de construcció antigues de Linux introduïdes pels nous rellotges específics de Linux per Mario Longobardi el 2016-04-18. Refreshment release en 2019-04 després de nombroses contribucions. Refactoring for Windows, consistència d'implementació de Mac per Alexander Vershilov el 16-01/2021. [Version Scheme] Major-'/R/'-ewrite . Unicitat «/F/» nova. '/I/'-mprovementAndBugFixes . «/P/»-ackagingOnly * Els canvis 'PackagingOnly' es realitzen per raons de garantia de qualitat.

source: Haskell clock library development files
ca: Fitxers de desenvolupament de la biblioteca del rellotge Haskell

source: This package provides the Haskell clock library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell clock.

source: Fast, accurate GitHub Flavored Markdown parser and renderer
ca: Analitzador i renderitzador Markdown de GitHub Flavored ràpid i precís

source: This package provides Haskell bindings for <https://github.com/github/cmark-gfm libcmark-gfm>, the reference parser for <https://github.github.com/gfm/ GitHub Flavored Markdown>, a fully specified variant of Markdown. It includes sources for libcmark-gfm (0.29.0.gfm.0) and does not require prior installation of the C library.
ca: Aquest paquet proporciona vinculacions Haskell per a <https://github.com/github/cmark-gfm libcmark-gfm>, l'analitzador de referència per a <https://github.github.com/gfm/ GitHub Flavored Markdown>, una variant completament especificada de Markdown. Inclou fonts per a la libcmark-gfm (0.29.0.gfm.0) i no requereix la instal·lació prèvia de la biblioteca C.

source: Haskell cmark-gfm library development files
ca: Fitxers de desenvolupament de la biblioteca «cmark-gfm» del Haskell

source: This package provides the Haskell cmark-gfm library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell cmark-gfm.

source: Command line argument processing
ca: Processament d'arguments de la línia d'ordres

source: This library provides an easy way to define command line parsers. Most users will want to use the "System.Console.CmdArgs.Implicit" module, whose documentation contains an example. * "System.Console.CmdArgs.Explicit" provides a way to write command line parsers for both single mode programs (most programs) and multiple mode programs (e.g. darcs or cabal). Parsers are defined by constructing a data structure. * "System.Console.CmdArgs.Implicit" provides a way to concisely define command line parsers, up to three times shorter than getopt. These parsers are translated into the Explicit data type. * "System.Console.CmdArgs.GetOpt" provides a wrapper allowing compatiblity with existing getopt parsers, mapping to the Explicit data type. For a general reference on what command line flags are commonly used, see <http://www.faqs.org/docs/artu/ch10s05.html>.
ca: Aquesta biblioteca proporciona una manera fàcil de definir analitzadors de línia d'ordres. La majoria d'usuaris voldran utilitzar el "Sistema.Consola.CmdArgs.Mòdul Implicit", la documentació del qual conté un exemple. * "Sistema.Consola.CmdArgs.Explicit" proporciona una manera d'escriure analitzadors de línia d'ordres per a programes de mode únic (la majoria de programes) i múltiples programes de mode (p. ex. darcs o cabal). Els analitzadors es defineixen mitjançant la construcció d'una estructura de dades. * "Sistema.Consola.CmdArgs.Implicit" proporciona una manera de definir concisament analitzadors de línia d'ordres, fins a tres vegades més curts que getopt. Aquests analitzadors es tradueixen al tipus de dades explícit. * "Sistema.Consola.CmdArgs.GetOpt" proporciona un embolcall que permet la compatiblitat amb els analitzadors getopt existents, mapejant al tipus de dades explícit. Per a una referència general sobre quins indicadors de línia d'ordres s'utilitzen habitualment, vegeu <http://www.faqs.org/docs/artu/ch10s05.html>.

source: Haskell cmdargs library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell cmdargs

source: This package provides the Haskell cmdargs library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell cmdargs.

source: Windows code page library for Haskell
ca: Biblioteca de la pàgina de codis del Windows per al Haskell

source: This library provides two modules: * "System.IO.CodePage": a cross-platform module that exports functions which adjust code pages on Windows, and do nothing on other operating systems. * "System.Win32.CodePage": On Windows, this exports functions for getting, setting, and analyzing code pages. On other operating systems, this module exports nothing.
ca: Aquesta biblioteca proporciona dos mòduls: * "System.IO.CodePage: un mòdul multiplataforma que exporta funcions que ajusten pàgines de codi a Windows, i no fan res en altres sistemes operatius. * "Sistema.Win32.CodePage": Al Windows, això exporta funcions per obtenir, definir i analitzar pàgines de codi. En altres sistemes operatius, aquest mòdul no exporta res.

source: Haskell code-page library development files
ca: Fitxers de desenvolupament de la biblioteca de pàgines de codi Haskell

source: This package provides the Haskell code-page library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de pàgines de codi Haskell.

source: A model for human colour/color perception
ca: Un model per a la percepció del color/color humà

source: This package provides a data type for colours and transparency. Colours can be blended and composed. Various colour spaces are supported. A module of colour names ("Data.Colour.Names") is provided.
ca: Aquest paquet proporciona un tipus de dades per als colors i la transparència. Els colors es poden barrejar i compondre. Es recolzen diversos espais de color. Un mòdul de noms de color ("Dades.Color.Es proporcionen els noms.

source: Haskell colour library development files
ca: Fitxers de desenvolupament de la biblioteca de color Haskell

source: This package provides the Haskell colour library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de color Haskell.

source: Pure Haskell commonmark parser
ca: Analitzador de Commonmark de Haskell pur
