Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: A new formatting library that tries to be simple to understand while still being powerful and providing more convenience features than other libraries (like functions for pretty-printing maps and lists, or a function for printing arbitrary datatypes using generics). A comparison with other libraries: * 'printf' (from 'Text.Printf') takes a formatting string and uses some type tricks to accept the rest of the arguments polyvariadically. It's very concise, but there are some drawbacks – it can't produce 'Text' (you'd have to 'T.pack' it every time) and it doesn't warn you at compile-time if you pass wrong arguments or not enough of them. * <https://hackage.haskell.org/package/text-format text-format> takes a formatting string with curly braces denoting places where arguments would be substituted (the arguments themselves are provided via a tuple). If you want to apply formatting to some of the arguments, you have to use one of the provided formatters. Like 'printf', it can fail at runtime, but at least the formatters are first-class (and you can add new ones). * <https://hackage.haskell.org/package/formatting formatting> takes a formatting template consisting of pieces of strings interleaved with formatters; this ensures that arguments always match their placeholders. 'formatting' provides lots of formatters and generally seems to be the most popular formatting library here. Unfortunately, at least in my experience writing new formatters can be awkward and people sometimes have troubles understanding how 'formatting' works. * <https://hackage.haskell.org/package/fmt fmt> (i.e. this library) provides formatters that are ordinary functions, and a bunch of operators for concatenating formatted strings; those operators also do automatic conversion. There are some convenience formatters which aren't present in 'formatting' (like ones for formatting maps, lists, converting to base64, etc). Some find the operator syntax annoying, while others like it.
ca: Una nova biblioteca de formatació que intenta ser senzilla d'entendre mentre encara és potent i proporciona característiques més còmodes que altres biblioteques (com funcions per a mapes i llistes d'impressió boniques, o una funció per a imprimir tipus de dades arbitraris utilitzant genèrics). Una comparació amb altres biblioteques: * 'printf' (de 'Text.Printf') pren una cadena de formatació i utilitza alguns tipus de trucs per acceptar la resta dels arguments polivariàdicament. És molt concís, però hi ha alguns inconvenients: no pot produir 'Text' (hauríeu de 'T.pack' cada vegada) i no us avisa a temps de compilació si passeu arguments equivocats o no prou d'ells. * <https://hackage.haskell.org/package/text-format text-format> pren una cadena de formatació amb claus arrissades que denoten llocs on els arguments serien substituïts (els arguments en si es proporcionen a través d'una tupla). Si voleu aplicar la formatació a alguns dels arguments, heu d'utilitzar un dels formatadors proporcionats. Igual que «printf», pot fallar en temps d'execució, però almenys els formatadors són de primera classe (i podeu afegir-ne de noves). * <https://hackage.haskell.org/package/formatting formatting> pren una plantilla de formatació que consisteix en peces de cadenes entrellaçades amb formatadors; això assegura que els arguments sempre coincideixen amb els seus marcadors de posició. «formatting» proporciona molts formatadors i generalment sembla ser la biblioteca de formatació més popular aquí. Per desgràcia, almenys en la meva experiència escriure nous formatadors pot ser incòmode i la gent a vegades té problemes per entendre com funciona el format. * <https://hackage.haskell.org/package/fmt fmt> (és a dir, aquesta biblioteca) proporciona formatadors que són funcions ordinàries, i un munt d'operadors per concatenar cadenes formatades; aquests operadors també fan conversió automàtica. Hi ha alguns formatadors de conveniència que no estan presents a la «formatació» (com els de formatació de mapes, llistes, conversió a base64, etc.). Alguns troben que la sintaxi de l'operador és molesta, mentre que altres li agraden.

source: Haskell fmt library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell fmt

source: This package provides the Haskell fmt library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca «fmt» de Haskell.

source: Composable, streaming, and efficient left folds
ca: Plegaments esquerres compostables, en streaming i eficients

source: This library provides strict left folds that stream in constant memory, and you can combine folds using 'Applicative' style to derive new folds. Derived folds still traverse the container just once and are often as efficient as hand-written folds.
ca: Aquesta biblioteca proporciona plecs esquerres estrictes que flueixen en memòria constant, i podeu combinar plecs utilitzant l'estil 'Applicative' per obtenir nous plecs. Els plecs derivats encara travessen el contenidor només una vegada i sovint són tan eficients com els plecs escrits a mà.

source: Haskell foldl library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell foldl

source: This package provides the Haskell foldl library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de plecs Haskell.

source: Combinator-based type-safe formatting (like printf() or FORMAT)
ca: Format de seguretat de tipus basat en el combinador (com printf() o FORMAT)

source: Combinator-based type-safe formatting (like printf() or FORMAT), modelled from the HoleyMonoids package. See the README at <https://github.com/AJChapman/formatting#readme> for more info.
ca: Format de seguretat de tipus basat en el combinador (com printf() o FORMAT), modelat a partir del paquet HoleyMonoids. Vegeu el README a <https://github.com/AJChapman/formatting#readme> per a més informació.

source: Haskell formatting library development files
ca: Fitxers de desenvolupament de la biblioteca amb format Haskell

source: This package provides the Haskell formatting library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de formatació Haskell.

source: Alternative prelude with batteries and no dependencies
ca: Preludi alternatiu amb bateries i sense dependències

source: A custom prelude with no dependencies apart from base. This package has the following goals: * provide a base like sets of modules that provide a consistent set of features and bugfixes across multiple versions of GHC (unlike base). * provide a better and more efficient prelude than base's prelude. * be self-sufficient: no external dependencies apart from base. * provide better data-types: packed unicode string by default, arrays. * Better numerical classes that better represent mathematical thing (No more all-in-one Num). * Better I/O system with less Lazy IO * Usual partial functions distinguished through type system.
ca: Un preludi personalitzat sense dependències a part de la base. Aquest paquet té els següents objectius: * Proporciona una base com conjunts de mòduls que proporcionen un conjunt coherent de característiques i esmenes d'errors en múltiples versions de GHC (a diferència de la base). * Proporcionar un preludi millor i més eficient que el preludi de base. * ser autosuficient: no hi ha dependències externes a part de la base. * proporciona millors tipus de dades: cadena unicode empaquetada per defecte, matrius. * Classes numèriques millors que representen millor cosa matemàtica (No més tot en un Num). * Millor sistema d'E/S amb menys E/S mandrosa * Funcions parcials habituals distingides a través del sistema de tipus.

source: Haskell foundation library development files
ca: Fitxers de desenvolupament de la biblioteca de la fundació Haskell

source: This package provides the Haskell foundation library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de la fundació Haskell.

source: Monads for free
ca: Monads gratis

source: Free monads are useful for many tree-like structures and domain specific languages. If 'f' is a 'Functor' then the free 'Monad' on 'f' is the type of trees whose nodes are labeled with the constructors of 'f'. The word "free" is used in the sense of "unrestricted" rather than "zero-cost": 'Free f' makes no constraining assumptions beyond those given by 'f' and the definition of 'Monad'. As used here it is a standard term from the mathematical theory of adjoint functors. Cofree comonads are dual to free monads. They provide convenient ways to talk about branching streams and rose-trees, and can be used to annotate syntax trees. The cofree comonad can be seen as a stream parameterized by a 'Functor' that controls its branching factor. More information on free monads, including examples, can be found in the following blog posts: <http://comonad.com/reader/2008/monads-for-free/> <http://comonad.com/reader/2011/free-monads-for-less/>.
ca: Els monads lliures són útils per a moltes estructures semblants a arbres i llenguatges específics de domini. Si 'f' és un 'Functor' llavors la 'Monad' lliure en 'f' és el tipus d'arbres els nodes dels quals estan etiquetats amb els constructors de 'f'. La paraula "lliure" s'utilitza en el sentit de "sense restriccions" en comptes de "zero-cost": "Free f" no fa suposicions restrictives més enllà de les donades per "f" i la definició de "Monad". Com s'utilitza aquí, és un terme estàndard de la teoria matemàtica dels functors adjunts. Les comonades cofree són duals a les mònades lliures. Proporcionen maneres convenients de parlar sobre els corrents de ramificació i els arbres de roses, i es poden utilitzar per anotar arbres de sintaxi. La comonad cofree es pot veure com un flux parametritzat per un 'Functor' que controla el seu factor de ramificació. Més informació sobre els monads lliures, incloent exemples, es pot trobar a les següents entrades del blog: <http://comonad.com/reader/2008/monads-for-free/> <http://comonad.com/reader/2011/free-monads-for-less/>.

source: Haskell free library development files
ca: Fitxers de desenvolupament de biblioteques lliures de Haskell

source: This package provides the Haskell free library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca lliure de Haskell.

source: Cross platform library for file change notification
ca: Biblioteca de plataforma creuada per a la notificació de canvi de fitxer

source: Cross platform library for file creation, modification, and deletion notification. This library builds upon existing libraries for platform-specific Windows, Mac, and Linux filesystem event notification.
ca: Biblioteca de plataforma creuada per a la creació, modificació i notificació d'eliminació de fitxers. Aquesta biblioteca es basa en les biblioteques existents per a la notificació d'esdeveniments del sistema de fitxers de Windows, Mac i Linux específics de la plataforma.

source: Haskell fsnotify library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell fsnotify

source: This package provides the Haskell fsnotify library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell fsnotify.

source: Gamma function and related functions
ca: Funció gamma i funcions relacionades

source: Approximations of the gamma function, incomplete gamma functions, and factorials.
ca: Aproximacions de la funció gamma, funcions gamma incompletes i factorials.

source: Haskell gamma library development files
ca: Fitxers de desenvolupament de la biblioteca gamma Haskell

source: This package provides the Haskell gamma library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca gamma Haskell.

source: Deriving instances with GHC.Generics and related utilities
ca: Instàncies derivades amb GHC.Genèrics i utilitats relacionades

source: Generic implementations of standard type classes. Operations on generic representations to help using "GHC.Generics". See README.
ca: Implementacions genèriques de classes tipus estàndard. Operacions sobre representacions genèriques per ajudar a utilitzar "GHC.Generics». Vegeu README.

source: Haskell generic-data library development files
ca: Fitxers de desenvolupament de la biblioteca de genèrics Haskell

source: This package provides the Haskell generic-data library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de dades genèriques de Haskell.

source: Generic programming library for generalised deriving
ca: Biblioteca genèrica de programació per a derivacions generalitzades

source: This package provides functionality for generalising the deriving mechanism in Haskell to arbitrary classes. It was first described in the paper: * /A generic deriving mechanism for Haskell/. Jose Pedro Magalhaes, Atze Dijkstra, Johan Jeuring, and Andres Loeh. Haskell'10. The current implementation integrates with the new GHC Generics. See <http://www.haskell.org/haskellwiki/GHC.Generics> for more information. Template Haskell code is provided for supporting older GHCs. This library is organized as follows: * "Generics.Deriving.Base" defines the core functionality for GHC generics, including the 'Generic(1)' classes and representation data types. On modern versions of GHC, this simply re-exports "GHC.Generics" from 'base'. On older versions of GHC, this module backports parts of "GHC.Generics" that were not included at the time, including 'Generic(1)' instances. * "Generics.Deriving.TH" implements Template Haskell functionality for deriving instances of 'Generic(1)'. * Educational code: in order to provide examples of how to define and use "GHC.Generics"-based defaults, this library offers a number of modules which define examples of type classes along with default implementations for the classes' methods. Currently, the following modules are provided: "Generics.Deriving.Copoint", "Generics.Deriving.ConNames", "Generics.Deriving.Enum", "Generics.Deriving.Eq", "Generics.Deriving.Foldable", "Generics.Deriving.Functor", "Generics.Deriving.Monoid", "Generics.Deriving.Semigroup", "Generics.Deriving.Show", "Generics.Deriving.Traversable", and "Generics.Deriving.Uniplate". It is worth emphasizing that these modules are primarly intended for educational purposes. Many of the classes in these modules resemble other commonly used classes—for example, 'GShow' from "Generics.Deriving.Show" resembles 'Show' from 'base'—but in general, the classes that 'generic-deriving' defines are not drop-in replacements. Moreover, the generic defaults that 'generic-deriving' provide often make simplifying assumptions that may violate expectations of how these classes might work elsewhere. For example, the generic default for 'GShow' does not behave exactly like 'deriving Show' would. If you are seeking "GHC.Generics"-based defaults for type classes in 'base', consider using the '<http://hackage.haskell.org/package/generic-data generic-data>' library. * "Generics.Deriving.Default" provides newtypes that allow leveraging the generic defaults in this library using the 'DerivingVia' GHC language extension. * "Generics.Deriving" re-exports "Generics.Deriving.Base", "Generics.Deriving.Default", and a selection of educational modules.
ca: Aquest paquet proporciona funcionalitat per generalitzar el mecanisme derivat a Haskell a classes arbitràries. Es va descriure per primera vegada en el document: * /Un mecanisme genèric de derivació per Haskell/. Jose Pedro Magalhaes, Atze Dijkstra, Johan Jeuring i Andres Loeh. Haskell'10. La implementació actual s'integra amb el nou GHC Generics. Vegeu .http://www.haskell.org/haskellwiki/GHC.Generics for per a més informació. El codi Haskell de plantilla es proporciona per a admetre GHCs més antics. Aquesta biblioteca està organitzada de la següent manera: * "Genèrics.Deriving.Base" defineix la funcionalitat bàsica per als genèrics de GHC, incloent les classes 'Generic(1)' i els tipus de dades de representació. En versions modernes de GHC, això simplement reexporta "GHC.Genèrics" de 'base'. En versions anteriors de GHC, aquest mòdul porta enrere parts de "GHC.Genèrics" que no es van incloure en aquell moment, incloent-hi instàncies «Generic(1)». * "Genèrics.Deriving.TH" implementa la funcionalitat Haskell de plantilla per a obtenir instàncies de 'Generic(1)'. * Codi educatiu: per tal d'aportar exemples de com definir i utilitzar "GHC.Generics"-based defaults, aquesta biblioteca ofereix una sèrie de mòduls que defineixen exemples de classes de tipus juntament amb implementacions predeterminades per als mètodes de les classes. Actualment, es proporcionen els següents mòduls: "Generics.Deriving.Copoint", "Generics.Deriving.ConNames", "Generics.Deriving.Enum", "Generics.Deriving.Eq", "Generics.Deriving.Foldable", "Generics.Deriving.Functor", "Generics.Deriving.Monoid", "Generics.Deriving.Semigrup", "Generics.Deriving.Show", "Generics.Deriving.Traversable" i "Generics.Deriving.Uniplate». Cal destacar que aquests mòduls estan destinats primordialment a fins educatius. Moltes de les classes d'aquests mòduls s'assemblen a altres classes d'ús comú, per exemple, 'GShow' de "Generics.Deriving.Show" s'assembla a 'Show' des de 'base', però en general, les classes que defineix 'deriving genèric' no són substituts. A més, els valors predeterminats genèrics que proporciona la «derivació genèrica» sovint fan suposicions simplificadores que poden violar les expectatives de com aquestes classes podrien funcionar en altres llocs. Per exemple, el valor predeterminat genèric per a «GShow» no es comporta exactament com ho faria «deriving Show». Si estàs buscant "GHC.Per defecte basat en genèrics per a classes de tipus a «base», considereu utilitzar la biblioteca «<http://hackage.haskell.org/package/generic-data generic-data>». * "Genèrics.Deriving.Default" proporciona nous tipus que permeten aprofitar els valors predeterminats genèrics d'aquesta biblioteca utilitzant l'extensió de llengua GHC 'DerivingVia'. * "Genèrics.Deriving" reexporta "Generics.Deriving.Base", "Generics.Deriving.Per defecte", i una selecció de mòduls educatius.

source: Haskell generic-deriving library development files
ca: Fitxers de desenvolupament de la biblioteca genèrica Haskell

source: This package provides the Haskell generic-deriving library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de derivats genèrics Haskell.

source: Generically derive traversals, lenses and prisms
ca: Genericalment deriva traversals, lents i prismes

source: This library uses GHC.Generics to derive efficient optics (traversals, lenses and prisms) for algebraic data types in a type-directed way, with a focus on good type inference and error messages when possible. The library exposes a van Laarhoven interface. For an alternative interface, supporting an opaque optic type, see '<https://hackage.haskell.org/package/generic-optics generic-optics>'.
ca: Aquesta biblioteca utilitza GHC.Genèriques per obtenir òptica eficient (traversals, lents i prismes) per a tipus de dades algebraiques de manera dirigida per tipus, amb un enfocament en la inferència de tipus bons i missatges d'error quan sigui possible. La biblioteca exposa una interfície de van Laarhoven. Per a una interfície alternativa, admet un tipus d'òptica opaca, vegeu '<https://hackage.haskell.org/package/generic-optics generic-optics>'.

source: This library uses GHC.Generics to derive efficient optics (traversals, lenses and prisms) for algebraic data types in a type-directed way, with a focus on good type inference and error messages when possible. This package is the shared internal logic of the '<https://hackage.haskell.org/package/generic-lens generic-lens>' and '<https://hackage.haskell.org/package/generic-optics generic-optics>' libraries.
ca: Aquesta biblioteca utilitza GHC.Genèriques per obtenir òptica eficient (traversals, lents i prismes) per a tipus de dades algebraiques de manera dirigida per tipus, amb un enfocament en la inferència de tipus bons i missatges d'error quan sigui possible. Aquest paquet és la lògica interna compartida de les biblioteques «<https://hackage.haskell.org/package/generic-lens generic-lens>» i «<https://hackage.haskell.org/package/generic-optics generic-optics>».

source: Haskell generic-lens-core library development files
ca: Fitxers de desenvolupament de la biblioteca generic-lens-core de Haskell

source: This package provides the Haskell generic-lens-core library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell generic-lens-core.

source: Haskell generic-lens library development files
ca: Fitxers de desenvolupament de la biblioteca generic-lens del Haskell

source: This package provides the Haskell generic-lens library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell generic-lens.

source: Derive monoid instances for product types
ca: Instàncies de monoide derivades per a tipus de producte

source: Using GHC's generics, allow for deriving `Monoid` and `Semigroup` instances for your product types.
ca: Utilitzant els genèrics de GHC, permet obtenir instàncies MMonoid. i .Semigroup. per als teus tipus de producte.

source: Haskell generic-monoid library development files
ca: Fitxers de desenvolupament de la biblioteca genèric-monoid de Haskell

source: This package provides the Haskell generic-monoid library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell generic-monoid.

source: Generic random generators for QuickCheck
ca: Generadors aleatoris genèrics per al QuickCheck

source: Derive instances of 'Arbitrary' for QuickCheck, with various options to customize implementations. For more information - See the README - "Generic.Random.Tutorial" - http://blog.poisson.chat/posts/2018-01-05-generic-random-tour.html.
ca: Instàncies derives de 'Arbitrari' per a QuickCheck, amb diverses opcions per a personalitzar implementacions. Per a més informació - Vegeu el README - "Generic.Aleatòriament.Guia d'aprenentatge" - http://blog.poisson.chat/posts/2018-01-05-generic-random-tour.html.

source: Haskell generic-random library development files
ca: Fitxers de desenvolupament de la biblioteca genèrica aleatòria de Haskell

source: This package provides the Haskell generic-random library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca genèrica aleatòria de Haskell.

source: Haskell ghc library
ca: Biblioteca Haskell ghc

source: This package provides the Haskell ghc library.
ca: Aquest paquet proporciona la biblioteca Haskell ghc.

source: Haskell ghc-boot library
ca: Biblioteca Haskell ghc-boot

source: This package provides the Haskell ghc-boot library.
ca: Aquest paquet proporciona la biblioteca ghc-boot de Haskell.

source: Haskell ghc-boot library development files
ca: Fitxers de desenvolupament de la biblioteca ghc-boot de Haskell

source: This package provides the Haskell ghc-boot library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca ghc-boot de Haskell.

source: Haskell ghc-boot-th library
ca: Biblioteca Haskell ghc-boot-th

source: This package provides the Haskell ghc-boot-th library.
ca: Aquest paquet proporciona la biblioteca Haskell ghc-boot-th.

source: Haskell ghc-boot-th library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell ghc-boot-th

source: This package provides the Haskell ghc-boot-th library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca ghc-boot-th de Haskell.

source: "GHC.ByteOrder" API Compatibility Layer
ca: "GHC.Capa de compatibilitat amb l'API de ByteOrder
