Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: A Haskell interface to 'syslog(3)' as specified in <http://pubs.opengroup.org/onlinepubs/9699919799/functions/syslog.html POSIX.1-2008>. The entire public API lives in "System.Posix.Syslog". There is a set of exposed modules available underneath that one, which contain various implementation details that may be useful to other developers who want to implement syslog-related functionality. /Users/ of 'syslog', however, do not need them. An example program that demonstrates how to use this library is available in the <https://github.com/peti/hsyslog/blob/master/example/Main.hs examples> directory of this package.
ca: Una interfície Haskell a «syslog(3)» segons s'especifica a <http://pubs.opengroup.org/onlinepubs/9699919799/functions/syslog.html POSIX.1-2008>. Tota l'API pública viu a "System.Posix.Syslog». Hi ha un conjunt de mòduls exposats disponibles sota d'aquest, que contenen diversos detalls d'implementació que poden ser útils a altres desenvolupadors que volen implementar la funcionalitat relacionada amb el syslog. /Users/ de 'syslog', però, no els necessita. Un programa d'exemple que demostra com utilitzar aquesta biblioteca està disponible al directori <https://github.com/peti/hsyslog/blob/master/example/Main.hs examples> d'aquest paquet.

source: Haskell hsyslog library development files
ca: Fitxers de desenvolupament de la biblioteca Hsyslog de Haskell

source: This package provides the Haskell hsyslog library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hsyslog.

source: HTML combinator library
ca: Biblioteca combinatora HTML

source: This package contains a combinator library for constructing HTML documents.
ca: Aquest paquet conté una biblioteca combinadora per a la construcció de documents HTML.

source: Haskell html library development files
ca: Fitxers de desenvolupament de la biblioteca html de Haskell

source: This package provides the Haskell html library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca html Haskell.

source: Converting to/from HTTP API data like URL pieces, headers and query parameters
ca: S'estan convertint a/des de dades de l'API HTTP com ara peces d'URL, capçaleres i paràmetres de consulta

source: This package defines typeclasses used for converting Haskell data types to and from HTTP API data. Please see README.md.
ca: Aquest paquet defineix les classes de tipus utilitzades per convertir els tipus de dades Haskell a i des de les dades de l'API HTTP. Si us plau, vegeu README.md.

source: This package provides the Haskell http-api-data library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell http-api-data.

source: An HTTP client engine
ca: Un motor de client HTTP

source: Hackage documentation generation is not reliable. For up to date documentation, please see: <http://www.stackage.org/package/http-client>.
ca: La generació de documentació de Hackage no és fiable. Per obtenir documentació actualitzada, consulteu: <http://www.stackage.org/package/http-client>.

source: Haskell http-client library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell http-client

source: This package provides the Haskell http-client library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell http-client.

source: Restricting the servers that http-client will use
ca: Restricció dels servidors que http-client utilitzarà

source: Addition to the http-client and http-client-tls libraries, that restricts the HTTP servers that can be used. This is useful when a security policy needs to eg, prevent connections to HTTP servers on localhost or a local network, or only allow connections to a specific HTTP server. It handles restricting redirects as well as the initial HTTP connection, and it also guards against DNS poisoning attacks.
ca: Suma a les biblioteques http-client i http-client-tls, que restringeix els servidors HTTP que es poden utilitzar. Això és útil quan una política de seguretat necessita, p. ex., evitar connexions a servidors HTTP en localhost o en una xarxa local, o només permetre connexions a un servidor HTTP específic. Gestiona les redireccions restrictives, així com la connexió HTTP inicial, i també protegeix contra atacs d'enverinament per DNS.

source: Haskell http-client-restricted library development files
ca: Fitxers de desenvolupament de la biblioteca amb restriccions http-client

source: This package provides the Haskell http-client-restricted library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca amb restriccions de haskell http-client.

source: Http-client backend using the connection package and tls library
ca: Dorsal Http-client utilitzant el paquet de connexió i la biblioteca tls

source: Hackage documentation generation is not reliable. For up to date documentation, please see: <https://www.stackage.org/package/http-client-tls>.
ca: La generació de documentació de Hackage no és fiable. Per obtenir documentació actualitzada, consulteu: <https://www.stackage.org/package/http-client-tls>.

source: Haskell http-client-tls library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell http-client-tls

source: This package provides the Haskell http-client-tls library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell http-client-tls.

source: HTTP client package with conduit interface and HTTPS support
ca: Paquet client HTTP amb interfície de conducte i suport HTTPS

source: Hackage documentation generation is not reliable. For up to date documentation, please see: <http://www.stackage.org/package/http-conduit>.
ca: La generació de documentació de Hackage no és fiable. Per obtenir documentació actualitzada, consulteu: <http://www.stackage.org/package/http-conduit>.

source: Haskell http-conduit library development files
ca: Haskell http-conduit biblioteca fitxers de desenvolupament

source: This package provides the Haskell http-conduit library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell http-conduit.

source: HTTP Date parser/formatter
ca: Analitzador/formatador de data HTTP

source: Fast parser and formatter for HTTP Date.
ca: Analitzador i formatador ràpid per a la data HTTP.

source: Haskell http-date library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell http-date

source: This package provides the Haskell http-date library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell http-date.

source: Processing HTTP Content-Type and Accept headers
ca: Processament de les capçaleres Content-Type i Accept HTTP

source: This library is intended to be a comprehensive solution to parsing and selecting quality-indexed values in HTTP headers. It is capable of parsing both media types and language parameters from the Accept and Content header families, and can be extended to match against other accept headers as well. Selecting the appropriate header value is achieved by comparing a list of server options against the quality-indexed values supplied by the client. In the following example, the Accept header is parsed and then matched against a list of server options to serve the appropriate media using 'mapAcceptMedia': > getHeader >>= maybe send406Error sendResourceWith . mapAcceptMedia > [ ("text/html", asHtml) > , ("application/json", asJson) > ] Similarly, the Content-Type header can be used to produce a parser for request bodies based on the given content type with 'mapContentMedia': > getContentType >>= maybe send415Error readRequestBodyWith . mapContentMedia > [ ("application/json", parseJson) > , ("text/plain", parseText) > ] The API is agnostic to your choice of server.
ca: Aquesta biblioteca pretén ser una solució integral per analitzar i seleccionar valors indexats de qualitat en les capçaleres HTTP. És capaç d'analitzar tant els tipus de suports com els paràmetres de llengua de les famílies de capçalera Accepta i Contingut, i es pot estendre per coincidir amb altres capçaleres acceptades també. La selecció del valor de capçalera adequat s'aconsegueix comparant una llista d'opcions del servidor amb els valors indexats de qualitat subministrats pel client. En el següent exemple, la capçalera Accept s'analitza i després es correspon amb una llista d'opcions del servidor per a servir el mitjà apropiat utilitzant «mapAcceptMedia»: . getHeader . potser send406Error sendResourceWith . mapAcceptMedia ] [ ("text/html", asHtml) ] , ("application/json", asJson) ] ] De la mateixa manera, la capçalera Content-Type es pot utilitzar per a produir un analitzador per als cossos de sol·licitud basat en el tipus de contingut indicat amb «mapContentMedia»: . getContentType . potser send415Error readRequestBodyWith . mapContentMedia ] [ ("application/json", parseJson) ] , ("text/plain", parseText) ] ] L'API és agnòstic a la vostra elecció de servidor.

source: Haskell http-media library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell http-media

source: This package provides the Haskell http-media library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell http-media.

source: Generic HTTP types for Haskell (for both client and server code)
ca: Tipus HTTP genèrics per a Haskell (tant per al codi del client com del servidor)

source: Generic HTTP types for Haskell (for both client and server code).
ca: Tipus HTTP genèrics per a Haskell (tant per al codi del client com del servidor).

source: Haskell http-types library development files
ca: Fitxers de desenvolupament de la biblioteca de tipus http de Haskell

source: This package provides the Haskell http-types library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell http-types.

source: HTTP/2 library
ca: Biblioteca HTTP/2

source: HTTP/2 library including frames, priority queues, HPACK, client and server.
ca: Biblioteca HTTP/2 que inclou fotogrames, cues de prioritat, HPACK, client i servidor.

source: Haskell http2 library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell http2

source: This package provides the Haskell http2 library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell http2.

source: A collection of tools for processing XML with Haskell
ca: Una col·lecció d'eines per processar XML amb Haskell

source: The Haskell XML Toolbox bases on the ideas of HaXml and HXML, but introduces a more general approach for processing XML with Haskell. The Haskell XML Toolbox uses a generic data model for representing XML documents, including the DTD subset and the document subset, in Haskell. It contains a validating XML parser, a HTML parser, namespace support, an XPath expression evaluator, an XSLT library, a RelaxNG schema validator and funtions for serialization and deserialization of user defined data. The library makes extensive use of the arrow approach for processing XML. Since version 9 the toolbox is partitioned into various (sub-)packages. This package contains the core functionality, hxt-curl, hxt-tagsoup, hxt-relaxng, hxt-xpath, hxt-xslt, hxt-regex-xmlschema contain the extensions. hxt-unicode contains encoding and decoding functions, hxt-charproperties char properties for unicode and XML. Changes from 9.3.1.21: ghc-9.0 compatibility Changes from 9.3.1.20: ghc 8.10 and 9.0 compatibility, tuple picker up to 24-tuples, Either instance for xpickle Changes from 9.3.1.19: ghc-8.8.2 compatibility Changes from 9.3.1.15: Bug in quoting PI instructions in showXmlTrees fixed Changes from 9.3.1.14: For ghc-7.10 network-uri is automatically selected Changes from 9.3.1.13: ghc-7.10 compatibility Changes from 9.3.1.12: Bug when unpickling an empty attribute value removed Changes from 9.3.1.11: Bug fix in haddock comments Changes from 9.3.1.10: Bug in DTD validation, space and time leak in delta removed Changes from 9.3.1.9: lower bound of mtl dependency lowered to 2.0.1 Changes from 9.3.1.8: Bug in hread removed Changes from 9.3.1.7: Foldable and Traversable instances for NTree added Control.Except used instead of deprecated Control.Error Changes from 9.3.1.6: canonicalize added in hread and hreadDoc Changes from 9.3.1.4: conditionally (no default) dependency from networt changed to network-uri with flag "network-uri" Changes from 9.3.1.3: warnings from ghc-7.8.1 removed Changes from 9.3.1.2: https as protocol added Changes from 9.3.1.1: new parser xreadDoc Changes from 9.3.1.0: in readString all input decoding switched off Changes from 9.3.0.1: lower bound for network set to be >= 2.4 Changes from 9.3.0: upper bound for network set to be < 2.4 (URI signatures changed in 2.4) Changes from 9.2.2: XMLSchema validation integrated Changes from 9.2.1: user defined mime type handlers added Changes from 9.2.0: New warnings from ghc-7.4 removed.
ca: La caixa d'eines Haskell XML es basa en les idees de HaXml i HXML, però introdueix un enfocament més general per processar XML amb Haskell. La caixa d'eines Haskell XML utilitza un model de dades genèric per representar documents XML, incloent el subconjunt DTD i el subconjunt de documents, a Haskell. Conté un analitzador XML validador, un analitzador HTML, suport d'espai de noms, un avaluador d'expressions XPath, una biblioteca XSLT, un validador d'esquemes RelaxNG i funtions per a la serialització i desserialització de dades definides per l'usuari. La biblioteca fa un ús extensiu de l'enfocament de fletxa per processar XML. Des de la versió 9 la caixa d'eines es divideix en diversos (sub-)paquets. Aquest paquet conté la funcionalitat principal, hxt-curl, hxt-tagsoup, hxt-relaxng, hxt-xpath, hxt-xslt, hxt-regex-xmlschema contenen les extensions. hxt-unicode conté funcions de codificació i descodificació, propietats de caràcters hxt-charproperties per a unicode i XML. Canvis des de la 9.3.1.21: compatibilitat ghc-9.0 Canvis des de la compatibilitat 9.3.1.20: ghc 8.10 i 9.0, tuple picker fins a 24-tuples, sigui per exemple per xpickle Canvis des de la 9.3.1.19: compatibilitat amb ghc-8.8.2 Canvis des de la 9.3.1.15: Error en citar les instruccions PI a «showXmlTrees» solucionades Canvis des de la 9.3.1.14: Per a ghc-7.10, l'URI de la xarxa se selecciona automàticament Canvis a 9.3.1.13: compatibilitat ghc-7.10 Canvis des de la 9.3.1.12: Error en desmarcar un valor buit d'atribut eliminat Canvis des de la 9.3.1.11: Esmena d'errors als comentaris de l'hadock Canvis des de la 9.3.1.10: S'ha eliminat un error en la validació de DTD, una fuita d'espai i temps al delta Canvis de 9.3.1.9: límit inferior de la dependència mtl baixat a 2.0.1 Canvis des de la 9.3.1.8: S'ha eliminat l'error en el fil Canvis de 9.3.1.7: Instàncies plegables i transitables per al control afegit de NTree.Excepte utilitzat en lloc de control obsolet.Error Canvis a partir de la 9.3.1.6: canonicalitza afegit a «hread» i «hreadDoc» Canvis des de la 9.3.1.4: condicionalment (no per defecte) dependència de networt canviada a network-uri amb l'indicador «network-uri» Canvis a partir de la 9.3.1.3: s'han eliminat els avisos del ghc-7.8.1 Canvis a partir de la 9.3.1.2: https com a protocol afegit Canvis des de la 9.3.1.1: analitzador nou xreadDoc Canvis des de la 9.3.1.0: a readString s'ha desactivat tota la descodificació d'entrada Canvis des de la 9.3.0.1: límit inferior per al conjunt de xarxa a 2.4 2.4 Canvis des de la 9.3.0: límit superior per al conjunt de xarxa a 2.4 2.4 (s'han canviat les signatures d'URI a 2.4) Canvis des de la 9.2.2: validació XMLSchema integrada Canvis des de la 9.2.1: s'han afegit els controladors de tipus MIME definits per l'usuari Canvis des de la 9.2.0: s'han eliminat els avisos nous des del ghc-7.4.

source: Character properties and classes for XML and Unicode
ca: Propietats i classes de caràcters per a XML i Unicode

source: Character properties defined by XML and Unicode standards. These modules contain predicates for Unicode blocks, char properties and character predicates defined by XML. Supported Unicode version is 13.0.0 9.4.0.0: Supported Unicode version 12.1.0 9.3.0.2: Supported Unicode version 9.0.0.
ca: Propietats de caràcter definides per estàndards XML i Unicode. Aquests mòduls contenen predicats per a blocs Unicode, propietats de caràcters i predicats de caràcters definits per XML. La versió Unicode admesa és 13.0.0 9.4.0.0: Versió Unicode admesa 12.1.0 9.3.0.2: Versió Unicode admesa 9.0.0.

source: Haskell hxt-charproperties library development files
ca: Haskell hxt-charproperties fitxers de desenvolupament de biblioteca

source: This package provides the Haskell hxt-charproperties library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hxt-charproperties.

source: Haskell hxt library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hxt

source: This package provides the Haskell hxt library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hxt.

source: A regular expression library for W3C XML Schema regular expressions
ca: Una biblioteca d'expressions regulars per a expressions regulars XML Schema de W3C

source: This library supports full W3C XML Schema regular expressions inclusive all Unicode character sets and blocks. The complete grammar can be found under <http://www.w3.org/TR/xmlschema11-2/#regexs>. It is implemented by the technique of derivations of regular expressions. The W3C syntax is extended to support not only union of regular sets, but also intersection, set difference, exor. Matching of subexpressions is also supported. The library can be used for constricting lightweight scanners and tokenizers. It is a standalone library, no external regex libraries are used. Extensions in 9.2: The library does nor only support String's, but also ByteString's and Text in strict and lazy variants.
ca: Aquesta biblioteca admet expressions regulars de l'esquema XML W3C completes incloent tots els jocs de caràcters i blocs Unicode. La gramàtica completa es pot trobar sota <http://www.w3.org/TR/xmlschema11-2/#regexs>. S'aplica mitjançant la tècnica de derivacions d'expressions regulars. La sintaxi del W3C s'estén per donar suport no només a la unió de conjunts regulars, sinó també a la intersecció, la diferència de conjunts, l'exor. També s'admet la coincidència de subexpressions. La biblioteca es pot utilitzar per restringir escàners i tokenizers lleugers. És una biblioteca independent, no s'utilitzen biblioteques regex externes. Extensions en 9.2: La biblioteca no només suporta String, sinó també ByteString i Text en variants estrictes i mandroses.

source: Haskell hxt-regex-xmlschema library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hxt-regex-xmlschema

source: This package provides the Haskell hxt-regex-xmlschema library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hxt-regex-xmlschema.

source: Unicode en-/decoding functions for utf8, iso-latin-* and other encodings
ca: Funcions Unicode en-/decoding per a utf8, iso-latin-* i altres codificacions

source: Unicode encoding and decoding functions for utf8, iso-latin-* and somes other encodings, used in the Haskell XML Toolbox. ISO Latin 1 - 16, utf8, utf16, ASCII are supported. Decoding is done with lazy functions, errors may be detected or ignored.
ca: Funcions de codificació i descodificació Unicode per a utf8, iso-latin-* i algunes altres codificacions, utilitzades a la caixa d'eines XML de Haskell. ISO Latin 1 - 16, utf8, utf16, ASCII són compatibles. La descodificació es fa amb funcions mandroses, els errors es poden detectar o ignorar.

source: Haskell hxt-unicode library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hxt-unicode

source: This package provides the Haskell hxt-unicode library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hxt-unicode.

source: Utilities for indexed profunctors
ca: Utilitats per als profunctors indexats

source: This package contains basic definitions related to indexed profunctors. These are primarily intended as internal utilities to support the 'optics' and 'generic-lens' package families.
ca: Aquest paquet conté definicions bàsiques relacionades amb els profunctors indexats. Aquestes estan destinades principalment com a utilitats internes per a donar suport a les famílies de paquets «òptiques» i «de lents gèriques».

source: Haskell indexed-profunctors library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell indexed-profunctors

source: This package provides the Haskell indexed-profunctors library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell indexed-profunctors.

source: This package provides three useful generalizations: ' class Functor f => FunctorWithIndex i f | f -> i where imap :: (i -> a -> b) -> f a -> f b ' ' class Foldable f => FoldableWithIndex i f | f -> i where ifoldMap :: Monoid m => (i -> a -> m) -> f a -> m ' ' class (FunctorWithIndex i t, FoldableWithIndex i t, Traversable t) => TraversableWithIndex i t | t -> i where itraverse :: Applicative f => (i -> a -> f b) -> t a -> f (t b) ' This package contains instances for types in GHC boot libraries. For some additional instances see [indexed-traversable-instances](https://hackage.haskell.org/package/indexed-traversable-instances). The [keys](https://hackage.haskell.org/package/keys) package provides similar functionality, but uses (associated) 'TypeFamilies' instead of 'FunctionalDependencies'.
ca: Aquest paquet proporciona tres generalitzacions útils: ' classe Functor f ) FunctorWithIndex i f ) f -) i on imap :: (i -) a -) b) - f f a - f b ' ' classe Foldable f ) FoldableWithIndex i f f - where i where ifoldMap :: Monoid m ) (i -) a -) m) -) f a -' m ' ' class (FunctorWithIndex i t, FoldableWithIndex i t, Traversable t) => TraversableWithIndex i t t - t i where itraverse :: Applicative f ) (i - a a - f f b) - t t a -) f (t b) Aquest paquet conté instàncies per als tipus a les biblioteques d'arrencada GHC. Per a algunes instàncies addicionals, vegeu [instàncies indexades-traversables](https://hackage.haskell.org/package/indexed-traversable-instàncies). El paquet [keys](https://hackage.haskell.org/package/keys) proporciona funcionalitats similars, però utilitza (associat) «TypeFamilies» en lloc de «FunctionalDependencies».

source: Haskell indexed-traversable library development files
ca: Fitxers de desenvolupament de biblioteques indexades i transitables del Haskell

source: This package provides the Haskell indexed-traversable library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca indexada transitable de Haskell.

source: More instances of FunctorWithIndex, FoldableWithIndex, TraversableWithIndex
ca: Més instàncies de FunctorWithIndex, FoldableWithIndex, TraversableWithIndex
