Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: 'th-reify-many' provides functions for recursively reifying top level declarations. The main intended use case is for enumerating the names of datatypes reachable from an initial datatype, and passing these names to some function which generates instances.
ca: 'th-reify-many' proporciona funcions per a la reificació recursiva de les declaracions de primer nivell. El cas d'ús principal és per enumerar els noms dels tipus de dades accessibles a partir d'un tipus de dades inicial, i passar aquests noms a alguna funció que genera instàncies.

source: Haskell th-reify-many library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell th-reify-many

source: This package provides the Haskell th-reify-many library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell th-reify-many.

source: Collection of useful functions for use with Template Haskell
ca: Col·lecció de funcions útils per a usar amb la plantilla Haskell

source: Collection of useful functions for use with Template Haskell.
ca: Col·lecció de funcions útils per utilitzar amb la plantilla Haskell.

source: Haskell th-utilities library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell th-utilities

source: This package provides the Haskell th-utilities library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell th-utilities.

source: An either-or-both data type
ca: Un tipus de dades qualsevol o ambdós

source: This package provides a data type 'These a b' which can hold a value of either type or values of each type. This is usually thought of as an "inclusive or" type (contrasting 'Either a b' as "exclusive or") or as an "outer join" type (contrasting '(a, b)' as "inner join"). ' data These a b = This a | That b | These a b ' Since version 1, this package was split into parts: * <https://hackage.haskell.org/package/semialign semialign> For 'Align' and 'Zip' type-classes. * <https://hackage.haskell.org/package/semialign-indexed semialign-indexed> For 'SemialignWithIndex' class, providing 'ialignWith' and 'izipWith'. * <https://hackage.haskell.org/package/these-lens these-lens> For lens combinators. * <http://hackage.haskell.org/package/monad-chronicle monad-chronicle> For transformers variant of 'These'.
ca: Aquest paquet proporciona un tipus de dades 'These a b' que pot contenir un valor de qualsevol tipus o valors de cada tipus. Això es pensa normalment com un tipus "inclusiu o" (contrastejant 'Either a b' com a "exclusiu o") o com un tipus "outer join" (contrastejant '(a, b)' com a "inner join"). ' dades Aquests a b Aquest a ' Aquell b Aquests a b ' Des de la versió 1, aquest paquet es va dividir en parts: * <https://hackage.haskell.org/package/semialign semialign> Per a les classes de tipus 'Alinea' i 'Zip'. * <https://hackage.haskell.org/package/semialign-indexed semialign-indexed> Per a la classe 'SemialignWithIndex', proporcionant 'ialignWith' i 'izipWith'. * <https://hackage.haskell.org/package/these-lens these-lens> Per als combinadors de lents. * <http://hackage.haskell.org/package/monad-chronicle monad-chronicle> Per a la variant dels transformadors de 'These'.

source: Haskell these library development files
ca: Haskell d'aquests fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell these library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell.

source: GUI framework that uses the web browser as a display
ca: Marc de treball de la IGU que utilitza el navegador web com a pantalla

source: Threepenny-GUI is a GUI framework that uses the web browser as a display. It's very easy to install because everyone has a web browser installed. A program written with Threepenny is essentially a small web server that displays the user interface as a web page to any browser that connects to it. You can freely manipulate the HTML DOM and handle JavaScript events from your Haskell code. Stability forecast: This is an experimental release! Send me your feedback! Significant API changes are likely in future versions. NOTE: This library contains examples, but they are not built by default. To build and install the example, use the 'buildExamples' flag like this 'cabal install threepenny-gui -fbuildExamples'.
ca: Threepenny-GUI és un marc de treball d'IGU que utilitza el navegador web com a pantalla. És molt fàcil d'instal·lar perquè tothom té instal·lat un navegador web. Un programa escrit amb Threepenny és essencialment un petit servidor web que mostra la interfície d'usuari com una pàgina web a qualsevol navegador que es connecta amb ella. Podeu manipular lliurement el DOM HTML i gestionar esdeveniments JavaScript des del codi Haskell. Pronosticació d'estabilitat: Aquest és un llançament experimental! Envia'm els teus comentaris! És probable que els canvis significatius de l'API es facin en versions futures. NOTA: Aquesta biblioteca conté exemples, però no es construeixen de manera predeterminada. Per a construir i instal·lar l'exemple, utilitzeu l'indicador «buildExamples» com aquest 'cabal install threepenny-gui -fbuildExamples'.

source: Haskell threepenny-gui library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell threepenny-gui

source: This package provides the Haskell threepenny-gui library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell threepenny-gui.

source: Haskell time library
ca: Biblioteca de temps del Haskell

source: This package provides the Haskell time library.
ca: Aquest paquet proporciona la biblioteca de temps Haskell.

source: Compatibility package for time
ca: Paquet de compatibilitat per temps

source: This packages tries to compat as much of 'time' features as possible. /TODO:/ * Difference type 'ParseTime' and 'FormatTime' instances are missing. * Formatting varies depending on underlying 'time' version * 'dayFractionToTimeOfDay' on extreme values.
ca: Aquests paquets intenten combinar tantes característiques de «temps» com sigui possible. /TODO:/ * Falta la diferència entre les instàncies «ParseTime» i «FormatTime». * La formatació varia depenent de la versió 'time' subjacent * 'dayFractionToTimeOfDay' sobre valors extrems.

source: Haskell time-compat library development files
ca: Fitxers de desenvolupament de la biblioteca de conformitat amb el temps del Haskell

source: This package provides the Haskell time-compat library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell amb temps compatible.

source: Haskell time library development files
ca: Fitxers de desenvolupament de la biblioteca de temps Haskell

source: This package provides the Haskell time library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell time.

source: Compatibile module for time-format locale
ca: Mòdul compatible per a la configuració regional de format de temps

source: This package contains wrapped name module for time-format locale between old-locale and time-1.5.
ca: Aquest paquet conté un mòdul de nom ajustat per a la configuració regional de format de temps entre la «old-locale» i la «time-1.5».

source: Haskell time-locale-compat library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell amb compatibilitat temporal

source: This package provides the Haskell time-locale-compat library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell amb compatibilitat temporal.

source: Scalable timer
ca: Temporitzador escalable

source: Scalable timer functions provided by a timer manager.
ca: Funcions de temporitzador escalables proporcionades per un gestor de temporitzador.

source: Haskell time-manager library development files
ca: Fitxers de desenvolupament de la biblioteca de gestió de temps Haskell

source: This package provides the Haskell time-manager library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de gestió de temps Haskell.

source: A basic library for defining units of time as types
ca: Una biblioteca bàsica per definir unitats de temps com a tipus

source: In many cases, it is useful (either for error checking or documentation reasons) to define input and output types as having a particular unit of time. In addition, by creating a type class defining type units, this library should make it easier to separate the units of time the developer wants to think in versus the units of time the library author wants to think in.
ca: En molts casos, és útil (ja sigui per raons de comprovació d'errors o de documentació) definir els tipus d'entrada i sortida com que tenen una unitat de temps particular. A més, mitjançant la creació d'una classe tipus que defineixi les unitats de tipus, aquesta biblioteca hauria de facilitar la separació de les unitats de temps en què el desenvolupador vol pensar en contra de les unitats de temps en què l'autor de la biblioteca vol pensar.

source: Haskell time-units library development files
ca: Fitxers de desenvolupament de la biblioteca d'unitats temporals del Haskell

source: This package provides the Haskell time-units library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell time-units.

source: Time monadic computations with an IO base
ca: Càlculs monòdics de temps amb una base IO

source: A simple wrapper to show the used CPU time of monadic computation with an IO base.
ca: Un embolcall simple per mostrar el temps de CPU utilitzat de càlcul monòdic amb una base IO.

source: Haskell timeit library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell timeit

source: This package provides the Haskell timeit library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell timeit.

source: A pure Haskell parser and renderer for binary Olson timezone files
ca: Un analitzador i renderitzador Haskell pur per als fitxers binaris de zona horària Olson

source: A parser and renderer for binary Olson timezone files whose format is specified by the tzfile(5) man page on Unix-like systems. For more information about this format, see <http://www.iana.org/time-zones/repository/tz-link.html>. Functions are provided for converting the parsed data into 'TimeZoneSeries' objects from the timezone-series package. On many platforms, binary Olson timezone files suitable for use with this package are available in the directory /usr/share/zoneinfo and its subdirectories on your computer. For a way to read binary Olson timezone files at compile time, see the timezone-olson-th package (<http://hackage.haskell.org/package/timezone-olson-th>).
ca: Un analitzador i renderitzador per a fitxers binaris de zona horària d'Olson el format dels quals s'especifica a la pàgina «man» de tzfile(5) en sistemes similars a Unix. Per a més informació sobre aquest format, vegeu <http://www.iana.org/time-zones/repository/tz-link.html>. Es proporcionen funcions per convertir les dades analitzades en objectes «TimeZoneSeries» del paquet timezone-series. En moltes plataformes, els fitxers binaris de zona horària Olson adequats per al seu ús amb aquest paquet estan disponibles al directori /usr/share/zoneinfo i els seus subdirectoris al vostre ordinador. Per a una manera de llegir fitxers binaris de zona horària d'Olson en temps de compilació, vegeu el paquet timezone-olson-th (<http://hackage.haskell.org/package/timezone-olson-th>).

source: Haskell timezone-olson library development files
ca: Fitxers de desenvolupament de la biblioteca Timezone-olson del Haskell

source: This package provides the Haskell timezone-olson library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell timezone-olson.

source: Enhanced timezone handling for Data.Time
ca: Gestió millorada de la zona horària per a les dades.Hora

source: This package endows Data.Time, from the time package, with several data types and functions for enhanced processing of timezones. For one way to create timezone series, see the timezone-olson (<http://hackage.haskell.org/package/timezone-olson>) and timezone-olson-th (<http://hackage.haskell.org/package/timezone-olson-th>) packages.
ca: Aquest paquet dota les dades.Temps, a partir del paquet temps, amb diversos tipus de dades i funcions per a un processament millorat de les zones horàries. Per a una manera de crear sèries de zones horàries, vegeu els paquets timezone-olson (<http://hackage.haskell.org/package/timezone-olson>) i timezone-olson-th (<http://hackage.haskell.org/package/timezone-olson-th>).

source: Haskell timezone-series library development files
ca: Fitxers de desenvolupament de la biblioteca «timezone-series» del Haskell

source: This package provides the Haskell timezone-series library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell timezone-series.

source: TLS/SSL protocol native implementation (Server and Client)
ca: Implementació nativa del protocol TLS/SSL (Servidor i Client)

source: Native Haskell TLS and SSL protocol implementation for server and client. This provides a high-level implementation of a sensitive security protocol, eliminating a common set of security issues through the use of the advanced type system, high level constructions and common Haskell features. Currently implement the SSL3.0, TLS1.0, TLS1.1, TLS1.2 and TLS 1.3 protocol, and support RSA and Ephemeral (Elliptic curve and regular) Diffie Hellman key exchanges, and many extensions. Some debug tools linked with tls, are available through the <http://hackage.haskell.org/package/tls-debug/>.
ca: Implementació del protocol TLS i SSL Native Haskell per a servidor i client. Això proporciona una implementació d'alt nivell d'un protocol de seguretat sensible, eliminant un conjunt comú de problemes de seguretat mitjançant l'ús del sistema de tipus avançat, construccions d'alt nivell i característiques comunes de Haskell. Actualment implementa el protocol SSL3.0, TLS1.0, TLS1.1, TLS1.2 i TLS 1.3, i suporta intercanvis de claus RSA i Ephemeral (corba elíptica i regular) Diffie Hellman, i moltes extensions. Algunes eines de depuració enllaçades amb tls, estan disponibles a través del <http://hackage.haskell.org/package/tls-debug/>.

source: Haskell tls library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell tls

source: This package provides the Haskell tls library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell tls.

source: In-memory TLS session manager
ca: Gestor de sessions TLS a la memòria

source: TLS session manager with limitation, automatic pruning, energy saving and replay resistance.
ca: Gestor de sessions TLS amb limitació, poda automàtica, estalvi energètic i resistència a la reproducció.

source: Haskell tls-session-manager library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell tls-session-manager

source: This package provides the Haskell tls-session-manager library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell tls-session-manager.

source: Directed acyclic graphs
ca: Gràfics acíclics dirigits

source: Directed acyclic graphs can be sorted topographically. Existence of topographic ordering allows writing many graph algorithms efficiently. And many graphs, e.g. most dependency graphs are acyclic! There are some algorithms built-in: dfs, transpose, transitive closure, transitive reduction... Some algorithms even become not-so-hard to implement, like a longest path!.
ca: Els grafs acíclics dirigits es poden ordenar topogràficament. L'existència d'ordenació topogràfica permet escriure molts algorismes de grafs de manera eficient. I molts grafs, per exemple, la majoria de grafs de dependència són acíclics! Hi ha alguns algorismes incorporats: dfs, transpose, tancament transitiu, reducció transitiva... Alguns algoritmes fins i tot no es tornen tan difícils d'implementar, com un camí més llarg!.

source: Haskell topograph library development files
ca: Fitxers de desenvolupament de la biblioteca de topografia Haskell

source: This package provides the Haskell topograph library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de topògrafs Haskell.

source: BitTorrent file parser and generater
ca: Analitzador de fitxers i generador de BitTorrent

source: BitTorrent file parser and generater.
ca: Analitzador i generador de fitxers BitTorrent.

source: Haskell torrent library development files
ca: Fitxers de desenvolupament de la biblioteca torrent Haskell

source: This package provides the Haskell torrent library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca torrent de Haskell.

source: Haskell transformers library
ca: Biblioteca de transformadors de Haskell

source: This package provides the Haskell transformers library.
ca: Aquest paquet proporciona la biblioteca de transformadors de Haskell.

source: Lift computations from the bottom of a transformer stack
ca: Càlculs d'elevació des de la part inferior d'una pila de transformadors

source: This package provides a straightforward port of 'monadLib''s BaseM typeclass to 'transformers'.
ca: Aquest paquet proporciona un port senzill de la classe de tipus BaseM de 'monadLib' a 'transformadors'.

source: Haskell transformers-base library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell transformers-base

source: This package provides the Haskell transformers-base library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell transformers-base.

source: A small compatibility shim for the transformers library
ca: Un petit shim de compatibilitat per a la biblioteca de transformadors

source: This package includes backported versions of types that were added to transformers in transformers 0.3, 0.4, and 0.5 for users who need strict transformers 0.2 or 0.3 compatibility to run on old versions of the platform, but also need those types. Those users should be able to just depend on 'transformers >= 0.2' and 'transformers-compat >= 0.3'. Note: missing methods are not supplied, but this at least permits the types to be used.
ca: Aquest paquet inclou versions retroportades dels tipus que es van afegir als transformadors en transformadors 0.3, 0.4 i 0.5 per als usuaris que necessiten transformadors estrictes 0.2 o 0.3 compatibilitat per funcionar en versions antigues de la plataforma, però també necessiten aquests tipus. Aquests usuaris haurien de poder dependre únicament de "transformadors 0.2 0.2" i "transformadors-compat 0.3 0.3". Nota: no es proporcionen els mètodes que falten, però això almenys permet els tipus a utilitzar.

source: Haskell transformers-compat library development files
ca: Fitxers de desenvolupament de biblioteques compatibles amb els transformadors de Haskell

source: This package provides the Haskell transformers-compat library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell transformers-compat.

source: Haskell transformers library development files
ca: Fitxers de desenvolupament de la biblioteca de transformadors de Haskell

source: This package provides the Haskell transformers library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de transformadors de Haskell.

source: An Except monad transformer with
ca: Un transformador Except monad amb

source: Extra pieces for working with Except.
ca: Peces extres per treballar amb Except.

source: Haskell transformers-except library development files
ca: Transformadors de Haskell, excepte fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell transformers-except library development files.
ca: Aquest paquet proporciona els transformadors de Haskell, excepte els fitxers de desenvolupament de la biblioteca.

source: Diffing of (expression) trees
ca: Diferència d'arbres (expressió)

source: Common diff algorithm works on list structures: ' diff :: Eq a => [a] -> [a] -> [Edit a] ' This package works on trees. ' treeDiff :: Eq a => Tree a -> Tree a -> Edit (EditTree a) ' This package also provides a way to diff arbitrary ADTs, using 'Generics'-derivable helpers. This package differs from <http://hackage.haskell.org/package/gdiff gdiff>, in a two ways: 'tree-diff' doesn't have patch function, and the "edit-script" is a tree itself, which is useful for pretty-printing. ' >>> prettyEditExpr $ ediff (Foo 42 [True, False] "old") (Foo 42 [False, False, True] "new") Foo {fooBool = [-True, +False, False, +True], fooInt = 42, fooString = -"old" +"new"} '.
ca: L'algorisme comú de diferències funciona en estructures de llista: ' diff :: Eq a ' [a] - - [a] -' [Edita a] ' Aquest paquet funciona en arbres. ' treeDiff :: Eq a ' Tree a -) Tree a -) Edit (EditTree a) ' Aquest paquet també proporciona una manera de diferir els ADT arbitraris, utilitzant ajudants 'Generics' derivables. Aquest paquet difereix de <http://hackage.haskell.org/package/gdiff gdiff>, de dues maneres: 'tree-diff' no té funció de patch, i el "edit-script" és un arbre en si, el qual és útil per a la impressió bonica. ' . prettyEditExpr $ ediff (Foo 42 [True, False] "old") (Foo 42 [False, False, True] "new") Foo {fooBool . [-True, +False, False, +True], fooInt . 42, fooString . -"old" +"new"} '.

source: Haskell tree-diff library development files
ca: Fitxers de desenvolupament de la biblioteca «arbre-diff» del Haskell

source: This package provides the Haskell tree-diff library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell tree-diff.

source: Shell programming, Haskell-style
ca: Programació d'intèrpret d'ordres, a l'estil Haskell
