Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: 'turtle' is a reimplementation of the Unix command line environment in Haskell so that you can use Haskell as both a shell and a scripting language. Features include: * Batteries included: Command an extended suite of predefined utilities * Interoperability: You can still run external shell commands * Portability: Works on Windows, OS X, and Linux * Exception safety: Safely acquire and release resources * Streaming: Transform or fold command output in constant space * Patterns: Use typed regular expressions that can parse structured values * Formatting: Type-safe 'printf'-style text formatting * Modern: Supports 'text' and 'system-filepath' Read "Turtle.Tutorial" for a detailed tutorial or "Turtle.Prelude" for a quick-start guide 'turtle' is designed to be beginner-friendly, but as a result lacks certain features, like tracing commands. If you feel comfortable using 'turtle' then you should also check out the 'Shelly' library which provides similar functionality.
ca: «turtle» és una reorganització de l'entorn de línia d'ordres Unix a Haskell de manera que podeu utilitzar Haskell com a intèrpret d'ordres i com a llenguatge de script. Les característiques inclouen: * Bateries incloses: Mana un conjunt ampliat d'utilitats predefinides * Interoperabilitat: Encara podeu executar ordres externes de l'intèrpret d'ordres * Portabilitat: funciona en Windows, OS X i Linux * Seguretat de l'excepció: Adquirir i alliberar recursos de forma segura * Streaming: Transforma o plega la sortida de l'ordre en espai constant * Patrons: Utilitza expressions regulars teclejades que poden analitzar valors estructurats * Formatació: formatació de text a l'estil «printf» amb seguretat de tipus * Modern: admet «text» i «system-filepath» Llegeix "Turtle.Tutorial" per a un tutorial detallat o "Turtle.Preludi" per a una guia d'inici ràpid La "tortuga" està dissenyada per ser fàcil per a principiants, però com a resultat no té certes característiques, com ara les ordres de seguiment. Si us sentiu còmodes utilitzant la 'tortuga', també hauríeu de consultar la biblioteca 'Shelly' que proporciona funcionalitats similars.

source: Haskell turtle library development files
ca: Fitxers de desenvolupament de la biblioteca de tortugues Haskell

source: This package provides the Haskell turtle library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de tortuga Haskell.

source: Data.Type.Equality compat package
ca: Dades.Tipus.Paquet d'igualtat

source: This library defines a propositional equality data type, shims 'Data.Type.Equality' as well as possible for older GHCs (< 7.8). ' data a :~: b where Refl :: a :~: a ' The module 'Data.Type.Equality.Hetero' shims ':~~:' equality, for compilers with 'PolyKinds'.
ca: Aquesta biblioteca defineix un tipus de dades d'igualtat proposicional, shims 'Dades.Tipus.Igualtat' tan bé com sigui possible per als GHC més antics ( 7 7.8). ' dades a :: b on Refl :: a :: a ' El mòdul 'Dades.Tipus.Igualtat.Hetero crida '::' igualtat, per als compiladors amb 'PolyKinds'.

source: Haskell type-equality library development files
ca: Fitxers de desenvolupament de la biblioteca de tipus Haskell

source: This package provides the Haskell type-equality library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de tipus Haskell.

source: Run external processes, with strong typing of streams
ca: Executa processos externs, amb una mecanografia forta de fluxos

source: Please see the tutorial at <https://github.com/fpco/typed-process#readme>.
ca: Vegeu el tutorial a <https://github.com/fpco/typed-process#readme>.

source: Haskell typed-process library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell typed-process

source: This package provides the Haskell typed-process library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell typed-process.

source: A simple (but internally ugly) memoization function
ca: Una funció de memoització senzilla (però internament lletja)

source: A simple (but internally ugly) memoization function. * New in 0.1.0.1: Make it exception safe.
ca: Una funció de memoització simple (però internament lletja). * Nou en 0.1.0.1: Fer que l'excepció sigui segura.

source: Haskell uglymemo library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell uglymemo

source: This package provides the Haskell uglymemo library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell uglymemo.

source: Unbounded thread delays and timeouts
ca: Retard i temps d'espera del fil sense límit

source: The 'threadDelay' and 'timeout' functions from the 'base' library use the bounded 'Int' type for specifying the delay or timeout period. This packages provides alternatives which use the unbounded 'Integer' type.
ca: Les funcions «threadDelay» i «timeout» de la biblioteca «base» utilitzen el tipus «Int» afitat per a especificar el període de retard o de temps d'espera. Aquests paquets proporcionen alternatives que utilitzen el tipus 'Integer' sense límits.

source: Haskell unbounded-delays library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell sense límits

source: This package provides the Haskell unbounded-delays library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell sense límits.

source: Construct and transform unicode characters
ca: Construeix i transforma caràcters unicode

source: The package contains functions for construction of various characters like: * block graphic elements * frame elements * fractions * subscript and superscript characters Related packages: * 'unicode-properties': classifications such as lower case, graphical etc. * 'rfc5051': sorting of characters.
ca: El paquet conté funcions per a la construcció de diversos caràcters com: * bloca els elements gràfics * elements de marc * fraccions * caràcters de subíndex i superíndex Paquets relacionats: * 'unicode-properties': classificacions com minúscules, gràfiques etc. * 'rfc5051': ordenació dels caràcters.

source: Haskell implementation of the Unicode Collation Algorithm
ca: Implementació de Haskell de l'algorisme de col·locació Unicode

source: This library provides a pure Haskell implementation of the Unicode Collation Algorithm described at <http://www.unicode.org/reports/tr10/>. It is not as fully-featured or as performant as 'text-icu', but it avoids a dependency on a large C library. Locale-specific tailorings are also provided.
ca: Aquesta biblioteca proporciona una implementació pura de Haskell de l'algorisme de col·locació Unicode descrit a <http://www.unicode.org/reports/tr10/>. No és tan íntegre o tan performant com 'text-icu', però evita la dependència d'una gran biblioteca C. També es proporcionen sastres específics de la zona.

source: Haskell unicode-collation library development files
ca: Fitxers de desenvolupament de la biblioteca «unicode-collation» del Haskell

source: This package provides the Haskell unicode-collation library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell unicode-collation.

source: Access Unicode character database
ca: Accedeix a la base de dades de caràcters Unicode

source: 'unicode-data' provides Haskell APIs to efficiently access the Unicode character database. Performance is the primary goal in the design of this package. The Haskell data structures are generated programmatically from the Unicode character database (UCD) files. The latest Unicode version supported by this library is 14.0.0.
ca: «unicode-data» proporciona les API de Haskell per accedir eficientment a la base de dades de caràcters Unicode. El rendiment és l'objectiu principal en el disseny d'aquest paquet. Les estructures de dades de Haskell es generen programàticament a partir dels fitxers de la base de dades de caràcters Unicode (UCD). L'última versió Unicode admesa per aquesta biblioteca és 14.0.0.

source: Haskell unicode-data library development files
ca: Fitxers de desenvolupament de la biblioteca de dades unicode-haskell

source: This package provides the Haskell unicode-data library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de dades unicode Haskell.

source: Haskell unicode library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell unicode

source: This package provides the Haskell unicode library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell unicode.

source: Unicode normalization
ca: Normalització Unicode

source: Fast Unicode 14.0.0 normalization in Haskell (NFC, NFKC, NFD, NFKD).
ca: Normalització ràpida Unicode 14.0.0 en Haskell (NFC, NFKC, NFD, NFKD).

source: Haskell unicode-transforms library development files
ca: Haskell unicode-transforma els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell unicode-transforms library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell unicode-transforms.

source: Help writing simple, concise and fast generic operations
ca: Ajuda a escriure operacions genèriques simples, concises i ràpides

source: Uniplate is library for writing simple and concise generic operations. Uniplate has similar goals to the original Scrap Your Boilerplate work, but is substantially simpler and faster. To get started with Uniplate you should import one of the three following modules: * "Data.Generics.Uniplate.Data" - to quickly start writing generic functions. Most users should start by importing this module. * "Data.Generics.Uniplate.Direct" - a replacement for "Data.Generics.Uniplate.Data" with substantially higher performance (around 5 times), but requires writing instance declarations. * "Data.Generics.Uniplate.Operations" - definitions of all the operations defined by Uniplate. Both the above two modules re-export this module. In addition, some users may want to make use of the following modules: * "Data.Generics.Uniplate.Zipper" - a zipper built on top of Uniplate instances. * "Data.Generics.SYB" - users transitioning from the Scrap Your Boilerplate library. * "Data.Generics.Compos" - users transitioning from the Compos library. * "Data.Generics.Uniplate.DataOnly" - users making use of both 'Data' and 'Direct' to avoid getting instance conflicts.
ca: Uniplate és una biblioteca per escriure operacions genèriques simples i concises. Uniplate té objectius similars al treball original de Scrap Your Boilerplate, però és substancialment més senzill i més ràpid. Per a començar amb Uniplate hauríeu d'importar un dels tres mòduls següents: * "Dades.Genèrics.Unipolar.Dades" - per començar ràpidament a escriure funcions genèriques. La majoria d'usuaris haurien de començar per importar aquest mòdul. * "Dades.Genèrics.Unipolar.Direct" - un substitut de "Data.Genèrics.Unipolar.Dades" amb un rendiment substancialment més alt (al voltant de 5 vegades), però requereix escriure declaracions d'instància. * "Dades.Genèrics.Unipolar.Operacions" - definicions de totes les operacions definides per Uniplate. Els dos mòduls anteriors reexporten aquest mòdul. A més, alguns usuaris poden voler fer ús dels següents mòduls: * "Dades.Genèrics.Unipolar.Cremallera" - una cremallera construïda sobre les instàncies Uniplate. * "Dades.Generics.SYB" - els usuaris que fan la transició des de la biblioteca Scrap Your Boilerplate. * "Dades.Genèrics.Compos" - els usuaris que fan la transició des de la biblioteca Compos. * "Dades.Genèrics.Unipolar.DataOnly" - els usuaris que fan ús tant de 'Data' com de 'Direct' per evitar conflictes d'instàncies.

source: Haskell uniplate library development files
ca: Haskell deslliga els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell uniplate library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell uniplate.

source: Haskell unix library
ca: Biblioteca Haskell unix

source: This package provides the Haskell unix library.
ca: Aquest paquet proporciona la biblioteca Haskell unix.

source: Unix/Posix-specific functions for ByteStrings
ca: Funcions específiques d'Unix/Posix per a ByteStrings

source: Unix/Posix-specific functions for ByteStrings. Provides 'ByteString' file-descriptor based I/O API, designed loosely after the 'String' file-descriptor based I/O API in "System.Posix.IO". The functions here wrap standard C implementations of the functions specified by the ISO/IEC 9945-1:1990 (``POSIX.1'') and X/Open Portability Guide Issue 4, Version 2 (``XPG4.2'') specifications. Note that this package doesn't require the 'unix' package as a dependency. But you'll need it in order to get your hands on an 'Fd', so we're not offering a complete replacement.
ca: Funcions específiques d'Unix/Posix per a ByteStrings. Proporciona l'API d'E/S basada en el descriptor de fitxers «ByteString», dissenyada lliurement després de l'API d'E/S basada en el descriptor de fitxers «System».Posix.IO». Les funcions aquí embolcallen les implementacions estàndard C de les funcions especificades per les especificacions ISO/IEC 9945-1:1990 (.POSIX.1'') i X/Open Portability Guide Issue 4, Versió 2 (.XPG4.2''). Tingueu en compte que aquest paquet no requereix el paquet «unix» com a dependència. Però el necessitaràs per a posar-te les mans en un 'Fd', així que no t'oferim un reemplaçament complet.

source: Haskell unix-bytestring library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell unix-bytestring

source: This package provides the Haskell unix-bytestring library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell unix-bytestring.

source: Portable POSIX-compatibility layer
ca: Capa portable POSIX-compatibility

source: This package provides portable implementations of parts of the unix package. This package re-exports the unix package when available. When it isn't available, portable implementations are used.
ca: Aquest paquet proporciona implementacions portàtils de parts del paquet unix. Aquest paquet reexporta el paquet unix quan està disponible. Quan no està disponible, s'utilitzen implementacions portàtils.

source: Haskell unix-compat library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell unix-compat

source: This package provides the Haskell unix-compat library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell unix-compat.

source: Haskell unix library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell unix

source: This package provides the Haskell unix library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell unix.

source: Unix time parser/formatter and utilities
ca: Analitzador/formatador de temps Unix i utilitats

source: Fast parser/formatter/utilities for Unix time.
ca: Analitzador/formatador/utilitats ràpid per a temps Unix.

source: Haskell unix-time library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell unixtime

source: This package provides the Haskell unix-time library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell unix-time.

source: The MonadUnliftIO typeclass for unlifting monads to IO (batteries included)
ca: El MonadUnliftIO typeclass per a monads unlifting a IO (bateries incloses)

source: Please see the documentation and README at <https://www.stackage.org/package/unliftio>.
ca: Vegeu la documentació i el README a <https://www.stackage.org/package/unliftio>.

source: The MonadUnliftIO typeclass for unlifting monads to IO
ca: La classe tipogràfica MonadUnliftIO per a desfer les monades a IO

source: Please see the documentation and README at <https://www.stackage.org/package/unliftio-core>.
ca: Vegeu la documentació i el README a <https://www.stackage.org/package/unliftio-core>.

source: Haskell unliftio-core library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell unliftio-core

source: This package provides the Haskell unliftio-core library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell unliftio-core.

source: Haskell unliftio library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell unliftio

source: This package provides the Haskell unliftio library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell unliftio.

source: Efficient hashing-based container types
ca: Tipus de contenidors eficients basats en hashing

source: Efficient hashing-based container types. The containers have been optimized for performance critical use, both in terms of large data quantities and high speed. The declared cost of each operation is either worst-case or amortized, but remains valid even if structures are shared. /Security/ This package currently provides no defenses against hash collision attacks such as HashDoS. Users who need to store input from untrusted sources are advised to use 'Data.Map' or 'Data.Set' from the 'containers' package instead.
ca: Tipus de contenidors eficients basats en hashing. Els contenidors s'han optimitzat per a un ús crític del rendiment, tant en termes de grans quantitats de dades com d'alta velocitat. El cost declarat de cada operació és el pitjor dels casos o amortitzat, però continua sent vàlid fins i tot si es comparteixen les estructures. /Seguretat/ Aquest paquet actualment no proporciona defenses contra atacs de col·lisió de hash com HashDoS. S'aconsella als usuaris que necessiten emmagatzemar l'entrada de fonts no fiables que utilitzin 'Dades.Mapa' o 'Dades.Estableix» del paquet «contenidors».

source: Haskell unordered-containers library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell sense ordenar

source: This package provides the Haskell unordered-containers library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell sense ordenar.

source: Unicode aware uri-encoding
ca: Codificació uri conscient d'Unicode

source: This package allows you to uri encode and uri decode Strings, Texts and ByteString values.
ca: Aquest paquet permet codificar i descodificar cadenes, text i ByteString.

source: This package provides the Haskell uri-encode library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca uri-encode de Haskell.

source: Support for reading and writing UTF8 Strings
ca: Suport per a llegir i escriure cadenes UTF8

source: A UTF8 layer for Strings. The utf8-string package provides operations for encoding UTF8 strings to Word8 lists and back, and for reading and writing UTF8 without truncation.
ca: Una capa UTF8 per a cadenes. El paquet utf8-string proporciona operacions per codificar cadenes UTF8 a llistes Word8 i enrere, i per llegir i escriure UTF8 sense truncament.

source: Haskell utf8-string library development files
ca: Fitxers de desenvolupament de la biblioteca utf8 de cadena Haskell

source: This package provides the Haskell utf8-string library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell utf8-string.

source: Various small helper functions for Lists, Maybes, Tuples, Functions
ca: Diverses funcions d'ajudant petites per a llistes, potser, titelles, funcions

source: Various small helper functions for Lists, Maybes, Tuples, Functions. Some of these functions are improved implementations of standard functions. They have the same name as their standard counterparts. Others are equivalent to functions from the 'base' package, but if you import them from this utility package then you can write code that runs on older GHC versions or other compilers like Hugs and JHC. All modules are plain Haskell 98. The package depends exclusively on the 'base' package and only that portions of 'base' that are simple to port. Thus you do not risk a dependency avalanche by importing it. However, further splitting the base package might invalidate this statement. Alternative packages: 'Useful', 'MissingH'.
ca: Diverses funcions d'ajudant petites per a Llist, Maybes, Tuples, Functions. Algunes d'aquestes funcions són implementacions millorades de funcions estàndard. Tenen el mateix nom que els seus homòlegs estàndard. Altres són equivalents a funcions del paquet 'base', però si les importeu d'aquest paquet d'utilitat, podreu escriure codi que s'executi en versions antigues de GHC o altres compiladors com Hugs i JHC. Tots els mòduls són Haskell 98. El paquet depèn exclusivament del paquet «base» i només d'aquelles porcions de «base» que són simples de portar. Per tant, no s'arrisca a una allau de dependència important-la. No obstant això, la divisió addicional del paquet base podria invalidar aquesta declaració. Paquets alternatius: «Useful», «MissingH».

source: Haskell utility-ht library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell utility-ht

source: This package provides the Haskell utility-ht library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell utility-ht.

source: For creating, comparing, parsing and printing Universally Unique Identifiers
ca: Eina per a crear, comparar, analitzar i imprimir identificadors universalment únics

source: This library is useful for creating, comparing, parsing and printing Universally Unique Identifiers. See <http://en.wikipedia.org/wiki/UUID> for the general idea.
ca: Aquesta biblioteca és útil per crear, comparar, analitzar i imprimir identificadors universalment únics. Vegeu <http://en.wikipedia.org/wiki/UUID> per a la idea general.

source: Haskell uuid library development files
ca: Fitxers de desenvolupament de la biblioteca uuid del Haskell

source: This package provides the Haskell uuid library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca uuid de Haskell.

source: Type definitions for Universally Unique Identifiers
ca: Definicions de tipus per a identificadors universalment únics

source: This library contains type definitions for <https://en.wikipedia.org/wiki/UUID Universally Unique Identifiers (UUID)> (as specified in <http://tools.ietf.org/html/rfc4122 RFC 4122>) and basic conversion functions. See also the <https://hackage.haskell.org/package/uuid 'uuid' package> providing a high-level API for managing the different UUID versions.
ca: Aquesta biblioteca conté definicions de tipus per a <https://en.wikipedia.org/wiki/UUID Universally Unique Identifiers (UUID)> (com s'especifica a <http://tools.ietf.org/html/rfc4122 RFC 4122>) i funcions de conversió bàsiques. Vegeu també el <https://hackage.haskell.org/package/uuid 'uuid' package> proporcionant una API d'alt nivell per gestionar les diferents versions UUID.

source: Haskell uuid-types library development files
ca: Fitxers de desenvolupament de la biblioteca de tipus uuid del Haskell

source: This package provides the Haskell uuid-types library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de tipus uuid de Haskell.

source: A persistent store for values of arbitrary types
ca: Un magatzem persistent per als valors de tipus arbitraris
