Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: D-Bus is a simple, message-based protocol for inter-process communication, which allows applications to interact with other parts of the machine and the user's session using remote procedure calls. D-Bus is a essential part of the modern Linux desktop, where it replaces earlier protocols such as CORBA and DCOP. This library is an implementation of the D-Bus protocol in Haskell. It can be used to add D-Bus support to Haskell applications, without the awkward interfaces common to foreign bindings. Example: connect to the session bus, and get a list of active names. ' &#x7b;-# LANGUAGE OverloadedStrings #-&#x7d; import Data.List (sort) import DBus import DBus.Client main = do &#x20; client <- connectSession &#x20; &#x20; -- Request a list of connected clients from the bus &#x20; reply <- call_ client (methodCall "/org/freedesktop/DBus" "org.freedesktop.DBus" "ListNames") &#x20; &#x7b; methodCallDestination = Just "org.freedesktop.DBus" &#x20; &#x7d; &#x20; &#x20; -- org.freedesktop.DBus.ListNames() returns a single value, which is &#x20; -- a list of names (here represented as [String]) &#x20; let Just names = fromVariant (methodReturnBody reply !! 0) &#x20; &#x20; -- Print each name on a line, sorted so reserved names are below &#x20; -- temporary names. &#x20; mapM_ putStrLn (sort names) ' >$ ghc --make list-names.hs >$ ./list-names >:1.0 >:1.1 >:1.10 >:1.106 >:1.109 >:1.110 >ca.desrt.dconf >org.freedesktop.DBus >org.freedesktop.Notifications >org.freedesktop.secrets >org.gnome.ScreenSaver.
ca: D-Bus és un protocol senzill basat en missatges per a la comunicació entre processos, que permet a les aplicacions interactuar amb altres parts de la màquina i la sessió de l'usuari mitjançant trucades de procediment remotes. D-Bus és una part essencial de l'escriptori Linux modern, on reemplaça protocols anteriors com CORBA i DCOP. Aquesta biblioteca és una implementació del protocol D-Bus a Haskell. Es pot utilitzar per afegir suport de D-Bus a les aplicacions Haskell, sense les interfícies incòmodes comunes als enllaços estrangers. Exemple: connecteu-vos al bus de sessió i obteniu una llista de noms actius. ' xx7b;-# LANGUAGE OverloadedStrings -xx7d; Importa les dades.Llista (ordena) importa DBus importa DBus.Client main the do xx20; client the- connectSession xx20; thex20; -- Sol·licita una llista de clients connectats del bus thex20; respon the- call client (methodCall "/org/freedesktop/DBus" "org.freedesktop.DBus" "ListNames") thex20; xx7b; methodCallDestination Just Just "org.freedesktop.DBus" thex20; thex7d; thex20; thex20; thex20; -- org.freedesktop.DBus.ListNames() retorna un sol valor, el qual és !!x20; -- una llista de noms (aquí representat com a [String]) )x20; deixeu Només noms !! fromVariant (methodReturnBody response !! 0) xx20; .x20; -- Imprimeix cada nom en una línia, ordenada de manera que els noms reservats estiguin per sota de .x20; -- noms temporals. 'x20; mapM putStrLn (ordena els noms) ' .$ ghc --make list-names.hs .$ ./list-names .:1.0 .:1.1 .:1.10 .:1.106 .:1.109 .:1.110 .ca.desrt.dconf .org.freedesktop.DBus .org.freedesktop.DBus.Notificacions .org.freedesktop.secrets .org.gnome.Estalvi de pantalla.

source: Haskell dbus library development files
ca: Fitxers de desenvolupament de la biblioteca de D-Bus del Haskell

source: This package provides the Haskell dbus library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell dbus.

source: Decidable propositions
ca: Propostes decidibles

source: This package provides a 'Dec' type. ' type Neg a = a -> Void data Dec a = Yes a | No (Neg a) '.
ca: Aquest paquet proporciona un tipus «descens». ' tipus Neg a a - a Void data Dec a . Yes a . No (Neg a) '.

source: Haskell dec library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell dec library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell dec.

source: Haskell deepseq library
ca: Biblioteca Haskell deepseq

source: This package provides the Haskell deepseq library.
ca: Aquest paquet proporciona la biblioteca Haskell deepseq.

source: Haskell deepseq library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell deepseq

source: This package provides the Haskell deepseq library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell deepseq.

source: Simple and incomplete pure haskell implementation of linear algebra
ca: Implementació simple i incompleta de haskell pur d'àlgebra lineal

source: This library is simply collection of linear-algebra related modules split from statistics library.
ca: Aquesta biblioteca és simplement una col·lecció de mòduls relacionats amb l'àlgebra lineal dividits de la biblioteca d'estadística.

source: Haskell dense-linear-algebra library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell dense-linear-algebra

source: This package provides the Haskell dense-linear-algebra library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell dense-linear-algebra.

source: Dependent sum type
ca: Tipus de suma dependent

source: A dependent sum is a generalization of a particular way of thinking about the 'Either' type. 'Either a b' can be thought of as a 2-tuple '(tag, value)', where the value of the tag determines the type of the value. In particular, either 'tag = Left' and 'value :: a' or 'tag = Right' and 'value :: b'. This package allows you to define your own dependent sum types by using your own "tag" types.
ca: Una suma dependent és una generalització d'una manera particular de pensar sobre el tipus 'Either'. 'O sigui a b' es pot considerar com un '(etiqueta, valor)' de 2-tuples, on el valor de l'etiqueta determina el tipus del valor. En particular, o bé 'etiqueta . esquerra' i 'valor :: a' o 'etiqueta . dreta' i 'valor :: b'. Aquest paquet us permet definir els vostres propis tipus de suma dependents utilitzant els vostres propis tipus d'etiqueta.

source: Haskell dependent-sum library development files
ca: Fitxers de desenvolupament de la biblioteca de suma dependent de Haskell

source: This package provides the Haskell dependent-sum library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de suma dependent de Haskell.

source: A configuration language guaranteed to terminate
ca: Un llenguatge de configuració garantit per a finalitzar

source: Dhall is an explicitly typed configuration language that is not Turing complete. Despite being Turing incomplete, Dhall is a real programming language with a type-checker and evaluator. Use this library to parse, type-check, evaluate, and pretty-print the Dhall configuration language. This package also includes an executable which type-checks a Dhall file and reduces the file to a fully evaluated normal form. Read "Dhall.Tutorial" to learn how to use this library.
ca: Dhall és un llenguatge de configuració escrit explícitament que no està complet de Turing. Tot i ser incomplet, Dhall és un llenguatge de programació real amb un verificador de tipus i avaluador. Utilitzeu aquesta biblioteca per analitzar, teclejar, avaluar i imprimir el llenguatge de configuració Dhall. Aquest paquet també inclou un executable que verifica un fitxer Dhall i redueix el fitxer a un formulari normal totalment avaluat. Llegiu "Dhall.Tutorial" per aprendre a utilitzar aquesta biblioteca.

source: Haskell dhall library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell dhall library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell dhall.

source: Various cryptographic hashes for bytestrings; CRC32 and Adler32 for now
ca: Diversos hashes criptogràfics per bytestrings; CRC32 i Adler32 de moment

source: This package provides efficient cryptographic hash implementations for strict and lazy bytestrings. For now, CRC32 and Adler32 are supported; they are implemented as FFI bindings to efficient code from zlib.
ca: Aquest paquet proporciona implementacions de hash criptogràfiques eficients per als bytestrings estrictes i mandrosos. De moment, el CRC32 i l'Adler32 estan suportats; s'implementen com a enllaços FFI a un codi eficient des de la zlib.

source: Haskell digest library development files
ca: Fitxers de desenvolupament de la biblioteca de resums Haskell

source: This package provides the Haskell digest library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell digest.

source: Haskell directory library
ca: Biblioteca de directoris Haskell

source: This package provides the Haskell directory library.
ca: Aquest paquet proporciona la biblioteca de directoris Haskell.

source: Haskell directory library development files
ca: Fitxers de desenvolupament de la biblioteca de directoris Haskell

source: This package provides the Haskell directory library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de directoris Haskell.

source: Retrieve information about disk space usage
ca: Recupera informació sobre l'ús de l'espai en disc

source: A cross-platform library for retrieving information about disk space usage.
ca: Una biblioteca multiplataforma per obtenir informació sobre l'ús de l'espai en disc.

source: Haskell disk-free-space library development files
ca: Fitxers de desenvolupament de la biblioteca de disc lliure de Haskell

source: This package provides the Haskell disk-free-space library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca sense disc Haskell.

source: Types, functions, and tools to manipulate the openSUSE distribution
ca: Tipus, funcions i eines per manipular la distribució openSUSE

source: This library is a loose collection of types, functions, and tools that users and developers of the <https://opensuse.org/ openSUSE Linux distribution> might find useful.
ca: Aquesta biblioteca és una col·lecció solta de tipus, funcions i eines que els usuaris i desenvolupadors de la <https://opensuse.org/ openSUSE Linux distribution> poden trobar útils.

source: Haskell distribution-opensuse library development files
ca: Fitxers de desenvolupament de la biblioteca de distribució de Haskell

source: This package provides the Haskell distribution-opensuse library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell distribution-opensuse.

source: Distributive functors -- Dual to Traversable
ca: Functors distributius -- Dual a Traversable

source: Distributive functors -- Dual to 'Traversable'.
ca: Functors distributius -- Dual a 'Traversable'.

source: Haskell distributive library development files
ca: Fitxers de desenvolupament de la biblioteca distributiva Haskell

source: This package provides the Haskell distributive library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca distributiva Haskell.

source: Difference lists
ca: Llistes de diferències

source: List-like types supporting O(1) append and snoc operations.
ca: Tipus similars a llistes que suporten operacions d'annexos O(1) i snoc.

source: Haskell dlist library development files
ca: Haskell llista els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell dlist library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell dlist.

source: DNS library in Haskell
ca: Biblioteca DNS a Haskell

source: A thread-safe DNS library for both clients and servers written in pure Haskell.
ca: Una biblioteca DNS segura per a fils per a clients i servidors escrita en pur Haskell.

source: Haskell dns library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell dns

source: This package provides the Haskell dns library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell dns.

source: A prettyprinting library for laying out text documents
ca: Una biblioteca de PRETTYprinting per a l'elaboració de documents de text

source: Doclayout is a prettyprinting library for laying out text documents, with several features not present in prettyprinting libraries designed for code. It was designed for use in pandoc.
ca: Doclayout és una biblioteca de PRETTYprinting per a la disposició de documents de text, amb diverses característiques que no estan presents a les biblioteques de PRETTYprinting dissenyades per al codi. Va ser dissenyat per al seu ús en pandoc.

source: Haskell doclayout library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell doclayout

source: This package provides the Haskell doclayout library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell doclayout.

source: Pandoc-style document templates
ca: Plantilles de documents a l'estil del Pandoc

source: This is the text templating system used by pandoc. It supports variable interpolation, iteration, tests for non-blank values, pipes, and partials. Templates are rendered to doclayout Docs, and variable values may come from a variety of different sources, including aeson Values.
ca: Aquest és el sistema de templating de text utilitzat pel pandoc. Suporta la interpolació variable, la iteració, proves per valors no en blanc, canonades i parcials. Les plantilles es representen a documents de doclayout, i els valors de les variables poden provenir d'una varietat de fonts diferents, inclosos els valors de l'esó.

source: Haskell doctemplates library development files
ca: Haskell doctemplates fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell doctemplates library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell doctemplates.

source: A simple interface for building .dot graph files
ca: Una interfície senzilla per a construir fitxers de grafs .dot

source: This package provides a simple interface for building .dot graph files, for input into the dot and graphviz tools. It includes a monadic interface for building graphs.
ca: Aquest paquet proporciona una interfície senzilla per a construir fitxers de grafs .dot, per a l'entrada a les eines dot i graphviz. Inclou una interfície monacal per construir grafs.

source: Haskell dotgen library development files
ca: Fitxers de desenvolupament de la biblioteca de dotgen Haskell

source: This package provides the Haskell dotgen library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de punts Haskell.

source: Fast conversion between single and double precision floating point and text
ca: Conversió ràpida entre la coma flotant i el text d'una precisió i doble

source: A library that performs fast, accurate conversion between floating point and text. This library is implemented as bindings to the C++ 'double-conversion' library written by Florian Loitsch at Google: <https://github.com/floitsch/double-conversion>. Now it can convert single precision numbers, and also it can create Builder, instead of bytestring or text. The 'Text' versions of these functions are about 30 times faster than the default 'show' implementation for the 'Double' type. The 'ByteString' versions are /slower/ than the 'Text' versions; roughly half the speed. (This seems to be due to the cost of allocating 'ByteString' values via 'malloc'.) Builder versions are slower on single value, but they are much faster on large number of values (up to 50x faster on list with 20000 doubles). As a final note, be aware that the 'bytestring-show' package is about 50% slower than simply using 'show'.
ca: Una biblioteca que realitza una conversió ràpida i precisa entre coma flotant i text. Aquesta biblioteca s'implementa com a vinculacions a la biblioteca 'doble conversió' de C++ escrita per Florian Loitsch a Google: <https://github.com/floitsch/double-conversion>. Ara pot convertir nombres de precisió simples, i també pot crear el Constructor, en lloc de prova o text. Les versions «Text» d'aquestes funcions són unes 30 vegades més ràpides que la implementació predeterminada «show» per al tipus «Double». Les versions «ByteString» són /slower/ més que les versions «Text»; aproximadament la meitat de la velocitat. (Sembla que això es deu al cost d'assignar els valors de «ByteString» a través de «malloc».) Les versions del constructor són més lentes en un sol valor, però són molt més ràpides en un gran nombre de valors (fins a 50x més ràpid a la llista amb 20000 dobles). Com a nota final, tingueu en compte que el paquet «bytestring-show» és aproximadament un 50% més lent que el simple ús de «show».

source: Haskell double-conversion library development files
ca: Fitxers de desenvolupament de la biblioteca de doble conversió Haskell

source: This package provides the Haskell double-conversion library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de doble conversió Haskell.

source: Cross-platform File handling
ca: Gestió de fitxers multiplataforma

source: Cross-platform File handling for Unix/Mac/Windows.
ca: Gestió de fitxers multiplataforma per a Unix/Mac/Windows.

source: Haskell easy-file library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell de fitxers fàcils

source: This package provides the Haskell easy-file library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell de fitxers fàcils.

source: A cross-platform, cross-console way to handle echoing terminal input
ca: Una manera multiplataforma i multiconsola de gestionar l'entrada de terminal d'eco

source: The 'base' library exposes the 'hGetEcho' and 'hSetEcho' functions for querying and setting echo status, but unfortunately, neither function works with MinTTY consoles on Windows. This is a serious issue, since 'hGetEcho' and 'hSetEcho' are often used to disable input echoing when a program prompts for a password, so many programs will reveal your password as you type it on MinTTY! This library provides an alternative interface which works with both MinTTY and other consoles. An example is included which demonstrates how one might prompt for a password using this library. To build it, make sure to configure with the '-fexample' flag.
ca: La biblioteca «base» exposa les funcions «hGetEcho» i «hSetEcho» per a consultar i establir l'estat de l'eco, però malauradament, cap de les funcions funciona amb les consoles MinTTY al Windows. Aquest és un problema seriós, ja que «hGetEcho» i «hSetEcho» s'utilitzen sovint per desactivar l'eco d'entrada quan un programa demana una contrasenya, de manera que molts programes revelaran la vostra contrasenya a mesura que la escriviu a MinTTY! Aquesta biblioteca proporciona una interfície alternativa que funciona tant amb MinTTY com amb altres consoles. S'inclou un exemple que demostra com es pot demanar una contrasenya utilitzant aquesta biblioteca. Per a construir-lo, assegureu-vos de configurar amb l'indicador «-fexample».

source: Haskell echo library development files
ca: Fitxers de desenvolupament de la biblioteca d'eco del Haskell

source: This package provides the Haskell echo library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'eco de Haskell.

source: Ed25519 cryptographic signatures
ca: Signatures criptogràfiques Ed25519

source: This package provides a simple, fast, self-contained copy of the Ed25519 public-key signature system with a clean interface. It also includes support for detached signatures, and thorough documentation on the design and implementation, including usage guidelines.
ca: Aquest paquet proporciona una còpia senzilla, ràpida i autocontinguda del sistema de signatura de clau pública Ed25519 amb una interfície neta. També inclou suport per a signatures separades, i documentació exhaustiva sobre el disseny i la implementació, incloses les directrius d'ús.

source: Haskell ed25519 library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell ed25519

source: This package provides the Haskell ed25519 library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell ed25519.

source: Levenshtein and restricted Damerau-Levenshtein edit distances
ca: Distàncies d'edició de Levenshtein i Damerau-Levenshtein restringides

source: Optimized edit distances for fuzzy matching, including Levenshtein and restricted Damerau-Levenshtein algorithms.
ca: Distàncies d'edició optimitzades per a coincidències difuses, inclosos els algorismes Levenshtein i Damerau-Levenshtein restringits.

source: Haskell edit-distance library development files
ca: Fitxers de desenvolupament de la biblioteca d'edició i distància Haskell

source: This package provides the Haskell edit-distance library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'edició i distància de Haskell.

source: Combinators for working with sums
ca: Combinadors per treballar amb sumes

source: Combinators for working with sums.
ca: Combinadors per treballar amb sumes.

source: Haskell either library development files
ca: Haskell de qualsevol fitxer de desenvolupament de la biblioteca

source: This package provides the Haskell either library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell.

source: Remote monitoring of processes
ca: Monitorització remota de processos

source: This library lets you remotely monitor a running process over HTTP. It provides a simple way to integrate a monitoring server into any application.
ca: Aquesta biblioteca us permet monitoritzar remotament un procés en execució a través de HTTP. Proporciona una manera senzilla d'integrar un servidor de monitorització en qualsevol aplicació.

source: Tracking of system metrics
ca: Seguiment de les mètriques del sistema

source: This library lets you defined and track system metrics.
ca: Aquesta biblioteca us permet definir i fer un seguiment de les mètriques del sistema.

source: Haskell ekg-core library development files
ca: Fitxers de desenvolupament de la biblioteca ekg-core de Haskell

source: This package provides the Haskell ekg-core library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca ekg-core de Haskell.

source: Haskell ekg library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell ekg

source: This package provides the Haskell ekg library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca ekg de Haskell.

source: JSON encoding of ekg metrics
ca: Codificació JSON de mètriques ekg

source: Encodes ekg metrics as JSON, using the same encoding as used by the ekg package, thus allowing ekg metrics to be served by other HTTP servers than the one used by the ekg package.
ca: Codifica les mètriques d'ekg com a JSON, utilitzant la mateixa codificació utilitzada pel paquet d'ekg, permetent així que les mètriques d'ekg siguin servides per altres servidors HTTP que l'utilitzat pel paquet d'ekg.

source: Haskell ekg-json library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell ekg-json

source: This package provides the Haskell ekg-json library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell ekg-json.

source: Email address validation
ca: Validació de l'adreça electrònica
