Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: <https://github.com/snowleopard/alga Alga> is a library for algebraic construction and manipulation of graphs in Haskell. See <https://github.com/snowleopard/alga-paper this paper> for the motivation behind the library, the underlying theory and implementation details. The top-level module <http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph.html Algebra.Graph> defines the main data type for /algebraic graphs/ <http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph.html#t:Graph Graph>, as well as associated algorithms. For type-safe representation and manipulation of /non-empty algebraic graphs/, see <http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-NonEmpty.html Algebra.Graph.NonEmpty>. Furthermore, /algebraic graphs with edge labels/ are implemented in <http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-Labelled.html Algebra.Graph.Labelled>. The library also provides conventional graph data structures, such as <http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-AdjacencyMap.html Algebra.Graph.AdjacencyMap> along with its various flavours: * adjacency maps specialised to graphs with vertices of type 'Int' (<http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-AdjacencyIntMap.html Algebra.Graph.AdjacencyIntMap>), * non-empty adjacency maps (<http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-NonEmpty-AdjacencyMap.html Algebra.Graph.NonEmpty.AdjacencyMap>), * adjacency maps for undirected bipartite graphs (<http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-Bipartite-AdjacencyMap.html Algebra.Graph.Bipartite.AdjacencyMap>), * adjacency maps with edge labels (<http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-Labelled-AdjacencyMap.html Algebra.Graph.Labelled.AdjacencyMap>), * acyclic adjacency maps (<http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-Acyclic-AdjacencyMap.html Algebra.Graph.Acyclic.AdjacencyMap>), A large part of the API of algebraic graphs and adjacency maps is available through the 'Foldable'-like type class <http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-ToGraph.html Algebra.Graph.ToGraph>. The type classes defined in <http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-Class.html Algebra.Graph.Class> and <http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-HigherKinded-Class.html Algebra.Graph.HigherKinded.Class> can be used for polymorphic construction and manipulation of graphs. This is an experimental library and the API is expected to remain unstable until version 1.0.0. Please consider contributing to the on-going <https://github.com/snowleopard/alga/issues discussions on the library API>.
ca: <https://github.com/snowleopard/alga Alga> és una biblioteca per a la construcció algebraica i la manipulació de grafs a Haskell. Vegeu <https://github.com/snowleopard/alga-paper this paper> per a la motivació darrere de la biblioteca, la teoria subjacent i els detalls d'implementació. El mòdul de nivell superior httphttp://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph.html Algebra.Graph defines defineix el tipus de dades principal per /algebraic graphs/ <http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph.html#t:Graph Graph>, així com els algorismes associats. Per a la representació segura de tipus i la manipulació de /gràfics algebraics no buits/, vegeu httphttp://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-NonEmpty.html Algebra.Graf.NonEmpty.. A més, /gràfics algebraics amb etiquetes d'aresta/ s'implementen a httphttp://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-Labelled.html Algebra.Graf.Labelled.. La biblioteca també proporciona estructures de dades de graf convencionals, com ara httphttp://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-AdjacencyMap.html Algebra.Graf.AdjacencyMap along juntament amb els seus diversos sabors: * Mapes d'adjacència especialitzats en grafs amb vèrtexs de tipus 'Int' (httphttp://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-AdjacencyIntMap.html Algebra.Graf.AdjacencyIntMap),), * Mapes d'adjacència no buida (httphttp://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-NonEmpty-AdjacencyMap.html Algebra.Graf.No està bé.AdjacencyMap),), * mapes d'adjacència per a grafs bipartits no dirigits (httphttp://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-Bipartite-AdjacencyMap.html Algebra.Graf.Bipartit.AdjacencyMap),), * mapes d'adjacència amb etiquetes de vora (httphttp://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-Labelled-AdjacencyMap.html Algebra.Graf.Etiquetat.AdjacencyMap),), * mapes d'adjacència acíclica (httphttp://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-Acyclic-AdjacencyMap.html Algebra.Graf.Acíclica.AdjacencyMap),), Una gran part de l'API de grafs algebraics i mapes d'adjacència està disponible a través de la classe de tipus «Foldable» .http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-ToGraph.html Algebra.Graf.ToGraph.. Les classes de tipus definides a .http://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-Class.html Algebra.Graf.Classe Class i httphttp://hackage.haskell.org/package/algebraic-graphs/docs/Algebra-Graph-HigherKinded-Class.html Algebra.Graf.Més amunt.Classe Class es pot utilitzar per a la construcció polimòrfica i la manipulació de grafs. Aquesta és una biblioteca experimental i s'espera que l'API romangui inestable fins a la versió 1.0.0. Si us plau, considereu contribuir a l'actual <https://github.com/snowleopard/alga/issues discussions on the library API>.

source: Haskell algebraic-graphs library development files
ca: Fitxers de desenvolupament de la biblioteca de gràfics algebraics de Haskell

source: This package provides the Haskell algebraic-graphs library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell algebraic-graphs.

source: Binding to the ALSA Library API (Exceptions)
ca: Vinculació a l'API de la biblioteca ALSA (Exceptions)

source: This package provides access to ALSA infrastructure, that is needed by both alsa-seq and alsa-pcm.
ca: Aquest paquet proporciona accés a la infraestructura ALSA, que és necessària tant per alsa-seq com per alsa-pcm.

source: Haskell alsa-core library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell alsa-core

source: This package provides the Haskell alsa-core library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell alsa-core.

source: Bindings to the ALSA simple mixer API
ca: Vinculacions a l'API del mesclador simple ALSA

source: This package provides bindings to the ALSA simple mixer API.
ca: Aquest paquet proporciona vinculacions a l'API del mesclador simple ALSA.

source: Haskell alsa-mixer library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell alsa-mixer

source: This package provides the Haskell alsa-mixer library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell alsa-mixer.

source: The Wadler/Leijen Pretty Printer, with annotation support
ca: La impressora Wadler/Leijen Pretty, amb suport d'anotacions

source: This is a modified version of wl-pprint, which was based on Wadler's paper "A Prettier Printer". See the haddocks for full info. This version allows the library user to annotate the text with semantic information, which can later be rendered in a variety of ways.
ca: Aquesta és una versió modificada de wl-pprint, que es va basar en el paper de Wadler "A Prettier Printer". Vegeu els haddocks per obtenir informació completa. Aquesta versió permet a l'usuari de la biblioteca anotar el text amb informació semàntica, que més tard es pot representar de diverses maneres.

source: Haskell annotated-wl-pprint library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell annotated-wl-pprint

source: This package provides the Haskell annotated-wl-pprint library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell annotated-wl-pprint.

source: Simple ANSI terminal support, with Windows compatibility
ca: Implementació senzilla del terminal ANSI, amb compatibilitat amb Windows

source: ANSI terminal support for Haskell: allows cursor movement, screen clearing, color output, showing or hiding the cursor, and changing the title. Works on UNIX and Windows.
ca: Suport de terminal ANSI per a Haskell: permet el moviment del cursor, l'esborrat de la pantalla, la sortida del color, mostrar o amagar el cursor i canviar el títol. Funciona en UNIX i Windows.

source: Haskell ansi-terminal library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell ansi-terminal

source: This package provides the Haskell ansi-terminal library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell ansi-terminal.

source: The Wadler/Leijen Pretty Printer for colored ANSI terminal output
ca: La impressora Wadler/Leijen Pretty per a la sortida acolorida del terminal ANSI

source: This is a pretty printing library based on Wadler's paper ["A Prettier Printer"](https://homepages.inf.ed.ac.uk/wadler/papers/prettier/prettier.pdf). It has been enhanced with support for ANSI terminal colored output using the [ansi-terminal](https://hackage.haskell.org/package/ansi-terminal) package.
ca: Aquesta és una bonica biblioteca d'impressió basada en el paper de Wadler ["A Prettier Printer"](https://homepages.inf.ed.ac.uk/wadler/papers/prettier/prettier.pdf). S'ha millorat amb el suport per a la sortida de color del terminal ANSI utilitzant el paquet [ansi-terminal](https://hackage.haskell.org/package/ansi-terminal).

source: Haskell ansi-wl-pprint library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell ansi-wl-pprint

source: This package provides the Haskell ansi-wl-pprint library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell ansi-wl-pprint.

source: Self-normalizing applicative expressions
ca: Expressions d'aplicació autonormalitzadores

source: An applicative functor transformer to normalize expressions using '(<$>)', '(<*>)', and 'pure' into a linear list of actions. See "ApNormalize" to get started.
ca: Un transformador de functor aplicatiu per normalitzar expressions utilitzant '(<$>)', '(<*>)', i 'pur' en una llista lineal d'accions. Vegeu «ApNormalitza» per començar.

source: Haskell ap-normalize library development files
ca: Haskell ap-normalitza els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell ap-normalize library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell ap-normalize.

source: A simple applicative parser
ca: Un simple analitzador aplicatiu

source: A simple applicative parser in Parsec style.
ca: Un simple analitzador aplicatiu a l'estil Parsec.

source: Haskell appar library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell appar

source: This package provides the Haskell appar library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell appar.

source: Haskell array library
ca: Biblioteca de matrius Haskell

source: This package provides the Haskell array library.
ca: Aquest paquet proporciona la biblioteca Haskell array.

source: Haskell array library development files
ca: Fitxers de desenvolupament de la biblioteca de matrius Haskell

source: This package provides the Haskell array library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell array.

source: A simple progress bar for the console
ca: Una simple barra de progrés per a la consola

source: A simple Haskell progress bar for the console. Heavily borrows from TJ Holowaychuk's Node.JS project <https://github.com/tj/node-progress progress> <https://github.com/yamadapc/haskell-ascii-progress github>.
ca: Una simple barra de progrés de Haskell per a la consola. Manlleva enormement del projecte Node.JS de TJ Holowaychuk <https://github.com/tj/node-progress progress> <https://github.com/yamadapc/haskell-ascii-progress github>.

source: Haskell ascii-progress library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell ascii-progress

source: This package provides the Haskell ascii-progress library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell ascii-progress.

source: ASN1 data reader and writer in RAW, BER and DER forms
ca: Lector i escriptor de dades ASN1 en els formularis RAW, BER i DER

source: ASN1 data reader and writer in raw form with supports for high level forms of ASN1 (BER, and DER).
ca: Lector i escriptor de dades ASN1 en format RAW amb suports per a formes d'alt nivell d'ASN1 (BER, I DER).

source: Haskell asn1-encoding library development files
ca: Haskell asn1-codificant fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell asn1-encoding library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell asn1-encoding.

source: Simple monadic parser for ASN1 stream types
ca: Analitzador monadic simple per als tipus de flux ASN1

source: Simple monadic parser for ASN1 stream types, when ASN1 pattern matching is not convenient.
ca: Analitzador monadic simple per als tipus de flux ASN1, quan la coincidència de patrons ASN1 no és convenient.

source: Haskell asn1-parse library development files
ca: Haskell asn1-analitza els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell asn1-parse library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell asn1-parse.

source: ASN.1 types
ca: Tipus ASN.1

source: ASN.1 standard types.
ca: Tipus estàndard ASN.1.

source: Haskell asn1-types library development files
ca: Haskell asn1-tipula els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell asn1-types library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell asn1-types.

source: Swap and assoc: Symmetric and Semigroupy Bifunctors
ca: Intercanvia i assoc: Bifunctors simètrics i semigrups

source: Provides generalisations of 'swap :: (a,b) -> (b,a)' and 'assoc :: ((a,b),c) -> (a,(b,c))' to 'Bifunctor's supporting similar operations (e.g. 'Either', 'These').
ca: Proporciona generalitzacions de 'swap :: (a,b) -). (b,a)' i 'assoc :: ((a,b),c) - to (a,(b,c))' a 'Bifunctor suporta operacions similars (per exemple 'Either', 'These').

source: Haskell assoc library development files
ca: Fitxers de desenvolupament de la biblioteca assoc Haskell

source: This package provides the Haskell assoc library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell assoc.

source: Run IO operations asynchronously and wait for their results
ca: Executa les operacions IO asíncrones i espera els seus resultats

source: This package provides a higher-level interface over threads, in which an 'Async a' is a concurrent thread that will eventually deliver a value of type 'a'. The package provides ways to create 'Async' computations, wait for their results, and cancel them. Using 'Async' is safer than using threads in two ways: * When waiting for a thread to return a result, if the thread dies with an exception then the caller must either re-throw the exception ('wait') or handle it ('waitCatch'); the exception cannot be ignored. * The API makes it possible to build a tree of threads that are automatically killed when their parent dies (see 'withAsync').
ca: Aquest paquet proporciona una interfície de nivell més alt sobre fils, en què un «Assincronitza a» és un fil concurrent que finalment lliurarà un valor de tipus «a». El paquet proporciona maneres de crear càlculs «Async», esperar els seus resultats i cancel·lar-los. L'ús de «Asincronització» és més segur que l'ús de fils de dues maneres: * Quan s'espera que un fil retorni un resultat, si el fil mor amb una excepció, llavors el que truca ha de tornar a llançar l'excepció ('espera') o gestionar-la ('waitCatch'); l'excepció no es pot ignorar. * L'API permet construir un arbre de fils que es maten automàticament quan mor el seu pare (vegeu 'withAsync').

source: Haskell async library development files
ca: Haskell asincronitza els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell async library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell async.

source: Provides API for timer based execution of IO actions
ca: Proporciona l'API per a l'execució basada en el temporitzador d'accions d'E/S

source: This is a lightweight package built on top of the async package providing easy to use periodic timers. This can be used for executing IO actions periodically.
ca: Aquest és un paquet lleuger construït sobre el paquet async que proporciona temporitzadors periòdics fàcils d'utilitzar. Això es pot utilitzar per executar accions d'E/S periòdicament.

source: Haskell async-timer library development files
ca: Fitxers de desenvolupament de la biblioteca async-timer del Haskell

source: This package provides the Haskell async-timer library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell async-timer.

source: A safe approach to CAS and other atomic ops in Haskell
ca: Un enfocament segur de CAS i altres operacions atòmiques a Haskell

source: After GHC 7.4 a new `casMutVar#` primop became available, but it's difficult to use safely, because pointer equality is a highly unstable property in Haskell. This library provides a safer method based on the concept of "Tickets". Also, this library uses the "foreign primop" capability of GHC to add access to other variants that may be of interest, specifically, compare and swap inside an array. Note that as of GHC 7.8, the relevant primops have been included in GHC itself. This library is engineered to work pre- and post-GHC-7.8, while exposing the same interface.
ca: Després del GHC 7.4 un nou primop cascasMutVar. va estar disponible, però és difícil d'utilitzar de forma segura, perquè la igualtat de punters és una propietat altament inestable a Haskell. Aquesta biblioteca proporciona un mètode més segur basat en el concepte de "Entrades". A més, aquesta biblioteca utilitza la capacitat de «primop estranger» de GHC per afegir accés a altres variants que poden ser d'interès, específicament, comparar i intercanviar dins d'una matriu. Tingueu en compte que a partir del GHC 7.8, els primops pertinents s'han inclòs en el GHC mateix. Aquesta biblioteca està dissenyada per treballar abans i després del GHC-7.8, mentre s'exposa la mateixa interfície.

source: Haskell atomic-primops library development files
ca: Fitxers de desenvolupament de la biblioteca Atomic-primops de Haskell

source: This package provides the Haskell atomic-primops library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Atomic-primops de Haskell.

source: Atomically write to a file
ca: Escriu atòmicament a un fitxer

source: Atomically write to a file on POSIX-compliant systems while preserving permissions. On most Unix systems, `mv` is an atomic operation. This makes it simple to write to a file atomically just by using the mv operation. However, this will destroy the permissions on the original file. This library does the following to preserve permissions while atomically writing to a file: * If an original file exists, take those permissions and apply them to the temp file before `mv`ing the file into place. * If the original file does not exist, create a following with default permissions (based on the currently-active umask). This way, when the file is `mv`'ed into place, the permissions will be the ones held by the original file. This library is based on similar implementations found in common libraries in Ruby and Python: * <http://apidock.com/rails/File/atomic_write/class Ruby on Rails includes a similar method called atomic_write> * <https://github.com/chef/chef/blob/c4631816132fcfefaba3d123a1d0dfe8bc2866bb/lib/chef/file_content_management/deploy/mv_unix.rb#L23:L71 Chef includes atomic update functionality> * <https://github.com/sashka/atomicfile There is a python library for atomically updating a file> To use `atomic-write`, import the module corresponding to the type you wish to write atomically, e.g., to write a (strict) ByteString atomically: > import System.AtomicWrite.Writer.ByteString Then you can use the atomicWriteFile function that accepts a `FilePath` and a `ByteString`, e.g.: > atomicWriteFile myFilePath myByteString.
ca: Escriviu atòmicament a un fitxer en sistemes compatibles amb POSIX mentre es conserven els permisos. En la majoria dels sistemes Unix, mmv. és una operació atòmica. Això fa que sigui senzill escriure a un fitxer de forma atòmica només utilitzant l'operació mv. Tanmateix, això destruirà els permisos del fitxer original. Aquesta biblioteca fa el següent per preservar els permisos mentre escriu atomicalment a un fitxer: * Si existeix un fitxer original, agafeu aquests permisos i apliqueu-los al fitxer temporal abans de .mv.ing the file into place. * Si el fitxer original no existeix, creeu un següent amb els permisos per defecte (basat en l'umask actualment actiu). D'aquesta manera, quan el fitxer estigui .mv.' al seu lloc, els permisos seran els que tingui el fitxer original. Aquesta biblioteca es basa en implementacions similars que es troben a les biblioteques comunes de Ruby i Python: * <http://apidock.com/rails/File/atomicwrite/class Ruby on Rails includes a similar method called atomicwrite> * <https://github.com/chef/chef/blob/c4631816132fcfefaba3d123a1d0dfe8bc2866bb/lib/chef/filecontentmanagement/deploy/mvunix.rb#L23:L71 Chef includes atomic update functionality> * <https://github.com/sashka/atomicfile There is a python library for atomically updating a file> Per a utilitzar theatomic-write,, importeu el mòdul corresponent al tipus que voleu escriure atomicalment, p. ex., per a escriure un ByteString atomical: . Sistema d'importació.AtomicWrite.Escriptor.ByteString Llavors podeu utilitzar la funció atomicWriteFile que accepta una theFilePath and i una .ByteString,, p. ex.: . atomicWriteFile myFilePath myByteString.

source: Haskell atomic-write library development files
ca: Fitxers de desenvolupament de la biblioteca d'escriptura atòmica Haskell

source: This package provides the Haskell atomic-write library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'escriptura atòmica Haskell.

source: Fast combinator parsing for bytestrings and text
ca: Anàlisi ràpida del combinador per a proves i text

source: A fast parser combinator library, aimed particularly at dealing efficiently with network protocols and complicated text/binary file formats.
ca: Una biblioteca combinadora d'analitzadors ràpida, dirigida especialment a tractar eficientment els protocols de xarxa i els complicats formats de text/arxiu binari.

source: Haskell attoparsec library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell attoparsec

source: This package provides the Haskell attoparsec library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca attoparsec de Haskell.
