Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: A library which aims to reexport all the non-conflicting and most general definitions from the "base" package. This includes APIs for applicatives, arrows, monoids, foldables, traversables, exceptions, generics, ST, MVars and STM. This package will never have any dependencies other than "base". Besides a rich prelude it provides limited ones like "BasePrelude.DataTypes", which only exports the data-types defined across the "base" package, and "BasePrelude.Operators", which only exports the common operators. /Versioning policy/ The versioning policy of this package deviates from PVP in the sense that its exports in part are transitively determined by the version of "base". Therefore it's recommended for the users of "base-prelude" to specify the bounds of "base" as well.
ca: Una biblioteca que té com a objectiu reexportar totes les definicions no conflictives i més generals del paquet "base". Això inclou APIs per a aplicacions, fletxes, monoides, plegables, traversables, excepcions, genèrics, ST, MVars i STM. Aquest paquet mai tindrà dependències diferents de «base». A més d'un preludi ric, proporciona alguns limitats com "BasePreludi.DataTypes", que només exporta els tipus de dades definits a través del paquet "base", i "BasePrelude.Operadors", que només exporta els operadors comuns. /Política de verificació/ La política de versionat d'aquest paquet es desvia del PVP en el sentit que les seves exportacions en part estan determinades transitivament per la versió de "base". Per tant, es recomana que els usuaris de "base-prelude" especifiquin també els límits de "base".

source: Efficient implementation of a dependent map with types as keys
ca: Implementació eficient d'un mapa dependent amb tipus com a claus

source: A dependent map from type representations to values of these types. Here is an illustration of such a map: > TMap > --------------- > Int -> 5 > Bool -> True > Char -> 'x' In addition to 'TMap', we provide 'TypeRepMap' parametrized by a 'vinyl'-style interpretation. This data structure is equivalent to 'DMap TypeRep', but with significantly more efficient lookups.
ca: Un mapa dependent de les representacions de tipus als valors d'aquests tipus. Aquí hi ha una il·lustració d'aquest mapa: TMap ----------------- Int - 5 5 Bool - Cert Char -' 'x' A més de 'TMap', proporcionem 'TypeRepMap' parametritzat per una interpretació d'estil 'vinil'. Aquesta estructura de dades és equivalent a «DMap TypeRep», però amb cerques significativament més eficients.

source: Haskell typerep-map library development files
ca: Fitxers de desenvolupament de la biblioteca de tipus de mapa Haskell

source: This package provides the Haskell typerep-map library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell typerep-map.
