Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: This package contains two modules, <http://hackage.haskell.org/package/streaming/docs/Streaming.html Streaming> and <http://hackage.haskell.org/package/streaming/docs/Streaming-Prelude.html Streaming.Prelude>. The principal module, <http://hackage.haskell.org/package/streaming-0.1.4.3/docs/Streaming-Prelude.html Streaming.Prelude>, exports an elementary streaming prelude focused on a simple "source" or "producer" type, namely 'Stream (Of a) m r'. This is a sort of effectful version of '([a],r)' in which successive elements of type 'a' arise from some sort of monadic action before the succession ends with a value of type 'r'. Everything in the library is organized to make programming with this type as simple as possible, by the simple expedient of making it as close to 'Prelude' and 'Data.List' as possible. Thus for example the trivial program > >>> S.sum $ S.take 3 (S.readLn :: Stream (Of Int) IO ()) > 1<Enter> > 2<Enter> > 3<Enter> > 6 :> () sums the first three valid integers from user input. Similarly, > >>> S.stdoutLn $ S.map (map toUpper) $ S.take 2 S.stdinLn > hello<Enter> > HELLO > world!<Enter> > WORLD! upper-cases the first two lines from stdin as they arise, and sends them to stdout. And so on, with filtering, mapping, breaking, chunking, zipping, unzipping, replicating and so forth: we program with streams of 'Int's or 'String's directly as if they constituted something like a list. That's because streams really do constitute something like a list, and the associated operations can mostly have the same names. (A few, like 'reverse', don't stream and thus disappear; others like 'unzip' are here given properly streaming formulation for the first time.) And we everywhere oppose "extracting a pure list from IO", which is the origin of typical Haskell memory catastrophes. Basically any case where you are tempted to use 'mapM', 'replicateM', 'traverse' or 'sequence' with Haskell lists, you would do better to use something like 'Stream (Of a) m r'. The type signatures are a little fancier, but the programs themselves are mostly the same. /In fact, they are mostly simpler./ Thus, consider the trivial demo program mentioned in <http://stackoverflow.com/questions/24068399/haskell-performance-of-iorefs this SO question> > main = mapM newIORef [1..10^8::Int] >>= mapM readIORef >>= mapM_ print The new user notices that this exhausts memory, and worries about the efficiency of Haskell 'IORefs'. But of course it exhausts memory! Look what it says! The problem is immediately cured by writing > main = S.print $ S.mapM readIORef $ S.mapM newIORef $ S.each [1..10^8::Int] which really does what the other program was meant to do, uses no more memory than 'hello-world', /and is simpler anyway/, since it doesn't involve the detour of "extracting a list from IO". Almost every use of list 'mapM', 'replicateM', 'traverse' and 'sequence' produces this problem on a smaller scale. People get used to it, as if it were characteristic of Haskell programs to use a lot of memory. But in truth "extracting a list or sequence from IO" is mostly just bad practice pure and simple. Of course, 'mapM', 'replicateM', 'traverse' and 'sequence' make sense for lists, under certain conditions! But 'unsafePerformIO' also makes sense under certain conditions. The <http://hackage.haskell.org/package/streaming-0.1.4.3/docs/Streaming.html Streaming> module exports the general type, 'Stream f m r', which can be used to stream successive distinct steps characterized by /any/ functor 'f', though we are mostly interested in organizing computations of the form 'Stream (Of a) m r'. The streaming-IO libraries have various devices for dealing with effectful variants of '[a]' or '([a],r)' in which the emergence of successive elements somehow depends on IO. But it is only with the general type 'Stream f m r', or some equivalent, that one can envisage (for example) the connected streaming of their sorts of stream - as one makes lists of lists in the Haskell 'Prelude' and 'Data.List'. One needs some such type if we are to express properly streaming equivalents of e.g. > group :: Ord a => [a] -> [[a]] > chunksOf :: Int -> [a] -> [[a]] > lines :: [Char] -> [[Char]] -- but similarly with byte streams, etc. to mention a few obviously desirable operations. (This is explained more elaborately in the <https://hackage.haskell.org/package/streaming#readme readme> below.) One could of course throw something like the present 'Stream' type on top of a prior stream concept: this is how 'pipes' and 'pipes-group' (which are very much our model here) use 'FreeT'. But once one grasps the iterable stream concept needed to express those functions then one will also see that, with it, one is /already/ in possession of a complete elementary streaming library - since one possesses 'Stream ((,) a) m r' or equivalently 'Stream (Of a) m r'. This is the type of a 'generator' or 'producer' or 'source' or whatever you call an effectful stream of items. /The present Streaming.Prelude is thus the simplest streaming library that can replicate anything like the API of the Prelude and Data.List/. The emphasis of the library is on interoperation; for the rest its advantages are: extreme simplicity, re-use of intuitions the user has gathered from mastery of 'Prelude' and 'Data.List', and a total and systematic rejection of type synonyms. The two conceptual pre-requisites are some comprehension of monad transformers and some familiarity with 'rank 2 types'. It is hoped that experimentation with this simple material, starting with the ghci examples in 'Streaming.Prelude', will give people who are new to these concepts some intuition about their importance. The most fundamental purpose of the library is to express elementary streaming ideas without reliance on a complex framework, but in a way that integrates transparently with the rest of Haskell, using ideas - e.g. rank 2 types, which are here implicit or explicit in most mapping - that the user can carry elsewhere, rather than chaining her understanding to the curiosities of a so-called streaming IO framework (as necessary as that is for certain purposes.) See the <https://hackage.haskell.org/package/streaming#readme readme> below for further explanation, including the examples linked there. Elementary usage can be divined from the ghci examples in 'Streaming.Prelude' and perhaps from this rough beginning of a <https://github.com/michaelt/streaming-tutorial/blob/master/tutorial.md tutorial>. Note also the <https://hackage.haskell.org/package/streaming-bytestring streaming bytestring> and <https://hackage.haskell.org/package/streaming-utils streaming utils> packages. Questions about usage can be put raised on StackOverflow with the tag '[haskell-streaming]', or as an issue on Github, or on the <https://groups.google.com/forum/#!forum/haskell-pipes pipes list> (the package understands itself as part of the pipes 'ecosystem'.) The simplest form of interoperation with <http://hackage.haskell.org/package/pipes pipes> is accomplished with this isomorphism: > Pipes.unfoldr Streaming.next :: Stream (Of a) m r -> Producer a m r > Streaming.unfoldr Pipes.next :: Producer a m r -> Stream (Of a) m r Interoperation with <http://hackage.haskell.org/package/io-streams io-streams> is thus: > Streaming.reread IOStreams.read :: InputStream a -> Stream (Of a) IO () > IOStreams.unfoldM Streaming.uncons :: Stream (Of a) IO () -> IO (InputStream a) With <http://hackage.haskell.org/package/conduit conduit> one might use, e.g.: > Conduit.unfoldM Streaming.uncons :: Stream (Of a) m () -> Source m a > str -> Streaming.mapM_ Conduit.yield (hoist lift str) :: Stream (Of o) m r -> ConduitM i o m r > src -> hoist lift str $$ Conduit.mapM_ Streaming.yield :: Source m a -> Stream (Of a) m () These conversions should never be more expensive than a single '>->' or '=$='. The simplest interoperation with regular Haskell lists is provided by, say > Streaming.each :: [a] -> Stream (Of a) m () > Streaming.toList_ :: Stream (Of a) m r -> m [a] The latter of course accumulates the whole list in memory, and is mostly what we are trying to avoid. Every use of 'Prelude.mapM f' should be reconceived as using the composition 'Streaming.toList_ . Streaming.mapM f . Streaming.each' with a view to considering whether the accumulation required by 'Streaming.toList_' is really necessary. Here are the results of some <https://gist.github.com/michaelt/96606bbf05b29bf43a05aba081dc9bd4#file-benchmachines-hs microbenchmarks> based on the <https://github.com/ekmett/machines/blob/master/benchmarks/Benchmarks.hs benchmarks> included in the machines package: <<http://i.imgur.com/YbQtlXm.png>> Because these are microbenchmarks for individual functions, they represent a sort of "worst case"; many other factors can influence the speed of a complex program.
ca: Aquest paquet conté dos mòduls, <http://hackage.haskell.org/package/streaming/docs/Streaming.html Streaming> i .http://hackage.haskell.org/package/streaming/docs/Streaming-Prelude.html Streaming.Preludi.. El mòdul principal, .http://hackage.haskell.org/package/streaming-0.1.4.3/docs/Streaming-Prelude.html Streaming.Preludi Pre, exporta un preludi de flux elemental centrat en un simple tipus "font" o "productor", és a dir, "Stream (Of a) m r". Aquesta és una mena de versió efectiva de '([a],r)' en la qual els elements successius de tipus 'a' sorgeixen d'alguna mena d'acció monòdica abans que la successió acabi amb un valor de tipus 'r'. Tot el que hi ha a la biblioteca està organitzat per fer la programació amb aquest tipus tan senzilla com sigui possible, pel simple expedient de fer-la tan propera a 'Preludi' i 'Dades.Llista' el més possible. Per exemple, el programa trivial ) ) S.sum $ S.take 3 (S.readLn :: Stream (Of Int) IO ()) ) 1<Enter> ) 2<Enter> ) 3<Enter> ) 6 :) () suma els tres primers enters vàlids a partir de l'entrada de l'usuari. De la mateixa manera, ! ! S.stdoutLn $ S.map (mapa toUpper) $ S.take 2 S.stdinLn ! hello<Enter> ! HELLO ! world!<Enter> ! WORLD! Posa en majúscula les dues primeres línies de stdin a mesura que van sorgint, i les envia a stdout. I així successivament, amb filtratge, mapatge, ruptura, fragmentació, zipping, descomprimir, replicar, etc.: programem amb fluxos de 'Int's o 'String's directament com si constituïssin alguna cosa així com una llista. Això es deu al fet que els fluxos realment constitueixen alguna cosa així com una llista, i les operacions associades poden tenir majoritàriament els mateixos noms. (Uns pocs, com ara 'invers', no es transmeten i per tant desapareixen; altres com 'descomprimir' es donen aquí una formulació de transmissió adequada per primera vegada.) I a tot arreu ens oposem a "extreure una llista pura de IO", que és l'origen de les catàstrofes típiques de la memòria de Haskell. Bàsicament, en qualsevol cas en què se senti temptat d'utilitzar «mapM», «replicateM», «traverse» o «seqüència» amb les llistes de Haskell, seria millor utilitzar alguna cosa com «Stream (Of a) m r». Les signatures tipus són una mica fantasioses, però els programes en si són majoritàriament els mateixos. /De fet, són majoritàriament més simples./ Per tant, considereu el programa de demostració trivial esmentat a <http://stackoverflow.com/questions/24068399/haskell-performance-of-iorefs this SO question> main mapM newIORef [1..1088::Int] mapM readIORef mapM print El nou usuari nota que això exhaureix la memòria, i es preocupa per l'eficiència de Haskell 'IORefs'. Però, per descomptat, exhaureix la memòria! Mira el que diu! El problema es cura immediatament per escrit ] main ] S.print $ S.mapM readIORef $ S.mapM newIORef $ S.each [1..10]8::Int] el que realment fa el que l'altre programa estava destinat a fer, no utilitza més memòria que 'hola-món', /i és més simple de totes maneres/, ja que no implica el desviament d'"extreure una llista de IO". Gairebé cada ús de la llista «mapM», «replicateM», «traverse» i «sequence» produeix aquest problema a menor escala. La gent s'hi acostuma, com si fos característic dels programes Haskell utilitzar molta memòria. Però en realitat, "extreure una llista o seqüència d'E/S" és, en la seva majoria, una mala pràctica pura i simple. Per descomptat, "mapM", "replicateM", "travers" i "seqüència" tenen sentit per a les llistes, en determinades condicions! Però "unsafePerformIO" també té sentit en determinades condicions. El mòdul <http://hackage.haskell.org/package/streaming-0.1.4.3/docs/Streaming.html Streaming> exporta el tipus general, 'Stream f m r', que es pot utilitzar per transmetre successius passos diferents caracteritzats per /any/ functor 'f', encara que estem principalment interessats en organitzar càlculs de la forma 'Stream (Of a) m r'. Les biblioteques streaming-IO tenen diversos dispositius per tractar amb variants efectives de '[a]' o '([a],r)' en què l'aparició d'elements successius d'alguna manera depèn de IO. Però és només amb el tipus general 'Stream f m r', o algun equivalent, que es pot imaginar (per exemple) la transmissió connectada de la seva mena de flux - ja que es fan llistes de llistes en el Haskell 'Preludi' i 'Dades.Llista'. Un necessita algun tipus d'aquest tipus si volem expressar els equivalents de transmissió adequats, per exemple. . grup :: Ord a . [a] -. [[a]] . chunksOf :: Int -. [a] -. [[a]] . línies :: [Char] -. [[Char]] -- però de manera similar amb els fluxos de bytes, etc. Per esmentar algunes operacions evidentment desitjables. (Això s'explica de forma més elaborada en el <https://hackage.haskell.org/package/streaming#readme readme> inferior.) Per descomptat, es podria llançar alguna cosa com el tipus actual de "Stream" a sobre d'un concepte de flux anterior: així és com "pipes" i "pipes-grup" (que són en gran manera el nostre model aquí) utilitzen "FreeT". Però una vegada que s'agafa el concepte de flux iterable necessari per expressar aquestes funcions, llavors també es veurà que, amb ell, un està /ja/ en possessió d'una biblioteca de flux elemental completa - ja que hom posseeix 'Stream ((,) a) m r' o equivalentment 'Stream (Of a) m r'. Aquest és el tipus de «generador» o «productor» o «font» o el que anomeneu un flux efectiu d'elements. /El present Streaming.El preludi és, doncs, la biblioteca de streaming més senzilla que pot replicar qualsevol cosa com l'API del preludi i les dades.Llista/. L'èmfasi de la biblioteca està en la interoperació; per la resta els seus avantatges són: simplicitat extrema, reutilització de les intuïcions que l'usuari ha recollit del domini de 'Preludi' i 'Dades.List', i un rebuig total i sistemàtic dels sinònims de tipus. Els dos prerequisits conceptuals són una certa comprensió dels transformadors de mònada i certa familiaritat amb els 'tipus de rang 2'. S'espera que l'experimentació amb aquest material senzill, començant pels exemples ghci a 'Streaming.Preludi', donarà a les persones que són noves a aquests conceptes una certa intuïció sobre la seva importància. El propòsit més fonamental de la biblioteca és expressar idees elementals de transmissió sense dependre d'un marc complex, però d'una manera que s'integri de manera transparent amb la resta de Haskell, utilitzant idees -per exemple, tipus de rang 2, que aquí són implícites o explícites en la majoria de mapes- que l'usuari pot portar a un altre lloc, en lloc d'encadenar la seva comprensió a les curiositats d'un marc de streaming IO (tan necessari com això és per a determinats propòsits). Vegeu el <https://hackage.haskell.org/package/streaming#readme readme> per a més informació, incloent els exemples enllaçats. L'ús elemental es pot deduir dels exemples ghci a 'Streaming.Preludi' i potser d'aquest començament aspre de <https://github.com/michaelt/streaming-tutorial/blob/master/tutorial.md tutorial>. Tingueu en compte també els paquets <https://hackage.haskell.org/package/streaming-bytestring streaming bytestring> i <https://hackage.haskell.org/package/streaming-utils streaming utils>. Les preguntes sobre l'ús es poden plantejar a StackOverflow amb l'etiqueta '[haskell-streaming]', o com a problema a Github, o a la <https://groups.google.com/forum/#!forum/haskell-pipes pipes list> (el paquet s'entén a si mateix com a part de l'ecosistema de canonades). La forma més simple d'interoperació amb <http://hackage.haskell.org/package/pipes pipes> es realitza amb aquest isomorfisme: > Pipes.unfoldr Streaming.next :: Stream (Of a) m r -) Producer a m r Streaming.unfoldr Pipes.next :: Producer a m r -) Stream (Of a) m r La cooperació amb <http://hackage.haskell.org/package/io-streams io-streams> és així: ) Streaming.reread IOStreams.read :: InputStream a -) Stream (Of a) IO () ) IOStreams.unfoldM Streaming.uncons :: Stream (Of a) IO () -) IO (InputStream a) Amb <http://hackage.haskell.org/package/conduit conduit> es podria utilitzar, per exemple: > Conduit.unfoldM Streaming.uncons :: Stream (Of a) m () -> Source m a ) str -) Streaming.mapM Conduit.yield (hoist lift str) :: Stream (Of o) m r -> ConduitM i o m r src - $$ hoist lift str $$ Conduit.mapM Streaming.yield :: Source m a -) Flux (D'a) m () Aquestes conversions mai haurien de ser més cares que una sola '--.' o '$$.'. La interoperació més senzilla amb les llistes regulars de Haskell és proporcionada per, diguem Streaming.each :: [a] -] Stream (Of a) m () Streaming.toList :: Stream (Of a) m r -] m [a] Aquest últim, per descomptat, acumula tota la llista en la memòria, i és sobretot el que intentem evitar. Tot ús de «Prelude.mapM f» s'hauria de considerar com a ús de la composició «Streaming.toList». Streaming.mapM f . Streaming.each' amb vista a considerar si l'acumulació requerida per "Streaming.toList" és realment necessària. Aquests són els resultats d'unes <https://gist.github.com/michaelt/96606bbf05b29bf43a05aba081dc9bd4#file-benchmachines-hs microbenchmarks> basades en les <https://github.com/ekmett/machines/blob/master/benchmarks/Benchmarks.hs benchmarks> incloses en el paquet de màquines: <<http://i.imgur.com/YbQtlXm.png> Com que són microbenchmarks per a funcions individuals, representen una mena de "cas pitjor"; molts altres factors poden influir en la velocitat d'un programa complex.

source: Streaming interface to binary
ca: Interfície de transmissió al binari

source: Streaming interface to binary.
ca: Interfície de transmissió a binari.

source: Haskell streaming-binary library development files
ca: Fitxers de desenvolupament de la biblioteca de streaming de Haskell

source: This package provides the Haskell streaming-binary library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell streaming-binary.

source: Fast, effectful byte streams
ca: Fluxos de bytes ràpids i efectius

source: This library enables fast and safe streaming of byte data, in either 'Word8' or 'Char' form. It is a core addition to the <https://github.com/haskell-streaming streaming ecosystem> and avoids the usual pitfalls of combinbing lazy 'ByteString's with lazy 'IO'. We follow the philosophy shared by 'streaming' that "the best API is the one you already know". Thus this library mirrors the API of the 'bytestring' library as closely as possible. See the module documentation and the README for more information.
ca: Aquesta biblioteca permet la transmissió ràpida i segura de dades de bytes, ja sigui en forma 'Word8' o 'Char'. És una addició bàsica a la <https://github.com/haskell-streaming streaming ecosystem> i evita els obstacles habituals de combinar 'ByteString's amb 'IO' mandrós. Seguim la filosofia compartida per 'streaming' que "la millor API és la que ja coneixes". Per tant, aquesta biblioteca reflecteix l'API de la biblioteca 'bytestring' el més de prop possible. Consulteu la documentació del mòdul i el README per a més informació.

source: Haskell streaming-bytestring library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell streaming-bytestring

source: This package provides the Haskell streaming-bytestring library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell de transmissió de bytestring.

source: Common lower-level functions needed by various streaming data libraries
ca: Funcions comunes de baix nivell necessàries per a diverses biblioteques de dades en flux

source: Provides low-dependency functionality commonly needed by various streaming data libraries, such as conduit and pipes.
ca: Proporciona funcionalitats de baixa dependència que normalment necessiten diverses biblioteques de dades de transmissió, com ara conductes i conductes.

source: This package provides the Haskell streaming-commons library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell streaming-commons.

source: Haskell streaming library development files
ca: Fitxers de desenvolupament de la biblioteca de flux Haskell

source: This package provides the Haskell streaming library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de transmissió Haskell.

source: Strict data types and String IO
ca: Tipus de dades estrictes i E/S de cadena
