Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: This package provides the Haskell bimap library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca bimapa Haskell.

source: Haskell binary library
ca: Biblioteca binària Haskell

source: This package provides the Haskell binary library.
ca: Aquest paquet proporciona la biblioteca binària Haskell.

source: Haskell binary library development files
ca: Fitxers de desenvolupament de la biblioteca binària Haskell

source: This package provides the Haskell binary library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca binària Haskell.

source: Compatibility package for binary; provides instances
ca: Paquet de compatibilitat per al binari; proporciona instàncies

source: This package provides instances defined in later versions of 'binary' package Prior version 1 this packages provided instances for other packages. That functionality is moved to [binary-instances](https://hackage.haskell.org/package/binary-instances) package.
ca: Aquest paquet proporciona instàncies definides en versions posteriors del paquet «binari» Versió 1 anterior, aquests paquets proporcionaven instàncies per a altres paquets. Aquesta funcionalitat es mou al paquet [binary-instances](https://hackage.haskell.org/package/binary-instances).

source: Haskell binary-orphans library development files
ca: Fitxers de desenvolupament de la biblioteca d'orfes binàries de Haskell

source: This package provides the Haskell binary-orphans library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'orfes binàries de Haskell.

source: FFI domain specific language, on top of hsc2hs
ca: Idioma específic del domini FFI, a sobre de hsc2hs

source: This is a set of macros to be used when writing Haskell FFI. They were designed to be able to fully describe C interfaces, so that hsc2hs can extract from them all Haskell code needed to mimic such interfaces. All Haskell names used are automatically derived from C names, structures are mapped to Haskell instances of Storable, and there are also macros you can use with C code to help write bindings to inline functions or macro functions. Documentation is available at package homepage: <https://github.com/jwiegley/bindings-dsl/wiki> The extra module Bindings.Utilities will contain tools that may be convenient when working with FFI.
ca: Aquest és un conjunt de macros que s'utilitzaran per a escriure Haskell FFI. Van ser dissenyats per poder descriure completament interfícies C, de manera que hsc2hs pot extreure d'elles tot el codi Haskell necessari per imitar aquestes interfícies. Tots els noms Haskell utilitzats es deriven automàticament dels noms C, les estructures s'assignen a les instàncies Haskell de Storable, i també hi ha macros que podeu utilitzar amb codi C per ajudar a escriure vinculacions a funcions en línia o funcions macro. La documentació està disponible a la pàgina d'inici del paquet: <https://github.com/jwiegley/bindings-dsl/wiki> El mòdul extra Vinculacions.Les utilitats contindran eines que poden ser convenients a l'hora de treballar amb FFI.

source: Haskell bindings-DSL library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell bindings-DSL

source: This package provides the Haskell bindings-DSL library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell bindings-DSL.

source: Low-level binding to POSIX uname(3)
ca: Vinculació de baix nivell a POSIX uname(3)

source: This is a low-level binding to POSIX uname(3) function. Perhaps it shoule be part of unix package.
ca: Aquesta és una unió de baix nivell a la funció POSIX uname(3). Potser shoule forma part del paquet unix.

source: Haskell bindings-uname library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell bindings-uname

source: This package provides the Haskell bindings-uname library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell bindings-uname.

source: Mutable and immutable bit arrays
ca: Matrius de bits mutables i immutables

source: Mutable and immutable bit arrays.
ca: Matrius de bits mutables i immutables.

source: Haskell bitarray library development files
ca: Fitxers de desenvolupament de la biblioteca de bitarray del Haskell

source: This package provides the Haskell bitarray library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell bitarray.

source: A library for handling and manipulating bitmaps (rectangular pixel arrays)
ca: Una biblioteca per a gestionar i manipular mapes de bits (arrays de píxels rectangulars)

source: A library for handling and manipulating bitmaps (that is, rectangular pixel arrays).
ca: Una biblioteca per al maneig i manipulació de mapes de bits (és a dir, matrius de píxels rectangulars).

source: Haskell bitmap library development files
ca: Fitxers de desenvolupament de la biblioteca de mapes de bits Haskell

source: This package provides the Haskell bitmap library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell bitmap.

source: Efficient buffered output
ca: Sortida eficient a la memòria intermèdia

source: This library allows to efficiently serialize Haskell values to lazy bytestrings with a large average chunk size. The large average chunk size allows to make good use of cache prefetching in later processing steps (e.g. compression) and reduces the system call overhead when writing the resulting lazy bytestring to a file or sending it over the network. This library was inspired by the module Data.Binary.Builder provided by the binary package. It was originally developed with the specific needs of the blaze-html package in mind. Since then it has been restructured to serve as a drop-in replacement for Data.Binary.Builder, which it improves upon both in speed as well as expressivity.
ca: Aquesta biblioteca permet serialitzar eficientment els valors de Haskell a bytestrings mandrosos amb una gran mida mitjana de fragment. La gran mida mitjana del fragment permet fer un bon ús de la memòria cau prefetching en passos de processament posteriors (p. ex. compressió) i redueix la sobrecàrrega de trucada del sistema quan s'escriu la prova mandrosa resultant a un fitxer o s'envia a través de la xarxa. Aquesta biblioteca es va inspirar en el mòdul Data.Binari.Constructor proporcionat pel paquet binari. Originalment es va desenvolupar pensant en les necessitats específiques del paquet blaze-html. Des de llavors s'ha reestructurat per servir com a substitut de Data.Binari.Constructor, que millora tant en velocitat com en expressivitat.

source: Haskell blaze-builder library development files
ca: Fitxers de desenvolupament de la biblioteca de construcció de blazes de Haskell

source: This package provides the Haskell blaze-builder library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell blaze-builder.

source: A blazingly fast HTML combinator library for Haskell
ca: Una biblioteca combinadora d'HTML ràpida per al Haskell

source: A blazingly fast HTML combinator library for the Haskell programming language. The Text.Blaze module is a good starting point, as well as this tutorial: <http://jaspervdj.be/blaze/tutorial.html>.
ca: Una biblioteca combinadora HTML ràpida per al llenguatge de programació Haskell. El text.El mòdul Blaze és un bon punt de partida, així com aquest tutorial: <http://jaspervdj.be/blaze/tutorial.html>.

source: Haskell blaze-html library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell blaze-html

source: This package provides the Haskell blaze-html library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell blaze-html.

source: A blazingly fast markup combinator library for Haskell
ca: Una biblioteca de marques ràpides per al Haskell

source: Core modules of a blazingly fast markup combinator library for the Haskell programming language. The Text.Blaze module is a good starting point, as well as this tutorial: <http://jaspervdj.be/blaze/tutorial.html>.
ca: Mòduls bàsics d'una llibreria de marcatge ràpida per al llenguatge de programació Haskell. El text.El mòdul Blaze és un bon punt de partida, així com aquest tutorial: <http://jaspervdj.be/blaze/tutorial.html>.

source: Haskell blaze-markup library development files
ca: Fitxers de desenvolupament de la biblioteca de marques blaze de Haskell

source: This package provides the Haskell blaze-markup library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell blaze-markup.

source: Pure and impure Bloom Filter implementations
ca: Implementacions del filtre de floració pures i impures

source: Pure and impure Bloom Filter implementations.
ca: Implementacions pures i impures de Bloom Filter.

source: Haskell bloomfilter library development files
ca: Fitxers de desenvolupament de la biblioteca de flora de Haskell

source: This package provides the Haskell bloomfilter library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de floració de Haskell.

source: Binary distributions of The Glorious Glasgow Haskell Compiler
ca: Distribucions binàries del compilador Glasgow Haskell Glorious

source: This package contains a binary distribution of "The Glorious Glasgow Haskell Compilation System". See README.openSUSE on how the tarballs were produced. Do not install this package! Install 'ghc' instead.
ca: Aquest paquet conté una distribució binària de "The Glorious Glasgow Haskell Compilation System". Vegeu README.openSUSE sobre com es van produir els tarballs. No instal·lis aquest paquet! Instal·leu «ghc».

source: Dependencies to build ghc
ca: Dependències per a construir el ghc

source: Prebuild alex and happy for ghc-8.8+ build Don't use outside GHC-8.8+ build
ca: Alex de preconstrucció i feliç per a la construcció ghc-8.8+ No utilitzeu fora de la construcció GHC-8.8+

source: Boring and Absurd types
ca: Tipus d'avorrits i absurds

source: * 'Boring' types are isomorphic to '()'. * 'Absurd' types are isomorphic to 'Void'. See [What does () mean in Haskell -answer by Conor McBride](https://stackoverflow.com/questions/33112439/what-does-mean-in-haskell/33115522#33115522).
ca: * Els tipus 'Boring' són isomorfs a '()'. * Els tipus 'Absurd' són isomorfs a 'Void'. Vegeu [Què significa () a Haskell -resposta de Conor McBride](https://stackoverflow.com/questions/33112439/what-does-mean-in-haskell/33115522).33115522).

source: Haskell boring library development files
ca: Fitxers de desenvolupament de la biblioteca avorrits del Haskell

source: This package provides the Haskell boring library development files.
ca: Aquest paquet proporciona els fitxers avorrits de desenvolupament de la biblioteca Haskell.

source: 2D text pretty-printing library
ca: Biblioteca de text en 2D que està imprimint

source: A pretty-printing library for laying out text in two dimensions, using a simple box model.
ca: Una biblioteca d'impressió bonica per a la disposició de text en dues dimensions, utilitzant un model de caixa simple.

source: Haskell boxes library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell boxes

source: This package provides the Haskell boxes library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell boxes.

source: A declarative terminal user interface library
ca: Una biblioteca d'interfície d'usuari de terminal declarativa

source: Write terminal user interfaces (TUIs) painlessly with 'brick'! You write an event handler and a drawing function and the library does the rest. > module Main where > > import Brick > > ui :: Widget () > ui = str "Hello, world!" > > main :: IO () > main = simpleMain ui To get started, see: * <https://github.com/jtdaugherty/brick/blob/master/README.md The README> * The <https://github.com/jtdaugherty/brick/blob/master/docs/guide.rst Brick user guide> * The demonstration programs in the 'programs' directory This package deprecates <http://hackage.haskell.org/package/vty-ui vty-ui>.
ca: Escriu les interfícies d'usuari de terminal (TUIs) sense dolor amb «brick»! Escriviu un gestor d'esdeveniments i una funció de dibuix i la biblioteca fa la resta. !" Mòdul Principal on !" !" import Brick !" > ui :: Widget () !" ui !" str "Hola, món!" main :: IO () main simpleMain ui Per començar, vegeu: * <https://github.com/jtdaugherty/brick/blob/master/README.md The README> * El <https://github.com/jtdaugherty/brick/blob/master/docs/guide.rst Brick user guide> * Els programes de demostració en el directori de 'programes' Aquest paquet és obsolet <http://hackage.haskell.org/package/vty-ui vty-ui>.

source: Haskell brick library development files
ca: Fitxers de desenvolupament de la biblioteca de maons del Haskell

source: This package provides the Haskell brick library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de maons Haskell.

source: Chunked HTTP transfer encoding for bytestring builders
ca: Codificació de transferència HTTP fragmentada per als constructors de proves

source: This library contains functions for encoding [bytestring builders](http://hackage.haskell.org/package/bytestring/docs/Data-ByteString-Builder.html#t:Builder) for [chunked HTTP/1.1 transfer](https://en.wikipedia.org/wiki/Chunked_transfer_encoding). This functionality was extracted from the [blaze-builder](http://hackage.haskell.org/package/blaze-builder) package.
ca: Aquesta biblioteca conté funcions per a codificar [compiladors de bytestring](http://hackage.haskell.org/package/bytestring/docs/Data-ByteString-Builder.html).t:Builder) per a la [transferència HTTP/1.1 eliminada](https://en.wikipedia.org/wiki/Chunkedtransferencoding). Aquesta funcionalitat s'ha extret del paquet [blaze-builder](http://hackage.haskell.org/package/blaze-builder).

source: Haskell bsb-http-chunked library development files
ca: Haskell bsb-http-chunked biblioteca fitxers de desenvolupament

source: This package provides the Haskell bsb-http-chunked library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell bsb-http-chunked.

source: Type class for sequence of bytes
ca: Tipus de classe per a la seqüència de bytes

source: Abstract class to manipulate sequence of bytes The use case of this class is abstracting manipulation of types that are just wrapping a bytestring with stronger and more meaniful name. Usual definition of those types are of the form: newtype MyType = MyType ByteString.
ca: Classe abstracta per manipular la seqüència de bytes El cas d'ús d'aquesta classe és l'abstracció de la manipulació de tipus que només estan embolcallant un bytestring amb un nom més fort i mesquin. Definició habitual d'aquests tipus són de la forma: newtype MyType . MyType ByteString.

source: Haskell byteable library development files
ca: Fitxers de desenvolupament de biblioteques byteables de Haskell

source: This package provides the Haskell byteable library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca byteable de Haskell.

source: Exposes the native endianness or byte ordering of the system
ca: Exposa l'ordre de l'endianitat nativa o de bytes del sistema

source: This package is for working with the native byte-ordering of the system.
ca: Aquest paquet és per treballar amb l'ordenació de bytes nativa del sistema.

source: Haskell byteorder library development files
ca: Fitxers de desenvolupament de la biblioteca byteorder de Haskell

source: This package provides the Haskell byteorder library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca byteorder de Haskell.

source: Haskell bytestring library
ca: Biblioteca Haskell bytestring

source: This package provides the Haskell bytestring library.
ca: Aquest paquet proporciona la biblioteca Haskell bytestring.

source: The new bytestring builder, packaged outside of GHC
ca: El nou constructor bytestring, empaquetat fora del GHC

source: This is the bytestring builder that is debuting in bytestring-0.10.4.0, which should be shipping with GHC 7.8, probably late in 2013. This builder has several nice simplifications and improvements, and more out-of-box functionality than the older blaze-builder. Note that this package detects which version of bytestring you are compiling against, and if you are compiling against bytestring-0.10.4 or later, will be an empty package. This package lets the new interface and implementation be used with most older compilers without upgrading bytestring, which can be rather problematic. In conjunction with blaze-builder-0.4 or later, which offers an implementation of blaze-builder in terms of bytestring-builder, this should let most people try the new interface and implementation without causing undue compatibility problems with packages that depend on blaze-builder. GHC 7.6 did debut an almost identical interface and implementation, but with slightly different module names and organization. Trying to re-export/rename the builder provided with 7.6 did not turn out to be very practical, because this interface includes new functions that rely on Builder internals, which are not exported in 7.6. Furthermore, these module names should be deprecated in 7.10.
ca: Aquest és el bytestring builder que està debutant en bytestring-0.10.4.0, que hauria d'enviar amb GHC 7.8, probablement a finals de 2013. Aquest constructor té diverses simplificacions i millores agradables, i més funcionalitat fora de caixa que l'anterior blaze-builder. Tingueu en compte que aquest paquet detecta en quina versió del bytestring esteu compilant, i si esteu compilant contra el bytestring-0.10.4 o posterior, serà un paquet buit. Aquest paquet permet utilitzar la nova interfície i implementació amb la majoria dels compiladors més antics sense actualitzar bytestring, la qual cosa pot ser bastant problemàtica. Juntament amb blaze-builder-0.4 o posterior, que ofereix una implementació de blaze-builder en termes de bytestring-builder, això hauria de permetre a la majoria de la gent provar la nova interfície i implementació sense causar problemes de compatibilitat indeguda amb paquets que depenen de blaze-builder. El GHC 7.6 va debutar amb una interfície i implementació gairebé idèntiques, però amb noms de mòduls i organització lleugerament diferents. Intentar reexportar/reanomenar el constructor proporcionat amb 7.6 no va resultar ser molt pràctic, perquè aquesta interfície inclou noves funcions que depenen dels interns del constructor, que no s'exporten en 7.6. A més, aquests noms de mòduls haurien d'estar obsolets en 7,10.

source: Haskell bytestring-builder library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell bytestring-builder

source: This package provides the Haskell bytestring-builder library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell bytestring-builder.

source: Haskell bytestring library development files
ca: Haskell provant els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell bytestring library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell bytestring.

source: Streaming compression/decompression via conduits
ca: Compressió/descompressió de flux a través de conductes

source: Streaming compression/decompression via conduits.
ca: Compressió/descompressió de flux a través de conductes.

source: Haskell bzlib-conduit library development files
ca: Fitxers de desenvolupament de la biblioteca de bzlib-conduit de Haskell

source: This package provides the Haskell bzlib-conduit library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell bzlib-conduit.

source: A Setup.hs helper for running doctests
ca: Un ajudant de Setup.hs per a executar doctests

source: As of now (end of 2021), there isn't 'cabal doctest' command. Yet, to properly work, 'doctest' needs plenty of configuration. This library provides the common bits for writing a custom 'Setup.hs'.
ca: A partir d'ara (finals de 2021), no hi ha ordre 'cabal doctest'. No obstant això, per a funcionar correctament, el «doctest» necessita molta configuració. Aquesta biblioteca proporciona els bits comuns per a escriure un «Setup.hs» personalitzat.

source: Haskell cabal-doctest library development files
ca: Fitxers de desenvolupament de la biblioteca cabal-doctest de Haskell

source: This package provides the Haskell cabal-doctest library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca cabal-doctest de Haskell.

source: Use GHC call-stacks in a backward compatible way
ca: Usa les piles de trucades GHC de manera compatible cap enrere

source: Use GHC call-stacks in a backward compatible way.
ca: Utilitza les piles de trucades GHC d'una manera compatible cap enrere.

source: Haskell call-stack library development files
ca: Fitxers de desenvolupament de la biblioteca de crides Haskell

source: This package provides the Haskell call-stack library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell call-stack.

source: Canonical JSON for signing and hashing JSON values
ca: JSON canònic per a signar i resumir valors JSON

source: An implementation of Canonical JSON. <http://wiki.laptop.org/go/Canonical_JSON> The "canonical JSON" format is designed to provide repeatable hashes of JSON-encoded data. It is designed for applications that need to hash, sign or authenitcate JSON data structures, including embedded signatures. Canonical JSON is parsable with any full JSON parser, and it allows whitespace for pretty-printed human readable presentation, but it can be put into a canonical form which then has a stable serialised representation and thus a stable hash.
ca: Una implementació del JSON canònic. <http://wiki.laptop.org/go/CanonicalJSON> El format "JSON canònic" està dissenyat per a proporcionar hashes repetibles de dades codificades en JSON. Està dissenyat per a aplicacions que necessiten hash, sign o autenitcat d'estructures de dades JSON, incloent signatures incrustades. El JSON canònic és analitzable amb qualsevol analitzador JSON complet, i permet espais en blanc per a una presentació llegible humana bastant impresa, però es pot posar en una forma canònica que després té una representació serialitzada estable i, per tant, un hash estable.

source: Haskell canonical-json library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell canonical-json

source: This package provides the Haskell canonical-json library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell canonical-json.

source: Case insensitive string comparison
ca: Comparació de cadenes sense distingir majúscules i minúscules

source: The module 'Data.CaseInsensitive' provides the 'CI' type constructor which can be parameterised by a string-like type like: 'String', 'ByteString', 'Text', etc.. Comparisons of values of the resulting type will be insensitive to cases.
ca: El mòdul 'Dades.CaseInsensitive proporciona el constructor de tipus 'CI' que es pot parametritzar per un tipus similar a una cadena com: 'String', 'ByteString', 'Text', etc. Les comparacions dels valors del tipus resultant no seran sensibles als casos.

source: Haskell case-insensitive library development files
ca: Fitxers de desenvolupament de la biblioteca sense distingir majúscules i minúscules Haskell
