Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: <http://hedgehog.qa/ Hedgehog> automatically generates a comprehensive array of test cases, exercising your software in ways human testers would never imagine. Generate hundreds of test cases automatically, exposing even the most insidious of corner cases. Failures are automatically simplified, giving developers coherent, intelligible error messages. To get started quickly, see the <https://github.com/hedgehogqa/haskell-hedgehog/tree/master/hedgehog-example examples>.
ca: <http://hedgehog.qa/ Hedgehog> genera automàticament una àmplia gamma de casos de prova, exercint el vostre programari de maneres que els provadors humans mai s'imaginarien. Genera centenars de casos de prova automàticament, exposant fins i tot els casos més insidiosos de racons. Les fallades se simplifiquen automàticament, donant als desenvolupadors missatges d'error coherents i intel·ligibles. Per començar ràpidament, vegeu el <https://github.com/hedgehogqa/haskell-hedgehog/tree/master/hedgehog-example examples>.

source: Collection of strings for testing things.
ca: Col·lecció de cadenes per provar coses.

source: Haskell hedgehog-corpus library development files
ca: Fitxers de desenvolupament de la biblioteca Hedgehog-corpus de Haskell

source: This package provides the Haskell hedgehog-corpus library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hedgehog-corpus.

source: Haskell hedgehog library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hedgehog

source: This package provides the Haskell hedgehog library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hedgehog.

source: Use QuickCheck generators in Hedgehog and vice versa
ca: Usa els generadors QuickCheck a Hedgehog i viceversa

source: Use QuickCheck generators in Hedgehog and vice versa. Hedgehog is a modern property-based testing system, in the spirit of QuickCheck. Hedgehog uses integrated shrinking, so shrinks obey the invariants of generated values by construction. To get started quickly, see the examples: <https://github.com/hedgehogqa/haskell-hedgehog/tree/master/hedgehog-.
ca: Utilitzeu generadors QuickCheck a Hedgehog i viceversa. Hedgehog és un modern sistema de proves basat en propietats, amb l'esperit de QuickCheck. L'eriçó utilitza la reducció integrada, de manera que les encongides obeeixen els invariants dels valors generats per la construcció. Per començar ràpidament, vegeu els exemples: httpshttps://github.com/hedgehogqa/haskell-hedgehog/tree/master/hedgehog-.

source: Haskell hedgehog-quickcheck library development files
ca: Fitxers de desenvolupament de la biblioteca de haskell hedgehog-quickcheck

source: This package provides the Haskell hedgehog-quickcheck library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hedgehog-quickcheck.

source: Parser for GHC's hi files
ca: Analitzador per als fitxers hi del GHC

source: Parser for GHC's hi files.
ca: Analitzador per als fitxers hi de GHC.

source: Haskell hi-file-parser library development files
ca: Haskell hi-file-parser biblioteca fitxers de desenvolupament

source: This package provides the Haskell hi-file-parser library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Hi-file-parser de Haskell.

source: Haskell binding to inotify
ca: Vinculació de Haskell a «inotify»

source: This library provides a wrapper to the Linux Kernel's inotify feature, allowing applications to subscribe to notifications when a file is accessed or modified.
ca: Aquesta biblioteca proporciona un embolcall a la característica d'inotify del nucli Linux, permetent a les aplicacions subscriure's a les notificacions quan s'accedeix o es modifica un fitxer.

source: Haskell hinotify library development files
ca: Haskell hinotifica els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell hinotify library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hinotify.

source: Haskell implementation of a javascript minifier
ca: Implementació de Haskell d'un minifier javascript

source: Reduces size of javascript files by stripping out extraneous whitespace and other syntactic elements, without changing the semantics.
ca: Redueix la mida dels fitxers javascripts eliminant espais en blanc i altres elements sintàctics, sense canviar la semàntica.

source: Haskell hjsmin library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hjsmin

source: This package provides the Haskell hjsmin library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hjsmin.

source: A reusable library providing the core functionality of hledger
ca: Una biblioteca reutilitzable que proporciona la funcionalitat principal del hledger

source: A reusable library containing hledger's core functionality. This is used by most hledger* packages so that they support the same common file formats, command line options, reports etc. hledger is a robust, cross-platform set of tools for tracking money, time, or any other commodity, using double-entry accounting and a simple, editable file format, with command-line, terminal and web interfaces. It is a Haskell rewrite of Ledger, and one of the leading implementations of Plain Text Accounting. Read more at: <https://hledger.org>.
ca: Una biblioteca reutilitzable que conté la funcionalitat principal de hledger. Això és utilitzat per la majoria de paquets hledger* de manera que admeten els mateixos formats de fitxer comuns, opcions de línia d'ordres, informes, etc. hledger és un conjunt d'eines robustes i multiplataforma per fer el seguiment de diners, temps o qualsevol altra mercaderia, utilitzant comptabilitat de doble entrada i un format de fitxer senzill i editable, amb interfícies de línia d'ordres, terminal i web. És una reescriptura Haskell de Ledger, i una de les implementacions principals de la comptabilitat de text net. Llegiu més a: <https://hledger.org>.

source: Haskell hledger-lib library development files
ca: Fitxers de desenvolupament de la biblioteca hledger-lib de Haskell

source: This package provides the Haskell hledger-lib library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Hledger-lib de Haskell.

source: A very simple package providing a cross-platform means of determining the hostname
ca: Un paquet molt senzill que proporciona un mitjà multiplataforma per determinar el nom de l'amfitrió

source: A very simple package providing a cross-platform means of determining the hostname.
ca: Un paquet molt senzill que proporciona un mitjà multiplataforma per determinar el nom de l'amfitrió.

source: Haskell hostname library development files
ca: Fitxers de desenvolupament de la biblioteca de nom d'amfitrió Haskell

source: This package provides the Haskell hostname library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hostname.

source: Simple performant time related library
ca: Biblioteca senzilla relacionada amb el temps performant

source: Simple time library focusing on simple but powerful and performant API The backbone of the library are the Timeable and Time type classes. Each Timeable instances can be converted to type that has a Time instances, and thus are different representations of current time.
ca: Biblioteca de temps simple centrada en una API simple però potent i performant La columna vertebral de la biblioteca són les classes Timeable i Time type. Cada instància temporitzada es pot convertir a tipus que tingui una instància de temps, i per tant són representacions diferents de l'hora actual.

source: Haskell hourglass library development files
ca: Fitxers de desenvolupament de la biblioteca de rellotge de sorra Haskell

source: This package provides the Haskell hourglass library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de rellotge de sorra Haskell.

source: Haskell hpc library
ca: Biblioteca Hpc de Haskell

source: This package provides the Haskell hpc library.
ca: Aquest paquet proporciona la biblioteca hpc de Haskell.

source: Haskell hpc library development files
ca: Fitxers de desenvolupament de la biblioteca Hpc de Haskell

source: This package provides the Haskell hpc library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca hpc de Haskell.

source: Haskell bindings to bibutils, the bibliography conversion utilities
ca: Haskell vincula a bibutils, les utilitats de conversió de bibliografia

source: Haskell bindings to Chris Putnam's bibutils, a library that interconverts between various bibliography formats using a common MODS-format XML intermediate. hs-bibutils is available under the GNU GPL license. See the LICENSE file for details. For more details about bibutils, please check: <http://sourceforge.net/p/bibutils/home/Bibutils/>. The package release number refers to the release number of the included bibutils library.
ca: Haskell s'uneix als bibutils de Chris Putnam, una biblioteca que interconverteix entre diversos formats de bibliografia utilitzant un format XML intermedi comú MODS. hs-bibutils està disponible sota la llicència GNU GPL. Vegeu el fitxer de llicència per a més detalls. Per a més detalls sobre els bibutils, si us plau, comproveu: <http://sourceforge.net/p/bibutils/home/Bibutils/>. El número de llançament del paquet es refereix al número de llançament de la biblioteca de bibutils inclosos.

source: Haskell hs-bibutils library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hs-bibutils

source: This package provides the Haskell hs-bibutils library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hs-bibutils.

source: Parsec parsers for the Internet Message format (e-mail)
ca: Analitzadors Parsec per al format de missatge d'Internet (correu electrònic)

source: Parsec parsers for the Internet Message format defined in RFC2822.
ca: Analitzadors Parsec per al format de missatge d'Internet definit a RFC2822.

source: Haskell hsemail library development files
ca: Fitxers de desenvolupament de la biblioteca Hsemail del Haskell

source: This package provides the Haskell hsemail library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hsemail.

source: Versatile logging framework
ca: Marc de treball de registre versàtil

source: 'hslogger' is a logging framework for Haskell, roughly similar to [Python's logging module](https://docs.python.org/2/library/logging.html). 'hslogger' lets each log message have a priority and source be associated with it. The programmer can then define global handlers that route or filter messages based on the priority and source. 'hslogger' also has a [Syslog](https://tools.ietf.org/html/rfc5424) handler built in.
ca: «hslogger» és un marc de treball de registre per a Haskell, més o menys similar al [mòdul de registre de Python](https://docs.python.org/2/library/logging.html). «hslogger» permet que cada missatge de registre tingui una prioritat i que la font s'hi associï. El programador pot definir els gestors globals que encamina o filtra els missatges en funció de la prioritat i la font. «hslogger» també té incorporat un gestor [Syslog](https://tools.ietf.org/html/rfc5424).

source: Haskell hslogger library development files
ca: Fitxers de desenvolupament de la biblioteca hslogger de Haskell

source: This package provides the Haskell hslogger library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca hslogger de Haskell.

source: Bindings to Lua, an embeddable scripting language
ca: Vinculacions a Lua, un llenguatge de creació de scripts incrustable

source: HsLua provides wrappers and helpers to bridge Haskell and <https://www.lua.org/ Lua>. It builds upon the /lua/ package, which allows to bundle a Lua interpreter with a Haskell program. <https://github.com/hslua/hslua-examples Example programs> are available in a separate repository.
ca: HsLua proporciona embolcalls i ajudants per al pont Haskell i <https://www.lua.org/ Lua>. Es basa en el paquet /lua/, que permet agrupar un intèrpret de Lua amb un programa Haskell. <https://github.com/hslua/hslua-examples Example programs> estan disponibles en un repositori separat.

source: Allow aeson data types to be used with Lua
ca: Permet que els tipus de dades d'eson s'utilitzin amb Lua

source: This package provides instances to push and receive any datatype encodable as JSON to and from the Lua stack.
ca: Aquest paquet proporciona instàncies per a enviar i rebre qualsevol tipus de dades codificable com a JSON a i des de la pila Lua.

source: Haskell hslua-aeson library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hslua-aeson

source: This package provides the Haskell hslua-aeson library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hslua-aeson.

source: Type classes for HsLua
ca: Tipus de classes per a HsLua

source: Type classes for convenient marshalling and calling of Lua functions.
ca: Tipus de classes per a realitzar un acoblament convenient i cridar de les funcions de Lua.

source: Haskell hslua-classes library development files
ca: Fitxers de desenvolupament de la biblioteca de les classes hslua del Haskell

source: This package provides the Haskell hslua-classes library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hslua-classes.

source: Wrappers and helpers to bridge Haskell and <https://www.lua.org/ Lua>. It builds upon the /lua/ package, which allows to bundle a Lua interpreter with a Haskell program.
ca: Embolcalls i ajudants per pontejar Haskell i <https://www.lua.org/ Lua>. Es basa en el paquet /lua/, que permet agrupar un intèrpret de Lua amb un programa Haskell.

source: Haskell hslua-core library development files
ca: Fitxers de desenvolupament de la biblioteca hslua-core de Haskell

source: This package provides the Haskell hslua-core library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hslua-core.

source: Haskell hslua library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hslua

source: This package provides the Haskell hslua library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hslua.

source: Marshalling of values between Haskell and Lua
ca: Aparellament de valors entre Haskell i Lua

source: Provides functions to marshal values from Haskell to Lua, and /vice versa/. This package is part of HsLua, a Haskell framework built around the embeddable scripting language <https://lua.org Lua>.
ca: Proporciona funcions de valors de mariscal de Haskell a Lua, i /vice versa/. Aquest paquet forma part de HsLua, un marc de treball Haskell construït al voltant del llenguatge de script incrustable <https://lua.org Lua>.

source: Haskell hslua-marshalling library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hslua-marshalling

source: This package provides the Haskell hslua-marshalling library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hslua-marshalling.

source: Lua module to work with file paths
ca: Mòdul Lua per a treballar amb camins de fitxers

source: Lua module to work with file paths in a platform independent way.
ca: Mòdul Lua per treballar amb camins de fitxers de forma independent de plataforma.

source: Haskell hslua-module-path library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hslua-module-path

source: This package provides the Haskell hslua-module-path library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hslua-module-path.

source: Lua module wrapper around Haskell's System module
ca: Embolcall del mòdul Lua al voltant del mòdul del sistema de Haskell

source: Provides access to system information and functionality to Lua scripts via Haskell's `System` module. This package is part of HsLua, a Haskell framework built around the embeddable scripting language <https://lua.org Lua>.
ca: Proporciona accés a la informació i funcionalitat del sistema als scripts Lua a través del mòdul .System. de Haskell. Aquest paquet forma part de HsLua, un marc de treball Haskell construït al voltant del llenguatge de script incrustable <https://lua.org Lua>.

source: Haskell hslua-module-system library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hslua-module-system

source: This package provides the Haskell hslua-module-system library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hslua-module-system.

source: Lua module for text
ca: Mòdul Lua per al text

source: UTF-8 aware subset of Lua's `string` module. This package is part of HsLua, a Haskell framework built around the embeddable scripting language <https://lua.org Lua>.
ca: subconjunt conscient d'UTF-8 del mòdul .string. de Lua. Aquest paquet forma part de HsLua, un marc de treball Haskell construït al voltant del llenguatge de script incrustable <https://lua.org Lua>.

source: Haskell hslua-module-text library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hslua-module-text

source: This package provides the Haskell hslua-module-text library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hslua-module-text.

source: Lua module to work with version specifiers
ca: Mòdul Lua per a treballar amb especificadors de versions

source: Wrapper for the Data.Version.Version Haskell type.
ca: Embolcall per a les dades.Versió.Versió del tipus Haskell.

source: Haskell hslua-module-version library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hslua-module-version

source: This package provides the Haskell hslua-module-version library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hslua-module-version.

source: Object orientation tools for HsLua
ca: Eines d'orientació d'objectes per a HsLua

source: Expose Haskell objects to Lua with an object oriented interface.
ca: Exposa els objectes Haskell a Lua amb una interfície orientada a objectes.

source: Haskell hslua-objectorientation library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hslua-objectorientation

source: This package provides the Haskell hslua-objectorientation library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hslua-objectorientation.

source: Utilities to build Lua modules
ca: Utilitats per construir mòduls Lua

source: Utilities to package up Haskell functions and values into a Lua module. This package is part of HsLua, a Haskell framework built around the embeddable scripting language <https://lua.org Lua>.
ca: Utilitats per empaquetar funcions i valors de Haskell en un mòdul Lua. Aquest paquet forma part de HsLua, un marc de treball Haskell construït al voltant del llenguatge de script incrustable <https://lua.org Lua>.

source: Haskell hslua-packaging library development files
ca: Fitxers de desenvolupament de la biblioteca hslua-packaging de Haskell

source: This package provides the Haskell hslua-packaging library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hslua-packaging.

source: A Testing Framework for Haskell
ca: Un marc de proves per al Haskell

source: Hspec is a testing framework for Haskell. Some of Hspec's distinctive features are: * a friendly DSL for defining tests * integration with QuickCheck, SmallCheck, and HUnit * parallel test execution * automatic discovery of test files The Hspec Manual is at <http://hspec.github.io/>.
ca: Hspec és un marc de proves per a Haskell. Algunes de les característiques distintives de Hspec són: * una DSL amigable per definir proves * integració amb QuickCheck, SmallCheck i HUnit * Execució de prova paral·lela * descobriment automàtic de fitxers de prova El manual de l'espectre és a les <http://hspec.github.io/>.

source: This package exposes internal types and functions that can be used to extend Hspec's functionality.
ca: Aquest paquet exposa els tipus interns i les funcions que es poden utilitzar per ampliar la funcionalitat de l'Hspec.

source: Haskell hspec-core library development files
ca: Fitxers de desenvolupament de la biblioteca hspec-core de Haskell

source: This package provides the Haskell hspec-core library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca hspec-core de Haskell.

source: Haskell hspec library development files
ca: Fitxers de desenvolupament de la biblioteca hspec del Haskell

source: This package provides the Haskell hspec library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca hspec de Haskell.

source: Catchy combinators for HUnit
ca: Combinadors de catchy per a HUnit

source: Catchy combinators for HUnit: <https://github.com/hspec/hspec-expectations#readme>.
ca: Combinadors catchy per HUnit: <https://github.com/hspec/hspec-expectations#readme>.

source: Haskell hspec-expectations library development files
ca: Fitxers de desenvolupament de la biblioteca hspec-expectations del Haskell

source: This package provides the Haskell hspec-expectations library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca «hspec-expectations» de Haskell.

source: Use tests to monitor changes in Aeson serialization
ca: Utilitza proves per monitoritzar els canvis en la serialització d'Aeson

source: Use tests to monitor changes in Aeson serialization.
ca: Utilitzeu proves per monitoritzar els canvis en la serialització d'Aeson.

source: Haskell hspec-golden-aeson library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell hspec-golden-aeson

source: This package provides the Haskell hspec-golden-aeson library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hspec-golden-aeson.

source: SmallCheck support for the Hspec testing framework
ca: Implementació de SmallCheck per al marc de treball de proves Hspec

source: SmallCheck support for the Hspec testing framework.
ca: Implementació de SmallCheck per al marc de treball de proves Hspec.

source: Haskell hspec-smallcheck library development files
ca: Fitxers de desenvolupament de la biblioteca «hspec-smallcheck» del Haskell

source: This package provides the Haskell hspec-smallcheck library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell hspec-smallcheck.

source: FFI interface to syslog(3) from POSIX.1-2001
ca: Interfície FFI a syslog(3) des de POSIX.1-2001
