Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: This package provides a library for parallel programming. For documentation start from the "Control.Parallel.Strategies" module below. For more tutorial documentation, see the book <http://simonmar.github.io/pages/pcph.html Parallel and Concurrent Programming in Haskell>. To understand the principles behind the library, see <http://simonmar.github.io/bib/papers/strategies.pdf Seq no more: Better Strategies for Parallel Haskell>.
ca: Aquest paquet proporciona una biblioteca per a la programació paral·lela. Per a la documentació s'inicia des del "Control.Paral·lel.El mòdul Estratègies, a continuació. Per a més documentació d'aprenentatge, vegeu el llibre <http://simonmar.github.io/pages/pcph.html Parallel and Concurrent Programming in Haskell>. Per entendre els principis darrere de la biblioteca, vegeu <http://simonmar.github.io/bib/papers/strategies.pdf Seq no more: Better Strategies for Parallel Haskell>.

source: Haskell parallel library development files
ca: Fitxers paral·lels de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell parallel library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca paral·lela Haskell.

source: Haskell parsec library
ca: Biblioteca parsec de Haskell

source: This package provides the Haskell parsec library.
ca: Aquest paquet proporciona la biblioteca parsec Haskell.

source: Class of types that can be constructed from their text representation
ca: Classes de tipus que es poden construir a partir de la seva representació de text

source: This library provides the type class 'HasParser' as a dual to 'Pretty'. Instances of this class provide a parser than can be used to construct the type from its text representation.
ca: Aquesta biblioteca proporciona la classe de tipus «HasParser» com a dual a «Pretty». Instàncies d'aquesta classe proporcionen un analitzador que es pot utilitzar per construir el tipus a partir de la seva representació de text.

source: Haskell parsec-class library development files
ca: Fitxers de desenvolupament de la biblioteca de classe parsec de Haskell

source: This package provides the Haskell parsec-class library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de classe parsec Haskell.

source: Haskell parsec library development files
ca: Fitxers de desenvolupament de la biblioteca parsec Haskell

source: This package provides the Haskell parsec library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca parsec Haskell.

source: Utilities for parsing numbers from strings
ca: Utilitats per analitzar els números de les cadenes

source: Parsec-numbers provides the number parsers without the need to use a large (and unportable) token parser.
ca: Parsec-numbers proporciona els analitzadors de nombres sense la necessitat d'utilitzar un analitzador de testimoni gran (i no portable).

source: Haskell parsec-numbers library development files
ca: Fitxers de desenvolupament de la biblioteca de números parsec de Haskell

source: This package provides the Haskell parsec-numbers library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell parsec-numbers.

source: Lightweight package providing commonly useful parser combinators
ca: Paquet lleuger que proporciona combinats d'analitzador d'ús comú

source: Lightweight package providing commonly useful parser combinators.
ca: Paquet lleuger que proporciona combinadors d'analitzador d'ús comú.

source: Haskell parser-combinators library development files
ca: Fitxers de desenvolupament de la biblioteca «parser-combinators» de Haskell

source: This package provides the Haskell parser-combinators library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca «parser-combinators» de Haskell.

source: Parsing combinators
ca: Combinadors d'anàlisi

source: This library provides convenient combinators for working with and building parsing combinator libraries. Given a few simple instances, e.g. for the class 'Text.Parser.Combinators.Parsing' in "Text.Parser.Combinators.Parsing" you get access to a large number of canned definitions. Instances exist for the parsers provided by 'parsec', 'attoparsec' and base’s "Text.Read".
ca: Aquesta biblioteca proporciona combinators convenients per treballar amb i construir llibreries combinadores d'anàlisi. Donades algunes instàncies simples, p. ex. per a la classe 'Text.Parser.Combinadors.Analitzant a "Text.Parser.Combinadors.Analitzant" s'accedeix a un gran nombre de definicions enllaunades. Existeixen instàncies per als analitzadors proporcionats per «parsec», «attoparsec» i «Text» de base.Llegeix».

source: Haskell parsers library development files
ca: Fitxers de desenvolupament de la biblioteca d'analitzadors de Haskell

source: This package provides the Haskell parsers library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'analitzadors Haskell.

source: Provides typeclass suitable for types admitting a partial order
ca: Proporciona una classe de tipus adequada per a tipus que admetin un ordre parcial

source: This packages provides the PartialOrd typeclass suitable for types admitting a partial order. The only module exposed by this package is Data.PartialOrd. Along with the PartialOrd typeclass and some utility functions for working with partially ordered types, it exports instances for certain numeric types along with instances for lists and sets.
ca: Aquest paquet proporciona la classe de tipus PartialOrd adequada per a tipus que admetin un ordre parcial. L'únic mòdul exposat per aquest paquet és Dades.PartialOrd. Juntament amb la classe de tipus PartialOrd i algunes funcions d'utilitat per treballar amb tipus parcialment ordenats, exporta instàncies per a certs tipus numèrics juntament amb instàncies per a llistes i conjunts.

source: Haskell partial-order library development files
ca: Fitxers de desenvolupament de biblioteques d'ordre parcial de Haskell

source: This package provides the Haskell partial-order library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'ordre parcial de Haskell.

source: Support for well-typed paths
ca: Suport per a camins ben tipificats

source: Support for well-typed paths.
ca: Suport per a camins ben tipificats.

source: Haskell path library development files
ca: Fitxers de desenvolupament de la biblioteca de camins del Haskell

source: This package provides the Haskell path library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de camins de Haskell.

source: Interface to ‘directory’ package for users of ‘path’
ca: Interfície al paquet «directory» per als usuaris de «path»

source: Interface to ‘directory’ package for users of ‘path’.
ca: Interfície al paquet «directori» per als usuaris de «camí».

source: Haskell path-io library development files
ca: Fitxers de desenvolupament de la biblioteca de camí-io de Haskell

source: This package provides the Haskell path-io library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell path-io.

source: Components of paths
ca: Components de camins

source: Hackage documentation generation is not reliable. For up to date documentation, please see: <http://www.stackage.org/package/path-pieces>.
ca: La generació de documentació de Hackage no és fiable. Per obtenir documentació actualitzada, consulteu: <http://www.stackage.org/package/path-pieces>.

source: Haskell path-pieces library development files
ca: Fitxers de desenvolupament de la biblioteca de camins del Haskell

source: This package provides the Haskell path-pieces library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de camins de Haskell.

source: Privacy Enhanced Mail (PEM) format reader and writer
ca: Privacy Enhanced Mail (PEM) format lector i escriptor

source: Privacy Enhanced Mail (PEM) format reader and writer.
ca: Privacy Enhanced Mail (PEM) formata lector i escriptor.

source: Haskell pem library development files
ca: Fitxers de desenvolupament de la biblioteca Pem Haskell

source: This package provides the Haskell pem library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Pem Haskell.

source: Type-safe, multi-backend data serialization
ca: Serialització de dades multibackend i segura de tipus

source: Hackage documentation generation is not reliable. For up to date documentation, please see: <http://www.stackage.org/package/persistent>.
ca: La generació de documentació de Hackage no és fiable. Per obtenir documentació actualitzada, consulteu: <http://www.stackage.org/package/persistent>.

source: Haskell persistent library development files
ca: Fitxers persistents de desenvolupament de la biblioteca Haskell

source: This package provides the Haskell persistent library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament persistent de la biblioteca Haskell.

source: Backend for the persistent library using sqlite3
ca: Dorsal per a la biblioteca persistent usant sqlite3

source: This package includes a thin sqlite3 wrapper based on the direct-sqlite package, as well as the entire C library, so there are no system dependencies.
ca: Aquest paquet inclou un embolcall sqlite3 prim basat en el paquet directe-sqlite, així com tota la biblioteca C, de manera que no hi ha dependències del sistema.

source: Haskell persistent-sqlite library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell persistent-sqlite

source: This package provides the Haskell persistent-sqlite library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell persistent-sqlite.

source: Type-safe, non-relational, multi-backend persistence
ca: persistència de tipus segur, no relacional, multirelatal

source: Hackage documentation generation is not reliable. For up to date documentation, please see: <http://www.stackage.org/package/persistent-template>.
ca: La generació de documentació de Hackage no és fiable. Per obtenir documentació actualitzada, consulteu: <http://www.stackage.org/package/persistent-template>.

source: Haskell persistent-template library development files
ca: Fitxers de desenvolupament de biblioteques de plantilla persistent de Haskell

source: This package provides the Haskell persistent-template library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de plantilla persistent de Haskell.

source: Compositional pipelines
ca: Composició de canonades

source: `pipes` is a clean and powerful stream processing library that lets you build and connect reusable streaming components Advantages over traditional streaming libraries: * /Concise API/: Use simple commands like 'for', ('>->'), 'await', and 'yield' * /Blazing fast/: Implementation tuned for speed, including shortcut fusion * /Lightweight Dependency/: 'pipes' is small and compiles very rapidly, including dependencies * /Elegant semantics/: Use practical category theory * /ListT/: Correct implementation of 'ListT' that interconverts with pipes * /Bidirectionality/: Implement duplex channels * /Extensive Documentation/: Second to none! Import "Pipes" to use the library. Read "Pipes.Tutorial" for an extensive tutorial.
ca: spipess és una biblioteca de processament de flux neta i potent que permet construir i connectar components de flux reutilitzables Avantatges sobre les biblioteques de transmissió tradicionals: * /Concise API/: Usa ordres simples com ara «for», ('--''), «await' i «yield» * /Blazing fast/: Implementació sintonitzada per a la velocitat, inclosa la fusió de dreceres * /Dependència lleugera/: 'pipes' és petit i compila molt ràpidament, incloses les dependències * /Elegant semantics/: Utilitza la teoria pràctica de categories * /ListT/: Implementació correcta de 'ListT' que interconverteix amb canonades * /Bidirectionality/: Implementa canals dúplex * /Extensive Documentation/: Segona a cap! Importa «Pipes» per a utilitzar la biblioteca. Llegeix "Pipes.Tutorial" per a un extens tutorial.

source: Haskell pipes library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell pipes

source: This package provides the Haskell pipes library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell pipes.

source: Safety for the pipes ecosystem
ca: Seguretat per a l'ecosistema de canonades

source: This package adds resource management and exception handling to the 'pipes' ecosystem. Notable features include: * /Resource Safety/: Guarantee finalization using 'finally', 'bracket' and more * /Exception Safety/: Even against asynchronous exceptions! * /Laziness/: Only acquire resources when you need them * /Promptness/: Finalize resources early when you are done with them * /Native Exception Handling/: Catch and resume from exceptions inside pipes * /No Buy-in/: Mix resource-safe pipes with unmanaged pipes using 'hoist'.
ca: Aquest paquet afegeix la gestió de recursos i la gestió d'excepcions a l'ecosistema de «pipes». Entre les característiques notables s'inclouen: * /Seguretat de recursos/: Finalització de la garantia amb 'finally', 'bracket' i més * /Exception Safety/: Fins i tot contra excepcions asíncrones! * /Laziness/: Només adquireix recursos quan els necessites * /Promptness/: Finalitza els recursos aviat quan acabis amb ells * /Native Exception Handling/: Atrapa i reprèn a partir d'excepcions dins de canonades * /No Buy-in/: Barreja canonades amb recursos segurs amb canonades no gestionades utilitzant 'hoist'.

source: Haskell pipes-safe library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell pipes-safe

source: This package provides the Haskell pipes-safe library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell pipes-safe.

source: A variety of alternative parser combinator libraries
ca: Una varietat de llibreries alternatives de combinators d'analitzador

source: This version, 1.13 is a Non-Maintainer Upload (NMU). Report issues to the Hackage Trustees issue tracker. A variety of alternative parser combinator libraries, including the original HuttonMeijer set. The Poly sets have features like good error reporting, arbitrary token type, running state, lazy parsing, and so on. Finally, Text.Parse is a proposed replacement for the standard Read class, for better deserialisation of Haskell values from Strings.
ca: Aquesta versió, 1.13 és una pujada no-mantenidora (NMU). Informa dels problemes al seguidor d'emissions de Hackage Trustees. Una varietat de biblioteques combinadores alternatives d'analitzador, incloent-hi el conjunt original de HuttonMeijer. Els conjunts Poly tenen característiques com un bon informe d'errors, tipus de testimoni arbitrari, estat d'execució, anàlisi mandrosa, etc. Finalment, el text.Parse és una proposta de substitució de la classe Read estàndard, per a una millor desserialització dels valors de Haskell de Strings.

source: Haskell polyparse library development files
ca: Fitxers de desenvolupament de la biblioteca poliparse del Haskell

source: This package provides the Haskell polyparse library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell poliparse.

source: Low-level binding to libpq
ca: Vinculació de baix nivell a la libpq

source: This is a binding to libpq: the C application programmer's interface to PostgreSQL. libpq is a set of library functions that allow client programs to pass queries to the PostgreSQL backend server and to receive the results of these queries.
ca: Aquesta és una vinculació a la libpq: la interfície del programador d'aplicacions C a PostgreSQL. libpq és un conjunt de funcions de biblioteca que permeten als programes del client passar consultes al servidor dorsal PostgreSQL i rebre els resultats d'aquestes consultes.

source: Haskell postgresql-libpq library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell postgresql-libpq

source: This package provides the Haskell postgresql-libpq library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell postgresql-libpq.

source: Mid-Level PostgreSQL client library
ca: Biblioteca de client de Mid-Level PostgreSQL

source: Mid-Level PostgreSQL client library, forked from mysql-simple.
ca: Biblioteca de client PostgreSQL de nivell mig, bifurcada des de mysql-simple.

source: Haskell postgresql-simple library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell postgresql-simple

source: This package provides the Haskell postgresql-simple library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell postgresql-simple.

source: Haskell pretty library
ca: Biblioteca de Haskell bonica

source: This package provides the Haskell pretty library.
ca: Aquest paquet proporciona la biblioteca Haskell PRETTY.

source: Pretty printing class similar to Show
ca: Classe d'impressió bonica similar a Mostra

source: Pretty printing class similar to Show, based on the HughesPJ pretty printing library. Provides the pretty printing class and instances for the Prelude types. This upload replaces the old pretty-class package (which I believe nobody is using) with a copy of Lennart's prettyclass package with a small change to its Char instance.
ca: Classe d'impressió bonica similar a Show, basada en la bonica biblioteca d'impressió HughesPJ. Proporciona la classe d'impressió bonica i les instàncies per als tipus Preludi. Aquesta pujada substitueix l'antic paquet de classe bonica (que crec que ningú està utilitzant) amb una còpia del paquet de Lennart de classe bonica amb un petit canvi a la seva instància de Char.

source: Haskell pretty-class library development files
ca: Fitxers de desenvolupament de biblioteques de classe bonica del Haskell

source: This package provides the Haskell pretty-class library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de classe bonica Haskell.

source: Haskell pretty library development files
ca: Haskell bonics fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell pretty library development files.
ca: Aquest paquet proporciona els bonics fitxers de desenvolupament de la biblioteca Haskell.

source: A library for hex dumps of ByteStrings
ca: Una biblioteca per a abocadors hexadecimals de ByteStrings

source: This library generates pretty hex dumps of ByteStrings in the style of other common *nix hex dump tools.
ca: Aquesta biblioteca genera bolcats hexadecimals bonics de ByteStrings a l'estil d'altres eines comunes de bolcat hexadecimal *nix.

source: Haskell pretty-hex library development files
ca: Fitxers de desenvolupament de la biblioteca de PRETTY-hex del Haskell

source: This package provides the Haskell pretty-hex library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell PRETTY-hex.

source: Tools for working with derived `Show` instances and generic inspection of values
ca: Eines per treballar amb instàncies SShows derivades i inspecció genèrica de valors

source: We provide a library and an executable for working with derived 'Show' instances. By using the library, we can parse derived 'Show' instances into a generic data structure. The 'ppsh' tool uses the library to produce human-readable versions of 'Show' instances, which can be quite handy for debugging Haskell programs. We can also render complex generic values into an interactive Html page, for easier examination.
ca: Proporcionem una biblioteca i un executable per a treballar amb les instàncies 'Mostra' derivades. Mitjançant l'ús de la biblioteca, podem analitzar les instàncies 'Mostra' derivades en una estructura de dades genèrica. L'eina 'ppsh' utilitza la biblioteca per produir versions llegibles per humans de les instàncies 'Show', que poden ser bastant útils per depurar programes Haskell. També podem convertir valors genèrics complexos en una pàgina Html interactiva, per a un examen més fàcil.

source: Haskell pretty-show library development files
ca: Fitxers de desenvolupament de la biblioteca de maquillatge Haskell

source: This package provides the Haskell pretty-show library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell PRETTY-show.

source: Pretty printer for data types with a 'Show' instance
ca: Impressora perfecta per a tipus de dades amb una instància «Mostra»

source: Pretty printer for data types with a 'Show' instance.
ca: Impressora perfecta per a tipus de dades amb una instància «Mostra».

source: Haskell pretty-simple library development files
ca: Haskell fitxers de desenvolupament de biblioteques bastant simples

source: This package provides the Haskell pretty-simple library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell bastant simples.

source: Pretty printing class similar to Show, based on the HughesPJ pretty printing library. Provides the pretty printing class and instances for the Prelude types.
ca: Classe d'impressió bonica similar a Show, basada en la bonica biblioteca d'impressió HughesPJ. Proporciona la classe d'impressió bonica i les instàncies per als tipus Preludi.

source: Haskell prettyclass library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell PRETTYclass

source: This package provides the Haskell prettyclass library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell PRETTYclass.

source: A modern, easy to use, well-documented, extensible pretty-printer
ca: Una màquina moderna, fàcil d'usar, ben documentada i extensible

source: A modern, easy to use, well-documented, extensible pretty-printer. For more see README.md.
ca: Un bonic imprès modern, fàcil d'utilitzar, ben documentat i extensible. Per a més informació, vegeu README.md.

source: ANSI terminal backend for the »prettyprinter« package
ca: Dorsal de terminal ANSI per al paquet »prettyprinter«

source: ANSI terminal backend for the »prettyprinter« package.
ca: Dorsal de terminal ANSI per al paquet »prettyprinter«.

source: Haskell prettyprinter-ansi-terminal library development files
ca: Fitxers de desenvolupament de la biblioteca PRETTYprinter-ansi-terminal

source: This package provides the Haskell prettyprinter-ansi-terminal library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell PRETTYprinter-ansi-terminal.

source: Haskell prettyprinter library development files
ca: Fitxers de desenvolupament de la biblioteca PRETTYprinter del Haskell

source: This package provides the Haskell prettyprinter library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de PRETTYprinter de Haskell.

source: Primitive memory-related operations
ca: Operacions primàries relacionades amb la memòria

source: This package provides various primitive memory-related operations.
ca: Aquest paquet proporciona diverses operacions primitives relacionades amb la memòria.

source: Haskell primitive library development files
ca: Fitxers de desenvolupament de la biblioteca primitiva Haskell

source: This package provides the Haskell primitive library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca primitiva de Haskell.

source: Haskell process library
ca: Biblioteca de processos Haskell
