Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: A /vault/ is a persistent store for values of arbitrary types. It's like having first-class access to the storage space behind IORefs. The data structure is analogous to a bank vault, where you can access different bank boxes with different keys; hence the name. Also provided is a /locker/ type, representing a store for a single element.
ca: Una /vault/ és un magatzem persistent per a valors de tipus arbitraris. És com tenir accés de primera classe a l'espai d'emmagatzematge darrere de IORefs. L'estructura de dades és anàloga a una caixa forta, on es pot accedir a diferents caixes bancàries amb diferents claus; d'aquí el nom. També es proporciona un tipus /locker/, que representa una botiga per a un sol element.

source: Haskell vault library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell vault

source: This package provides the Haskell vault library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell vault.

source: Efficient Arrays
ca: Ràtigues eficients

source: An efficient implementation of Int-indexed arrays (both mutable and immutable), with a powerful loop optimisation framework . It is structured as follows: ["Data.Vector"] Boxed vectors of arbitrary types. ["Data.Vector.Unboxed"] Unboxed vectors with an adaptive representation based on data type families. ["Data.Vector.Storable"] Unboxed vectors of 'Storable' types. ["Data.Vector.Primitive"] Unboxed vectors of primitive types as defined by the 'primitive' package. "Data.Vector.Unboxed" is more flexible at no performance cost. ["Data.Vector.Generic"] Generic interface to the vector types. There is also a (draft) tutorial on common uses of vector. * <http://haskell.org/haskellwiki/Numeric_Haskell:_A_Vector_Tutorial>.
ca: Una implementació eficient de matrius indexades per Int (tant mutables com immutables), amb un potent marc d'optimització de bucles . Està estructurada de la següent manera: ["Dades.Vector"] Vectors enquadernats de tipus arbitraris. ["Dades.Vector.Unboxed"] Vectors sense bústia amb una representació adaptativa basada en famílies de tipus de dades. ["Dades.Vector.Storable"] Vectors sense bústia de tipus 'emmagatzemables'. ["Dades.Vector.Primitive"] Vectors sense caixa de tipus primitius definits pel paquet 'primitiu'. "Dades.Vector.Unboxed" és més flexible sense cost de rendiment. ["Dades.Vector.Generic"] Interfície genèrica als tipus vectorials. També hi ha un tutorial (draft) sobre els usos comuns del vector. * <http://haskell.org/haskellwiki/NumericHaskell:AVectorTutorial>.

source: Efficient algorithms for vector arrays
ca: Algorismes eficients per a matrius vectorials

source: Efficient algorithms for sorting vector arrays. At some stage other vector algorithms may be added.
ca: Algorismes eficients per a ordenar matrius vectorials. En algun moment es poden afegir altres algorismes vectorials.

source: Haskell vector-algorithms library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell vector-algorithms

source: This package provides the Haskell vector-algorithms library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell vector-algorithms.

source: Instances of Data.Binary for vector
ca: Instàncies de dades.Binari per a vector

source: Instances for Binary for the types defined in the vector package, making it easy to serialize vectors to and from disk. We use the generic interface to vectors, so all vector types are supported. Specific instances are provided for unboxed, boxed and storable vectors. . To serialize a vector: . > *Data.Vector.Binary> let v = Data.Vector.fromList [1..10] > *Data.Vector.Binary> v > fromList [1,2,3,4,5,6,7,8,9,10] :: Data.Vector.Vector > *Data.Vector.Binary> encode v > Chunk "NULNULNULNULNUL...NULNULNULtNULNULNULNULn" Empty . Which you can in turn compress before writing to disk: . > compress . encode $ v > Chunk "US139bNULNULN...229240,254:NULNULNUL" Empty . Try the cereal-vector package if you are looking for Data.Serialize instances.
ca: Instàncies per a Binary per als tipus definits en el paquet vectorial, facilitant la serialització de vectors al i des del disc. Utilitzem la interfície genèrica a vectors, de manera que tots els tipus de vectors són compatibles. Es proporcionen instàncies específiques per a vectors no enquadernats, enquadernats i emmagatzemables. . Per a serialitzar un vector: . *Dades.Vector.Binary let let v . Dades.Vector.fromList [1..10] ] *Dades.Vector.Binary v v . fromList [1,2,3,4,5,6,7,8,9,10] :: Dades.Vector.Vector . *Dades.Vector.Binary en encode v . Chunk "NULNULNULNULNUL...NULNULNULNULNULNULN El qual podeu comprimir abans d'escriure al disc: . . comprimeix . encode $ v . Chunk "US139bNULNULN...229240,254:NULNULNUL" Empty . Prova el paquet de vectors de cereals si estàs buscant Dades.Serialitzeu les instàncies.

source: Haskell vector-binary-instances library development files
ca: Fitxers de desenvolupament de la biblioteca vectorial-binària de Haskell

source: This package provides the Haskell vector-binary-instances library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell vector-binari-instàncies.

source: Vector builder
ca: Creador de vectors

source: An API for efficient and convenient construction of vectors. It provides the composable `Builder` abstraction, which has instances of the `Monoid` and `Semigroup` classes. [Usage] First you use the `Builder` abstraction to specify the structure of the vector. Then you execute the builder to actually produce the vector. [Example] The following code shows how you can efficiently concatenate different datastructures into a single immutable vector: > >import qualified Data.Vector as A >import qualified VectorBuilder.Builder as B >import qualified VectorBuilder.Vector as C > > >myVector :: A.Vector a -> [a] -> a -> A.Vector a >myVector vector list element = > C.build builder > where > builder = > B.vector vector <> > B.foldable list <> > B.singleton element.
ca: Una API per a la construcció eficient i còmoda de vectors. Proporciona l'abstracció BBuilder. compostable, que té exemples de les classes .Monoid. i .Semigroup.. [Ús] Primer utilitzeu l'abstracció .Builder. per a especificar l'estructura del vector. Llavors executeu el constructor per a produir realment el vector. [Exemple] El codi següent mostra com podeu concatenar eficientment diferents estructures de dades en un sol vector immutable: . .importa les dades qualificades.Vector com a .import titulat VectorBuilder.Builder as B .import qualified VectorBuilder.Vector com a C . . .myVector :: A.Vector a - [ [a] -. a -. A.Vector a .myVector vector list element . . C.build builder . where . builder . . B.vector vector vector <> . B.foldable list <> . B.singleton element.

source: Haskell vector-builder library development files
ca: Fitxers de desenvolupament de la biblioteca de vectors Haskell

source: This package provides the Haskell vector-builder library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell vector-builder.

source: Haskell vector library development files
ca: Fitxers de desenvolupament de la biblioteca vectorial Haskell

source: This package provides the Haskell vector library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca vectorial Haskell.

source: Deriver for Data.Vector.Unboxed using Template Haskell
ca: Deriver for Data.Vector.S'ha desmarcat la caixa utilitzant la plantilla Haskell

source: A Template Haskell deriver for unboxed vectors, given a pair of coercion functions to and from some existing type with an Unbox instance. Refer to "Data.Vector.Unboxed.Deriving" for documentation and examples.
ca: Una plantilla de derivació Haskell per a vectors sense bústia, donat un parell de funcions de coerció a i des d'algun tipus existent amb una instància Unbox. Consulteu "Dades.Vector.Sense bústia.Deriving" per a documentació i exemples.

source: Haskell vector-th-unbox library development files
ca: Fitxers de desenvolupament de la biblioteca vectorial-th-unbox de Haskell

source: This package provides the Haskell vector-th-unbox library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell vector-th-unbox.

source: A Haskell 98 logically uninhabited data type
ca: Un tipus de dades Haskell 98 lògicament deshabitada

source: A Haskell 98 logically uninhabited data type, used to indicate that a given term should not exist.
ca: Un tipus de dades Haskell 98 lògicament deshabitada, s'utilitza per indicar que un terme donat no hauria d'existir.

source: Haskell void library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell void

source: This package provides the Haskell void library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell void.

source: A simple terminal UI library
ca: Una biblioteca d'interfície d'usuari de terminal senzilla

source: Vty is terminal GUI library in the niche of ncurses. It is intended to be easy to use, have no confusing corner cases, and good support for common terminal types. See the 'vty-examples' package as well as the program 'test/interactive_terminal_test.hs' included in the 'vty' package for examples on how to use the library. Import the "Graphics.Vty" convenience module to get access to the core parts of the library. &#169; 2006-2007 Stefan O'Rear; BSD3 license. &#169; Corey O'Connor; BSD3 license. &#169; Jonathan Daugherty; BSD3 license.
ca: Vty és la biblioteca GUI del terminal en el nínxol de ncurses. Està pensat per ser fàcil d'utilitzar, no tenir maletes cantoneres confuses i un bon suport per als tipus de terminal comuns. Vegeu el paquet «vty-examples», així com el programa «test/interactiveterminaltest.hs» inclòs en el paquet «vty» per a obtenir exemples sobre com utilitzar la biblioteca. Importa els "Graphics.Vty" mòdul de conveniència per accedir a les parts centrals de la biblioteca. 1169; 2006-2007 Llicència Stefan O'Rear; BSD3. Llicència Corey O'Connor; BSD3. 1169; Jonathan Daugherty; llicència BSD3.

source: Haskell vty library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell vty

source: This package provides the Haskell vty library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell vty.

source: Web Application Interface
ca: Interfície d'aplicació web

source: Provides a common protocol for communication between web applications and web servers. API docs and the README are available at <http://www.stackage.org/package/wai>.
ca: Proporciona un protocol comú de comunicació entre aplicacions web i servidors web. Els documents de l'API i el README estan disponibles a <http://www.stackage.org/package/wai>.

source: WAI application for static serving
ca: Aplicació WAI per a servei estàtic

source: API docs and the README are available at <http://www.stackage.org/package/wai-app-static>.
ca: Els documents de l'API i el README estan disponibles a <http://www.stackage.org/package/wai-app-static>.

source: Haskell wai-app-static library development files
ca: Fitxers de desenvolupament de la biblioteca wai-app-static de Haskell

source: This package provides the Haskell wai-app-static library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca haskell wai-app-static.

source: Haskell wai library development files
ca: Fitxers de desenvolupament de la biblioteca wai de Haskell

source: This package provides the Haskell wai library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca wai de Haskell.

source: Provides some basic WAI handlers and middleware
ca: Proporciona alguns controladors WAI bàsics i programari intermediari

source: Provides basic WAI handler and middleware functionality: * WAI Testing Framework Hspec testing facilities and helpers for WAI. * Event Source/Event Stream Send server events to the client. Compatible with the JavaScript EventSource API. * Accept Override Override the Accept header in a request. Special handling for the _accept query parameter (which is used throughout WAI override the Accept header). * Add Headers WAI Middleware for adding arbitrary headers to an HTTP request. * Clean Path Clean a request path to a canonical form. * GZip Compression Negotiate HTTP payload gzip compression. * HTTP Basic Authentication WAI Basic Authentication Middleware which uses Authorization header. * JSONP "JSON with Padding" middleware. Automatic wrapping of JSON responses to convert into JSONP. * Method Override / Post Allows overriding of the HTTP request method via the _method query string parameter. * Request Logging Request logging middleware for development and production environments * Request Rewrite Rewrite request path info based on a custom conversion rules. * Stream Files Convert ResponseFile type responses into ResponseStream type. * Virtual Host Redirect incoming requests to a new host based on custom rules. API docs and the README are available at <http://www.stackage.org/package/wai-extra>.
ca: Proporciona la funcionalitat bàsica del gestor WAI i del middleware: * Marc de proves WAI Instal·lacions de proves d'espectre i auxiliars per a la WAI. * Font d'esdeveniments/Flux d'esdeveniments Envia esdeveniments del servidor al client. Compatible amb l'API JavaScript EventSource. * Accepta la substitució Substitueix la capçalera Accepta en una sol·licitud. Gestió especial per al paràmetre accepta la consulta (que s'utilitza a través de WAI sobreescriu la capçalera Accepta). * Afegeix capçaleres Middleware WAI per afegir capçaleres arbitràries a una sol·licitud HTTP. * Neteja el camí Neteja un camí de sol·licitud a un formulari canònic. * Compressió GZip Negocia la compressió gzip de la càrrega útil HTTP. * Autenticació bàsica HTTP WAI Basic Authentication Middleware que utilitza la capçalera d'autorització. * JSONP "JSON with Padding" middleware. Ajustament automàtic de les respostes JSON per a convertir-les en JSONP. * Sobreescriu el mètode / Entrada Permet anul·lar el mètode de sol·licitud HTTP a través del paràmetre de cadena de consulta de mètode. * Sol·licitud de registre Sol·licita programari intermediari per a l'enregistrament per a entorns de desenvolupament i producció * Sol·licitud de reescriptura Torna a escriure la informació del camí de la sol·licitud basada en regles de conversió personalitzades. * Fitxers de flux Converteix les respostes del tipus ResponseFile en el tipus ResponseStream. * Amfitrió virtual Redirigeix les sol·licituds d'entrada a un amfitrió nou basant-se en regles personalitzades. Els documents de l'API i el README estan disponibles a <http://www.stackage.org/package/wai-extra>.

source: Haskell wai-extra library development files
ca: Fitxers de desenvolupament de la biblioteca wai-extra de Haskell

source: This package provides the Haskell wai-extra library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca wai-extra de Haskell.

source: A logging system for WAI
ca: Un sistema de registre per a WAI

source: A logging system for WAI.
ca: Un sistema de registre per a WAI.

source: Haskell wai-logger library development files
ca: Fitxers de desenvolupament de la biblioteca wai-logger de Haskell

source: This package provides the Haskell wai-logger library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca wai-logger de Haskell.

source: A fast, light-weight web server for WAI applications
ca: Un servidor web ràpid i lleuger per a aplicacions WAI

source: HTTP/1.0, HTTP/1.1 and HTTP/2 are supported. For HTTP/2, Warp supports direct and ALPN (in TLS) but not upgrade. API docs and the README are available at <http://www.stackage.org/package/warp>.
ca: S'admeten HTTP/1.0, HTTP/1.1 i HTTP/2. Per a HTTP/2, Warp suporta directe i ALPN (en TLS) però no actualització. Els documents de l'API i el README estan disponibles a <http://www.stackage.org/package/warp>.

source: Haskell warp library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell warp

source: This package provides the Haskell warp library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell warp.

source: HTTP over TLS support for Warp via the TLS package
ca: Implementació HTTP over TLS per a Warp a través del paquet TLS

source: SSLv1 and SSLv2 are obsoleted by IETF. We should use TLS 1.2 (or TLS 1.1 or TLS 1.0 if necessary). HTTP/2 can be negotiated by ALPN. API docs and the README are available at <http://www.stackage.org/package/warp-tls>.
ca: SSLv1 i SSLv2 estan obsolets per IETF. Hem d'utilitzar TLS 1.2 (o TLS 1.1 o TLS 1.0 si cal). HTTP/2 pot ser negociat per ALPN. Els documents de l'API i el README estan disponibles a <http://www.stackage.org/package/warp-tls>.

source: Haskell warp-tls library development files
ca: Fitxers de desenvolupament de la biblioteca warp-tls de Haskell

source: This package provides the Haskell warp-tls library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell warp-tls.

source: Native wcwidth
ca: Wcwidth nativa

source: Bindings for your system's native wcwidth and a command line tool to examine the widths assigned by it. The command line tool can compile a width table to Haskell code that assigns widths to the Char type.
ca: Vinculacions per a la wcwidth nativa del vostre sistema i una eina de línia d'ordres per a examinar les amplades assignades. L'eina de línia d'ordres pot compilar una taula d'amplada al codi Haskell que assigna amplades al tipus de Caràcter.

source: Haskell wcwidth library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell wcwidth

source: This package provides the Haskell wcwidth library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell wcwidth.

source: A sensible and clean way to write WebSocket-capable servers in Haskell
ca: Una manera sensible i neta d'escriure servidors amb capacitat WebSocket a Haskell

source: This library allows you to write WebSocket-capable servers. An example server: <https://github.com/jaspervdj/websockets/blob/master/example/server.lhs> An example client: <https://github.com/jaspervdj/websockets/blob/master/example/client.hs> See also: * The specification of the WebSocket protocol: <http://www.whatwg.org/specs/web-socket-protocol/> * The JavaScript API for dealing with WebSockets: <http://www.w3.org/TR/websockets/>.
ca: Aquesta biblioteca us permet escriure servidors amb capacitat per a WebSocket. Un servidor d'exemple: <https://github.com/jaspervdj/websockets/blob/master/example/server.lhs> Un client d'exemple: <https://github.com/jaspervdj/websockets/blob/master/example/client.hs> Vegeu també: * L'especificació del protocol WebSocket: <http://www.whatwg.org/specs/web-socket-protocol/> * L'API de JavaScript per a tractar amb WebSockets: <http://www.w3.org/TR/websockets/>.

source: Haskell websockets library development files
ca: Fitxers de desenvolupament de la biblioteca de websockets de Haskell

source: This package provides the Haskell websockets library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de websockets de Haskell.

source: Snap integration for the websockets library
ca: Integració d'ajustament per a la biblioteca websockets

source: Snap integration for the websockets library.
ca: Integració d'ajustament per a la biblioteca websockets.

source: Haskell websockets-snap library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell websockets-snap

source: This package provides the Haskell websockets-snap library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell websockets-snap.

source: Detect dead code
ca: Detecta codi mort

source: Find declarations.
ca: Troba les declaracions.

source: Haskell weeder library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell weeder

source: This package provides the Haskell weeder library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell weeder.

source: Filterable traversable
ca: Filtrable traversable

source: A stronger variant of `traverse` which can remove elements and generalised mapMaybe, catMaybes, filter.
ca: Una variant més forta de .traverse., que pot eliminar elements i generalitzar el filtre mapMaybe, catMaybes.

source: Haskell witherable library development files
ca: Haskell amb fitxers de desenvolupament de biblioteques que es poden utilitzar

source: This package provides the Haskell witherable library development files.
ca: Aquest paquet proporciona als Haskell fitxers de desenvolupament de biblioteca que es poden utilitzar.

source: High level, generic library for interrogative user interfaces
ca: Biblioteca genèrica d'alt nivell per a interfícies d'usuari interrogatives

source: 'wizards' is a package designed for the quick and painless development of /interrogative/ programs, which revolve around a "dialogue" with the user, who is asked a series of questions in a sequence much like an installation wizard. Everything from interactive system scripts, to installation wizards, to full-blown shells can be implemented with the support of 'wizards'. It is developed transparently on top of a free monad, which separates out the semantics of the program from any particular interface. A variety of backends exist, including console-based "System.Console.Wizard.Haskeline" and "System.Console.Wizard.BasicIO", and the pure "System.Console.Wizard.Pure". It is also possible to write your own backends, or extend existing back-ends with new features. While both built-in IO backends operate on a console, there is no reason why 'wizards' cannot also be used for making GUI wizard interfaces. See the github page for examples on usage: <http://www.github.com/liamoc/wizards> For creating backends, the module "System.Console.Wizard.Internal" has a brief tutorial.
ca: 'wizards' és un paquet dissenyat per al desenvolupament ràpid i indolor de programes /interrogatius/, que giren al voltant d'un "diàleg" amb l'usuari, a qui se li fa una sèrie de preguntes en una seqüència molt semblant a un assistent d'instal·lació. Tot, des dels scripts interactius del sistema, fins als auxiliars d'instal·lació, fins als shells complets es pot implementar amb el suport de «wizards». Es desenvolupa de manera transparent sobre una mònada lliure, que separa la semàntica del programa de qualsevol interfície particular. Hi ha una varietat de dorsals, inclòs el «System» basat en la consola.Consola.Auxiliar.Haskeline" i "Sistema.Consola.Auxiliar.BasicIO", i el pur "Sistema.Consola.Auxiliar.Pure». També és possible escriure els vostres propis dorsals, o ampliar els dorsals existents amb noves característiques. Tot i que els dos dorsals integrats d'E/S operen en una consola, no hi ha cap raó per la qual els «assistents» no es puguin utilitzar per a crear interfícies d'auxiliar d'IGU. Vegeu la pàgina github per a exemples sobre l'ús: <http://www.github.com/liamoc/wizards> Per crear dorsals, el mòdul "Sistema.Consola.Auxiliar.Intern" té un breu tutorial.

source: Haskell wizards library development files
ca: Fitxers de desenvolupament de la biblioteca de l'auxiliar Haskell

source: This package provides the Haskell wizards library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell wizards.

source: Pretty printer with annotation support
ca: Impressora bonica amb suport d'anotacions
