Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: This package provides Haskell bindings to the the [POSIX network database (netdb.h) API](http://pubs.opengroup.org/onlinepubs/009696699/basedefs/netdb.h.html). === Relationship to the 'network' package The 'network' package version 2.* series provides "Network.BSD" but it is removed starting with 'network' version 3.0. This package provides the "Network.BSD" module split off from the <https://hackage.haskell.org/package/network network package>. If in addition to the 'network''s modules also "Network.BSD" is necessary, add 'network-bsd' to your dependencies like so: > library > build-depends: network >= 2.7 && < 3.2 > , network-bsd >= 2.7 && < 2.9 I.e. you can control the version of the 'network' package independently. __NOTE__: Starting with 'network-bsd-2.8.1.0' the APIs of 'network' and 'network-bsd' evolve differently, and consequently the versioning doesn't match up anymore! Moreover, also starting with version 'network-bsd-2.8.1.0' this package requires 'network >= 3' in order to avoid module name clashes with 'network < 3''s "Network.BSD" module. However, 'network-bsd-2.7.0.0' and 'network-bsd-2.8.0.0' passes thru the "Network.BSD" module from 'network-2.7.*' and 'network-2.8.*' respectively in a non-clashing way via Cabal's <https://www.haskell.org/cabal/users-guide/developing-packages.html#pkg-field-library-reexported-modules reexported-modules> feature while ensuring a well-defined <https://pvp.haskell.org/ API versioning> of the observable API of 'network-bsd'. This is why the example above supporting a wide range of 'network' versions works by including version 2.7.0.0 in the required version range of 'network-bsd'.
ca: Aquest paquet proporciona enllaços Haskell a l'API [POSIX network database (netdb.h)](http://pubs.opengroup.org/onlinepubs/009696699/basedefs/netdb.h.html). the Relació amb el paquet «xarxa» El paquet 'xarxa' versió 2.* de la sèrie proporciona "Xarxa.BSD", però s'elimina començant per 'xarxa' versió 3.0. Aquest paquet proporciona el mòdul "Network.BSD" desglossat de la <https://hackage.haskell.org/package/network network package>. Si a més dels mòduls de 'xarxa' també cal "Xarxa.BSD", afegiu 'xarxa-bsd' a les vostres dependències així: , biblioteca : dependències de construcció: xarxa 2.7 2.7 < 3.2 > , network-bsd 2.7 2.7 2.9 És a dir, podeu controlar la versió del paquet «xarxa» de manera independent. NOTA: A partir de 'network-bsd-2.8.1.0' les API de 'network' i 'network-bsd' evolucionen de manera diferent, i en conseqüència la versió ja no coincideix! A més, a partir de la versió 'network-bsd-2.8.1.0' aquest paquet requereix 'network 3 3' per tal d'evitar xocs de nom de mòdul amb el mòdul 'network . 3' "Network.BSD". No obstant això, 'network-bsd-2.7.0.0' i 'network-bsd-2.8.0.0' passen pel mòdul "Network.BSD" de 'network-2.7.*' i 'network-2.8.*' respectivament d'una manera no taquillera a través de la característica <https://www.haskell.org/cabal/users-guide/developing-packages.html#pkg-field-library-reexported-modules reexported-modules> de Cabal, alhora que es garanteix un bé definit <https://pvp.haskell.org/ API versioning> de l'API observable de 'network-bsd'. És per això que l'exemple anterior que admet una àmplia gamma de versions de «xarxa» funciona incloent la versió 2.7.0.0 en l'interval de versions requerit de «xarxa-bsd».

source: Haskell network-bsd library development files
ca: Fitxers de desenvolupament de la biblioteca network-bsd de Haskell

source: This package provides the Haskell network-bsd library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell network-bsd.

source: Network byte order utilities
ca: Utilitats d'ordre de bytes de xarxa

source: Peek and poke functions for network byte order.
ca: Funcions Peek i poke per a l'ordre de bytes de xarxa.

source: Haskell network-byte-order library development files
ca: Fitxers de desenvolupament de la biblioteca network-byte-order de Haskell

source: This package provides the Haskell network-byte-order library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell network-byte-order.

source: Haskell network library development files
ca: Fitxers de desenvolupament de la biblioteca de xarxa Haskell

source: This package provides the Haskell network library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de xarxa Haskell.

source: Access the local computer's basic network configuration
ca: Accedeix a la configuració bàsica de xarxa de l'ordinador local

source: This library provides simple read-only access to the local computer's networking configuration. It is currently capable of getting a list of all the network interfaces and their respective IPv4, IPv6 and MAC addresses. network-info has been tested and is known to work on Ubuntu, FreeBSD, NetBSD, Mac OS and Windows.
ca: Aquesta biblioteca proporciona accés senzill de només lectura a la configuració de xarxa de l'ordinador local. Actualment és capaç d'obtenir una llista de totes les interfícies de xarxa i les seves respectives adreces IPv4, IPv6 i MAC. La informació de xarxa ha estat provada i se sap que funciona en Ubuntu, FreeBSD, NetBSD, Mac OS i Windows.

source: Haskell network-info library development files
ca: Fitxers de desenvolupament de la biblioteca network-info de Haskell

source: This package provides the Haskell network-info library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell network-info.

source: Simple multicast library
ca: Biblioteca multidifusió simple

source: The "Network.Multicast" module is for sending UDP datagrams over multicast (class D) addresses.
ca: La "Xarxa.El mòdul Multicast" és per enviar datagrames UDP a través d'adreces multicast (classe D).

source: Haskell network-multicast library development files
ca: Fitxers de desenvolupament de la biblioteca «network-multicast» de Haskell

source: This package provides the Haskell network-multicast library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell network-multicast.

source: URI manipulation
ca: Manipulació de l'URI

source: This package provides facilities for parsing and unparsing URIs, and creating and resolving relative URI references, closely following the URI spec, <http://www.ietf.org/rfc/rfc3986.txt IETF RFC 3986>. == Backward-compatibility In 'network-2.6' the "Network.URI" module was split off from the 'network' package into this package. If you're using the "Network.URI" module you can be backward compatible and automatically get it from the right package by using the </package/network-uri-flag network-uri-flag pseudo-package> in your '.cabal' file's build-depends (along with dependencies for both 'network-uri' and 'network'): > build-depends: > network-uri-flag == 0.1.* Or you can do the same manually by adding this boilerplate to your '.cabal' file: > flag network-uri > description: Get Network.URI from the network-uri package > default: True > > library > -- ... > if flag(network-uri) > build-depends: network-uri >= 2.6, network >= 2.6 > else > build-depends: network-uri < 2.6, network < 2.6 That is, get the module from either 'network < 2.6' or from 'network-uri >= 2.6'.
ca: Aquest paquet proporciona facilitats per analitzar i desanalitzar URIs, i crear i resoldre referències URI relatives, seguint de prop l'especificació URI, <http://www.ietf.org/rfc/rfc3986.txt IETF RFC 3986>. Concompatibilitat enrere A «network-2.6» el mòdul «Network.URI» es va separar del paquet «network» en aquest paquet. Si esteu utilitzant el mòdul "Network.URI" podeu ser compatible amb versions anteriors i obtenir-lo automàticament des del paquet correcte utilitzant el </package/network-uri-flag network-uri-flag pseudo-package> en el fitxer '.cabal' de dependències de construcció (juntament amb dependències tant per a 'network-uri' com per a 'network'): : build-depends: * network-uri-flag * 0.1.* O podeu fer el mateix manualment afegint aquesta caldera al fitxer «.cabal»: the flag network-uri the description: Get Network.URI from the network-uri package the default: True the library biblioteca -- -- ... if flag(network-uri) build-depends: network-uri 2.6 2.6, network the 2.6 else the build-depends: network-uri the 2.6, network , 2.6, network , 2.6 És a dir, obtingueu el mòdul de qualsevol de les dues xarxes < 2.6' or from 'network-uri >. 2.6".

source: Haskell network-uri library development files
ca: Fitxers de desenvolupament de la biblioteca network-uri de Haskell

source: This package provides the Haskell network-uri library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell network-uri.

source: Examine values for unexpected thunks
ca: Examina els valors per als thunks inesperats

source: Long lived application data typically should not contain any thunks. This library can be used to examine values for unexpected thunks, which can then be used in assertions. This can be invaluable in avoiding memory leaks, or tracking down existing ones.
ca: Les dades d'aplicació viscudes durant molt de temps normalment no haurien de contenir cap thunks. Aquesta biblioteca es pot utilitzar per examinar valors per als problemes inesperats, que després es poden utilitzar en les afirmacions. Això pot ser inestimable per evitar fuites de memòria, o per rastrejar les existents.

source: Haskell nothunks library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell nothunks

source: This package provides the Haskell nothunks library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell nothunks.

source: Locale library
ca: Biblioteca de configuració regional

source: This package provides the ability to adapt to locale conventions such as date and time formats.
ca: Aquest paquet proporciona la capacitat d'adaptar-se a convencions locals com ara els formats de data i hora.

source: Haskell old-locale library development files
ca: Fitxers de desenvolupament de la biblioteca de l'antiga ubicació del Haskell

source: This package provides the Haskell old-locale library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell a l'antic local.

source: Time library
ca: Biblioteca de l'hora

source: This package provides the old time library. For new projects, the newer <http://hackage.haskell.org/package/time time library> is recommended.
ca: Aquest paquet proporciona la biblioteca antiga de l'hora. Per a nous projectes, es recomana la més recent <http://hackage.haskell.org/package/time time library>.

source: Haskell old-time library development files
ca: Fitxers de desenvolupament de la biblioteca antiga del Haskell

source: This package provides the Haskell old-time library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de temps antics de Haskell.

source: Open a web browser from Haskell
ca: Obre un navegador web de Haskell

source: Open a web browser from Haskell. Currently BSD, Linux, OS X and Windows are supported.
ca: Obre un navegador web de Haskell. Actualment s'admeten BSD, Linux, OS X i Windows.

source: Haskell open-browser library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell open-browser

source: This package provides the Haskell open-browser library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell de navegador obert.

source: Optics as an abstract interface
ca: L'òptica com a interfície abstracta

source: This package makes it possible to define and use Lenses, Traversals, Prisms and other optics, using an abstract interface. See the main module "Optics" for the documentation. This is the "batteries-included" variant with many dependencies; see the '<https://hackage.haskell.org/package/optics-core optics-core>' package and other 'optics-*' dependencies if you need a more limited dependency footprint. Note: Hackage does not yet display documentation for reexported-modules, but you can start from the "Optics" module documentation or see the module list in '<https://hackage.haskell.org/package/optics-core optics-core>'.
ca: Aquest paquet permet definir i utilitzar lents, traversals, prismes i altres òptiques, utilitzant una interfície abstracta. Vegeu el mòdul principal "Òptics" per a la documentació. Aquesta és la variant "inclòs en bateries" amb moltes dependències; vegeu el paquet '<https://hackage.haskell.org/package/optics-core optics-core>' i altres dependències 'òptiques-*' si necessiteu una empremta de dependència més limitada. Nota: El Hackage encara no mostra documentació per als mòduls reexportats, però podeu començar des de la documentació del mòdul "Òptics" o veure la llista de mòduls a '<https://hackage.haskell.org/package/optics-core optics-core>'.

source: Optics as an abstract interface: core definitions
ca: L'òptica com a interfície abstracta: definicions bàsiques

source: This package makes it possible to define and use Lenses, Traversals, Prisms and other optics, using an abstract interface. This variant provides core definitions with a minimal dependency footprint. See the '<https://hackage.haskell.org/package/optics optics>' package (and its dependencies) for documentation and the "batteries-included" variant.
ca: Aquest paquet permet definir i utilitzar lents, traversals, prismes i altres òptiques, utilitzant una interfície abstracta. Aquesta variant proporciona definicions bàsiques amb una empremta de dependència mínima. Vegeu el paquet '<https://hackage.haskell.org/package/optics optics>' (i les seves dependències) per a la documentació i la variant "inclòs en bateries".

source: Haskell optics-core library development files
ca: Fitxers de desenvolupament de la biblioteca d'òptica de nucli de Haskell

source: This package provides the Haskell optics-core library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell optics-core.

source: Haskell optics library development files
ca: Fitxers de desenvolupament de la biblioteca d'òptica Haskell

source: This package provides the Haskell optics library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'òptica Haskell.

source: Extra utilities and instances for optics-core
ca: Utilitats i instàncies addicionals per a l'òptica-core

source: This package provides extra definitions and instances that extend the '<https://hackage.haskell.org/package/optics-core optics-core>' package, without incurring too many dependencies. See the '<https://hackage.haskell.org/package/optics optics>' package for more documentation.
ca: Aquest paquet proporciona definicions i instàncies addicionals que amplien el paquet '<https://hackage.haskell.org/package/optics-core optics-core>', sense incórrer en massa dependències. Vegeu el paquet '<https://hackage.haskell.org/package/optics optics>' per a més documentació.

source: Haskell optics-extra library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell optics-extra

source: This package provides the Haskell optics-extra library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell optics-extra.

source: Optics construction using TemplateHaskell
ca: Construcció d'òptiques mitjançant TemplateHaskell

source: This package is part of the '<https://hackage.haskell.org/package/optics optics>' package family. It provides machinery to construct optics using 'TemplateHaskell'. See the 'template-haskell-optics' package for optics to work with 'template-haskell' types.
ca: Aquest paquet forma part de la família de paquets '<https://hackage.haskell.org/package/optics optics>'. Proporciona maquinària per construir òptica utilitzant «TemplateHaskell». Vegeu el paquet «template-haskell-optics» perquè l'òptica funcioni amb els tipus «template-haskell».

source: Haskell optics-th library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell optics-th

source: This package provides the Haskell optics-th library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell optics-th.

source: Optional function arguments
ca: Arguments de la funció opcional

source: This library provides a type for specifying `Optional` function arguments Read the tutorial in "Data.Optional" to learn more.
ca: Aquesta biblioteca proporciona un tipus per a especificar els arguments de la funció ingOpcionaling Llegeix el tutorial a "Dades.Opcional" per aprendre més.

source: Haskell optional-args library development files
ca: Fitxers de desenvolupament de la biblioteca «opcional-args» del Haskell

source: This package provides the Haskell optional-args library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell opcional-args.

source: Utilities and combinators for parsing command line options
ca: Utilitats i combinators per analitzar les opcions de la línia d'ordres

source: Optparse-applicative is a haskell library for parsing options on the command line, and providing a powerful applicative interface for composing them. optparse-applicative takes care of reading and validating the arguments passed to the command line, handling and reporting errors, generating a usage line, a comprehensive help screen, and enabling context-sensitive bash, zsh, and fish completions. See the included README for detailed instructions and examples, which is also available on github <https://github.com/pcapriotti/optparse-applicative>.
ca: Optparse-applicative és una biblioteca haskell per analitzar opcions a la línia d'ordres, i proporciona una potent interfície d'aplicació per compondre-les. optparse-applicative s'encarrega de llegir i validar els arguments passats a la línia d'ordres, gestionar i informar els errors, generar una línia d'ús, una pantalla d'ajuda completa i habilitar les complecions de bash, zsh i fish sensibles al context. Vegeu el README inclòs per obtenir instruccions i exemples detallats, que també està disponible al github <https://github.com/pcapriotti/optparse-applicative>.

source: Haskell optparse-applicative library development files
ca: Fitxers de desenvolupament de biblioteques d'optparse-applicatives del Haskell

source: This package provides the Haskell optparse-applicative library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'aplicació optparse de Haskell.

source: Auto-generate a command-line parser for your datatype
ca: Genera automàticament un analitzador de línia d'ordres per al vostre tipus de dades

source: This library auto-generates an 'optparse-applicative'-compatible 'Parser' from any data type that derives the 'Generic' interface. See the documentation in "Options.Generic" for an example of how to use this library.
ca: Aquesta biblioteca autogenera un «Paràser» compatible amb «optparse-applicative» a partir de qualsevol tipus de dades que deriva la interfície «Generic». Consulta la documentació a "Opcions.Genèric" per exemple de com utilitzar aquesta biblioteca.

source: Haskell optparse-generic library development files
ca: Fitxers de desenvolupament de la biblioteca optparse-generic de Haskell

source: This package provides the Haskell optparse-generic library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca optparse-generic de Haskell.

source: Simple interface to optparse-applicative
ca: Interfície simple per a l'optparse-aplicative

source: Simple interface to optparse-applicative.
ca: Interfície simple per a l'optar-aplicatiu.

source: Haskell optparse-simple library development files
ca: Haskell optparse-simple biblioteca fitxers de desenvolupament

source: This package provides the Haskell optparse-simple library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell optparse-simple.

source: Use pandoc types in Lua
ca: Usa tipus pandoc a Lua

source: This package provides functions to marshal and unmarshal pandoc document types to and from Lua. The values of most types are pushed to pandoc as "userdata" objects that wrap a stable pointer to the Haskell value; these objects come with methods to access and modify their properties. Sequences are pushed as normal Lua tables, but are augmented with convenience functions.
ca: Aquest paquet proporciona funcions per als tipus de documents pandoc de mariscal i unmarshal cap a i des de Lua. Els valors de la majoria dels tipus es porten a pandoc com a objectes «userdata» que embolcallen un punter estable al valor de Haskell; aquests objectes venen amb mètodes per accedir i modificar les seves propietats. Les seqüències són empeses com a taules Lua normals, però s'augmenten amb funcions de conveniència.

source: Haskell pandoc-lua-marshal library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell pandoc-lua-marshal

source: This package provides the Haskell pandoc-lua-marshal library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell pandoc-lua-marshal.

source: Types for representing a structured document
ca: Tipus per a representar un document estructurat

source: 'Text.Pandoc.Definition' defines the 'Pandoc' data structure, which is used by pandoc to represent structured documents. This module used to live in the pandoc package, but starting with pandoc 1.7, it has been split off, so that other packages can use it without drawing in all of pandoc's dependencies, and pandoc itself can depend on packages (like citeproc-hs) that use them. 'Text.Pandoc.Builder' provides functions for building up 'Pandoc' structures programmatically. 'Text.Pandoc.Generic' provides generic functions for manipulating Pandoc documents. 'Text.Pandoc.Walk' provides faster, nongeneric functions for manipulating Pandoc documents. 'Text.Pandoc.JSON' provides functions for serializing and deserializing a 'Pandoc' structure to and from JSON.
ca: 'Text.Pandoc.Definició defineix l'estructura de dades «Pandoc», que el pandoc utilitza per representar documents estructurats. Aquest mòdul solia viure en el paquet pandoc, però a partir del pandoc 1.7, s'ha desglossat, de manera que altres paquets poden utilitzar-lo sense dibuixar en totes les dependències del pandoc, i el mateix pandoc pot dependre dels paquets (com citeproc-hs) que els utilitzen. 'Text.Pandoc.Builder proporciona funcions per construir estructures «Pandoc» de forma programàtica. 'Text.Pandoc.Generic' proporciona funcions genèriques per manipular documents Pandoc. 'Text.Pandoc.Walk' proporciona funcions més ràpides i no genèriques per manipular documents Pandoc. 'Text.Pandoc.JSON' proporciona funcions per serialitzar i desserialitzar una estructura 'Pandoc' a i des de JSON.

source: Haskell pandoc-types library development files
ca: Fitxers de desenvolupament de la biblioteca de tipus pandoc de Haskell

source: This package provides the Haskell pandoc-types library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de tipus pandoc de Haskell.

source: Parallel programming library
ca: Biblioteca de programació paral·lela
