Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: Shelly provides convenient systems programming in Haskell, similar in spirit to POSIX shells. Shelly: * is aimed at convenience and getting things done rather than being a demonstration of elegance, * has detailed and useful error messages, * maintains its own environment, making it thread-safe. Shelly is originally forked from the Shellish package. See the shelly-extra package for additional functionality. An overview is available in the README: <https://github.com/yesodweb/Shelly.hs/blob/master/README.md>.
ca: Shelly proporciona la programació de sistemes convenients en Haskell, similar en esperit als shells de POSIX. Shelly: * està dirigit a la comoditat i a fer les coses en lloc de ser una demostració d'elegància, * té missatges d'error detallats i útils, * manté el seu propi entorn, fent-lo segur per a fils. Shelly es bifurca originalment del paquet Shellish. Vegeu el paquet shelly-extra per a funcionalitats addicionals. Hi ha disponible una visió general al README: <https://github.com/yesodweb/Shelly.hs/blob/master/README.md>.

source: Haskell shelly library development files
ca: Fitxers de desenvolupament de la biblioteca del shelly del Haskell

source: This package provides the Haskell shelly library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell shelly.

source: Combinators to write Show instances
ca: Combinadors per a escriure Mostra les instàncies

source: A minimal pretty-printing library for Show instances in Haskell.
ca: Una biblioteca mínima de maquillatge per mostrar instàncies a Haskell.

source: Haskell show-combinators library development files
ca: Fitxers de desenvolupament de la biblioteca «mostre-combinators» del Haskell

source: This package provides the Haskell show-combinators library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell show-combinators.

source: Prevent or capture writing to stdout and other handles
ca: Evita o captura l'escriptura a la sortida estàndard i altres nanses

source: Prevent or capture writing to stdout, stderr, and other handles.
ca: Evita o captura l'escriptura a stdout, stderr i altres nanses.

source: Haskell silently library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell en silenci

source: This package provides the Haskell silently library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell en silenci.

source: Cross platform library for the sendfile system call
ca: Biblioteca de plataforma creuada per a la trucada del sistema sendfile

source: Cross platform library for the sendfile system call. This library tries to call minimum system calls which are the bottleneck of web servers.
ca: Biblioteca de plataforma creuada per a la trucada del sistema sendfile. Aquesta biblioteca intenta cridar trucades mínimes del sistema que són el coll d'ampolla dels servidors web.

source: Haskell simple-sendfile library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell simple-sendfile

source: This package provides the Haskell simple-sendfile library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell simple-sendfile.

source: Type level booleans
ca: Tipus de booleans de nivell

source: Type level booleans. 'singletons' package provides similar functionality, but it has tight dependency constraints.
ca: Tipus de booleans de nivell. El paquet «singletons» proporciona funcionalitats similars, però té restriccions de dependència estrictes.

source: Haskell singleton-bool library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell singleton-bool

source: This package provides the Haskell singleton-bool library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell singleton-bool.

source: Skein, a family of cryptographic hash functions. Includes Skein-MAC as well
ca: Skein, una família de funcions hash criptogràfiques. Inclou també Skein-MAC

source: Skein (<http://www.skein-hash.info/>) is a family of fast secure cryptographic hash functions designed by Niels Ferguson, Stefan Lucks, Bruce Schneier, Doug Whiting, Mihir Bellare, Tadayoshi Kohno, Jon Callas and Jesse Walker. This package uses bindings to the optimized C implementation of Skein. We provide a high-level interface (see module "Crypto.Skein") to some of the Skein use cases. We also provide a low-level interface (see module "Crypto.Skein.Internal") should you need to use Skein in a different way. Currently we have support for Skein as cryptographic hash function as Skein as a message authentication code (Skein-MAC). For examples of how to use this package, see "Crypto.Skein" module documentation. This package includes Skein v1.3. Versions of this package before 1.0.0 implemented Skein v1.1.
ca: Skein (<http://www.skein-hash.info/>) és una família de funcions de hash criptogràfic de seguretat ràpida dissenyades per Niels Ferguson, Stefan Lucks, Bruce Schneier, Doug Whiting, Mihir Bellare, Tadayoshi Kohno, Jon Callas i Jesse Walker. Aquest paquet utilitza vinculacions per a la implementació optimitzada de C de Skein. Proporcionem una interfície d'alt nivell (veure mòdul "Crypto.Skein") per a alguns dels casos d'ús de Skein. També proporcionem una interfície de baix nivell (vegeu el mòdul "Crypto.Skein.Intern") heu d'utilitzar Skein d'una manera diferent. Actualment tenim suport per a Skein com a funció hash criptogràfica com a Skein com a codi d'autenticació de missatges (Skein-MAC). Per exemples de com utilitzar aquest paquet, vegeu "Crypto.Documentació del mòdul Skein. Aquest paquet inclou Skein v1.3. Versions d'aquest paquet abans de 1.0.0 implementaven Skein v1.1.

source: Haskell skein library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell skein

source: This package provides the Haskell skein library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell skein.

source: Syntax highlighting library
ca: Biblioteca de ressaltat de la sintaxi

source: Skylighting is a syntax highlighting library with support for over one hundred languages. It derives its tokenizers from XML syntax definitions used by KDE's KSyntaxHighlighting framework, so any syntax supported by that framework can be added. An optional command-line program is provided. Skylighting is intended to be the successor to highlighting-kate. This package provides generated syntax modules based on the KDE XML definitions provided by the 'skylighting-core' package. As a result this package is licensed under the GPL.
ca: L'Skylighting és una biblioteca de ressaltat de sintaxi amb suport per a més de cent idiomes. Es deriva dels seus tokenizers a partir de les definicions de sintaxi XML emprades pel marc de treball KSyntaxHighlighting del KDE, de manera que es pot afegir qualsevol sintaxi suportada per aquest marc. Es proporciona un programa opcional de línia d'ordres. La il·luminació està destinada a ser la successora de la capacitat de ressaltat. Aquest paquet proporciona mòduls de sintaxi generats basats en les definicions XML del KDE proporcionades pel paquet «skylighting-core». Com a resultat, aquest paquet està llicenciat sota la GPL.

source: Skylighting is a syntax highlighting library. It derives its tokenizers from XML syntax definitions used by KDE's KSyntaxHighlighting framework, so any syntax supported by that framework can be added. An optional command-line program is provided. Skylighting is intended to be the successor to highlighting-kate. This package provides the core highlighting functionality under a permissive license. It also bundles XML parser definitions licensed under the GPL.
ca: L'Skylighting és una biblioteca de ressaltat de sintaxi. Es deriva dels seus tokenizers a partir de les definicions de sintaxi XML emprades pel marc de treball KSyntaxHighlighting del KDE, de manera que es pot afegir qualsevol sintaxi suportada per aquest marc. Es proporciona un programa opcional de línia d'ordres. La il·luminació està destinada a ser la successora de la capacitat de ressaltat. Aquest paquet proporciona la funcionalitat de ressaltat principal sota una llicència permissiva. També inclou definicions d'analitzador XML amb llicència sota la GPL.

source: Haskell skylighting-core library development files
ca: Fitxers de desenvolupament de la biblioteca skylighting-core de Haskell

source: This package provides the Haskell skylighting-core library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell skylighting-core.

source: Haskell skylighting library development files
ca: Fitxers de desenvolupament de la biblioteca de claraboies del Haskell

source: This package provides the Haskell skylighting library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de claraboies Haskell.

source: A property-based testing library
ca: Una biblioteca de proves basada en propietats

source: SmallCheck is a testing library that allows to verify properties for all test cases up to some depth. The test cases are generated automatically by SmallCheck.
ca: SmallCheck és una biblioteca de proves que permet verificar propietats per a tots els casos de prova fins a una certa profunditat. Els casos de prova són generats automàticament per SmallCheck.

source: Haskell smallcheck library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell smallcheck

source: This package provides the Haskell smallcheck library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell smallcheck.

source: Simple email sending via SMTP
ca: Enviament senzill de correu electrònic via SMTP

source: This packages provides a simple interface for mail over SMTP. PLease see the README for more information.
ca: Aquest paquet proporciona una interfície senzilla per al correu a través de SMTP. Si us plau, consulteu el README per a més informació.

source: Haskell smtp-mail library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell smtp-mail

source: This package provides the Haskell smtp-mail library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell smtp-mail.

source: Snap: A Haskell Web Framework (core interfaces and types)
ca: Snap: Un entorn web Haskell (interfícies i tipus de nucli)

source: Snap is a simple and fast web development framework and server written in Haskell. For more information or to download the latest version, you can visit the Snap project website at <http://snapframework.com/>. This library contains the core definitions and types for the Snap framework, including: 1. Primitive types and functions for HTTP (requests, responses, cookies, post/query parameters, etc) 2. A monad for programming web handlers called "Snap", which allows: * Stateful access to the HTTP request and response objects * Monadic failure (i.e. MonadPlus/Alternative instances) for declining to handle requests and chaining handlers together * Early termination of the computation if you know early what you want to return and want to prevent further monadic processing /Quick start/: The 'Snap' monad and HTTP definitions are in "Snap.Core".
ca: Snap és un marc de treball i un servidor web senzill i ràpid escrit en Haskell. Per a més informació o per descarregar l'última versió, podeu visitar el lloc web del projecte Snap a <http://snapframework.com/>. Aquesta biblioteca conté les definicions i els tipus bàsics per a l'entorn de treball Snap, incloent: 1. Tipus primitius i funcions per a HTTP (sol·licituds, respostes, galetes, paràmetres de post/consulta, etc) 2. Un monad per a programar gestors web anomenat "Snap", que permet: * Accés d'estat als objectes de sol·licitud i resposta HTTP * Error monàdic (és a dir, MonadPlus/Instàncies alternatives) per declinar gestionar les sol·licituds i encadenar els controladors junts * Finalització anticipada del càlcul si coneixes aviat el que vols retornar i vols evitar més processament monòdic /Inici ràpid/: La mònada 'Snap' i les definicions HTTP es troben a "Snap.Core».

source: Haskell snap-core library development files
ca: Fitxers de desenvolupament de la biblioteca «snap-core» del Haskell

source: This package provides the Haskell snap-core library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell snap-core.

source: A web server for the Snap Framework
ca: Un servidor web per a l'Snap Framework

source: Snap is a simple and fast web development framework and server written in Haskell. For more information or to download the latest version, you can visit the Snap project website at <http://snapframework.com/>. The Snap HTTP server is a high performance web server library written in Haskell. Together with the 'snap-core' library upon which it depends, it provides a clean and efficient Haskell programming interface to the HTTP protocol.
ca: Snap és un marc de treball i un servidor web senzill i ràpid escrit en Haskell. Per a més informació o per descarregar l'última versió, podeu visitar el lloc web del projecte Snap a <http://snapframework.com/>. El servidor HTTP Snap és una biblioteca de servidors web d'alt rendiment escrita en Haskell. Juntament amb la biblioteca 'snap-core' de la qual depèn, proporciona una interfície de programació Haskell neta i eficient al protocol HTTP.

source: Haskell snap-server library development files
ca: Fitxers de desenvolupament de la biblioteca «snap-server» del Haskell

source: This package provides the Haskell snap-server library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell snap-server.

source: Socks proxy (ver 5)
ca: Servidor intermediari de l'acoblador (ver 5)

source: Socks proxy (version 5) implementation.
ca: Implementació del servidor intermediari Socks (versió 5).

source: Haskell socks library development files
ca: Fitxers de desenvolupament de la biblioteca de socks Haskell

source: This package provides the Haskell socks library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell socks.

source: Existential type: Some
ca: Tipus existent: Alguns

source: This library defines an existential type 'Some'. ' data Some f where Some :: f a -> Some f ' in few variants, and utilities to work with it. If you are unsure which variant to use, use the one in "Data.Some" module.
ca: Aquesta biblioteca defineix un tipus existencial «Alguns». ' dades Una mica f on Alguns :: f a -' Una mica f ' en poques variants, i utilitats per treballar-hi. Si no esteu segur de quina variant utilitzar, utilitzeu la de "Dades.Un mòdul.

source: Haskell some library development files
ca: Haskell alguns fitxers de desenvolupament de biblioteques

source: This package provides the Haskell some library development files.
ca: Aquest paquet proporciona al Haskell alguns fitxers de desenvolupament de la biblioteca.

source: True Sums of Products
ca: Sumas de Productes Veritables

source: Implementation of n-ary sums and n-ary products. The module "Data.SOP" is the main module of this library and contains more detailed documentation. The main use case of this package is to serve as the core of '<https://hackage.haskell.org/package/generics-sop generics-sop>'. A detailed description of the ideas behind this library is provided by the paper: * Edsko de Vries and Andres Löh. <http://www.andres-loeh.de/TrueSumsOfProducts True Sums of Products>. Workshop on Generic Programming (WGP) 2014.
ca: Implementació de sumes n-àries i productes n-aris. El mòdul "Data.SOP" és el mòdul principal d'aquesta biblioteca i conté documentació més detallada. El cas d'ús principal d'aquest paquet és servir com a nucli de '<https://hackage.haskell.org/package/generics-sop generics-sop>'. Una descripció detallada de les idees que hi ha darrere d'aquesta biblioteca ve proporcionada per l'article: * Edsko de Vries i Andres Lhh. <http://www.andres-loeh.de/TrueSumsOfProducts True Sums of Products>. Taller de Programació Genèrica (WGP) 2014.

source: Haskell sop-core library development files
ca: Fitxers de desenvolupament de la biblioteca «sop-core» de Haskell

source: This package provides the Haskell sop-core library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca «sop-core» de Haskell.

source: Combinator library for splitting lists
ca: Biblioteca de combinador per a dividir llistes

source: A collection of various methods for splitting lists into parts, akin to the "split" function found in several mainstream languages. Here is its tale: Once upon a time the standard "Data.List" module held no function for splitting a list into parts according to a delimiter. Many a brave lambda-knight strove to add such a function, but their striving was in vain, for Lo, the Supreme Council fell to bickering amongst themselves what was to be the essential nature of the One True Function which could cleave a list in twain (or thrain, or any required number of parts). And thus came to pass the split package, comprising divers functions for splitting a list asunder, each according to its nature. And the Supreme Council had no longer any grounds for argument, for the favored method of each was contained therein. To get started, see the "Data.List.Split" module.
ca: Una col·lecció de diversos mètodes per dividir llistes en parts, similars a la funció "dividida" que es troba en diverses llengües dominants. Aquest és el seu conte: Hi havia una vegada l'estàndard "Dades.El mòdul List" no tenia cap funció per a dividir una llista en parts d'acord amb un delimitador. Molts dels valents lambda-cnight es van esforçar per afegir aquesta funció, però el seu esforç va ser en va, per Lo, el Consell Suprem va caure en barallar entre ells el que havia de ser la naturalesa essencial de la Funció Única Certa que podria trencar una llista en twain (o Thrain, o qualsevol nombre requerit de parts). I així va arribar a passar el paquet split, que comprèn funcions de divers per dividir una llista asunder, cadascuna segons la seva naturalesa. I el Consell Suprem ja no tenia cap motiu per argumentar, ja que el mètode afavorit de cadascun d'ells estava contingut en aquest. Per començar, consulteu les "Dades.Llista.Mòdul Split".

source: Haskell split library development files
ca: Haskell divideix els fitxers de desenvolupament de la biblioteca

source: This package provides the Haskell split library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca dividida de Haskell.

source: Fast Splittable PRNG
ca: Ràpidament separable

source: Pure Haskell implementation of SplitMix described in Guy L. Steele, Jr., Doug Lea, and Christine H. Flood. 2014. Fast splittable pseudorandom number generators. In Proceedings of the 2014 ACM International Conference on Object Oriented Programming Systems Languages & Applications (OOPSLA '14). ACM, New York, NY, USA, 453-472. DOI: <https://doi.org/10.1145/2660193.2660195> The paper describes a new algorithm /SplitMix/ for /splittable/ pseudorandom number generator that is quite fast: 9 64 bit arithmetic/logical operations per 64 bits generated. /SplitMix/ is tested with two standard statistical test suites (DieHarder and TestU01, this implementation only using the former) and it appears to be adequate for "everyday" use, such as Monte Carlo algorithms and randomized data structures where speed is important. In particular, it __should not be used for cryptographic or security applications__, because generated sequences of pseudorandom values are too predictable (the mixing functions are easily inverted, and two successive outputs suffice to reconstruct the internal state).
ca: Pure Haskell Implementació de SplitMix descrita a Guy L. Steele, Jr., Doug Lea i Christine H. Flood. 2014. Generadors de nombres pseudoaleatoris de taula dividida ràpida. A Proceedings of the 2014 ACM International Conference on Object Oriented Programming Systems Languages Applications (OOPSLA '14). ACM, Nova York, NY, EUA, 453-472. DOI: <https://doi.org/10.1145/2660193.2660195> L'article descriu un nou algorisme /SplitMix/ per a /splittable/ generador de nombres pseudoaleatoris que és bastant ràpid: 9 operacions aritmètiques/lògiques de 64 bits per 64 bits generats. /SplitMix/ es prova amb dos conjunts de proves estadístiques estàndard (DieHarder i TestU01, aquesta implementació només utilitzant l'anterior) i sembla ser adequat per a l'ús "cada dia", com algorismes de Monte Carlo i estructures de dades aleatòries on la velocitat és important. En particular, no s'ha d'utilitzar per a aplicacions criptogràfiques o de seguretat, perquè les seqüències generades de valors pseudoaleatoris són massa predictibles (les funcions de mescla s'inverteixen fàcilment, i dues sortides successives són suficients per reconstruir l'estat intern).

source: Haskell splitmix library development files
ca: Fitxers de desenvolupament de la biblioteca de splitmix del Haskell

source: This package provides the Haskell splitmix library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca de splitmix de Haskell.

source: Abstraction for things that work like IORef
ca: L'abstracció per a coses que funcionen com IORef

source: A collection of type-classes generalizing the read/write/modify operations for stateful variables provided by things like IORef, TVar, &c. Note that The interface has changed a bit from the 0.2.* version. "*Ref" functions are now called "*Reference" and new "*Ref" function exist with simpler signatures. The new 'Ref' existential type provides a convenient monad-indexed reference type, and the HasRef class indicates monads for which there is a default reference type for every referent.
ca: Una col·lecció de classes de tipus que generalitzen les operacions de lectura/escriptura/modificació per a variables amb estat proporcionades per coses com IORef, TVar, c. Tingueu en compte que la interfície ha canviat una mica de la versió 0.2.*. Les funcions "*Ref" ara s'anomenen "*Referència" i existeix una nova funció "*Ref" amb signatures més simples. El nou tipus existencial 'Ref' proporciona un tipus de referència convenient indexada per monads, i la classe HasRef indica monads per als quals hi ha un tipus de referència per defecte per a cada referent.

source: Haskell stateref library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell stateref

source: This package provides the Haskell stateref library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell stateref.

source: A library of statistical types, data, and functions
ca: Una biblioteca de tipus estadístics, dades i funcions
