Repository: openSUSE/packages-i18n
Catalog: */po/ghc.*.po
Languages: ca

source: This library provides a number of common functions and types useful in statistics. We focus on high performance, numerical robustness, and use of good algorithms. Where possible, we provide references to the statistical literature. The library's facilities can be divided into four broad categories: * Working with widely used discrete and continuous probability distributions. (There are dozens of exotic distributions in use; we focus on the most common.) * Computing with sample data: quantile estimation, kernel density estimation, histograms, bootstrap methods, significance testing, and regression and autocorrelation analysis. * Random variate generation under several different distributions. * Common statistical tests for significant differences between samples.
ca: Aquesta biblioteca proporciona una sèrie de funcions i tipus comuns útils en les estadístiques. Ens centrem en l'alt rendiment, la robustesa numèrica i l'ús de bons algorismes. Sempre que sigui possible, facilitem referències a la literatura estadística. Les instal·lacions de la biblioteca es poden dividir en quatre grans categories: * Treballar amb distribucions de probabilitat discretes i contínues àmpliament utilitzades. (Hi ha dotzenes de distribucions exòtiques en ús; ens centrem en les més comunes.) * Computació amb dades de mostra: estimació quantil, estimació de densitat del nucli, histogrames, mètodes bootstrap, proves de significació, i anàlisi de regressió i autocorrelació. * Generació variable aleatòria sota diverses distribucions diferents. * Proves estadístiques comunes per a diferències significatives entre mostres.

source: Haskell statistics library development files
ca: Fitxers de desenvolupament de la biblioteca d'estadístiques Haskell

source: This package provides the Haskell statistics library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca d'estadístiques Haskell.

source: Linear regression between two samples, based on the 'statistics' package
ca: Regressió lineal entre dues mostres, basada en el paquet 'estadística'

source: Provides functions to perform a linear regression between 2 samples, see the documentation of the linearRegression functions. This library is based on the 'statistics' package. * 0.3: you can now use all functions on any instance of the Vector class (not just unboxed vectors). * 0.2.4: added distribution estimations for standard regression parameters. * 0.2.3: added robust-fit support. * 0.2.2: added the Total-Least-Squares version and made some refactoring to eliminate code duplication * 0.2.1: added the r-squared version and improved the performances. Code sample: > import qualified Data.Vector.Unboxed as U > > test :: Int -> IO () > test k = do > let n = 10000000 > let a = k*n + 1 > let b = (k+1)*n > let xs = U.fromList [a..b] > let ys = U.map (x -> x*100 + 2000) xs > -- thus 100 and 2000 are the alpha and beta we want > putStrLn "linearRegression:" > print $ linearRegression xs ys The r-squared and Total-Least-Squares versions work the same way.
ca: Proporciona funcions per realitzar una regressió lineal entre 2 mostres, vegeu la documentació de les funcions de regressió lineal. Aquesta biblioteca es basa en el paquet d'estadístiques. * 0.3: ara podeu utilitzar totes les funcions en qualsevol instància de la classe de vector (no només vectors sense caixa). * 0.2.4: càlculs de distribució afegits per als paràmetres de regressió estàndard. * 0.2.3: s'ha afegit un suport robust-fit. * 0.2.2: s'ha afegit la versió Total-Least-Squares i s'ha fet alguna refactorització per eliminar la duplicació de codi * 0.2.1: va afegir la versió r-squared i va millorar les actuacions. Mostra de codi: . importar dades qualificades.Vector.Unboxed as U test :: Int - - IO () test k do let n 1000 10000000 let a k*n + 1 let b * (k+1)*n > let xs U.fromList [a..b] let ys = U.map (x - x x*100 + 2000) xs -- -- THUS 100 and 2000 are the alpha and beta we want putStrLn "linearRegression:" print $ linearRegression xs ys Les versions r-squared i Total-Least-Squares funcionen de la mateixa manera.

source: Haskell statistics-linreg library development files
ca: Fitxers de desenvolupament de la biblioteca «estadístic-linreg» del Haskell

source: This package provides the Haskell statistics-linreg library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell statistics-linreg.

source: Haskell stm library
ca: Biblioteca Haskell stm

source: This package provides the Haskell stm library.
ca: Aquest paquet proporciona la biblioteca Haskell stm.

source: Additional types of channels for STM
ca: Tipus addicionals de canals per a STM

source: Additional types of channels for STM.
ca: Tipus de canals addicionals per a STM.

source: Haskell stm-chans library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell stm-chans

source: This package provides the Haskell stm-chans library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell stm-chans.

source: Haskell stm library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell stm

source: This package provides the Haskell stm library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell stm.

source: Fast and lightweight binary serialization
ca: Serialització binària ràpida i lleugera

source: Fast and lightweight binary serialization.
ca: Serialització binària ràpida i lleugera.

source: Haskell store-core library development files
ca: Fitxers de desenvolupament de la biblioteca Haskell store-core

source: This package provides the Haskell store-core library development files.
ca: Aquest paquet proporciona els fitxers de desenvolupament de la biblioteca Haskell store-core.

source: An elementary streaming prelude and general stream type
ca: Un preludi elemental de flux i un tipus de flux general
