Repository: openSUSE/packages-i18n
Catalog: */po/gnome.*.po
Languages: ca, fr, ru

source: Provides translations for the "gnome-user-share" package.
ca: Proporciona traduccions per al paquet «gnome-user-share».
fr: Fournit des traductions pour le paquet "gnome-user-share".
ru: Предоставляет переводы для пакета «gnome-user-share».

source: GNOME version
ca: Versió del GNOME
fr: Version de GNOME
ru: Версия GNOME

source: This package contains information on the version of GNOME that is installed.
ca: Aquest paquet conté informació sobre la versió del GNOME que està instal·lada.
fr: Ce paquet contient des informations sur la version de GNOME installée.
ru: Пакет содержит информацию об установленной версии GNOME.

source: Bonobo monikers for GNOME-VFS
ca: Monikers de Bonobo per al GNOME-VFS
fr: Surnoms bonobos pour GNOME-VFS
ru: Компоненты Bonobo для GNOME-VFS

source: gnome-vfs-monikers contains all Bonobo monikers that were previously in the main gnome-vfs package.
ca: gnome-vfs-monikers conté tots els monikers Bonobo que anteriorment estaven en el paquet principal gnome-vfs.
fr: gnome-vfs-monikers contient toutes les références Bonobo qui étaient auparavant dans le paquet principal gnome-vfs package.
ru: gnome-vfs-monikers содержит все компоненты Bonobo, которые ранее находились в главном пакете gnome-vfs.

source: The GNOME 2.x Desktop Virtual File System Libraries
ca: Biblioteques del sistema de fitxers virtual d'escriptori GNOME 2.x
fr: Bibliothèques du système de fichiers virtuel de GNOME 2.x
ru: Библиотеки для GNOME 2.x Desktop Virtual File System

source: GNOME VFS is the GNOME virtual file system. It is the foundation of the Nautilus file manager. It provides a modular architecture and ships with several modules that implement support for file systems, HTTP, FTP, and others. It provides a URI-based API, a back-end supporting asynchronous file operations, a MIME type manipulation library, and other features.
ca: El VFS del GNOME és el sistema de fitxers virtual del GNOME. És la base del gestor de fitxers Nautilus. Proporciona una arquitectura modular i es distribueix amb diversos mòduls que implementen suport per a sistemes de fitxers, HTTP, FTP, i altres. Proporciona una API basada en URI, un back-end que suporta operacions de fitxers asíncrones, una biblioteca de manipulació de tipus MIME i altres característiques.
fr: GNOME VFS est le système de fichiers virtuel de GNOME. C'est la base du gestionnaire de fichiers Nautilus. Il fournit une architecture modulaire et est fourni avec plusieurs modules pour le support des systèmes de fichiers, HTTP, FTP et autres. Il fournit une API basée sur des URI, un sous-système pour la gestion des opérations asynchrones sur les fichiers, une bibliothèque pour la manipulation des types MIME et d'autres fonctions.
ru: GNOME VFS — это виртуальная файловая система GNOME. Это основа файлового менеджера Nautilus. Она имеет модульную архитектуру и поставляется с несколькими модулями, реализующими поддержку файловых систем, HTTP, FTP и других. Она предоставляет API на основе URI, серверную часть, поддерживающую асинхронные файловые операции, библиотеку управления типами MIME и другие функции.

source: Additional Package Documentation for gnome-vfs2
ca: Documentació addicional del paquet per al gnome-vfs2
fr: Paquet de documentation supplémentaire pour gnome-vfs2
ru: Дополнительная документация по gnome-vfs2

source: GNOME VFS is the GNOME virtual file system. It is the foundation for the Nautilus file manager. It provides a modular architecture and ships with several modules that implement support for file systems, HTTP, FTP, and more. It provides a URI-based API, a back-end that supports asynchronous file operations, a MIME type manipulation library, and other features. This package contains additional documentation for the main package.
ca: El VFS del GNOME és el sistema de fitxers virtual del GNOME. És la base del gestor de fitxers Nautilus. Proporciona una arquitectura modular i es distribueix amb diversos mòduls que implementen suport per a sistemes de fitxers, HTTP, FTP, i més. Proporciona una API basada en URI, un back-end que admet operacions de fitxers asíncrones, una biblioteca de manipulació de tipus MIME i altres característiques. Aquest paquet conté documentació addicional per al paquet principal.
fr: GNOME VFS est le système de fichiers virtuel de GNOME. C'est la base du gestionnaire de fichiers Nautilus. Il fournit une architecture modulaire et est fourni avec plusieurs modules pour le support des systèmes de fichiers, HTTP, FTP et autres. Il fournit une API basée sur des URI, un sous-système pour la gestion des opérations asynchrones sur les fichiers, une bibliothèque pour la manipulation des types MIME et d'autres fonctions. Ce paquet contient de la documentation supplémentaire pour le paquet principal.
ru: GNOME VFS — это виртуальная файловая система GNOME. Это основа файлового менеджера Nautilus. Она имеет модульную архитектуру и поставляется с несколькими модулями, реализующими поддержку файловых систем, HTTP, FTP и других. Она предоставляет API на основе URI, серверную часть, поддерживающую асинхронные файловые операции, библиотеку управления типами MIME и другие функции. Этот пакет содержит дополнительную документацию для главного пакета.

source: Translations for package gnome-vfs2
ca: Traduccions per al paquet gnome-vfs2
fr: Traductions pour le paquet gnome-vfs2
ru: Переводы для пакета gnome-vfs2

source: Provides translations for the "gnome-vfs2" package.
ca: Proporciona traduccions per al paquet «gnome-vfs2».
fr: Fournit des traductions pour le paquet "gnome-vfs2".
ru: Предоставляет переводы для пакета «gnome-vfs2».

source: Collection of GStreamer effects
ca: Col·lecció d'efectes de GStreamer
fr: Collection d'effets GStreamer
ru: Коллекция эффектов GStreamer

source: A collection of GStreamer effects to be used in different GNOME Modules.
ca: Una col·lecció d'efectes de GStreamer que s'utilitzaran en diferents mòduls del GNOME.
fr: Une collection d'effets GStreamer à utiliser dans différents modules GNOME.
ru: Коллекция эффектов GStreamer для использования в разных модулях GNOME.

source: Collection of GStreamer effects -- Development Files
ca: Col·lecció d'efectes de GStreamer -- Fitxers de desenvolupament
fr: Collection d'effets GStreamer -- Fichiers de développement
ru: Коллекция эффектов GStreamer — файлы для разработки

source: Weather App for GNOME
ca: Aplicació meteorològica per al GNOME
fr: Application Météo pour GNOME
ru: Приложение «Погода» для GNOME

source: GNOME 3 weather app that does: * display current conditions * display forecasts * show radar maps * notify on hazardous weather conditions
ca: Aplicació meteorològica del GNOME 3 que ho fa: * mostra les condicions actuals * mostra les previsions * mostra els mapes de radar * Notificació en condicions meteorològiques perilloses
fr: Application météo GNOME 3 qui : * affiche les conditions actuelles * affiche les prévisions * affiche les cartes radar * avertit en cas de conditions météorologiques dangereuses
ru: Погодное приложение GNOME 3, которое показывает: * текущую погоду * прогнозы * карты погоды * уведомления об опасных погодных условиях

source: Translations for package gnome-weather
ca: Traduccions per al paquet gnome-weather
fr: Traductions pour le paquet gnome-weather
ru: Переводы для пакета gnome-weather

source: Provides translations for the "gnome-weather" package.
ca: Proporciona traduccions per al paquet «gnome-weather».
fr: Fournit des traductions pour le paquet "gnome-weather".
ru: Предоставляет переводы для пакета «gnome-weather».

source: Development Files for gtk-frdp, an RDP Viewer Widget for Gtk+
ca: Fitxers de desenvolupament per a gtk-frdp, un giny visor RDP per a Gtk+
fr: Fichiers de développement pour gtk-frdp, un widget de visualisation RDP pour Gtk+.
ru: Файлы разработки для gtk-frdp, виджета просмотра RDP для Gtk+

source: gtk-frdp is an RDP viewer widget for the GNOME Desktop Environment. This package provides all the necessary files for development with libgtk-frdp.
ca: gtk-frdp és un giny del visor RDP per a l'entorn d'escriptori GNOME. Aquest paquet proporciona tots els fitxers necessaris per al desenvolupament amb libgtk-frdp.
fr: gtk-frdp est une fenêtre de visualisation RDP pour l'environnement de bureau GNOME. Ce paquet fournit tous les fichiers nécessaires au développement de libgtk-frdp.
ru: gtk-frdp — это виджет просмотра RDP для среды рабочего стола GNOME. Этот пакет предоставляет все необходимые файлы для разработки с libgtk-frdp.

source: Adwaita GNOME Theme -- GTK+ 2 Support
ca: Adwaita GNOME Theme -- GTK+ 2 Implementació
fr: Thème GNOME Adwaita -- Support GTK+ 2
ru: Тема для GNOME Адвайта — Поддержка GTK+ 2

source: Adwaita is the default GNOME theme in GNOME 3.
ca: Adwaita és el tema GNOME per defecte del GNOME 3.
fr: Le thème d'icônes par défaut de GNOAdwaita est le thème par défaut de GNOME dans GNOME 3.
ru: Адвайта является темой оформления по умолчанию в GNOME 3.

source: Adwaita GTK+ Theming Engine
ca: Motor de temes GTK+ d'Adwaita
fr: Moteur de création de thèmes Adwaita GTK+
ru: Движок темы оформления Адвайта для GTK+

source: Adwaita GNOME Theme -- GTK+ 3 Support
ca: Adwaita GNOME Theme -- GTK+ 3 Implementació
fr: Thème GNOME Adwaita -- Support GTK+ 3
ru: Тема для GNOME Адвайта — Поддержка GTK+ 3

source: Integrated LaTeX Environment for the GNOME desktop
ca: Entorn LaTeX integrat per a l'escriptori GNOME
fr: Environnement LaTeX intégré pour le bureau GNOME
ru: Интегрированная среда LaTeX для рабочего стола GNOME

source: Shared library for gnome-calculator
ca: Biblioteca compartida per al gnome-calculator
fr: Bibliothèque partagée pour gnome-calculator
ru: Разделяемая библиотека для gnome-calculator

source: This package contains the shared library for gnome-calculator.
ru: Этот пакет содержит разделяемую библиотеку для gnome-calculator.

source: Glib wrapper library for PKCS#11 - Modules
ca: Biblioteca de contenidor de la Glib per a PKCS1111 - Mòduls
fr: Compilation de la bibliothèque Glib pour PKCS#11 - Modules
ru: Библиотека обёртки Glib для PKCS#11 — Модули

source: GCK is a wrapper based on GLib implementing the PKCS#11 (Cryptoki) interface. This package contains various PKCS#11 modules, to expose keys and certificates from different sources.
ca: GCK és un embolcall basat en GLib implementant la interfície PKCS1111 (Cryptoki). Aquest paquet conté diversos mòduls PKCS1111, per exposar claus i certificats de diferents fonts.
fr: GCK est un wrapper basé sur GLib qui implémente l'interface PKCS#11 (Cryptoki). Ce paquet contient divers modules PKCS#11 permettant d'exposer des clés et des certificats provenant de différentes sources.
ru: GCK — программная обёртка на основе GLib, реализующая интерфейс PKCS#11 (Cryptoki). Этот пакет содержит различные модули PKCS#11 для раскрытия ключей и сертифиактов из различных источников.

source: gnome-autoar provides functions, widgets, and gschemas for GNOME applications which want to use archives as a method to transfer directories over the Internet.
ca: gnome-autoar proporciona funcions, ginys i gschemas per a les aplicacions del GNOME que volen utilitzar arxius com a mètode per a transferir directoris a través d'Internet.
fr: gnome-autoar fournit des fonctions, des widgets et des gschemas pour les applications GNOME qui souhaitent utiliser les archives comme méthode de transfert de répertoires via Internet.
ru: gnome-autoar предоставляет функции, виджеты и файлы gschema для приложений GNOME, желающих использовать архивы в качестве метода передачи каталогов через Интернет.

source: GNOME Bluetooth's Shared Libraries
ca: Biblioteques compartides del GNOME Bluetooth
fr: Bibliothèques partagées de GNOME Bluetooth
ru: Разделяемые библиотеки Bluetooth для GNOME

source: A set of graphical utilities to setup, monitor and use Bluetooth devices. This package provides the GNOME Bluetooth's shared library.
ca: Un conjunt d'utilitats gràfiques per configurar, monitoritzar i utilitzar dispositius Bluetooth. Aquest paquet proporciona la biblioteca compartida del GNOME Bluetooth.
fr: Un ensemble d'utilitaires graphiques pour configurer, surveiller et utiliser les périphériques Bluetooth. Ce paquet fournit la bibliothèque partagée de GNOME Bluetooth.
ru: Набор графических утилит для настройки, контроля и использования Bluetooth-устройств. Этот пакет предоставляет разделяемую библиотеку Bluetooth для GNOME.

source: The libgnome-desktop library provides API shared by several applications on the desktop, but that cannot live in the platform for various reasons. There is no API or ABI guarantee, although we are doing our best to provide stability. Documentation for the API is available with gtk-doc.
ca: La biblioteca libgnome-desktop proporciona una API compartida per diverses aplicacions a l'escriptori, però que no pot viure a la plataforma per diverses raons. No hi ha cap garantia API ni ABI, encara que estem fent tot el possible per proporcionar estabilitat. La documentació de l'API està disponible amb gtk-doc.
fr: La bibliothèque libgnome-desktop fournit des API partagées par plusieurs applications sur le bureau, mais qui ne peuvent pas vivre dans la plateforme pour diverses raisons. Il n'y a pas de garantie d'API ou d'ABI, bien que nous fassions de notre mieux pour assurer la stabilité. La documentation de l'API est disponible avec gtk-doc.
ru: Библиотека libgnome-desktop предоставляет API, совместно используемый несколькими приложениями на рабочем столе, но который не может быть в платформе по различным причинам. Нет гарантий насчёт API или ABI , хотя мы делаем всё возможное, чтобы обеспечить стабильность. Документация по API доступна в пакете gtk-doc.

source: The GNOME Desktop API Library -- Development Files
ca: La biblioteca API de l'escriptori del GNOME -- Fitxers de desenvolupament
fr: La bibliothèque API du bureau GNOME -- Fichiers de développement
ru: Библиотека API рабочего стола GNOME — Файлы разработки

source: The libgnome-desktop library provides API shared by several applications on the desktop, but that cannot live in the platform for various reasons.
ca: La biblioteca libgnome-desktop proporciona una API compartida per diverses aplicacions a l'escriptori, però que no pot viure a la plataforma per diverses raons.
fr: La bibliothèque libgnome-desktop fournit des API partagées par plusieurs applications sur le bureau, mais qui ne peuvent pas être intégrées à la plateforme pour diverses raisons.
ru: Библиотека libgnome-desktop предоставляет API, совместно используемый несколькими приложениями на рабочем столе, но который не может быть в платформе по различным причинам.

source: Development files for the GNOME Desktop API library
ca: Fitxers de desenvolupament per a la biblioteca API de l'escriptori GNOME
fr: Fichiers de développement pour la bibliothèque GNOME Desktop API
ru: Файлы разработки для библиотеки API рабочего стола GNOME

source: Common data files for the GNOME Desktop API library
ca: Fitxers de dades comuns per a la biblioteca API de l'escriptori del GNOME
fr: Fichiers de données communes pour la bibliothèque de l'API du bureau GNOME
ru: Общие файлы данных для библиотеки API рабочего стола GNOME

source: The libgnome-desktop library provides API shared by several applications on the desktop, but that cannot live in the platform for various reasons. This package contains data files used by libgnome-dekstop.
ca: La biblioteca libgnome-desktop proporciona una API compartida per diverses aplicacions a l'escriptori, però que no pot viure a la plataforma per diverses raons. Aquest paquet conté fitxers de dades utilitzats per libgnome-dekstop.
fr: La bibliothèque libgnome-desktop fournit des API partagées par plusieurs applications sur le bureau, mais qui ne peuvent pas vivre dans la plateforme pour diverses raisons. Ce paquet contient les fichiers de données utilisés par libgnome-dekstop.
ru: Библиотека libgnome-desktop предоставляет API, совместно используемый несколькими приложениями на рабочем столе, но который не может быть в платформе по различным причинам. Этот пакет содержит файлы данных используемые libgnome-dekstop.

source: GNOME service to access online accounts -- Client Library
ca: Servei del GNOME per a accedir als comptes en línia -- Biblioteca del client
fr: Service GNOME d'accès aux comptes en ligne -- Bibliothèque du client
ru: Служба GNOME для доступа к учётным записям Интернет — Клиентская библиотека

source: GNOME service to access online accounts -- Backend Library
ca: Servei del GNOME per a accedir als comptes en línia -- Biblioteca del dorsal
fr: Service GNOME d'accès aux comptes en ligne -- Bibliothèque Backend
ru: Служба GNOME для доступа к учётным записям Интернет — Внутренняя библиотека

source: Development Files for gtk-frdp, a virtual machine image library
ca: Fitxers de desenvolupament per a gtk-frdp, una biblioteca virtual d'imatges de màquina
fr: Fichiers de développement pour gtk-frdp, une bibliothèque d'images de machines virtuelles
ru: Файлы разработки для gtk-frdp, библиотеки образов виртуальных машин

source: Adwaita GNOME Theme -- Common Files
ca: Adwaita Tema del GNOME -- Fitxers comuns
fr: Thème GNOME Adwaita -- Fichiers communs
ru: Тема для GNOME Адвайта — Общие файлы

source: Nautilus Extension to Open Terminal in Folders
ca: Extensió del Nautilus per a obrir el terminal a les carpetes
fr: Extension Nautilus pour ouvrir un Terminal dans des dossiers
ru: Расширение Nautilus для открытия терминала в папках

source: This is a nautilus extension that allows you to open a terminal in arbitrary folders.
ca: Aquesta és una extensió nautilus que permet obrir un terminal en carpetes arbitràries.
ru: Это расширение для Nautilus, которое позволяет открыть терминал в произвольной папке.

source: Daemon to use DVB devices -- Python Library
ca: Dimoni per a usar dispositius DVB -- Biblioteca de Python
ru: Демон для использования DVB-устройств — Библиотека Python

source: Daemon to use DVB devices -- Totem Plugin
ca: Dimoni per utilitzar dispositius DVB -- Connector Totem
ru: Демон для использования DVB-устройств — Плагин Totem

source: The GNOME Desktop Menu -- Introspection bindings
ca: El menú d'escriptori del GNOME -- Vinculacions d'introducció
ru: Меню рабочего стола GNOME — Привязки самоанализа

source: The package contains an implementation of the draft "Desktop Menu Specification" from freedesktop.org This package provides the GObject Introspection bindings for the libgnome-menu library.
ca: El paquet conté una implementació de l'esborrany «Desktop Menu Specification» de freedesktop.org Aquest paquet proporciona els lligams d'introducció GObject per a la biblioteca «libgnome-menu».
ru: Этот пакет содержит реализацию черновика "Desktop Menu Specification" от freedesktop.org Этот пакет содержит привязки самоанализа GObject для библиотеки libgnome-menu.

source: Automatic archives creating and extracting library -- Introspection bindings
ca: Crear i extreure la biblioteca automàticament -- Vinculacions d'introspecció
ru: Библиотека автоматического создания и извлечения архивов — Привязки самоанализа

source: Introspection bindings for the GNOME Bluetooth libraries
ca: Vinculacions d'introspecció per a les biblioteques Bluetooth del GNOME
ru: Привязки самоанализа для библиотек GNOME Bluetooth

source: A set of graphical utilities to setup, monitor and use Bluetooth devices. This package provides the GObject Introspection bindings for the GNOME Bluetooth's libraries.
ca: Un conjunt d'utilitats gràfiques per configurar, monitoritzar i utilitzar dispositius Bluetooth. Aquest paquet proporciona els lligams d'introducció GObject per a les biblioteques del Bluetooth del GNOME.
ru: Набор графических утилит для настройки, контроля и использования Bluetooth-устройств. Этот пакет предоставляет привязки самоанализа GObject для библиотек GNOME Bluetooth.

source: Introspection bindings for the GNOME Desktop API library
ca: Vinculacions d'introspecció per a la biblioteca API de l'escriptori GNOME
ru: Привязки самоанализа для библиотеки API рабочего стола GNOME

source: The libgnome-desktop library provides API shared by several applications on the desktop, but that cannot live in the platform for various reasons. This package provides the GObject Introspection bindings for libgnome-desktop.
ca: La biblioteca libgnome-desktop proporciona una API compartida per diverses aplicacions a l'escriptori, però que no pot viure a la plataforma per diverses raons. Aquest paquet proporciona les vinculacions d'introspecció GObject per a libgnome-desktop.
ru: Библиотека libgnome-desktop предоставляет API, совместно используемый несколькими приложениями на рабочем столе, но который не может быть в платформе по различным причинам. Этот пакет содержит привязки самоанализа GObject для библиотеки libgnome-desktop.

source: GNOME service to access online accounts -- Introspection bindings
ca: Servei del GNOME per a accedir als comptes en línia -- Vinculacions d'introducció
ru: Служба GNOME для доступа к учётным записям — Привязки самоанализа

source: gnome-online-accounts provides interfaces so applications and libraries in GNOME can access the user's online accounts. This package provides the GObject Introspection bindings for the libgoa client library.
ca: gnome-online-accounts proporciona interfícies perquè les aplicacions i les biblioteques del GNOME puguin accedir als comptes en línia de l'usuari. Aquest paquet proporciona els lligams d'introspecció GObject per a la biblioteca del client de la libgoa.
ru: gnome-online-accounts предоставляет интерфейс для приложений и библиотек к данным сетевых учётных записей пользователя в GNOME. Этот пакет содержит привязки самоанализа GObject для клиентской библиотеки libgoa.

source: Introspection Bindings for libovf-glib, a virtual machine image library
ru: Привязки самоанализа для libovf-glib, библиотеки образов виртуальных машин

source: Libgovf is a library for reading and writing virtual machine images in the Open Virtualization Format. This package provides the GObject Introspection bindings for libovf-glib.
ru: Libgovf — это библиотека для чтения и записи образов виртуальных машин в формате Open Virtualization. Этот пакет предоставляет привязки самоанализа GObject для libovf-glib.

source: Introspection bindings for gnome-todo's library
ca: Vinculacions d'introspecció per a la biblioteca del gnome-todo
ru: Привязки самоанализа для библиотеки gnome-todo

source: gtk-frdp is an RDP viewer widget for the GNOME Desktop Environment. This package provides the GObject Introspection bindings for libgtk-frdp.
ru: gtk-frdp — это виджет просмотра RDP для среды рабочего стола GNOME. Этот пакет предоставляет привязки самоанализа GObject для libgtk-frdp.

source: Tool to extract translatable content from XML documents
ca: Eina per a extreure contingut traduïble de documents XML
ru: Инструмент извлечения переводимого содержимого из XML-документов

source: xml2po is a simple Python program which extracts translatable content from free-form XML documents and outputs gettext compatible POT files.
ru: xml2po — это простая программа на Python, которая извлекает переводимое содержимое из свободно сформированных XML-документов и выводит совместимые с gettext POT-файлы.
