Repository: openSUSE/packages-i18n
Catalog: */po/gnome.*.po
Languages: ca, fr, ru

source: The gnome-doc-utils package is a collection of documentation utilities for the GNOME project. It contains utilities for building documentation and auxiliary files in a source tree. It also contains the DocBook XSLT stylesheets that were once distributed with Yelp.
ca: El paquet gnome-doc-utils és una col·lecció d'utilitats de documentació per al projecte GNOME. Conté utilitats per a la construcció de documentació i fitxers auxiliars en un arbre de fonts. També conté els fulls d'estil DocBook XSLT que es van distribuir amb Yelp.
fr: Le paquet gnome-doc-utils est une collection d'utilitaires de documentation pour le projet GNOME. Il contient des utilitaires pour construire la documentation et les fichiers auxiliaires dans une arborescence de sources. Il contient également les feuilles de style DocBook XSLT qui étaient autrefois distribuées avec Yelp.
ru: Пакет gnome-doc-utils — это собрание утилит документации для проекта GNOME. Он содержит утилиты для построения документации и вспомогательные файлы в исходном дереве. Он также содержит таблицы стилей DocBook XSLT, которые когда-то распространялись вместе с Yelp.

source: Program for writing an ISO file to multiple USB devices at once
ca: Programa per a escriure un fitxer ISO a diversos dispositius USB alhora
fr: Programme permettant d'écrire un fichier ISO sur plusieurs périphériques USB à la fois
ru: Программа для записи файла ISO одновременно на несколько USB-устройств

source: GNOME News Reader
ru: Программа GNOME для чтения новостей

source: A GNOME 3 Feed Reader.
ru: Программа GNOME 3 для чтения новостных лент.

source: Translations for package gnome-news
ru: Переводы для пакета gnome-news

source: Provides translations for the "gnome-news" package.
ru: Предоставляет переводы для пакета «gnome-news».

source: Common files for the Adwaita GNOME theme
ca: Fitxers comuns per al tema Adwaita GNOME
ru: Общие файлы для темы GNOME Adwaita

source: xml2po is a Python program which extracts translatable content from free-form XML documents and outputs gettext compatible POT files.
ca: xml2po és un programa de Python que extreu contingut traduïble de documents XML de forma lliure i emet fitxers POT compatibles amb el gettext.
ru: xml2po — это программа на Python, которая извлекает переводимое содержимое из XML-документов в свободной форме и выводит совместимые с gettext POT-файлы.

source: Extensions app for GNOME Shell
ca: Aplicació d'extensions per al GNOME Shell
fr: Application d'extensions pour GNOME Shell

source: This package contains an optional extensions app for managing GNOME Shell extensions.
ca: Aquest paquet conté una aplicació d'extensions opcional per a gestionar les extensions del GNOME Shell.
fr: Ce paquet contient une application d'extensions optionnelle pour gérer les extensions du GNOME Shell.

source: Gnome-latex is an Integrated LaTeX Environment for GNOME. The main features are: * Configurable buttons to compile, convert and view a document in one click. * LaTeX commands auto-completion. * Symbol tables (Greek letters, arrows, ...). * File browser integrated. * Template managing. * Menus with the most commonly used LaTeX commands. * Easy projects management.
ca: Gnome-latex és un entorn LaTeX integrat per al GNOME. Les característiques principals són: * Botons configurables per compilar, convertir i veure un document en un sol clic. * Compleció automàtica d'ordres de LaTeX. * Taules de símbols (lletres gregues, fletxes, ...). * Navegador de fitxers integrat. * Gestió de plantilles. * Menús amb les ordres LaTeX més utilitzades. * Gestió de projectes fàcils.
fr: Gnome-latex est un environnement LaTeX intégré pour GNOME. Les principales caractéristiques sont les suivantes * Boutons configurables pour compiler, convertir et visualiser un document en un seul clic. * Auto-complétion des commandes LaTeX. * Tableaux de symboles (lettres grecques, flèches, ...). * Navigateur de fichiers intégré. * Gestion des modèles. * Menus avec les commandes LaTeX les plus utilisées. * Gestion facile des projets.

source: Translations for package gnome-remote-desktop
ca: Traduccions per al paquet gnome-remote-desktop
fr: Traductions pour le paquet gnome-remote-desktop

source: Provides translations for the "gnome-remote-desktop" package.
ca: Proporciona traduccions per al paquet «gnome-remote-desktop».
fr: Fournit des traductions pour le paquet "gnome-remote-desktop".

source: GNOME Calculator Library
ca: Biblioteca de càlcul del GNOME
fr: Bibliothèque de GNOME Calculator

source: GNOME Calculator Library GTK Interface
ca: Interfície GTK de la biblioteca de càlcul del GNOME
fr: Bibliothèque de GNOME Calculator Interface GTK

source: This package contains a shared library for gnome-calculator.
ca: Aquest paquet conté una biblioteca compartida per al gnome-calculator.
fr: Ce paquet contient une bibliothèque partagée pour gnome-calculator.

source: Libgovf is a library for reading and writing virtual machine images in the Open Virtualization Format. This package provides all the necessary files for development with libovf-glib.
ca: Libgovf és una biblioteca per llegir i escriure imatges de màquina virtual en el format de virtualització oberta. Aquest paquet proporciona tots els fitxers necessaris per al desenvolupament amb libovf-glib.
fr: Libgovf est une bibliothèque permettant de lire et d'écrire des images de machines virtuelles dans le format Open Virtualization Format. Ce paquet fournit tous les fichiers nécessaires au développement avec libovf-glib.

source: DVB Daemon is a daemon written in Vala to setup your DVB devices, record and watch TV shows and browse EPG. It can be controlled directly via its D-Bus interface or with UI applications that come with it. This package contains a a Python library to use the D-Bus interfaces of DVB Daemon.
ca: DVB Daemon és un dimoni escrit en Vala per a configurar els dispositius DVB, gravar i veure programes de televisió i navegar per l'EPG. Es pot controlar directament a través de la seva interfície D-Bus o amb aplicacions d'interfície d'usuari que l'acompanyen. Aquest paquet conté una biblioteca Python per utilitzar les interfícies D-Bus del dimoni DVB.

source: DVB Daemon is a daemon written in Vala to setup your DVB devices, record and watch TV shows and browse EPG. It can be controlled directly via its D-Bus interface or with UI applications that come with it. This package contains a Totem plugin to use your DVB devices.
ca: DVB Daemon és un dimoni escrit en Vala per a configurar els dispositius DVB, gravar i veure programes de televisió i navegar per l'EPG. Es pot controlar directament a través de la seva interfície D-Bus o amb aplicacions d'interfície d'usuari que l'acompanyen. Aquest paquet conté un connector Totem per utilitzar els dispositius DVB.

source: Pkgconfig file for xml2po
ca: Fitxer Pkgconfig per a xml2po

source: MicroOS Desktop default settings
ca: Configuració predeterminada de l'escriptori MicroOS

source: This package provides MicroOS defaults for GNOME settings.
ca: Aquest paquet proporciona els valors per defecte de MicroOS per a la configuració del GNOME.

source: A remote desktop client for GNOME
ca: Un client d'escriptori remot per al GNOME

source: A remote desktop client for the GNOME desktop environment.
ca: Un client d'escriptori remot per a l'entorn d'escriptori GNOME.

source: Translations for package gnome-connections
ca: Traduccions per al paquet gnome-connections

source: Provides translations for the "gnome-connections" package.
ca: Proporciona traduccions per al paquet «gnome-connections».

source: Mutter based compositor for kiosks
ca: Compositor basat en Mutter per a quioscos

source: Kiosk provides a desktop enviroment suitable for fixed purpose, or single application deployments like wall displays and point-of-sale systems.
ca: Kiosk proporciona un entorn d'escriptori adequat per a un propòsit fix, o desplegaments d'aplicacions individuals com pantalles de paret i sistemes de punt de venda.

source: Search appliance sample app
ca: Cerca una aplicació de mostra d'aparells

source: Search appliance sample app that demonstate how the kiosk compositor is used.
ca: Cerca l'aplicació de mostra d'aparell que demonitza com s'utilitza el compositor quiosc.

source: Miracast implementation for GNOME
ca: Implementació de Miracast per al GNOME

source: This is an experimental implementation of Wi-Fi Display (aka Miracast). The application will stream the selected monitor if the mutter screencast portal is available. If it is unavailable, a fallback to X11 based frame grabbing will happen. As such, it should work fine in almost all setups. To get audio streaming, you need to change the audio output in pulseaudio to use the created "Network-Displays" sink.
ca: Aquesta és una implementació experimental de Wi-Fi Display (també conegut com a Miracast). L'aplicació transmetrà el monitor seleccionat si hi ha disponible el portal de screencast del mutter. Si no està disponible, es produirà una recuperació de la captura de fotogrames basada en X11. Com a tal, hauria de funcionar bé en gairebé totes les configuracions. Per obtenir la transmissió d'àudio, heu de canviar la sortida d'àudio a pulseaudio per utilitzar el conducte creat «Network-Displays».

source: Translations for package gnome-network-displays
ca: Traduccions per al paquet gnome-network-displays

source: Provides translations for the "gnome-network-displays" package.
ca: Proporciona traduccions per al paquet «gnome-network-displays».

source: Podcast app for GNOME
ca: Aplicació de podcasts per al GNOME

source: A Podcast application for GNOME. Listen to your favorite podcasts, right from your desktop.
ca: Una aplicació de podcast per al GNOME. Escolta els teus podcasts preferits, des de l'escriptori.

source: Translations for package gnome-podcasts
ca: Traduccions per als paquets gnome-podcasts

source: Provides translations for the "gnome-podcasts" package.
ca: Proporciona traduccions per al paquet «gnome-podcasts».

source: Gnome Shell Extension to Auto Tiling
ca: Extensió de l'intèrpret d'ordres del GNOME a l'elaboració automàtica

source: Pop Shell is a keyboard-driven layer for GNOME Shell which allows for quick and sensible navigation and management of windows. The core feature of Pop Shell is the addition of advanced tiling window management — a feature that has been highly-sought within our community. For many — ourselves included — i3wm has become the leading competitor to the GNOME desktop. Tiling window management in GNOME is virtually nonexistent, which makes the desktop awkward to interact with when your needs exceed that of two windows at a given time. Luckily, GNOME Shell is an extensible desktop with the foundations that make it possible to implement a tiling window manager on top of the desktop. Therefore, we see an opportunity here to advance the usability of the GNOME desktop to better accomodate the needs of our community with Pop Shell. Advanced tiling window management is a must for the desktop, so we've merged i3-like tiling window management with the GNOME desktop for the best of both worlds.
ca: Pop Shell és una capa impulsada per teclat per al GNOME Shell que permet una navegació ràpida i assenyada i la gestió de les finestres. La característica principal de Pop Shell és l'addició d'una gestió avançada de finestres de tessel·lació, una característica que ha estat molt buscada dins de la nostra comunitat. Per a molts, inclosos nosaltres, l'i3wm s'ha convertit en el principal competidor de l'escriptori GNOME. La gestió del mosaic de finestres al GNOME és pràcticament inexistent, el qual fa que l'escriptori sigui incòmode d'interactuar quan les necessitats superen les de dues finestres en un moment determinat. Per sort, el GNOME Shell és un escriptori extensible amb els fonaments que permeten implementar un gestor de finestres en mosaic a la part superior de l'escriptori. Per tant, veiem una oportunitat aquí per avançar en la usabilitat de l'escriptori GNOME per a acomodar millor les necessitats de la nostra comunitat amb Pop Shell. La gestió avançada de les finestres de mosaic és un must per a l'escriptori, de manera que hem fusionat la gestió de les finestres de mosaic similar a l'i3 amb l'escriptori GNOME per al millor d'ambdós mons.

source: GNOME Text Editor
ca: Editor de text del GNOME

source: Text Editor is a simple text editor that focus on session management. It works hard to keep track of changes and state even if you quit the application. You can come back to your work even if you've never saved it to a file.
ca: L'editor de text és un editor de text senzill que se centra en la gestió de les sessions. Treballa dur per fer un seguiment dels canvis i l'estat fins i tot si sortiu de l'aplicació. Pots tornar al teu treball encara que mai l'hagis desat en un arxiu.

source: Translations for package gnome-text-editor
ca: Traduccions per al paquet gnome-text-editor

source: Provides translations for the "gnome-text-editor" package.
ca: Proporciona traduccions per al paquet «gnome-text-editor».

source: GNOME Tour & Greeter
ca: Salutació del Tour del GNOME

source: A guided tour and greeter for GNOME.
ca: Una visita guiada i benvinguda per al GNOME.

source: Translations for package gnome-tour
ca: Traduccions per al paquet gnome-tour

source: Provides translations for the "gnome-tour" package.
ca: Proporciona traduccions per al paquet «gnome-tour».

source: GTK+ 2 support for the Adwaita GNOME theme
ca: Implementació de GTK+ 2 per al tema Adwaita GNOME

source: GTK+ 3 support for the Adwaita GNOME theme
ca: Implementació de GTK+ 3 per al tema Adwaita GNOME
