Repository: openSUSE/packages-i18n
Catalog: */po/gnome.*.po
Languages: ca, fr, ru

source: GNOME Commander is a "two-pane" graphical file manager for the Linux desktop using GNOME libraries. In addition to basic file manager functions, the program is also an FTP client and can browse SMB networks.
ca: El GNOME Commander és un gestor de fitxers gràfic de dos panells per a l'escriptori Linux que utilitza les biblioteques del GNOME. A més de les funcions bàsiques del gestor de fitxers, el programa també és un client FTP i pot navegar per xarxes SMB.
fr: GNOME Commander est un gestionnaire de fichiers graphique à deux volets pour le bureau Linux utilisant les bibliothèques GNOME. Outre les fonctions de base du gestionnaire de fichiers, le programme est également un client FTP et peut parcourir les réseaux SMB.
ru: GNOME Commander — это двухпанельный графический файловый менеджер для рабочего стола Linux, использующий библиотеки GNOME. В добавление к базовым функциям программа имеет обозреватель сети SMB и клиент FTP.

source: A file manager for the GNOME desktop environment -- Documentation files
ca: Un gestor de fitxers per a l'entorn d'escriptori GNOME -- Fitxers de documentació
fr: Un gestionnaire de fichiers pour l'environnement de bureau GNOME -- Fichiers de documentation
ru: Файловый менеджер для среды рабочего стола GNOME — Файлы документации

source: Translations for package gnome-commander
ca: Traduccions per al paquet gnome-commander
fr: Traductions pour le paquet gnome-commander
ru: Переводы для пакета gnome-commander

source: Provides translations for the "gnome-commander" package.
ca: Proporciona traduccions per al paquet «gnome-commander».
fr: Fournit des traductions pour le paquet "gnome-commander".
ru: Предоставляет переводы для пакета «gnome-commander».

source: Common Files to Build GNOME
ca: Fitxers comuns per a construir el GNOME
fr: Fichiers communs pour construire GNOME
ru: Общие файлы для создания GNOME

source: Gnome-common includes files used by to build GNOME and GNOME applications.
ca: Gnome-common inclou els fitxers utilitzats per a construir el GNOME i les aplicacions del GNOME.
fr: Gnome-common inclut les fichiers utilisés pour construire GNOME et les applications GNOME.
ru: Gnome-common включает файлы, используемые для создания GNOME и его приложений.

source: Contacts Manager for GNOME
ca: Gestor de contactes per al GNOME
fr: Un gestionnaire de contacts pour GNOME
ru: Менеджер контактов для GNOME

source: The integraded address book for GNOME. Among its features are: * Search for and view contacts; * Edit contact details and make new contacts; * Integration with online address books; * Automatic linking of contacts from different online sources.
ca: La llibreta d'adreces integrada per al GNOME. Entre les seves característiques destaquen: * Cerca i visualització de contactes; * Edita les dades de contacte i fes contactes nous; * Integració amb llibretes d'adreces en línia; * Enllaç automàtic de contactes des de diferents fonts en línia.
fr: Le carnet d'adresses intégré pour GNOME. Parmi ses fonctionnalités, citons : * Recherche et affichage des contacts ; * Modification des détails des contacts et création de nouveaux contacts ; * Intégration avec les carnets d'adresses en ligne ; * Liaison automatique des contacts provenant de différentes sources en ligne.
ru: Интегрированная адресная книга для GNOME. Среди её особенностей: * Поиск и просмотр контактов; * Редактирование контактных данных и заведение новых контактов; * Интеграция с онлайн-адресными книгами; * Автоматическое связывание контактов из разных онлайн-источников.

source: Translations for package gnome-contacts
ca: Traduccions per al paquet gnome-contacts
fr: Traductions pour le paquet gnome-contacts
ru: Переводы для пакета gnome-contacts

source: Provides translations for the "gnome-contacts" package.
ca: Proporciona traduccions per al paquet «gnome-contacts».
fr: Fournit des traductions pour le paquet "gnome-contacts".
ru: Предоставляет переводы для пакета «gnome-contacts».

source: The GNOME Control Center
ca: El Centre de Control del GNOME
fr: Le centre de contrôle GNOME
ru: Центр управления GNOME

source: The control center is GNOME's main interface for configuration of various aspects of your desktop.
ca: El centre de control és la interfície principal del GNOME per a la configuració de diversos aspectes de l'escriptori.
fr: Le centre de contrôle est la principale interface de GNOME pour la configuration de nombreux aspects de votre bureau.
ru: Центр управления GNOME — это главный интерфейс для настройки различных аспектов вашего рабочего стола.

source: Configuration panel for color management
ca: Plafó de configuració per a la gestió del color
fr: Panneau de configuration de la gestion des couleurs.
ru: Панель настройки для управления цветопередачей

source: This package provides the color management configuration panel for GNOME control center.
ca: Aquest paquet proporciona el plafó de configuració de la gestió del color per al centre de control del GNOME.
fr: Ce paquetage fournit le panneau de configuration de la gestion des couleurs pour le centre de contrôle GNOME.
ru: Этот пакет предоставляет панель настройки для управления цветопередачей центра управления GNOME.

source: Header files for the GNOME Control Center
ca: Fitxers de capçalera per al Centre de Control del GNOME
fr: Fichiers d'en-tête pour le centre de contrôle GNOME
ru: Файлы заголовков для центра управления GNOME

source: Configuration panel for online accounts
ca: Panell de configuració per a comptes en línia
fr: Panneau de configuration pour les comptes en ligne
ru: Панель настройки сетевых учётных записей

source: This package provides the online accounts onfiguration panel for GNOME control center.
ca: Aquest paquet proporciona el plafó de comptes en línia onfiguration per al centre de control del GNOME.
fr: Ce paquet fournit le panneau de configuration des comptes en ligne pour le centre de contrôle GNOME.
ru: Этот пакет предоставляет панель настройки сетевых учётных записей для центра управления GNOME.

source: Translations for package gnome-control-center
ca: Traduccions per al paquet gnome-control-center
fr: Traductions pour le paquet gnome-control-center
ru: Переводы для пакета gnome-control-center

source: Provides translations for the "gnome-control-center" package.
ca: Proporciona traduccions per al paquet «gnome-control-center».
fr: Fournit des traductions pour le paquet "gnome-control-center".
ru: Предоставляет переводы для пакета «gnome-control-center».

source: Login manager user avatars
ca: Avatars d'usuari del gestor d'inici de sessió
fr: Avatars des utilisateurs du gestionnaire de connexion
ru: Аватары пользователей для окна входа

source: This package provides user avatars to be used by display managers
ca: Aquest paquet proporciona avatars d'usuari per a ser utilitzats pels gestors de pantalla
fr: Ce paquet fournit des avatars d'utilisateurs à utiliser par les gestionnaires d'affichage
ru: Этот пакет предоставляет аватары пользователей, отображаемые в окне входа в систему

source: Translations for package gnome-desktop
ca: Traduccions per al paquet gnome-desktop
fr: Traductions pour le paquet gnome-desktop
ru: Переводы для пакета gnome-desktop

source: Provides translations for the "gnome-desktop" package.
ca: Proporciona traduccions per al paquet «gnome-desktop».
fr: Fournit des traductions pour le paquet "gnome-desktop".
ru: Предоставляет переводы для пакета «gnome-desktop».

source: The GNOME Desktop API Library
ca: La biblioteca API de l'escriptori del GNOME
fr: La bibliothèque d'API du bureau GNOME
ru: Библиотека API рабочего стола GNOME

source: This package contains some desktop-wide documents.
ca: Aquest paquet conté alguns documents de tot l'escriptori.
fr: Ce paquet contient des documents pour l'ensemble du bureau.
ru: Этот пакет содержит некоторые документы рабочего стола.

source: Translations for package gnome-desktop2
ca: Traduccions per al paquet gnome-desktop2
fr: Traductions pour le paquet gnome-desktop2
ru: Переводы для пакета gnome-desktop2

source: Provides translations for the "gnome-desktop2" package.
ca: Proporciona traduccions per al paquet «gnome-desktop2».
fr: Fournit des traductions pour le paquet "gnome-desktop2".
ru: Предоставляет переводы для пакета gnome-desktop2.

source: GNOME Platform Documentation
ca: Documentació de la plataforma GNOME
fr: Documentation sur la plate-forme GNOME
ru: Документация платформы GNOME

source: This package contains documents that are useful for GNOME developers.
ca: Aquest paquet conté documents que són útils per als desenvolupadors del GNOME.
fr: Ce paquet contient des documents utiles aux développeurs GNOME.
ru: Этот пакет содержит документацию, полезную для разработчиков GNOME.

source: Translations for package gnome-devel-docs
ca: Traduccions per als paquets gnome-devel-docs
fr: Traductions pour le paquet gnome-devel-docs
ru: Переводы для пакета gnome-devel-docs

source: Provides translations for the "gnome-devel-docs" package.
ca: Proporciona traduccions per al paquet «gnome-devel-docs».
fr: Fournit des traductions pour le paquet "gnome-devel-docs".
ru: Предоставляет переводы для пакета «gnome-devel-docs».

source: Utility to look up words in dictionary sources
ca: Utilitat per a cercar paraules a les fonts del diccionari
fr: Utilité de la recherche de mots dans les dictionnaires
ru: Утилита для поиска слов в словарных источниках

source: The Dictionary application enables you to search words and terms on a dictionary source.
ca: L'aplicació Diccionari us permet cercar paraules i termes en una font de diccionari.
fr: L'application Dictionnaire vous permet de rechercher des mots et des termes dans un dictionnaire.
ru: Приложение Словарь позволяет вам искать слова и термины в словарных источниках.

source: Translations for package gnome-dictionary
ca: Traduccions per al paquet gnome-dictionary
fr: Traductions pour le paquet gnome-dictionnaire
ru: Переводы для пакета gnome-dictionary

source: Provides translations for the "gnome-dictionary" package.
ca: Proporciona traduccions per al paquet «gnome-dictionary».
fr: Fournit des traductions pour le paquet "gnome-dictionary".
ru: Предоставляет переводы для пакета «gnome-dictionary».

source: Directory Thumbnailer
ca: Miniatura de directoris
fr: Répertoire de l'éditeur de vignettes
ru: Утилита создания миниатюр для каталогов

source: GNOME thumbnailer to generate thumbnails for directories.
ca: Miniatures del GNOME per a generar miniatures per als directoris.
fr: Un générateur de vignettes GNOME pour générer des vignettes pour les répertoires.
ru: Утилита GNOME для создания миниатюр для каталогов.

source: Translations for package gnome-directory-thumbnailer
ca: Traduccions per al paquet gnome-directory-thumbnailer
fr: Traductions pour le paquet gnome-directory-thumbnailer
ru: Переводы для пакета gnome-directory-thumbnailer

source: Provides translations for the "gnome-directory-thumbnailer" package.
ca: Proporciona traduccions per al paquet «gnome-directory-thumbnailer».
fr: Fournit des traductions pour le paquet "gnome-directory-thumbnailer".
ru: Предоставляет переводы для пакета «gnome-directory-thumbnailer».

source: Disks application for dealing with storage devices
ca: Aplicació de discs per a gestionar dispositius d'emmagatzematge
fr: Application Disques pour la gestion des périphériques de stockage
ru: Приложение для работы с устройствами хранения

source: The gnome-disk-utility project provides the Disks application for dealing with storage devices.
ca: El projecte gnome-disk-utility proporciona l'aplicació Disks per gestionar dispositius d'emmagatzematge.
fr: Le projet gnome-disk-utility fournit l'application Disks pour gérer les périphériques de stockage.
ru: Проект gnome-disk-utility предоставляет приложение «Диски» для работы с устройствами хранения.

source: Translations for package gnome-disk-utility
ca: Traduccions per al paquet gnome-disk-utility
fr: Traductions pour le paquet gnome-disk-utility
ru: Переводы для пакета gnome-disk-utility

source: Provides translations for the "gnome-disk-utility" package.
ca: Proporciona traduccions per al paquet «gnome-disk-utility».
fr: Fournit des traductions pour le paquet "gnome-disk-utility".
ru: Предоставляет переводы для пакета «gnome-disk-utility».

source: A Collection of Documentation Utilities for GNOME
ca: Una col·lecció d'utilitats de documentació per al GNOME
fr: Une coillection d'utilitaires de documentation pour GNOME
ru: Собрание утилит документации для GNOME

source: The gnome-doc-utils package is a collection of documentation utilities for the GNOME project. Notably, it contains utilities for building documentation and all auxiliary files in your source tree. It also contains the DocBook XSLT stylesheets that were once distributed with Yelp.
ru: Пакет gnome-doc-utils — это собрание утилит документации для проекта GNOME. В частности, он содержит утилиты для построения документации и все вспомогательные файлы в вашем исходном дереве. Он также содержит таблицы стилей DocBook XSLT, которые когда-то распространялись вместе с Yelp.

source: Translations for package gnome-doc-utils
ca: Traduccions per al paquet gnome-doc-utils
fr: Traductions pour le paquet gnome-doc-utils
ru: Переводы для пакета gnome-doc-utils

source: Provides translations for the "gnome-doc-utils" package.
ca: Proporciona traduccions per al paquet «gnome-doc-utils».
fr: Fournit des traductions pour le paquet "gnome-doc-utils".
ru: Предоставляет переводы для пакета «gnome-doc-utils».

source: Document Manager for GNOME
ca: Gestor de documents per al GNOME
fr: Gestionnaire de documents pour GNOME
ru: Менеджер документов для GNOME

source: Documents is a document manager application for GNOME.
ca: Documents és una aplicació de gestió de documents per al GNOME.
fr: Documents est une application de gestion de documents pour GNOME.
ru: «Документы» — это приложение для управления документами в GNOME.

source: Translations for package gnome-documents
ca: Traduccions per al paquet gnome-documents
fr: Traductions pour le paquet gnome-documents
ru: Переводы для пакета gnome-documents

source: Provides translations for the "gnome-documents" package.
ca: Proporciona traduccions per al paquet «gnome-documents».
fr: Fournit des traductions pour le paquet "gnome-documents".
ru: Предоставляет переводы для пакета «gnome-documents».

source: Shared data between GNOME Documents and GNOME Books
ru: Общие данные для документов GNOME и книгами GNOME

source: This package provides runtime information shared between GNOME Documents and GNOME Books.
ru: Этот пакет предоставляет информацию времени выполнения, общую для приложений «Документы» и «Книги» GNOME.

source: Daemon to use DVB devices
ca: Dimoni per utilitzar dispositius DVB
fr: Démon pour l'utilisation de périphériques DVB
ru: Демон для использования DVB-устройств

source: DVB Daemon is a daemon written in Vala to setup your DVB devices, record and watch TV shows and browse EPG. It can be controlled directly via its D-Bus interface or with UI applications that come with it.
ca: DVB Daemon és un dimoni escrit en Vala per a configurar els dispositius DVB, gravar i veure programes de televisió i navegar per l'EPG. Es pot controlar directament a través de la seva interfície D-Bus o amb aplicacions d'interfície d'usuari que l'acompanyen.
fr: DVB Daemon est un démon écrit en Vala pour configurer vos appareils DVB, enregistrer et regarder des émissions de télévision et parcourir l'EPG. Il peut être contrôlé directement via son interface D-Bus ou avec les applications d'interface utilisateur qui l'accompagnent.
ru: DVB Daemon — это демон, написанный на Vala, для настройки ваших устройств DVB, записи и воспроизведения ТВ-шоу и просмотра EPG. Им можно управлять напрямую через интерфейс D-Bus или с помощью графических приложений, которые поставляются с ним.

source: Translations for package gnome-dvb-daemon
ca: Traduccions per al paquet gnome-dvb-daemon
fr: Traductions pour le paquet gnome-dvb-daemon
ru: Переводы для пакета gnome-dvb-daemon

source: Provides translations for the "gnome-dvb-daemon" package.
ca: Proporciona traduccions per al paquet «gnome-dvb-daemon».
fr: Fournit des traductions pour le paquet "gnome-dvb-daemon".
ru: Предоставляет переводы для пакета «gnome-dvb-daemon».

source: Thumbnailer for EPub books
ca: Miniatureer per a llibres EPub
fr: Miniature pour les livres EPub
ru: Утилита создания миниатюр для книг EPub

source: Thumbnailer for EPub books.
ca: Miniatureer per a llibres EPub.
fr: Miniature pour les livres EPub.
ru: Утилита создания миниатюр для книг EPub.

source: Install firmware on devices
ca: Instal·la el microprogramari als dispositius
fr: Installer le firmware sur les appareils
ru: Установка прошивки на устройствах

source: This application can update, reinstall and downgrade firmware on devices supported by fwupd.
ca: Aquesta aplicació pot actualitzar, reinstal·lar i degradar el microprogramari en dispositius compatibles amb fwupd.
fr: Cette application permet de mettre à jour, de réinstaller et de rétrograder le firmware sur les appareils pris en charge par fwupd.
ru: Это приложение может обновлять, переустанавливать и понижать версию прошивки на устройствах, поддерживаемых fwupd.

source: Translations for package gnome-firmware
ca: Traduccions per al paquet gnome-firmware
fr: Traductions pour le paquet gnome-firmware
ru: Переводы для пакета gnome-firmware

source: Provides translations for the "gnome-firmware" package.
ca: Proporciona traduccions per al paquet «gnome-firmware».
fr: Fournit des traductions pour le paquet "gnome-firmware".
ru: Предоставляет переводы для пакета «gnome-firmware».

source: A font viewer utility for GNOME
ca: Una utilitat de visualització de tipus de lletra per al GNOME
fr: Un utilitaire de visualisation des polices de caractères pour GNOME
ru: Утилита просмотра шрифтов для GNOME

source: A utility to let you see the installed fonts at a glance.
ca: Una utilitat per a permetre veure els tipus de lletra instal·lats d'un cop d'ull.
fr: Un utilitaire qui vous permet de visualiser les polices de caractère installées en un coup d'œil.
ru: Программа позволяет посмотреть установленные шрифты.

source: Translations for package gnome-font-viewer
ca: Traduccions per al visor del paquet gnome-font-viewer
fr: Traductions pour le paquet gnome-font-viewer
ru: Переводы для пакета gnome-font-viewer

source: Provides translations for the "gnome-font-viewer" package.
ca: Proporciona traduccions per al paquet «gnome-font-viewer».
fr: Fournit des traductions pour le paquet "gnome-font-viewer".
ru: Предоставляет переводы для пакета «gnome-font-viewer».

source: Browse and play your games - all of them
ru: Ищите и играйте в свои игры — во все

source: Games is a GNOME application to browse your video games library and to easily pick and play a game from it.
ru: «Игры» — это приложение GNOME для просмотра вашей библиотеки видеоигр и лёгкого выбора и запуска игр.

source: Translations for package gnome-games
ru: Переводы для пакета gnome-games

source: Provides translations for the "gnome-games" package.
ru: Предоставляет переводы для пакета «gnome-games».

source: Build helpers for gnome game packages
ca: Construeix ajudants per als paquets de jocs del gnome
fr: Aide à la construction des paquets de jeux gnome
ru: Помощники сборки для игровых пакетов GNOME

source: gnome-games-scripts is nothing more than a helper package producing the post scriptlets for various gnome-games descendents. The script does not serve much purpose out of this usecase.
ca: gnome-games-scripts no és més que un paquet d'ajuda que produeix els scriptlets post per a diversos descendents de gnome-games. L'script no té molt propòsit fora d'aquest cas d'ús.
fr: gnome-games-scripts n'est rien d'autre qu'un paquet d'aide produisant les post-scriptlets pour divers descendants de gnome-games. Le script ne sert pas à grand chose en dehors de ce cas d'utilisation.
ru: gnome-games-scripts — это не что иное, как вспомогательный пакет, создающий пост-сценарии для различных потомков gnome-games. Сценарий не имеет особой цели, кроме этого варианта использования.

source: Getting started with GNOME - Documentation
ca: Començar amb el GNOME - Documentació
fr: Débuter avec GNOME - Documentation
ru: Начало работы с GNOME — Документация

source: This package contains the Getting Started guide which is packaged and shipped as gnome-getting-started-docs in the core GNOME distribution.
ca: Aquest paquet conté la guia Getting Started que s'empaqueta i s'envia com a gnome-getting-started-docs a la distribució del nucli del GNOME.
fr: Ce paquet contient le guide de démarrage qui est empaqueté et livré en tant que gnome-getting-started-docs dans la distribution principale de GNOME.
ru: Этот пакет содержит руководство по началу работы, которое упаковано и поставлено в виде документации gnome-getting-started-docs в основном дистрибутиве GNOME.

source: Translations for package gnome-getting-started-docs
ca: Traduccions per als paquets gnome-getting-started-docs
fr: Traductions pour le paquet gnome-getting-started-docs
ru: Переводы для пакета gnome-getting-started-docs

source: Provides translations for the "gnome-getting-started-docs" package.
ca: Proporciona traduccions per al paquet «gnome-getting-started-docs».
fr: Fournit des traductions pour le paquet "gnome-getting-started-docs".
ru: Предоставляет переводы для пакета «gnome-getting-started-docs».

source: Gmail Notifier for GNOME
ca: Notificador de Gmail per al GNOME
fr: Notificateur Gmail pour GNOME
ru: Программа уведомлений Gmail для GNOME

source: GNOME Gmail Notifier is an application that provides periodic updates that pertain to the user's gmail inbox. The Notifier presents itself as a system tray icon displaying a small balloon popup when the user receives new mail.
ca: El Notificador Gmail del GNOME és una aplicació que proporciona actualitzacions periòdiques que pertanyen a la safata d'entrada de gmail de l'usuari. El Notificador es presenta com una icona de la safata del sistema que mostra un petit globus emergent quan l'usuari rep correu nou.
fr: GNOME Gmail Notifier est une application qui fournit des mises à jour périodiques concernant la boîte de réception gmail de l'utilisateur. Le Notificateur se présente sous la forme d'une icône de la barre d'état système affichant une petite bulle lorsque l'utilisateur reçoit un nouveau courrier.
ru: GNOME Gmail Notifier — это приложение, которое обеспечивает периодические обновления, относящиеся к почтовому ящику пользователя gmail. Notifier представляет собой значок на панели задач, отображающий небольшое всплывающее окно, когда пользователь получает новую почту.

source: Translations for package gnome-gmail-notifier
ca: Traduccions per al paquet gnome-gmail-notifier
fr: Traductions pour le paquet gnome-gmail-notifier
ru: Переводы для пакета gnome-gmail-notifier

source: Provides translations for the "gnome-gmail-notifier" package.
ca: Proporciona traduccions per al paquet «gnome-gmail-notifier».
fr: Fournit des traductions pour le paquet "gnome-gmail-notifier".
ru: Предоставляет переводы для пакета «gnome-gmail-notifier».

source: The default GNOME icon theme.
ca: El tema d'icones predeterminat del GNOME.
fr: Le thème d'icônes par défaut de GNOME.
ru: Тема значков по умолчанию для GNOME.

source: GNOME Icon Theme Extras
ca: Extres del tema d'icones del GNOME
fr: Thème d'icône GNOME supplémentaire
ru: Дополнительные темы значков GNOME

source: Extra GNOME icons for specific devices and file types.
ca: Icones addicionals del GNOME per a dispositius i tipus de fitxers específics.
fr: Icônes GNOME supplémentaires pour des appareils et des types de fichiers spécifiques.
ru: Дополнительные значки GNOME для конкретных устройств и типов файлов.
