Repository: openSUSE/packages-i18n
Catalog: */po/gnome.*.po
Languages: ca, fr, ru

source: Symbolic icon theme for GNOME
ca: Tema d'icones simbòlic per al GNOME
fr: Thème d'icône symbolique pour GNOME
ru: Символическая тема значков для GNOME

source: The purpose of this icon theme is to extend the base icon theme that follows the Tango style guidelines for specific purposes. This would include OSD messages, panel system/notification area, and possibly menu icons. Icons follow the naming specification, but have a -symbolic suffix, so only applications specifically looking up these symbolic icons will render them. If a -symbolic icon is missing, the app will fall back to the regular name.
ca: El propòsit d'aquest tema d'icones és estendre el tema d'icones base que segueix les directrius d'estil Tango per a propòsits específics. Això inclouria els missatges OSD, l'àrea del sistema del plafó/notificació i, possiblement, les icones del menú. Les icones segueixen l'especificació del nom, però tenen un sufix -simbòlic, de manera que només les aplicacions que busquin específicament aquestes icones simbòliques les representaran. Si falta una icona -simbòlica, l'aplicació tornarà al nom habitual.
fr: L'objectif de ce thème d'icônes est d'étendre le thème d'icônes de base qui suit les directives de style Tango à des fins spécifiques. Il s'agit notamment des messages OSD, du système de panneaux/de la zone de notification et, éventuellement, des icônes de menu. Les icônes suivent la spécification de dénomination, mais ont un suffixe -symbolique, de sorte que seules les applications recherchant spécifiquement ces icônes symboliques les rendront. Si une icône symbolique est manquante, l'application se rabattra sur le nom normal.
ru: Целью этой темы значков является расширение базовой темы значков для специальных применений, следуя стилевым принципам Tango. Её можно использовать для экранных сообщений, панели, области уведомлений и, возможно, для значков меню. Значки соблюдают правила наименования, но имеют суффикс -symbolic, так что только приложения, которые специально ищут такие значки, смогут ими воспользоваться. Если символический значок отсутствует, приложение перейдёт обратно на обычное имя.

source: GNOME Initial Setup Assistant
ca: Assistent de configuració inicial del GNOME
fr: Assistant d'installation initiale de GNOME
ru: Помощник начальной настройки GNOME

source: Initial assistant, helping you to get the system up and running.
ca: Assistent inicial, que us ajuda a posar en marxa el sistema.
fr: Assistant initial, qui vous aide à mettre le système en place et à le faire fonctionner.
ru: Начальный помощник, помогающий вам запустить систему.

source: Translations for package gnome-initial-setup
ca: Traduccions per al paquet gnome-initial-setup
fr: Traductions pour le paquet gnome-initial-setup
ru: Переводы для пакета gnome-initial-setup

source: Provides translations for the "gnome-initial-setup" package.
ca: Proporciona traduccions per al paquet «gnome-initial-setup».
fr: Fournit des traductions pour le paquet "gnome-initial-setup".
ru: Предоставляет переводы для пакета «gnome-initial-setup».

source: Live Internet radio broadcaster discovery program
ca: Programa de descobriment de locutors de ràdio per Internet en directe
fr: Programme de découverte des diffuseurs de radio en direct sur Internet
ru: Программа для обнаружения живых интернет-радиопередач

source: GNOME Internet Radio Locator is a program that allows locating free Internet radio stations by broadcasters with the help of a map. It is developed with GNOME Maps, libchamplain and geocode-lib. You can view all the stations in src/gnome-internet-radio-locator.xml and enter city names in the GUI search input field in order to locate radio stations in the city using the text search with auto-completion.
ca: GNOME Internet Radio Locator és un programa que permet localitzar emissores de ràdio d'Internet gratuïtes per part d'emissores amb l'ajuda d'un mapa. Es desenvolupa amb GNOME Maps, libchamplain i geocode-lib. Podeu veure totes les estacions a src/gnome-internet-radio-locator.xml i introduir els noms de les ciutats al camp d'entrada de cerca de la IGU per localitzar les estacions de ràdio a la ciutat utilitzant la cerca de text amb autocompleció.
fr: GNOME Internet Radio Locator est un programme qui permet de localiser les stations de radio Internet gratuites par diffuseur à l'aide d'une carte. Il est développé avec GNOME Maps, libchamplain et geocode-lib. Vous pouvez voir toutes les stations dans src/gnome-internet-radio-locator.xml et entrer le nom des villes dans le champ de recherche de l'interface graphique afin de localiser les stations de radio dans la ville en utilisant la recherche textuelle avec auto-complétion.
ru: GNOME Internet Radio Locator — это программа, которая позволяет находить бесплатные интернет-радиостанции с помощью карты. Он разработан с помощью GNOME Maps, libchamplain и geocode-lib. Вы можете просмотреть все станции в src/gnome-internet-radio-locator.xml и ввести названия городов в поле ввода поиска графического интерфейса пользователя, чтобы найти радиостанции в городе, используя текстовый поиск с автозаполнением.

source: Translations for package gnome-internet-radio-locator
ca: Traduccions per al paquet gnome-internet-radio-locator
fr: Traductions pour le paquet gnome-internet-radio-locator
ru: Переводы для пакета gnome-internet-radio-locator

source: Provides translations for the "gnome-internet-radio-locator" package.
ca: Proporciona traduccions per al paquet «gnome-internet-radio-locator».
fr: Fournit des traductions pour le paquet "gnome-internet-radio-locator".
ru: Предоставляет переводы для пакета «gnome-internet-radio-locator».

source: GNOME Keyring
ca: Anell de claus GNOME
fr: Porte-clés GNOME
ru: Связка ключей GNOME

source: The GNOME Keyring is a daemon in the session, similar to ssh-agent, and other applications can use it to store passwords and other sensitive information. The program can manage several keyrings, each with its own master password, and there is also a session keyring which is never stored to disk, but forgotten when the session ends.
ca: L'anell de claus del GNOME és un dimoni de la sessió, similar al ssh-agent, i altres aplicacions poden utilitzar-lo per a emmagatzemar contrasenyes i altra informació sensible. El programa pot gestionar diversos anells de claus, cadascun amb la seva pròpia contrasenya mestra, i també hi ha un anell de claus de sessió que mai s'emmagatzema al disc, però s'oblida quan acaba la sessió.
fr: Le trousseau GNOME est un démon dans la session, similaire à ssh-agent, et d'autres applications peuvent l'utiliser pour stocker des mots de passe et d'autres informations sensibles. Le programme peut gérer plusieurs trousseaux de clés, chacun avec son propre mot de passe principal, et il existe également un trousseau de clés de session qui n'est jamais stocké sur le disque, mais qui est oublié lorsque la session se termine.
ru: Связка ключей GNOME — это сессионный демон, похожий на ssh-agent, который может использоваться другими приложениями для хранения паролей и другой конфиденциальной информации. Приложение может управлять несколькими связками ключей, каждая со своим главным паролем, а ещё есть связка ключей для сессии, которая никогда не хранится на диске и исчезает по окончанию сессии.

source: Translations for package gnome-keyring
ca: Traduccions per a l'anell de claus gnome del paquet
fr: Traductions pour le paquet gnome-keyring
ru: Переводы для пакета gnome-keyring

source: Provides translations for the "gnome-keyring" package.
ca: Proporciona traduccions per al paquet «gnome-keyring».
fr: Fournit des traductions pour le paquet "gnome-keyring".
ru: Предоставляет переводы для пакета «gnome-keyring».

source: GNOME Keyring - PAM module
ca: Anell de claus del GNOME - Mòdul PAM
fr: Porte-clés GNOME - Module PAM
ru: Связка ключей GNOME — модуль PAM

source: The GNOME Keyring is a daemon in the session, similar to ssh-agent, and other applications can use it to store passwords and other sensitive information. The program can manage several keyrings, each with its own master password, and there is also a session keyring which is never stored to disk, but forgotten when the session ends. The PAM module can be used to unlock the keyring on login.
ca: L'anell de claus del GNOME és un dimoni de la sessió, similar al ssh-agent, i altres aplicacions poden utilitzar-lo per a emmagatzemar contrasenyes i altra informació sensible. El programa pot gestionar diversos anells de claus, cadascun amb la seva pròpia contrasenya mestra, i també hi ha un anell de claus de sessió que mai s'emmagatzema al disc, però s'oblida quan acaba la sessió. El mòdul PAM es pot utilitzar per desbloquejar l'anell de claus en iniciar la sessió.
fr: Le trousseau GNOME est un démon dans la session, similaire à ssh-agent, et d'autres applications peuvent l'utiliser pour stocker des mots de passe et d'autres informations sensibles. Le programme peut gérer plusieurs trousseaux de clés, chacun avec son propre mot de passe principal, et il existe également un trousseau de clés de session qui n'est jamais stocké sur le disque, mais qui est oublié à la fin de la session. Le module PAM peut être utilisé pour déverrouiller le trousseau lors de la connexion.
ru: Связка ключей GNOME — это сессионный демон, похожий на ssh-agent, который может использоваться другими приложениями для хранения паролей и другой конфиденциальной информации. Приложение может управлять несколькими связками ключей, каждая со своим главным паролем, а ещё есть связка ключей для сессии, которая никогда не хранится на диске и исчезает по окончанию сессии. Модуль PAM может разблокировать связку ключей при входе пользователя в систему.

source: Managed Implementation of libgnome-keyring
ca: Implementació gestionada de l'anell de claus de libgnome
fr: Implémentation administrée de libgnome-keyring
ru: Реализация управления libgnome-keyring

source: When the gnome-keyring-daemon is running, you can use this to retrieve/store confidential information such as passwords, notes or network services user information.
ca: Quan s'està executant el dimoni gnome-keyring-daemon, podeu utilitzar això per recuperar/emmagatzemar informació confidencial com contrasenyes, notes o informació d'usuari de serveis de xarxa.
fr: Lorsque le démon gnome-keyring est en cours d'exécution, vous pouvez l'utiliser pour récupérer/stocker des informations confidentielles telles que des mots de passe, des notes ou des informations sur les utilisateurs des services réseau.
ru: Если работает служба gnome-keyring-daemon, вы можете использовать этот пакет получать и сохранять конфиденциальную информацию, такую как пароли, заметки или сетевые настройки пользователя.

source: Managed implementation of libgnome-keyring
ca: Implementació gestionada de libgnome-keyring
fr: Implémentation administrée de libgnome-keyring
ru: Управляемая реализация libgnome-keyring

source: When the gnome-keyring-daemon is running, you can use this to retrieve and store confidential information such as passwords, notes or network services user information.
ca: Quan s'està executant el dimoni gnome-keyring-daemon, podeu utilitzar això per recuperar i emmagatzemar informació confidencial com contrasenyes, notes o informació d'usuari de serveis de xarxa.
fr: Lorsque le démon gnome-keyring est en cours d'exécution, vous pouvez l'utiliser pour récupérer et stocker des informations confidentielles telles que des mots de passe, des notes ou des informations sur les utilisateurs des services réseau.
ru: Если работает служба gnome-keyring-daemon, вы можете использовать этот пакет, чтобы получать и сохранять конфиденциальную информацию, такую как пароли, заметки или сетевые настройки пользователя.

source: GNOME OpenGPG key signing helper
ca: Ajudant per a la signatura de claus OpenGPG del GNOME
fr: Aide à la signature de clés GNOME OpenGPG
ru: Вспомогательная утилита подписи ключей OpenGPG для GNOME

source: Its purpose is to ease signing other peoples' keys. It is similar to caff, PIUS, or monkeysign. In fact, it is influenced a lot by these tools and either reimplements ideas or reuses code. Consider either of the aboved mentioned tools when you need a much more mature codebase.
ca: El seu propòsit és facilitar la signatura de les claus d'altres pobles. És similar al caff, el PIUS o el monkeysign. De fet, està molt influenciat per aquestes eines i o bé reutilitza idees o bé reutilitza codi. Considereu qualsevol de les eines esmentades anteriorment quan necessiteu una base de codi molt més madura.
fr: Son but est de faciliter la signature des clés d'autres personnes. Il est similaire à caff, PIUS ou monkeysign. En fait, il est très influencé par ces outils et réimplante des idées ou réutilise du code. Considérez l'un ou l'autre des outils mentionnés ci-dessus lorsque vous avez besoin d'une base de code beaucoup plus mature.
ru: Её цель — облегчить подписывание ключей других людей. Она похожа на caff, PIUS или monkeysign. Фактически, эти инструменты сильно повлияли на неё, и она либо перерабатывает их идеи, либо повторно использует код. Рассмотрите любой из вышеупомянутых инструментов, если вам нужна гораздо более зрелая кодовая база.

source: Klotski Game for GNOME
ca: Joc del Klotski per al GNOME
fr: Jeu Klotski pour GNOME
ru: Игра Klotski для GNOME

source: Klotski is a puzzle game of which the objective is to get the patterned block to the marker, which is done by moving the blocks in its way.
ca: El Klotski és un joc de trencaclosques de què l'objectiu és aconseguir el bloc amb patró al marcador, el qual es fa movent els blocs en el seu camí.
fr: Klotski est un jeu de puzzle dont l'objectif est d'amener le bloc à motifs jusqu'au marqueur, en déplaçant les blocs qui se trouvent sur son chemin.
ru: Klotski — это игра-головоломка, цель которой — доставить узорчатый блок к маркеру, перемещая блоки на своем пути.

source: Translations for package gnome-klotski
ca: Traduccions per al paquet gnome-klotski
fr: Traductions pour le paquet gnome-klotski
ru: Переводы для пакета gnome-klotski

source: Provides translations for the "gnome-klotski" package.
ca: Proporciona traduccions per al paquet «gnome-klotski».
fr: Fournit des traductions pour le paquet "gnome-klotski".
ru: Предоставляет переводы для пакета «gnome-klotski».

source: GNOME System Log Viewer
ca: Visor del registre del sistema del GNOME
fr: Visionneur de journaux système pour GNOME
ru: Инструмент GNOME для просмотра системных журналов

source: A utility for viewing detailed event logs for the system.
ca: Una utilitat per veure els registres detallats d'esdeveniments del sistema.
fr: Utilitaire permettant d'afficher les journaux d'événements détaillés du système.
ru: Утилита для просмотра подробных журналов событий системы.

source: Translations for package gnome-logs
ca: Traduccions per a paquets gnome-logs
fr: Traductions pour le paquet gnome-logs
ru: Переводы для пакета gnome-logs

source: Provides translations for the "gnome-logs" package.
ca: Proporciona traduccions per al paquet «gnome-logs».
fr: Fournit des traductions pour le paquet "gnome-logs".
ru: Предоставляет переводы для пакета «gnome-logs».

source: Mahjong Solitaire Game for GNOME
ca: Joc solitari Mahjong per al GNOME
fr: Jeu de solitaire Mahjong pour GNOME
ru: Пасьянс Маджонг для GNOME

source: Mahjongg is a solitaire version of the classic Eastern tile game. It involves clearing as much of the board as possible by matching corresponding tiles and taking them out of play.
ca: Mahjongg és una versió solitària del clàssic joc de fitxes de l'Est. Implica netejar tant del tauler com sigui possible fent coincidir les fitxes corresponents i traient-les fora de joc.
fr: Mahjongg est une version solitaire du jeu de tuiles oriental classique. Il s'agit d'éliminer autant de cases que possible en associant les tuiles correspondantes et en les retirant du jeu.
ru: Маджонг — это вариант пасьянса на основе классической восточной игры. Она заключается в освобождении как можно большей части доски путем нахождения совпадающих плиток и вывода их из игры.

source: Translations for package gnome-mahjongg
ca: Traduccions per al paquet gnome-mahjongg
fr: Traductions pour le paquet gnome-mahjongg
ru: Переводы для пакета gnome-mahjongg

source: Provides translations for the "gnome-mahjongg" package.
ca: Proporciona traduccions per al paquet «gnome-mahjongg».
fr: Fournit des traductions pour le paquet "gnome-mahjongg".
ru: Предоставляет переводы для пакета «gnome-mahjongg».

source: Maps Application for GNOME
ca: Aplicació de mapes per al GNOME
fr: Application Maps pour GNOME
ru: Приложение Карты для GNOME

source: Maps is a maps application for GNOME 3. It allows viewing street maps from OpenStreetMaps and satellite imagery from Mapbox. You can also get directions for your journeys, whether on foot, by bike, or by car.
ca: Maps és una aplicació de mapes per al GNOME 3. Permet veure mapes de carrer des d'OpenStreetMaps i imatges de satèl·lit des de Mapbox. També pots fer indicacions per als teus viatges, ja sigui a peu, en bicicleta o en cotxe.
fr: Maps est une application de cartographie pour GNOME 3. Elle permet de visualiser les cartes routières d'OpenStreetMaps et l'imagerie satellite de Mapbox. Vous pouvez également obtenir des itinéraires pour vos déplacements, que ce soit à pied, à vélo ou en voiture.
ru: Карты — это картографическое приложение для GNOME 3. Оно позволяет просматривать карты улиц из OpenStreetMaps и спутниковые изображения из Mapbox. Вы также можете проложить маршрут для своих путешествий пешком, на велосипеде или на машине.

source: Translations for package gnome-maps
ca: Traduccions per als paquets gnome-maps
fr: Traductions pour le paquet gnome-maps
ru: Переводы для пакета gnome-maps

source: Provides translations for the "gnome-maps" package.
ca: Proporciona traduccions per al paquet «gnome-maps».
fr: Fournit des traductions pour le paquet "gnome-maps".
ru: Предоставляет переводы для пакета «gnome-maps».

source: The GNOME Desktop Menu
ca: El menú d'escriptori del GNOME
fr: Menu de bureau GNOME
ru: Меню рабочего стола GNOME

source: The package contains an implementation of the draft "Desktop Menu Specification" from freedesktop.org: http://www.freedesktop.org/Standards/menu-spec
ca: El paquet conté una implementació de l'esborrany «Desktop Menu Specification» de freedesktop.org: http://www.freedesktop.org/Standards/menu-spec
fr: Le paquet contient une implémentation du projet "Desktop Menu Specification" de freedesktop.org : http://www.freedesktop.org/Standards/menu-spec
ru: Этот пакет содержит реализацию черновика "Desktop Menu Specification" от freedesktop.org: http://www.freedesktop.org/Standards/menu-spec

source: The GNOME Desktop Menu -- openSUSE Menus Definitions
ca: El menú d'escriptori del GNOME -- openSUSE Menus Definicions
fr: Le menu du bureau GNOME -- Définitions des menus openSUSE
ru: Меню рабочего стола GNOME — описания меню openSUSE

source: The package contains an implementation of the draft "Desktop Menu Specification" from freedesktop.org: http://www.freedesktop.org/Standards/menu-spec This package provides the openSUSE definitions for menus.
ca: El paquet conté una implementació de l'esborrany «Desktop Menu Specification» de freedesktop.org: http://www.freedesktop.org/Standards/menu-spec Aquest paquet proporciona les definicions d'openSUSE per als menús.
fr: Le paquet contient une implémentation du projet "Desktop Menu Specification" de freedesktop.org : http://www.freedesktop.org/Standards/menu-spec Ce paquet fournit les définitions openSUSE pour les menus.
ru: Этот пакет содержит реализацию черновика "Desktop Menu Specification" от freedesktop.org: http://www.freedesktop.org/Standards/menu-spec Этот пакет предоставляет описания для меню openSUSE.

source: The GNOME Desktop Menu -- Upstream Menus Definitions
ca: El menú d'escriptori del GNOME -- Definicions dels menús de la font
fr: Le menu du bureau GNOME -- Définitions des menus en amont
ru: Меню рабочего стола GNOME — оригинальные описания меню

source: The package contains an implementation of the draft "Desktop Menu Specification" from freedesktop.org: http://www.freedesktop.org/Standards/menu-spec This package provides the upstream definitions for menus.
ca: El paquet conté una implementació de l'esborrany «Desktop Menu Specification» de freedesktop.org: http://www.freedesktop.org/Standards/menu-spec Aquest paquet proporciona les definicions de la font per als menús.
fr: Le paquet contient une implémentation du projet "Desktop Menu Specification" de freedesktop.org : http://www.freedesktop.org/Standards/menu-spec Ce paquet fournit les définitions en amont des menus.
ru: Этот пакет содержит реализацию черновика "Desktop Menu Specification" от freedesktop.org: http://www.freedesktop.org/Standards/menu-spec Этот пакет предоставляет оригинальные определения для меню.

source: Translations for package gnome-menus
ca: Traduccions per al paquet gnome-menus
fr: Traductions pour le paquet gnome-menus
ru: Переводы для пакета gnome-menus

source: Provides translations for the "gnome-menus" package.
ca: Proporciona traduccions per al paquet «gnome-menus».
fr: Fournit des traductions pour le paquet "gnome-menus".
ru: Предоставляет переводы для пакета «gnome-menus».

source: Minesweeper Game for GNOME
ca: Joc Minesweeper per al GNOME
fr: Jeu du démineur pour GNOME
ru: Игра Сапер для GNOME

source: This is the popular logic puzzle minesweeper, which includes avoiding mines while receiving clues for the location of the mines.
ca: Aquest és el trencaclosques de lògica popular minesweeper, que inclou evitar mines mentre es reben pistes per a la ubicació de les mines.
fr: Il s'agit du célèbre casse-tête logique Minesweeper, qui consiste à éviter les mines tout en recevant des indices sur l'emplacement des mines.
ru: Это популярная логическая игра сапер, в которой необходимо определить расположение мин, получая подсказки об их положении и не подорваться на мине.

source: Translations for package gnome-mines
ca: Traduccions per al paquet gnome-mines
fr: Traductions pour le paquet gnome-mines
ru: Переводы для пакета gnome-mines

source: Provides translations for the "gnome-mines" package.
ca: Proporciona traduccions per al paquet «gnome-mines».
fr: Fournit des traductions pour le paquet "gnome-mines".
ru: Предоставляет переводы для пакета «gnome-mines».

source: GNOME MPV is a simple GTK+ frontend for MPV.
ru: GNOME MPV — это простой интерфейс на GTK+ для MPV.

source: Translations for package gnome-mpv
ru: Переводы для пакета gnome-mpv

source: Provides translations for the "gnome-mpv" package.
ru: Предоставляет переводы для пакета «gnome-mpv».

source: Write an ISO file to multiple USB devices at once
ru: Записать файл ISO на несколько USB-устройств одновременно
