Repository: openSUSE/packages-i18n
Catalog: */po/gnome.*.po
Languages: ca, fr, ru

source: Sliding block puzzle game
ca: Joc de trencaclosques de blocs lliscants
fr: Jeu de puzzle par glissement de blocs
ru: Игра-головоломка с подвижными блоками

source: 2048 is a single-player sliding block puzzle game, in which the objective is to slide and merge same-numbered tiles on a grid to reach higher numbers.
ca: 2048 és un joc de trencaclosques de blocs lliscants d'un sol jugador, en el qual l'objectiu és lliscar i fusionar fitxes del mateix nombre en una quadrícula per assolir nombres més alts.
fr: 2048 est un jeu "Un joueur" de glissement de blocs de puzzle, dans lequel l'objectif est de combiner les blocs de même nombre sur une grille, pour obtenir de plus grand nombres.
ru: 2048 — однопользовательская игра-головоломка со скользящими блоками, цель которой состоит в том, чтобы двигать и объединять плитки с одинаковыми номерами в сетке, чтобы достигать больших чисел.

source: Translations for package gnome-2048
ca: Traduccions per al paquet gnome-2048
fr: Traductions pour le paquet gnome-2048
ru: Переводы для пакета gnome-2048

source: Provides translations for the "gnome-2048" package.
ca: Proporciona traduccions per al paquet «gnome-2048».
fr: Fournit des traductions pour le paquet "gnome-2048".
ru: Предоставляет переводы для пакета "gnome-2048".

source: Automatic archives creating and extracting library
ca: Crear i extreure la biblioteca automàticament
fr: Bibliothèque automatique de création et d'extraction d'archives
ru: Библиотека для автоматического создания и распаковки архивов

source: gnome-autoar provides functions, widgets, and gschemas for GNOME applications which want to use archives as a method to transfer directories over the Internet. This package brings files required to develop against gnome-autoar
ca: gnome-autoar proporciona funcions, ginys i gschemas per a les aplicacions del GNOME que volen utilitzar arxius com a mètode per a transferir directoris a través d'Internet. Aquest paquet porta els fitxers necessaris per a desenvolupar-se contra gnome-autoar
fr: gnome-autoar fournit des fonctions, des widgets et des gschemas pour les applications GNOME qui souhaitent utiliser les archives comme méthode de transfert de répertoires sur Internet. Ce paquet apporte les fichiers nécessaires pour développer avec gnome-autoar
ru: gnome-autoar предоставляет функции, виджеты и файлы gschema для приложений GNOME, желающих использовать архивы в качестве метода передачи каталогов через Интернет. Этот пакет предоставляет файлы, необходимые для разработки с использованием gnome-autoar

source: GNOME Backgrounds
ca: Fons del GNOME
fr: Fonds d'écran GNOME
ru: Фоновые рисунки GNOME

source: Background images from the GNOME project.
ca: Imatges de fons del projecte GNOME.
fr: Images de fond d'écran pour le projet GNOME.
ru: Фоновые изображения от проекта GNOME.

source: Translations for package gnome-backgrounds
ru: Переводы для пакета gnome-backgrounds

source: Provides translations for the "gnome-backgrounds" package.
ru: Предоставляет переводы для пакета «gnome-backgrounds».

source: GNOME Bluetooth graphical utilities
ca: utilitats gràfiques del Bluetooth del GNOME
fr: Utilitaires graphiques de GNOME pour Bluetooth
ru: Графические утилиты Bluetooth для GNOME

source: A set of graphical utilities to setup, monitor and use Bluetooth devices. This package provides the utilities, data files and manuals for GNOME Bluetooth.
ca: Un conjunt d'utilitats gràfiques per configurar, monitoritzar i utilitzar dispositius Bluetooth. Aquest paquet proporciona les utilitats, fitxers de dades i manuals per al GNOME Bluetooth.
fr: Un ensemble d'utilitaires graphiques pour configurer, contrôler et utiliser les périphériques Bluetooth. Ce paquet fournit les utilitaires, les fichiers de données et les manuels pour GNOME Bluetooth.
ru: Набор графических утилит для настройки, контроля и использования Bluetooth-устройств. Этот пакет предоставляет утилиты, файлы данных и руководства для GNOME Bluetooth.

source: Development files for the GNOME Bluetooth libraries
ca: Fitxers de desenvolupament per a les biblioteques Bluetooth del GNOME
fr: Fichiers de développement pour les bibliothèques Bluetooth de GNOME
ru: Файлы разработки для библиотек GNOME Bluetooth

source: A set of graphical utilities to setup, monitor and use Bluetooth devices. This package provides the necessary files for development with GNOME Bluetooth.
ca: Un conjunt d'utilitats gràfiques per configurar, monitoritzar i utilitzar dispositius Bluetooth. Aquest paquet proporciona els fitxers necessaris per al desenvolupament amb el GNOME Bluetooth.
fr: Un ensemble d'outils graphiques pour configurer, surveiller et utiliser des périphériques Bluetooth. Ce paquet est distribué avec les fichiers nécessaires au développement avec GNOME Bluetooth.
ru: Набор графических утилит для настройки, контроля и использования Bluetooth-устройств. Этот пакет предоставляет необходимые файлы для разработки с GNOME Bluetooth.

source: Translations for package gnome-bluetooth
ca: Traduccions per al paquet gnome-bluetooth
fr: Traductions pour le paquet gnome-bluetooth
ru: Переводы для пакета gnome-bluetooth

source: Provides translations for the "gnome-bluetooth" package.
ca: Proporciona traduccions per al paquet «gnome-bluetooth».
fr: Fournit des traductions pour le paquet "gnome-bluetooth".
ru: Предоставляет переводы для пакета «gnome-bluetooth».

source: An e-book manager application for GNOME
ru: Приложение менеджера электронных книг для GNOME

source: Books is an e-book manager application for GNOME.
ru: «Книги» — это приложение менеджера электронных книг для GNOME.

source: Translations for package gnome-books
ru: Переводы для пакета gnome-books

source: Provides translations for the "gnome-books" package.
ru: Предоставляет переводы для пакета «gnome-books».

source: A GNOME 3 application to access remote or virtual systems
ca: Una aplicació del GNOME 3 per accedir a sistemes remots o virtuals
fr: Une application GNOME 3 pour accéder à des systèmes distants ou virtuels
ru: Приложение GNOME 3 для доступа к удалённым или виртуальным системам

source: Boxes is an application to create, setup, access, and use: remote machines, remote and local virtual machines, and, when technology permits, applications on local virtual machines.
ca: Boxes és una aplicació per crear, configurar, accedir i utilitzar: màquines remotes, màquines virtuals remotes i locals, i, quan la tecnologia ho permeti, aplicacions en màquines virtuals locals.
fr: Boxes est une application qui permet de créer, de configurer, d'accéder et d'utiliser : des machines distantes, des machines virtuelles distantes et locales et, lorsque la technologie le permet, des applications sur des machines virtuelles locales.
ru: Boxes — это приложение для создания, настройки, доступа и использования удалённых компьютеров, удалённых и локальных виртуальных машин, и, когда технология позволяет, приложений на локальных виртуальных машинах.

source: Translations for package gnome-boxes
ca: Traduccions per als paquets gnome-boxes
fr: Langues pour le paquet gnome-boxes
ru: Переводы для пакета gnome-boxes

source: Provides translations for the "gnome-boxes" package.
ca: Proporciona traduccions per al paquet «gnome-boxes».
fr: Fournit les traductions au paquet "gnome-boxes".
ru: Предоставляет переводы для пакета «gnome-boxes».

source: A toolsmith for GNOME-based applications
ca: Un ferrer per a aplicacions basades en el GNOME
fr: Une boîte à outils pour les applications basées sur GNOME
ru: Инструментальщик для приложений на основе GNOME

source: Builder is an IDE for GNOME and a tool to help writing GNOME-based applications.
ca: Builder és un IDE per al GNOME i una eina per a ajudar a escriure aplicacions basades en el GNOME.
fr: Builder est un IDE pour GNOME et un outil d'aide à l'écriture d'applications basées sur GNOME.
ru: Builder — это IDE для GNOME и инструмент, помогающий писать приложения на основе GNOME.

source: Documentation files for the gnome-builder package
ca: Fitxers de documentació per al paquet gnome-builder
fr: Fichiers de documentation pour le paquet gnome-builder
ru: Файлы документации для пакета gnome-builder

source: Translations for package gnome-builder
ca: Traduccions per al gnome-builder del paquet
fr: Langues pour le paquet gnome-builder
ru: Переводы для пакета gnome-builder

source: Provides translations for the "gnome-builder" package.
ca: Proporciona traduccions per al paquet «gnome-builder».
fr: Fournit les traductions au paquet "gnome-builder".
ru: Предоставляет переводы для пакета «gnome-builder».

source: Code beautifier plugin for gnome-builder
ru: Плагин для улучшения кода gnome-builder

source: This package provides the beautifier plugin for gnome-builder.
ru: Этот пакет предоставляет плагин для улучшения кода gnome-builder.

source: Clang plugin for gnome-builder
ru: Плагин clang для gnome-builder

source: This package provides the clang plugin for gnome-builder.
ru: Этот пакет предоставляет плагин clang для gnome-builder.

source: A cmake plugin for gnome-builder
ru: Плагин cmake для gnome-builder

source: This package provides the cmake plugin for gnome-builder.
ru: Этот пакет предоставляет плагин cmake для gnome-builder.

source: Ctags plugin for gnome-builder
ru: Плагин ctags для gnome-builder

source: This package provides the ctags plugin for gnome-builder to enable code completion assistance in C/C++ using ctags.
ru: Этот пакет предоставляет плагин ctags для gnome-builder, чтобы включить поддержку завершения кода в C/C++ с использованием ctags.

source: Devhelp plugin for gnome-builder
ru: Плагин devhelp для gnome-builder

source: This package provides the devhelp plugin for gnome-builder.
ru: Этот пакет предоставляет плагин devhelp для gnome-builder.

source: Gettext plugin for gnome-builder
ru: Плагин gettext для gnome-builder

source: This package provides the gettext plugin for gnome-builder.
ru: Этот пакет предоставляет плагин gettext для gnome-builder.

source: Gnome-code-assistance plugin for gnome-builder
ru: Плагин gnome-code-assistance для gnome-builder

source: This package provides the gnome-code-assistance plugin for gnome-builder.
ru: Этот пакет предоставляет плагин gnome-code-assistance для gnome-builder.

source: HTML-completion plugin for gnome-builder
ru: Плагин завершения HTML для gnome-builder

source: This package provides the html-completion plugin for gnome-builder.
ru: Этот пакет предоставляет плагин завершения HTML для gnome-builder.

source: Jedi plugin for python3 code completion in gnome-builder
ca: Connector Jedi per a la compleció de codi python3 al gnome-builder
fr: Plugin Jedi pour la complétion de code python3 dans gnome-builder
ru: Плагин jedi для завершения кода Python3 в gnome-builder

source: This package provides the jedi plugin for code completion assistance in Python3 inside gnome-builder's editor.
ca: Aquest paquet proporciona el connector jedi per a l'assistència de compleció de codi en Python3 dins de l'editor del gnome-builder.
fr: Ce paquetage fournit le plugin jedi pour l'assistance à la complétion de code en Python3 dans l'éditeur de gnome-builder.
ru: Этот пакет предоставляет плагин jedi для поддержки завершения кода Python3 в редакторе gnome-builder.

source: Jhbuild plugin for gnome-builder
ca: Connector Jhbuild per al gnome-builder
fr: Greffon Jhbuild pour gnome-builder
ru: Плагин jhbuild для gnome-builder

source: This package provides the jhbuild plugin for gnome-builder.
ca: Aquest paquet proporciona el connector jhbuild per al gnome-builder.
fr: Ce paquet fournit le greffon jhbuild pour gnome-builder.
ru: Этот пакет предоставляет плагин jhbuild для gnome-builder.

source: Mingw plugin for gnome-builder
ru: Плагин mingw для gnome-builder

source: This package provides the mingw plugin for gnome-builder for cross-compilation support using mingw.
ru: Этот пакет предоставляет плагин mingw для gnome-builder, поддерживающий кросс-компиляцию с использованием mingw.

source: Symbol-tree plugin for gnome-builder
ru: Плагин symbol-tree для gnome-builder

source: This package provides the symbol-tree plugin for gnome-builder to show the symbol tree for the currently focused document.
ru: Этот пакет предоставляет плагин symbol-tree для отображения дерева символов в текущем документе gnome-builder.

source: Sysmon plugin for gnome-builder
ru: Плагин sysmon для gnome-builder

source: This package provides the system monitor plugin for gnome-builder.
ru: Этот пакет предоставляет плагин системного монитора для gnome-builder.

source: Todo plugin for gnome-builder
ru: Плагин todo для gnome-builder

source: This package provides the todo plugin for gnome-builder that enables the extraction of TODO items from projects.
ru: Этот пакет предоставляет плагин todo для gnome-builder, позволяющий извлекать пункты TODO из проектов.

source: Vala-pack plugin for gnome-builder
ru: Плагин vala-pack для gnome-builder

source: This package provides the vala-pack plugin for gnome-builder.
ru: Этот пакет предоставляет плагин vala-pack для gnome-builder.

source: XML-pack plugin for gnome-builder
ru: Плагин XML-pack для gnome-builder

source: This package provides the xml-pack plugin for gnome-builder.
ru: Этот пакет предоставляет плагин xml-pack для gnome-builder.

source: A GNOME Calculator Application
ca: Una aplicació de càlcul del GNOME
fr: Une calculatrice GNOME
ru: Приложение Калькулятор GNOME

source: A GNOME calculator package based on calctool and MP library.
ca: Un paquet de calculadora del GNOME basat en calctool i la biblioteca MP.
fr: Une calculatrice GNOME basée sur calctool et la bibliothèque MP.
ru: Калькулятор GNOME основан на calctool и библиотеке MP.

source: Development files for gnome-calculator
ca: Fitxers de desenvolupament per al gnome-calculator
fr: Fichiers de développement pour gnome-calculator
ru: Файлы разработки для gnome-calculator

source: The gnome-calculator-devel package contains libraries and header files for developing applications that use gnome-calculator.
ca: El paquet gnome-calculator-devel conté biblioteques i fitxers de capçalera per al desenvolupament d'aplicacions que utilitzen gnome-calculator.
fr: Le paquet gnome-calculator-devel contient des bibliothèques et des fichiers d'en-tête pour le développement d'applications utilisant gnome-calculator.
ru: Пакет gnome-calculator-devel содержит библиотеки и файлы заголовков для разработки приложений, использующих gnome-calculator.

source: Translations for package gnome-calculator
ca: Traduccions per al paquet gnome-calculator
fr: Traductions pour le paquet gnome-calculator
ru: Переводы для пакета gnome-calculator

source: Provides translations for the "gnome-calculator" package.
ca: Proporciona traduccions per al paquet «gnome-calculator».
fr: Fournit des traductions pour le paquet "gnome-calculator".
ru: Предоставляет переводы для пакета «gnome-calculator».

source: A calendar application for GNOME
ca: Una aplicació de calendari per al GNOME
fr: Une application de calendrier pour GNOME
ru: Приложение календаря для GNOME

source: Calendar is a calendar application for GNOME.
ca: Calendar és una aplicació de calendari per al GNOME.
fr: Calendar est une application de calendrier pour GNOME.
ru: Календарь — приложение календаря для GNOME.

source: Translations for package gnome-calendar
ca: Traduccions per al paquet gnome-calendar
fr: Traductions pour le paquet gnome-calendar
ru: Переводы для пакета gnome-calendar

source: Provides translations for the "gnome-calendar" package.
ca: Proporciona traduccions per al paquet «gnome-calendar».
fr: Fournit des traductions pour le paquet "gnome-calendar".
ru: Предоставляет переводы для пакета «gnome-calendar».

source: Character Map
ca: Mapa de caràcters
fr: Table de caractères
ru: Таблица символов

source: A simple utility application to find and insert unusual characters.
ca: Una aplicació d'utilitat senzilla per trobar i inserir caràcters inusuals.
fr: Un utilitaire pour rechercher et insérer des caractères inhabituels.
ru: Простая утилита-приложение для поиска и вставки необычных символов.

source: Translations for package gnome-characters
ca: Traduccions per a gnome-characters de paquets
fr: Traductions pour le paquet gnome-characters
ru: Переводы для пакета gnome-characters

source: Provides translations for the "gnome-characters" package.
ca: Proporciona traduccions per al paquet «gnome-characters».
fr: Fournit des traductions pour le paquet "gnome-characters".
ru: Предоставляет переводы для пакета «gnome-characters».

source: Chess Game for GNOME
ca: Joc d'escacs per al GNOME
fr: Jeu d'échecs pour GNOME
ru: Шахматы для GNOME

source: This is a game for playing the classic board game of chess, in which two players simulate a battle by capturing the opponents pieces and ultimately the king. It can be played in 2D or 3D mode, full screen or in a window.
ca: Aquest és un joc per jugar el joc de taula clàssic dels escacs, en el qual dos jugadors simulen una batalla capturant les peces dels oponents i, en última instància, el rei. Es pot jugar en mode 2D o 3D, a pantalla completa o en una finestra.
fr: Le classique jeu d'échecs, où deux adversaires s'affrontent dans le but de capturer les pièces adverses, et ainsi vaincre le roi. Les modes 2D et 3D sont disponibles, ainsi que la possibilité de jouer en plein-écran.
ru: Это программа для игры в классическую настольную игру шахматы, в которой два игрока сражаются за захват фигур соперника и в конечном итоге короля противника. В программе есть 2D и 3D режимы, работа в окне или на весь экран.

source: Translations for package gnome-chess
ca: Traduccions per al paquet gnome-chess
fr: Traductions pour le paquet gnome-chess
ru: Переводы для пакета gnome-chess

source: Provides translations for the "gnome-chess" package.
ca: Proporciona traduccions per al paquet «gnome-chess».
fr: Fournit des traductions pour le paquet "gnome-chess".
ru: Предоставляет переводы для пакета «gnome-chess».

source: Clock application designed for GNOME 3
ca: Aplicació de rellotge dissenyada per al GNOME 3
fr: Horloge conçue pour GNOME 3
ru: Приложение часов, созданное для GNOME 3

source: A nice simple app to show the time, date, and alarms.
ca: Una aplicació senzilla per mostrar l'hora, la data i les alarmes.
fr: Une simple application pour consulter l'heure, la date ou pour paramétrer des alarmes.
ru: Приятное простое приложение для показа времени, даты и будильников.

source: Translations for package gnome-clocks
ca: Traduccions per al paquet gnome-clocks
fr: Traductions pour le paquet gnome-clocks
ru: Переводы для пакета gnome-clocks

source: Provides translations for the "gnome-clocks" package.
ca: Proporciona traduccions per al paquet «gnome-clocks».
fr: Fournit des traductions pour le paquet "gnome-clocks".
ru: Предоставляет переводы для пакета «gnome-clocks».

source: Code Assistance Service for Code Editors
ca: Servei d'assistència al codi per als editors de codi
fr: Service d'assistance aux éditeurs de code
ru: Служба поддержки кода для редакторов кода

source: gnome-code-assistance provides common code assistance services for code editors (simple editors as well as IDEs). It is an effort to provide a centralized code-assistance as a service for the GNOME platform instead of having every editor implement their own solution.
ca: gnome-code-assistance proporciona serveis d'assistència de codi comú per als editors de codi (editors simples així com IDE). Es tracta d'un esforç per a proporcionar una garantia de codi centralitzada com a servei per a la plataforma GNOME en lloc de fer que cada editor implementi la seva pròpia solució.
fr: gnome-code-assistance fournit des services communs d'assistance au code pour les éditeurs de code (éditeurs simples et IDE). Il s'agit d'un effort pour fournir une assistance au code centralisée en tant que service pour la plateforme GNOME au lieu que chaque éditeur implémente sa propre solution.
ru: gnome-code-assistance предоставляет общие службы поддержки кода для редакторов кода (простых редакторов, а также IDE). Это попытка предоставить централизованную помощь по коду в качестве службы для платформы GNOME вместо того, чтобы каждый редактор реализовывал свое собственное решение.

source: Color management tools for GNOME
ca: Eines de gestió del color per al GNOME
fr: Outils de gestion des couleurs pour GNOME
ru: Управление цветопередачей для GNOME

source: GNOME Color Manager is a session framework that makes it easy to manage, install and generate color profiles in the GNOME desktop.
ca: El Gestor de color del GNOME és un marc de treball de sessió que facilita la gestió, instal·lació i generació de perfils de color a l'escriptori GNOME.
fr: GNOME Color Manager est un cadre de session qui facilite la gestion, l'installation et la génération de profils de couleurs dans le bureau GNOME.
ru: GNOME Color Manager — это сеансовая инфраструктура, облегчающая управление, установку и создание цветовых профилей для рабочего стола GNOME.

source: Translations for package gnome-color-manager
ca: Traduccions per al paquet gnome-color-manager
fr: Traductions pour le paquet gnome-color-manager
ru: Переводы для пакета gnome-color-manager

source: Provides translations for the "gnome-color-manager" package.
ca: Proporciona traduccions per al paquet «gnome-color-manager».
fr: Fournit des traductions pour le paquet "gnome-color-manager".
ru: Предоставляет переводы для пакета «gnome-color-manager».

source: A complete, multi-colored suite of icons for Linux
ca: Un conjunt complet d'icones multicolor per a Linux
fr: Une suite complète d'icônes multicolores pour Linux
ru: Полный многоцветный набор иконок для Linux

source: The GNOME-Colors is a project that aims to make the GNOME desktop as elegant, consistent and colorful as possible. The current goal is to allow full color customization of themes, icons, GDM logins and splash screens. There are already five full color-schemes available; Brave (Blue), Human (Orange), Wine (Red), Noble (Purple) and Wise (Green). GNOME-Colors is mostly inspired/based on Tango, GNOME, Elementary, Tango-Generator and many other open-source projects.
ca: El GNOME-Colors és un projecte que té com a objectiu fer l'escriptori GNOME el més elegant, coherent i colorit possible. L'objectiu actual és permetre la personalització a tot color de temes, icones, inicis de sessió del GDM i pantalles de presentació. Ja hi ha cinc esquemes de colors complets disponibles; Brave (Blau), Human (Taronja), Wine (Red), Noble (Purple) i Wise (Green). GNOME-Colors està inspirat/basat principalment en Tango, GNOME, Elementary, Tango-Generator i molts altres projectes de codi obert.
fr: GNOME-Colors est un projet qui vise à rendre le bureau GNOME aussi élégant, cohérent et coloré à souhait. L'objectif actuel est de permettre une personnalisation complète des couleurs des thèmes, des icônes, des logins GDM et des écrans d'accueil. Cinq schémas de couleurs complets sont déjà disponibles : Brave (bleu), Human (orange), Wine (rouge), Noble (violet) et Wise (vert). GNOME-Colors s'inspire principalement de Tango, GNOME, Elementary, Tango-Generator et de nombreux autres projets open-source.
ru: GNOME-Colors — это проект, целью которого является сделать рабочий стол GNOME максимально элегантным, последовательным и ярким. В настоящее время цель состоит в том, чтобы сделать возможной полноцветную настройку тем, значков, логинов GDM и заставок. Уже доступно пять полных цветовых схем: Brave (синий), Human (оранжевый), Wine (красный), Noble (фиолетовый) and Wise (зелёный). GNOME-Colors в основном вдохновлён/основан на Tango, GNOME, Elementary, Tango-Generator и многих других проектах с открытым исходным кодом.

source: A file manager for the GNOME desktop environment
ca: Un gestor de fitxers per a l'entorn d'escriptori GNOME
fr: Un gestionnaire de fichiers pour l'environnement de bureau GNOME
ru: Файловый менеджер для среды рабочего стола GNOME
