Repository: openSUSE/packages-i18n
Catalog: */po/gnome.*.po
Languages: ca, fr, ru

source: Provides translations for the "gnome-screenshot" package.
ca: Proporciona traduccions per al paquet «gnome-screenshot».
fr: Fournit des traductions pour le paquet "gnome-screenshot".
ru: Предоставляет переводы для пакета «gnome-screenshot».

source: Utility to search for files
ca: Utilitat per a cercar fitxers
fr: Utilitaire pour chercher des fichiers
ru: Утилита для поиска файлов

source: The GNOME Seach Tool uses command-line tools such as find and locate to get results.
ca: L'eina GNOME Seach utilitza eines de línia d'ordres com ara Cerca i localitza per a obtenir resultats.
fr: L'outil de recherche GNOME utilise des outils de ligne de commande tels que find et locate pour obtenir des résultats.
ru: Инструмент поиска GNOME использует инструменты командной строки, такие как find и locate, для получения результатов.

source: Translations for package gnome-search-tool
ca: Traduccions per al paquet gnome-search-tool
fr: Traductions pour le paquet gnome-search-tool
ru: Переводы для пакета gnome-search-tool

source: Provides translations for the "gnome-search-tool" package.
ca: Proporciona traduccions per al paquet «gnome-search-tool».
fr: Fournit des traductions pour le paquet "gnome-search-tool".
ru: Предоставляет переводы для пакета «gnome-search-tool».

source: Session Tools for the GNOME Desktop
ca: Eines de sessió per a l'escriptori GNOME
fr: Outils de session pour le bureau GNOME
ru: Инструменты сеансов для рабочего стола GNOME

source: This package provides the basic session tools, like session management functionality, for the GNOME Desktop.
ca: Aquest paquet proporciona les eines bàsiques de sessió, com la funcionalitat de gestió de sessions, per a l'escriptori GNOME.
fr: Ce paquet fournit les outils de session de base, comme la fonctionnalité de gestion de session, pour le bureau GNOME.
ru: Этот пакет предоставляет основные инструменты для управления функциональностью сеансов рабочего стола GNOME.

source: Minimal version of the GNOME Session Manager
ca: Versió mínima del gestor de sessions del GNOME
fr: Version minimale du gestionnaire de session GNOME
ru: Минимальная версия диспетчера сеансов GNOME

source: This package contains a minimal version of gnome-session, that can be used for specific cases. The gnome-session package is needed for a fully functional GNOME desktop.
ca: Aquest paquet conté una versió mínima de gnome-session, que es pot utilitzar per a casos específics. El paquet gnome-session és necessari per a un escriptori GNOME completament funcional.
fr: Ce paquet contient une version minimale de gnome-session, qui peut être utilisée dans des cas spécifiques. Le paquet gnome-session est nécessaire pour un bureau GNOME pleinement fonctionnel.
ru: Этот пакет содержит минимальную версию gnome-session, которая может быть использована в особых случаях. Для полноценного функционирования рабочего стола GNOME требуется пакет gnome-session.

source: Default session support for the GNOME Session Manager
ca: Implementació predeterminada de la sessió per al gestor de sessions del GNOME
fr: Prise en charge de la session par défaut pour le gestionnaire de session GNOME
ru: Поддержка сеансов по умолчанию для диспетчера сеансов GNOME

source: This package contains the definition of the default GNOME session.
ca: Aquest paquet conté la definició de la sessió predeterminada del GNOME.
fr: Ce paquet contient la définition de la session GNOME par défaut.
ru: Этот пакет содержит определения для обычного сеанса GNOME.

source: Translations for package gnome-session
ca: Traduccions per al paquet gnome-session
fr: Traductions pour le paquet gnome-session
ru: Переводы для пакета gnome-session

source: Provides translations for the "gnome-session" package.
ca: Proporciona traduccions per al paquet «gnome-session».
fr: Fournit des traductions pour le paquet "gnome-session".
ru: Предоставляет переводы для пакета «gnome-session».

source: Wayland support for the GNOME Session Manager
ca: Implementació del Wayland per al gestor de sessions del GNOME
fr: Support Wayland pour le gestionnaire de session GNOME
ru: Поддержка Wayland для диспетчера сеансов GNOME

source: This package contains the definition of the default GNOME session on Wayland.
ca: Aquest paquet conté la definició de la sessió predeterminada del GNOME al Wayland.
fr: Ce paquet contient la définition de la session GNOME par défaut sur Wayland.
ru: Этот пакет содержит определение сеанса GNOME по умолчанию для Wayland.

source: Settings daemon for the GNOME desktop
ca: Dimoni de configuració per a l'escriptori GNOME
fr: Démon de paramétrage pour le bureau GNOME
ru: Демон настроек рабочего стола GNOME

source: gnome-settings-daemon provides a daemon run by all GNOME sessions to provide live access to configuration settings and the changes done to them as well as basic services like a clipboard manager, controlling the startup of the screensaver, etc. This module was previously part of GNOME Control Center, but has been split for a more general use.
ca: El gnome-settings-daemon proporciona un dimoni executat per totes les sessions del GNOME per a proporcionar accés directe a la configuració i els canvis que s'hi han fet, així com serveis bàsics com un gestor del porta-retalls, controlar l'inici de l'estalvi de pantalla, etc. Aquest mòdul formava part anteriorment del Centre de Control del GNOME, però s'ha dividit per a un ús més general.
fr: gnome-settings-daemon fournit un démon exécuté par toutes les sessions GNOME pour fournir un accès en direct aux paramètres de configuration et aux modifications qui y sont apportées, ainsi qu'à des services de base comme un gestionnaire de presse-papiers, le contrôle du démarrage de l'économiseur d'écran, etc. Ce module faisait auparavant partie du Centre de contrôle GNOME, mais il a été divisé pour une utilisation plus générale.
ru: gnome-settings-daemon предоставляет службу, которая используется всеми сеансами GNOME для обеспечения оперативного доступа к параметрам и их изменению, а также базовых функций, таких как управление буфером обмена, контроль запуска хранителя экрана и другие. Этот модуль раньше был частью Центра управления GNOME, но был выделен для более общего использования.

source: Development package for the GNOME settings daemon
ca: Paquet de desenvolupament per al dimoni de configuració del GNOME
fr: Paquet de développement pour le démon de configuration de GNOME
ru: Пакет разработки для демона настроек GNOME

source: gnome-settings-daemon provides a daemon run by all GNOME sessions to provide live access to configuration settings and the changes done to them as well as basic services like a clipboard manager, controlling the startup of the screensaver, etc. This package includes header files used for client applications to contact the settings daemon via its DBus interface.
ca: El gnome-settings-daemon proporciona un dimoni executat per totes les sessions del GNOME per a proporcionar accés directe a la configuració i els canvis que s'hi han fet, així com serveis bàsics com un gestor del porta-retalls, controlar l'inici de l'estalvi de pantalla, etc. Aquest paquet inclou els fitxers de capçalera utilitzats per a les aplicacions client per contactar amb el dimoni de configuració a través de la seva interfície DBus.
fr: gnome-settings-daemon fournit un démon exécuté par toutes les sessions GNOME pour fournir un accès en direct aux paramètres de configuration et aux modifications qui y sont apportées, ainsi qu'à des services de base comme un gestionnaire de presse-papiers, le contrôle du démarrage de l'économiseur d'écran, etc. Ce paquet inclut les fichiers d'en-tête utilisés par les applications clientes pour contacter le démon de configuration via son interface DBus.
ru: gnome-settings-daemon предоставляет службу, которая используется всеми сеансами GNOME для обеспечения оперативного доступа к параметрам и их изменению, а также базовых функций, таких как управление буфером обмена, контроль запуска хранителя экрана и другие. Этот пакет включает заголовочные файлы, используемые клиентскими приложениями для связи с демоном настроек через его интерфейс DBus.

source: Translations for package gnome-settings-daemon
ca: Traduccions per al paquet gnome-settings-daemon
fr: Traductions pour le paquet gnome-settings-daemon
ru: Переводы для пакета gnome-settings-daemon

source: Provides translations for the "gnome-settings-daemon" package.
ca: Proporciona traduccions per al paquet «gnome-settings-daemon».
fr: Fournit des traductions pour le paquet "gnome-settings-daemon".
ru: Предоставляет переводы для пакета «gnome-settings-daemon».

source: GNOME Shell
fr: Shell GNOME
ru: Оболочка GNOME

source: The GNOME Shell redefines user interactions with the GNOME desktop. In particular, it offers new paradigms for launching applications, accessing documents, and organizing open windows in GNOME.
ca: El GNOME Shell redefineix les interaccions de l'usuari amb l'escriptori GNOME. En particular, ofereix nous paradigmes per llançar aplicacions, accedir a documents i organitzar finestres obertes al GNOME.
fr: Le Shell GNOME redéfinit les interactions de l'utilisateur avec le bureau GNOME. En particulier, il offre de nouveaux paradigmes pour lancer des applications, accéder à des documents et organiser les fenêtres ouvertes dans GNOME.
ru: Оболочка GNOME Shell пересматривает взаимодействие пользователя с рабочим столом GNOME. В частности, она определяет новые парадигмы для запуска приложений, доступа к документам, а также работу с открытыми окнами в GNOME.

source: GNOME Shell Browser Plugin for the Extensions Repository
ru: Плагин браузера GNOME Shell для репозитория расширений

source: The GNOME Shell Browser Plugin provides integration with gnome-shell and the corresponding extensions repository. The plugin allows the extensions repository to provide good integration, letting the website know which extensions are enabled and disabled, and allowing the website to enable, disable and install them.
ru: Плагин браузера GNOME Shell обеспечивает интеграцию gnome-shell с соответствующим репозиторием расширений. Для обеспечения хорошей интеграции, плагин позволяет веб-сайту узнать, какие расширения включены или выключены, и позволяет веб-сайту включать, отключать и устанавливать их.

source: Evolution Calendar support for GNOME Shell
ca: Implementació del calendari de l'Evolution per al GNOME Shell
fr: Support du calendrier Evolution pour GNOME Shell
ru: Поддержка календаря Evolution для GNOME Shell

source: This package adds support for Evolution Calendar, such as appointments into GNOME Shell calendar.
ca: Aquest paquet afegeix suport per al Calendari de l'Evolution, com ara cites al calendari del GNOME Shell.
fr: Ce paquet ajoute la prise en charge du calendrier Evolution, comme les rendez-vous dans le calendrier GNOME Shell.
ru: Этот пакет добавляет в календарь GNOME Shell поддержку календаря Evolution, например, встреч.

source: A collection of extensions for Gnome-shell classic
ca: Una col·lecció d'extensions per al clàssic Gnome-shell
fr: Une collection d'extensions pour Gnome-shell classic
ru: Коллекция расширений для классической оболочки Gnome

source: This GNOME Shell extension adds a power off item in the status menu, and provides the ability to hibernate. This package provides the extensions required to switch to gnome-shell classic.
ca: Aquesta extensió del GNOME Shell afegeix un element apagat al menú d'estat i proporciona la possibilitat d'hibernar. Aquest paquet proporciona les extensions necessàries per a canviar al clàssic del «gnome-shell».
fr: Cette extension GNOME Shell ajoute un élément d'extinction dans le menu d'état, et offre la possibilité d'hiberner. Ce paquet fournit les extensions nécessaires pour passer à gnome-shell classic.
ru: Это расширение оболочки GNOME добавляет пункт выключения питания в меню статуса и предоставляет возможность ждущего режима. Этот пакет предоставляет расширения, необходимые для переключения к классической оболочке GNOME.

source: This packages provides architecture dependent session files to gnome-shell classic.
ru: Этот пакет предоставляет зависимые от архитектуры файлы сеанса для классической оболочки GNOME.

source: Development files for GNOME Shell
ca: Fitxers de desenvolupament per al GNOME Shell
fr: Fichiers de développement pour GNOME Shell
ru: Файлы разработки для GNOME Shell

source: Desktop icon support for GNOME Shell
ca: Implementació d'icones d'escriptori per al GNOME Shell
fr: Support des icônes de bureau pour GNOME Shell
ru: Поддержка значков на рабочем столе для GNOME Shell

source: This package provides a GNOME Shell extension for showing the contents of ~/Desktop on the desktop of the Shell. Common file management operations such as launching, copy/paste, rename and deleting are supported.
ca: Aquest paquet proporciona una extensió del GNOME Shell per a mostrar el contingut de /Desktop a l'escriptori del Shell. S'admeten operacions comunes de gestió de fitxers com ara llançar, copiar/enganxar, canviar el nom i suprimir.
fr: Ce paquet fournit une extension GNOME Shell pour afficher le contenu de ~/Desktop sur le bureau du Shell. Les opérations courantes de gestion de fichiers telles que le lancement, le copier/coller, le renommage et la suppression sont prises en charge.
ru: Этот пакет предоставляет расширение GNOME Shell для отображения содержимого ~/Desktop на рабочем столе оболочки. Поддерживаются стандартные операции управления файлами, такие как запуск, копирование/вставка, переименование и удаление.

source: Allow the user to change GNOME Shell Themes
ca: Permet a l'usuari canviar els temes de l'intèrpret d'ordres del GNOME
fr: Permet à l'utilisateur de modifier les thèmes du shell GNOME
ru: Разрешить пользователю изменять темы оболочки GNOME

source: This extension allows the user to switch to different themes. It's possible to pick system installed themes or even themes installed in the user's home.
ca: Aquesta extensió permet a l'usuari canviar a diferents temes. És possible triar temes instal·lats al sistema o fins i tot temes instal·lats a la llar de l'usuari.
fr: Cette extension permet à l'utilisateur de changer de thème. Il est possible de choisir des thèmes installés par le système ou même des thèmes installés chez l'utilisateur.
ru: Это расширение позволяет пользователю переключаться на разные темы. Можно выбрать темы, установленные в системе, или даже темы, установленные в домашнем каталоге пользователя.

source: Common files for GNOME Shell extensions
ca: Fitxers comuns per a les extensions del GNOME Shell
fr: Fichiers communs pour les extensions du Shell GNOME
ru: Общие файлы для расширений GNOME Shell

source: This package provides files common to several GNOME Shell Extensions
ca: Aquest paquet proporciona fitxers comuns a diverses extensions del GNOME Shell
fr: Ce paquet fournit des fichiers communs à plusieurs extensions du shell GNOME
ru: Этот пакет предоставляет файлы, общие для нескольких расширений GNOME Shell

source: Translations for package gnome-shell-extensions
ca: Traduccions per al paquet gnome-shell-extensions
fr: Traductions pour le paquet gnome-shell-extensions
ru: Переводы для пакета gnome-shell-extensions

source: Provides translations for the "gnome-shell-extensions" package.
ca: Proporciona traduccions per al paquet «gnome-shell-extensions».
fr: Fournit des traductions pour le paquet "gnome-shell-extensions".
ru: Предоставляет переводы для пакета «gnome-shell-extensions».

source: Translations for package gnome-shell
ca: Traduccions per al paquet gnome-shell
fr: Traductions pour le paquet gnome-shell
ru: Переводы для пакета gnome-shell

source: Provides translations for the "gnome-shell" package.
ca: Proporciona traduccions per al paquet «gnome-shell».
fr: Fournit des traductions pour le paquet "gnome-shell".
ru: Предоставляет переводы для пакета «gnome-shell».

source: Shell search provider for GNOME Boxes
ca: Proveïdor de cerca de l'intèrpret d'ordres per als quadres del GNOME
fr: Fournisseur de recherche dans le shell pour les boîtes GNOME
ru: Провайдер поиска оболочки GNOME для GNOME Boxes

source: Boxes is an application to create, setup, access, and use: remote machines, remote and local virtual machines, and, when technology permits, applications on local virtual machines. This package contains a search provider to enable GNOME Shell to get search results from Boxes.
ca: Boxes és una aplicació per crear, configurar, accedir i utilitzar: màquines remotes, màquines virtuals remotes i locals, i, quan la tecnologia ho permeti, aplicacions en màquines virtuals locals. Aquest paquet conté un proveïdor de cerca per a habilitar l'intèrpret d'ordres del GNOME per a obtenir resultats de cerca de Màquines.
fr: Boxes est une application permettant de créer, de configurer, d'accéder et d'utiliser des machines distantes, des machines virtuelles distantes et locales et, lorsque la technologie le permet, des applications sur des machines virtuelles locales. Ce paquet contient un fournisseur de recherche qui permet à GNOME Shell d'obtenir des résultats de recherche à partir de Boxes.
ru: Boxes — это приложение для создания, настройки, доступа и использования удалённых компьютеров, удалённых и локальных виртуальных машин, и, когда технология позволяет, приложений на локальных виртуальных машинах. В этом пакете содержится провайдер поиска, позволяющий оболочке GNOME получать результаты поиска из Boxes.

source: Contacts Manager for GNOME -- Search Provider for GNOME Shell
ca: Gestor de contactes per al GNOME -- Proveïdor de cerca per al GNOME Shell
fr: Gestionnaire de contacts pour GNOME -- Fournisseur de recherche pour GNOME Shell
ru: Менеджер контактов для GNOME — Модуль поиска для GNOME Shell

source: The integraded address book for GNOME. Among its features are: * Search for and view contacts; * Edit contact details and make new contacts; * Integration with online address books; * Automatic linking of contacts from different online sources. This package contains a search provider to enable GNOME Shell to get search results from contacts.
ca: La llibreta d'adreces integrada per al GNOME. Entre les seves característiques destaquen: * Cerca i visualització de contactes; * Edita les dades de contacte i fes contactes nous; * Integració amb llibretes d'adreces en línia; * Enllaç automàtic de contactes des de diferents fonts en línia. Aquest paquet conté un proveïdor de cerca per a habilitar l'intèrpret d'ordres del GNOME per a obtenir resultats de cerca dels contactes.
fr: Le carnet d'adresses intégré pour GNOME. Parmi ses fonctionnalités, citons * Recherche et affichage des contacts ; * Modification des détails des contacts et création de nouveaux contacts ; * Intégration avec les carnets d'adresses en ligne ; * Liaison automatique des contacts à partir de différentes sources en ligne. Ce paquet contient un fournisseur de recherche pour permettre à GNOME Shell d'obtenir des résultats de recherche à partir des contacts.
ru: Интегрированная адресная книга для GNOME. Среди её особенностей: * Поиск и просмотр контактов; * Редактирование контактных данных и заведение новых контактов; * Интеграция с онлайн-адресными книгами; * Автоматическое связывание контактов из разных онлайн-источников. Этот пакет содержит поисковый модуль, позволяющий GNOME Shell получать результаты поиска по контактам.

source: Document Manager for GNOME -- Search Provider for GNOME Shell
ca: Gestor de documents per al GNOME -- Proveïdor de cerca per al GNOME Shell
fr: Gestionnaire de documents pour GNOME -- Fournisseur de recherche pour le Shell GNOME
ru: Менеджер документов для GNOME — Модуль поиска для GNOME Shell

source: Documents is a document manager application for GNOME. This package contains a search provider to enable GNOME Shell to get search results from documents.
ca: Documents és una aplicació de gestió de documents per al GNOME. Aquest paquet conté un proveïdor de cerca per a habilitar el GNOME Shell per a obtenir resultats de cerca dels documents.
fr: Documents est une application de gestion de documents pour GNOME. Ce paquet contient un fournisseur de recherche qui permet au GNOME Shell d'obtenir des résultats de recherche à partir de documents.
ru: «Документы» — это приложение для управления документами в GNOME. Этот пакет содержит модуль поиска для GNOME Shell, позволяющий получать результаты поиска по документам.

source: GNOME Calculator -- Search Provider for GNOME Shell
ca: Calculadora del GNOME -- Proveïdor de cerca per al GNOME Shell
fr: GNOME Calculator -- Moteur de recherche pour GNOME Shell
ru: Калькулятор GNOME — Модуль поиска для GNOME Shell

source: This package contains a search provider to enable GNOME Shell to get search results from GNOME Calculator.
ca: Aquest paquet conté un proveïdor de cerca per a habilitar l'intèrpret d'ordres del GNOME per a obtenir resultats de cerca des de la Calculadora del GNOME.
fr: Ce paquet contient un moteur de recherche permettant à GNOME Shell d'obtenir des résultats de recherche à partir de la calculatrice GNOME.
ru: Этот пакет содержит модуль поиска, позволяющий оболочке GNOME получать результаты поиска из Калькулятора GNOME.

source: GNOME Shell search provider to return results from the GNOME Calendar
ca: Proveïdor de cerca del GNOME Shell per a retornar els resultats del calendari del GNOME
fr: Moteur de recherche du GNOME Shell pour renvoyer les résultats du calendrier GNOME
ru: Модуль поиска GNOME Shell для возврата результатов из календаря GNOME

source: This package contains a search provider to enable GNOME Shell to get search results from GNOME Calendar.
ca: Aquest paquet conté un proveïdor de cerca per a habilitar l'intèrpret d'ordres del GNOME per a obtenir resultats de cerca del calendari del GNOME.
fr: Ce paquet contient un moteur de recherche permettant à GNOME Shell d'obtenir des résultats de recherche à partir du calendrier GNOME.
ru: Этот пакет содержит модуль поиска, включающий в GNOME Shell результаты поиска из календаря GNOME.

source: GNOME Characters -- Search Provider for GNOME Shell
ca: Caràcters del GNOME -- Proveïdor de cerca per al GNOME Shell
fr: GNOME Characters -- Moteur de recherche pour GNOME Shell
ru: Символы GNOME — Служба поиска для GNOME Shell

source: This package contains a search provider to enable GNOME Shell to get search results from GNOME Characters.
ca: Aquest paquet conté un proveïdor de cerca per a habilitar l'intèrpret d'ordres del GNOME per a obtenir resultats de cerca dels caràcters del GNOME.
fr: Ce paquet contient un moteurr de recherche qui permet à GNOME Shell d'obtenir des résultats de recherche à partir de GNOME Characters.
ru: Этот пакет содержит модуль поиска, включающий в GNOME Shell результаты поиска из символов GNOME.

source: GNOME Clocks -- Search Provider for GNOME Shell
ca: Rellotges del GNOME -- Proveïdor de cerca per al GNOME Shell
fr: Horloges GNOME -- Moteur de recherche pour le Shell GNOME
ru: Часы GNOME — Модуль поиска для GNOME Shell

source: This package contains a search provider to enable GNOME Shell to get search results from GNOME Clocks.
ca: Aquest paquet conté un proveïdor de cerca per a habilitar l'intèrpret d'ordres del GNOME per a obtenir resultats de cerca dels rellotges del GNOME.
fr: Ce paquet contient un moteur de recherche permettant à GNOME Shell d'obtenir des résultats de recherche à partir des GNOME Clocks.
ru: Этот пакет содержит модуль поиска, позволяющий оболочке GNOME получать результаты поиска из Часов GNOME.

source: GNOME Photos -- Search Provider for GNOME Shell
ca: Fotos del GNOME -- Proveïdor de cerca per al GNOME Shell
fr: GNOME Photos -- Moteur de recherche pour GNOME Shell
ru: GNOME Photos — Модуль поиска для GNOME Shell
