Repository: openSUSE/packages-i18n
Catalog: */po/gnome.*.po
Languages: ca, fr, ru

source: This package contains a search provider to enable GNOME Shell to get search results from GNOME Photos.
ca: Aquest paquet conté un proveïdor de cerca per a habilitar l'intèrpret d'ordres del GNOME per a obtenir resultats de cerca de les fotografies del GNOME.
fr: Ce paquet contient un moteur de recherche permettant à GNOME Shell d'obtenir des résultats de recherche à partir de GNOME Photos.
ru: Этот пакет содержит модуль поиска, включающий в GNOME Shell результаты поиска из GNOME Photos.

source: A recipe app for GNOME -- Search Provider for GNOME Shell
ca: Una aplicació de recepta per al GNOME -- Search Provider per al GNOME Shell
fr: Une application de recettes pour GNOME -- Moteur de recherche pour GNOME Shell
ru: Приложение рецептов для GNOME — Модуль поиска для GNOME Shell

source: GNOME Recipes is an easy-to-use application that will help you to discover what to cook today, tomorrow, rest of the week and for your special occasions. Recipes comes with a collection of recipes that have been collected by GNOME contributors from all over the world. It also lets you store your own recipes, and share them with your friends. This package contains a search provider to enable GNOME Shell to get search results from Recipes.
ca: El GNOME Recipes és una aplicació fàcil d'utilitzar que us ajudarà a descobrir què cuinar avui, demà, resta de la setmana i per a les vostres ocasions especials. Receptes ve amb una col·lecció de receptes que han estat recollides per col·laboradors del GNOME de tot el món. També et permet guardar les teves pròpies receptes i compartir-les amb els teus amics. Aquest paquet conté un proveïdor de cerca per a permetre que el GNOME Shell obtingui resultats de cerca de les receptes.
fr: GNOME Recipes est une application facile à utiliser qui vous aidera à découvrir quoi cuisiner aujourd'hui, demain, le reste de la semaine et pour vos occasions spéciales. Recipes est livré avec une collection de recettes qui ont été rassemblées par des contributeurs GNOME du monde entier. Il vous permet également de stocker vos propres recettes et de les partager avec vos amis. Ce paquet contient un moteur de recherche qui permet à GNOME Shell d'obtenir des résultats de recherche à partir de Recipes.
ru: Рецепты GNOME — это простое в использовании приложение, которое поможет вам узнать, что готовить сегодня, завтра, в остальные дни недели и для особых случаев. Рецепты включает в себя сборник рецептов, собранных участниками GNOME со всего мира. Оно также позволяет вам хранить свои собственные рецепты и делиться ими с друзьями. Этот пакет содержит поисковый модуль, позволяющий GNOME Shell получать результаты поиска по рецептам.

source: GNOME Terminal -- Search Provider for GNOME Shell
ca: GNOME Terminal -- Proveïdor de cerca per al GNOME Shell
fr: GNOME Terminal -- Moteur de recherche pour GNOME Shell
ru: Терминал GNOME — Модуль поиска для GNOME Shell

source: This package contains a search provider to enable GNOME Shell to get search results from GNOME Terminal.
ca: Aquest paquet conté un proveïdor de cerca per a habilitar l'intèrpret d'ordres del GNOME per a obtenir resultats de cerca des del terminal del GNOME.
fr: Ce paquet contient un moteur de recherche permettant à GNOME Shell d'obtenir des résultats de recherche à partir de GNOME Terminal.
ru: Этот пакет содержит модуль поиска, позволяющий оболочке GNOME получать результаты поиска из Терминала GNOME.

source: GNOME Weather -- Search Provider for GNOME Shell
ca: GNOME Weather -- Proveïdor de cerca per al GNOME Shell
fr: GNOME Weather -- Moteur de recherche pour GNOME Shell
ru: Погода GNOME — Модуль поиска для оболочки GNOME

source: This package contains a search provider to enable GNOME Shell to get search results from GNOME Weather.
ca: Aquest paquet conté un proveïdor de cerca per a permetre que el GNOME Shell obtingui resultats de cerca del GNOME Weather.
fr: Ce paquet contient un moteur de recherche permettant à GNOME Shell d'obtenir des résultats de recherche à partir de GNOME Weather.
ru: Этот пакет содержит модуль поиска, включающий в оболочке GNOME результаты поиска из Фотографий GNOME.

source: GNOME Software Store
ca: Botiga de programari GNOME
fr: Magasin de logiciels GNOME
ru: Магазин программного обеспечения GNOME

source: AppStore like management of Applications for your GNOME Desktop.
ca: AppStore com la gestió d'aplicacions per a l'escriptori GNOME.
fr: Gestion d'applications pour votre bureau GNOME, à la manière de l'AppStore.
ru: Управление приложениями как в AppStore для вашего рабочего стола GNOME.

source: Development files for the GNOME software store
ca: Fitxers de desenvolupament per a la botiga de programari del GNOME
fr: Fichiers de développement pour la boutique de logiciels GNOME
ru: Файлы разработки для магазина программного обеспечения GNOME

source: This subpackage contains the header files for developing GNOME software store plugins.
ca: Aquest subpaquet conté els fitxers de capçalera per a desenvolupar connectors de la botiga de programari del GNOME.
fr: Ce sous-paquet contient les fichiers d'en-tête pour le développement des plugins de la boutique de logiciels GNOME.
ru: Этот пакет содержит файлы заголовков для разработки плагинов магазина программного обеспечения GNOME.

source: Translations for package gnome-software
ca: Traduccions per al paquet gnome-software
fr: Traductions pour le paquet gnome-software
ru: Переводы для пакета gnome-software

source: Provides translations for the "gnome-software" package.
ca: Proporciona traduccions per al paquet «gnome-software».
fr: Fournit des traductions pour le paquet "gnome-software".
ru: Предоставляет переводы для пакета «gnome-software».

source: Sound Recorder
ca: Enregistrador de so
fr: Enregistreur de son
ru: Запись звука

source: A simple, modern sound recorder.
ca: Una gravadora de so senzilla i moderna.
fr: Un enregistreur de son simple et moderne.
ru: Простой, современный диктофон.

source: Translations for package gnome-sound-recorder
ca: Traduccions per al paquet gnome-sound-recorder
fr: Traductions pour le paquet gnome-sound-recorder
ru: Переводы для пакета gnome-sound-recorder

source: Provides translations for the "gnome-sound-recorder" package.
ca: Proporciona traduccions per al paquet «gnome-sound-recorder».
fr: Fournit des traductions pour le paquet "gnome-sound-recorder".
ru: Предоставляет переводы для пакета «gnome-sound-recorder».

source: Subtitle editor for GNOME
ca: Editor de subtítols per al GNOME
fr: Éditeur de sous-titres pour GNOME
ru: Редактор субтитров для GNOME

source: Gnome Subtitles is a subtitle editor for the GNOME desktop. It supports the most common text-based subtitle formats and allows for subtitle editing, translation and synchronization.
ca: Gnome Subtitles és un editor de subtítols per a l'escriptori GNOME. És compatible amb els formats de subtítols basats en text més comuns i permet l'edició, traducció i sincronització de subtítols.
fr: nome Subtitles est un éditeur de sous-titres pour le bureau GNOME. Il prend en charge les formats de sous-titres textuels les plus courants et permet l'édition, la traduction et la synchronisation des sous-titres.
ru: Gnome Subtitles — это редактор субтитров для рабочего стола GNOME. Он поддерживает наиболее распространенные текстовые форматы субтитров и позволяет редактировать, переводить и синхронизировать субтитры.

source: Translations for package gnome-subtitles
ca: Traduccions per als paquets gnome-subtitles
fr: Traductions pour le paquet gnome-subtitles
ru: Переводы для пакета gnome-subtitles

source: Provides translations for the "gnome-subtitles" package.
ca: Proporciona traduccions per al paquet «gnome-subtitles».
fr: Fournit des traductions pour le paquet "gnome-subtitles".
ru: Предоставляет переводы для пакета «gnome-subtitles».

source: Sudoku Game for GNOME
ca: Joc Sudoku per al GNOME
fr: Jeu de sudoku pour GNOME
ru: Судоку для GNOME

source: Sudoku is a logic puzzle game, in which one must fill a 9 by 9 square with the correct digits.
ca: El Sudoku és un joc de trencaclosques lògic, en el qual s'ha d'omplir un quadrat de 9 per 9 amb els dígits correctes.
fr: Le Sudoku est un jeu de logique dans lequel il faut remplir un carré de 9 x 9 avec les bons chiffres.
ru: Судоку — это логическая игра, в которой нужно заполнить квадрат 9 на 9 правильными цифрами.

source: Translations for package gnome-sudoku
ca: Traduccions per al paquet gnome-sudoku
fr: Traductions pour le paquet gnome-sudoku
ru: Переводы для пакета gnome-sudoku

source: Provides translations for the "gnome-sudoku" package.
ca: Proporciona traduccions per al paquet «gnome-sudoku».
fr: Fournit des traductions pour le paquet "gnome-sudoku".
ru: Предоставляет переводы для пакета «gnome-sudoku».

source: A process monitor for the GNOME desktop
ca: Un monitor de processos per a l'escriptori GNOME
fr: Un moniteur de processus pour le bureau GNOME
ru: Монитор процессов для рабочего стола GNOME

source: GNOME-system-monitor is a process and system monitor for the GNOME Desktop. It shows you what programs are running and how much processor time, memory, and disk space are being used.
ca: GNOME-system-monitor és un monitor de procés i sistema per a l'escriptori GNOME. Us mostra quins programes s'estan executant i quant temps de processador, memòria i espai de disc s'estan utilitzant.
fr: GNOME-system-monitor est un moniteur de processus et de système pour le bureau GNOME. Il vous indique les programmes en cours d'exécution et la charge de travail du processeur, de la mémoire et de l'espace disque utilisés.
ru: GNOME-system-monitor — это монитор процессов и системы для рабочего стола GNOME. Он показывает, какие программы работают и сколько процессорного времени, памяти и дискового пространства используется.

source: Translations for package gnome-system-monitor
ca: Traduccions per al paquet gnome-system-monitor
fr: Traductions pour le paquet gnome-system-monitor
ru: Переводы для пакета gnome-system-monitor

source: Provides translations for the "gnome-system-monitor" package.
ca: Proporciona traduccions per al paquet «gnome-system-monitor».
fr: Fournit des traductions pour le paquet "gnome-system-monitor".
ru: Предоставляет переводы для пакета «gnome-system-monitor».

source: A computer version of the 15-puzzle and other sliding puzzles
ca: Una versió per ordinador del trencaclosques 15 i altres trencaclosques lliscants
fr: Une version informatique du puzzle à 15 et d'autres puzzles coulissants
ru: Компьютерная версия головоломки «пятнадцать» и других схожих головоломок

source: Taquin is a computer version of the 15-puzzle and other sliding puzzles. The object of Taquin is to move tiles so that they reach their places, either indicated with numbers, or with parts of a great image.
ca: Taquin és una versió per ordinador del trencaclosques de 15 i altres trencaclosques lliscants. L'objecte de Taquin és moure les fitxes perquè arribin als seus llocs, ja sigui indicats amb números, o amb parts d'una gran imatge.
fr: Taquin est une version informatique du 15-puzzle et d'autres puzzles coulissants. Le but de Taquin est de déplacer des tuiles de façon à ce qu'elles atteignent leur emplacement, soit indiqué par des chiffres, soit par des parties d'une grande image.
ru: Taquin — это компьютерная версия головоломки «пятнадцать» и других раздвижных головоломок. Цель Taquin — перемещать плитки так, чтобы они достигли своих мест, обозначенных числами или частями большого изображения.

source: Translations for package gnome-taquin
ca: Traduccions per al paquet gnome-taquin
fr: Traductions pour le paquet gnome-taquin
ru: Переводы для пакета gnome-taquin

source: Provides translations for the "gnome-taquin" package.
ca: Proporciona traduccions per al paquet «gnome-taquin».
fr: Fournit des traductions pour le paquet "gnome-taquin".
ru: Предоставляет переводы для пакета «gnome-taquin».

source: GNOME Terminal
ca: Terminal del GNOME
fr: Terminal GNOME
ru: Терминал GNOME

source: This package provides the GNOME terminal emulator application.
ca: Aquest paquet proporciona l'aplicació d'emulador de terminal del GNOME.
fr: Ce paquetage fournit l'émulateur de terminal GNOME.
ru: Этот пакет предоставляет программу эмулятора терминала для GNOME.

source: Translations for package gnome-terminal
ca: Traduccions per al paquet gnome-terminal
fr: Traductions pour le paquet gnome-terminal
ru: Переводы для пакета gnome-terminal

source: Provides translations for the "gnome-terminal" package.
ca: Proporciona traduccions per al paquet «gnome-terminal».
fr: Fournit des traductions pour le paquet "gnome-terminal".
ru: Предоставляет переводы для пакета «gnome-terminal».

source: Tetravex Game for GNOME
ca: Joc Tetravex per al GNOME
fr: Jeu Tetravex pour GNOME
ru: Игра Tetravex для GNOME

source: Tetravex is a simple puzzle game in which pieces have numbers on each side. The pieces must be positioned so that the same numbers touch each other, during which you are being timed. The times are then stored in a system-wide scoreboard.
ca: Tetravex és un joc de trencaclosques senzill en el qual les peces tenen números a cada costat. Les peces s'han de col·locar perquè els mateixos números es toquin, durant els quals s'està cronometritzant. Els temps s'emmagatzemen en un marcador de tot el sistema.
fr: Tetravex est un jeu de puzzle simple dans lequel les pièces portent des chiffres sur chaque face. Les pièces doivent être positionnées de manière à ce que les mêmes chiffres se touchent, ce qui vous permet d'être chronométré. Les temps sont ensuite enregistrés dans un tableau de scores à l'échelle du système.
ru: Тетравекс — это простая игра-головоломка, в которой на каждой стороне фигурки есть числа. Фигуры должны быть расположены так, чтобы одни и те же числа касались друг друга, при этом ведётся подсчёт времени. Затем время сохраняется на общесистемном табло.

source: Translations for package gnome-tetravex
ca: Traduccions per al paquet gnome-tetravex
fr: Traductions pour le paquet gnome-tetravex
ru: Переводы для пакета gnome-tetravex

source: Provides translations for the "gnome-tetravex" package.
ca: Proporciona traduccions per al paquet «gnome-tetravex».
fr: Fournit des traductions pour le paquet "gnome-tetravex".
ru: Предоставляет переводы для пакета «gnome-tetravex».

source: GNOME Themes
ca: Temes del GNOME
fr: Thèmes GNOME
ru: Темы GNOME

source: GNOME themes, including Ximian Industrial and selected background images.
ca: Temes del GNOME, incloent-hi Ximian Industrial i imatges de fons seleccionades.
fr: Thèmes GNOME, dont Ximian Industrial et sélection d'images de fonds d'écran.
ru: Темы GNOME, включая индустриальную от Ximian и избранные фоновые изображения.

source: Accessibility GNOME Themes
ca: Accessibilitat dels temes del GNOME
fr: Thèmes d'accessibilité GNOME
ru: Темы GNOME для людей с ограниченными возможностями

source: This package contains high-contrast and low-contrast themes for GNOME.
ca: Aquest paquet conté temes d'alt contrast i baix contrast per al GNOME.
fr: Ce paquet contient des thèmes à contraste élevé et à contraste faible pour GNOME.
ru: Этот пакет содержит высоко- и низкоконтрастные темы для GNOME.

source: This package contains high-contrast and low-contrast themes for gtk2 applications.
ca: Aquest paquet conté temes d'alt contrast i baix contrast per a les aplicacions gtk2.
fr: Ce paquet contient des thèmes à contraste élevé et faible pour les applications gtk2.
ru: Этот пакет содержит высоко- и низкоконтрастные темы для приложений gtk2.

source: Additional GNOME Themes
ca: Temes addicionals del GNOME
fr: Thèmes supplémentaires pour GNOME
ru: Дополнительные темы GNOME

source: This package contains several extra GNOME themes.
ca: Aquest paquet conté diversos temes addicionals del GNOME.
fr: Ce paquet contient plusieurs thèmes GNOME supplémentaires.
ru: Этот пакет содержит несколько дополнительных тем GNOME.

source: Translations for package gnome-themes
ca: Traduccions per a paquets gnome-themes
fr: Traductions pour le paquet gnome-themes
ru: Переводы для пакета gnome-themes

source: Provides translations for the "gnome-themes" package.
ca: Proporciona traduccions per al paquet «gnome-themes».
fr: Fournit des traductions pour le paquet "gnome-themes".
ru: Предоставляет переводы для пакета «gnome-themes».

source: Personal task manager for GNOME
ca: Gestor de tasques personals per al GNOME
fr: Gestionnaire de tâches personnelles pour GNOME
ru: Персональный менеджер задач для GNOME

source: GNOME To Do is a application to manage your personal tasks. It uses GNOME technologies, and so it has complete integration with the GNOME desktop environment.
ca: GNOME To Do és una aplicació per a gestionar les tasques personals. Utilitza les tecnologies del GNOME i, per tant, té una integració completa amb l'entorn d'escriptori GNOME.
fr: GNOME To Do est une application pour gérer vos tâches personnelles. Elle utilise les technologies GNOME et s'intègre donc parfaitement à l'environnement de bureau GNOME.
ru: GNOME To Do — это приложение для управления вашими личными задачами. В нем используются технологии GNOME, поэтому он полностью интегрирован со средой рабочего стола GNOME.

source: Development files for the GNOME task manager
ca: Fitxers de desenvolupament per al gestor de tasques del GNOME
fr: Fichiers de développement pour le gestionnaire de tâches GNOME
ru: Файлы разработки для менеджера задач GNOME

source: Translations for package gnome-todo
ca: Traduccions per al paquet gnome-todo
fr: Traductions pour le paquet gnome-todo
ru: Переводы для пакета gnome-todo

source: Provides translations for the "gnome-todo" package.
ca: Proporciona traduccions per al paquet «gnome-todo».
fr: Fournit des traductions pour le paquet "gnome-todo".
ru: Предоставляет переводы для пакета «gnome-todo».

source: A tool to customize advanced GNOME 3 options
ca: Una eina per a personalitzar les opcions avançades del GNOME 3
fr: Un outil pour personnaliser les options avancées de GNOME 3
ru: Инструмент для настройки расширенных параметров GNOME 3

source: GNOME Tweak Tool is an application for changing the advanced settings of GNOME 3.
ca: GNOME Tweak Tool és una aplicació per a canviar la configuració avançada del GNOME 3.
fr: GNOME Tweak Tool est une application permettant de modifier les paramètres avancés de GNOME 3.
ru: Инструмент тонкой настройки GNOME — это приложение для изменения расширенных параметров GNOME 3.

source: Translations for package gnome-tweak-tool
ca: Traduccions per al paquet gnome-tweak-tool
fr: Traductions pour le paquet gnome-tweak-tool
ru: Переводы для пакета gnome-tweak-tool

source: Provides translations for the "gnome-tweak-tool" package.
ca: Proporciona traduccions per al paquet «gnome-tweak-tool».
fr: Fournit des traductions pour le paquet "gnome-tweak-tool".
ru: Предоставляет переводы для пакета «gnome-tweak-tool».

source: Translations for package gnome-tweaks
ca: Traduccions per al paquet gnome-tweaks
ru: Переводы для пакета gnome-tweaks

source: Provides translations for the "gnome-tweaks" package.
ca: Proporciona traduccions per al paquet «gnome-tweaks».
fr: Fournit des traductions pour le paquet "gnome-tweaks".
ru: Предоставляет переводы для пакета «gnome-tweaks».

source: System resources viewer for GNOME
ca: Visor de recursos del sistema per al GNOME
fr: Visualiseur de ressources système pour GNOME
ru: Программа просмотра системных ресурсов для GNOME

source: GNOME Usage is a program to view information about the use of system resources, like memory and disk space.
ca: L'ús del GNOME és un programa per a veure informació sobre l'ús dels recursos del sistema, com ara la memòria i l'espai en disc.
fr: GNOME Usage est un programme qui permet d'afficher des informations sur l'utilisation des ressources du système, comme la mémoire et l'espace disque.
ru: GNOME Usage — это программа для просмотра информации об использовании системных ресурсов, таких как память и дисковое пространство.

source: Translations for package gnome-usage
ca: Traduccions per al paquet gnome-usage
fr: Traductions pour le paquet gnome-usage
ru: Переводы для пакета gnome-usage

source: Provides translations for the "gnome-usage" package.
ca: Proporciona traduccions per al paquet «gnome-usage».
fr: Fournit les traductions pour le paquet "gnome-usage".
ru: Предоставляет переводы для пакета «gnome-usage».

source: GNOME Desktop Documentation
ca: Documentació de l'escriptori del GNOME
fr: Documentation du bureau GNOME
ru: Документация рабочего стола GNOME

source: This package contains documents that are targeted for GNOME end-users.
ca: Aquest paquet conté documents dirigits als usuaris finals del GNOME.
fr: Ce paquet contient des documents pour les utilisateurs finaux de GNOME.
ru: Этот пакет содержит документы, которые предназначены для конечных пользователей GNOME.

source: Translations for package gnome-user-docs
ca: Traduccions per al paquet gnome-user-docs
fr: Traductions pour le paquet gnome-user-docs
ru: Переводы для пакета gnome-user-docs

source: Provides translations for the "gnome-user-docs" package.
ca: Proporciona traduccions per al paquet «gnome-user-docs».
fr: Fournit les traductions pour le paquet "gnome-user-docs".
ru: Предоставляет переводы для пакета «gnome-user-docs».

source: GNOME user file sharing
ca: Compartició de fitxers d'usuari del GNOME
fr: Partage de fichiers entre utilisateurs GNOME
ru: Общий доступ к файлам пользователя в GNOME

source: gnome-user-share is a small package that binds together various free software projects to bring easy to use user-level file sharing to the masses. The program is meant to run in the background when the user is logged in, and when file sharing is enabled a webdav server is started that shares the $HOME/Public folder. The share is then published to all computers on the local network using mDNS/rendezvous, so that it shows up in the Network location in GNOME.
ca: gnome-user-share és un petit paquet que uneix diversos projectes de programari lliure per facilitar l'ús de la compartició de fitxers a nivell d'usuari a les masses. El programa està destinat a executar-se en segon pla quan l'usuari ha iniciat sessió, i quan s'habilita la compartició de fitxers s'inicia un servidor webdav que comparteix la carpeta $HOME/Public. La compartició es publica a tots els ordinadors de la xarxa local utilitzant mDNS/rendezvous, de manera que es mostra a la ubicació de la xarxa al GNOME.
fr: gnome-user-share est un petit paquet qui rassemble plusieurs projets de logiciels libres afin d'apporter au plus grand nombre un partage de fichiers facile à utiliser au niveau de l'utilisateur. Le programme est conçu pour fonctionner en arrière-plan lorsque l'utilisateur est connecté, et lorsque le partage de fichiers est activé, un serveur webdav est lancé pour partager le dossier $HOME/Public. Le partage est ensuite publié sur tous les ordinateurs du réseau local à l'aide de mDNS/rendezvous, de sorte qu'il apparaît dans l'emplacement Réseau de GNOME.
ru: gnome-user-share — это небольшой пакет, который связывает воедино различные проекты свободного программного обеспечения, чтобы принести в массы простой в использовании обмен общими файлами на пользовательском уровне. Программа предназначена для работы в фоновом режиме, после входа пользователя в систему и если общий доступ к файлам включен, запускается сервер webdav, который обеспечивает доступ к папке $HOME/Public. Общие файлы публикуются в локальной сети на всех компьютерах, которые используют mDNS/rendezvous так, что они появляются на сетевой закладке в GNOME.

source: Translations for package gnome-user-share
ca: Traduccions per al paquet gnome-user-share
fr: Traductions pour le paquet gnome-user-share
ru: Переводы для пакета gnome-user-share
