Repository: openSUSE/packages-i18n
Catalog: */po/gnome.*.po
Languages: ca, fr, ru

source: GNOME MultiWriter can be used to write an ISO file to multiple USB devices at once. Supported drive sizes are between 1Gb and 32Gb. MultiWriter may be useful for QA testing, to create a GNOME Live image or a code sprint or to create hundreds of LiveUSB drives for a trade show.
ca: El GNOME MultiWriter es pot utilitzar per a escriure un fitxer ISO a diversos dispositius USB alhora. Les mides de la unitat suportades són entre 1Gb i 32Gb. MultiWriter pot ser útil per a proves de QA, per a crear una imatge en viu del GNOME o un esprint de codi o per a crear centenars de unitats LiveUSB per a un espectacle comercial.
fr: GNOME MultiWriter peut être utilisé pour écrire un fichier ISO sur plusieurs périphériques USB à la fois. Les tailles de disques supportées sont comprises entre 1 Go et 32 Go. MultiWriter peut être utile pour les tests d'assurance qualité, pour créer une image GNOME Live lors d'un "code sprint" ou pour créer des centaines de lecteurs LiveUSB pour une foire commerciale.
ru: GNOME MultiWriter можно использовать для записи ISO-файла сразу на несколько USB-устройств. Поддерживаются размеры дисков от 1 до 32 ГБ. MultiWriter может быть полезен для QA-тестирования, для создания образа GNOME Live или спринта кода или для создания сотен дисков LiveUSB для выставки.

source: Translations for package gnome-multi-writer
ca: Traduccions per al paquet gnome-multi-writer
fr: Traductions pour le paquet gnome-multi-writer
ru: Переводы для пакета gnome-multi-writer

source: Provides translations for the "gnome-multi-writer" package.
ca: Proporciona traduccions per al paquet «gnome-multi-writer».
fr: Fournit des traductions pour le paquet "gnome-multi-writer".
ru: Предоставляет переводы для пакета «gnome-multi-writer».

source: Music Player for GNOME
ca: Reproductor de música per al GNOME
fr: Lecteur de musique pour GNOME
ru: Музыкальный проигрыватель для GNOME

source: Music player and management application for GNOME.
ca: Reproductor de música i aplicació de gestió per al GNOME.
fr: Lecteur de musique et application de gestion pour GNOME.
ru: Приложение для проигрывания и управления музыкой для GNOME.

source: Translations for package gnome-music
ca: Traduccions per al paquet gnome-music
fr: Traductions pour le paquet gnome-music
ru: Переводы для пакета gnome-music

source: Provides translations for the "gnome-music" package.
ca: Proporciona traduccions per al paquet «gnome-music».
fr: Fournit des traductions pour le paquet "gnome-music".
ru: Предоставляет переводы для пакета «gnome-music».

source: GNOME Interface for Various Networking Tools
ca: Interfície del GNOME per a diverses eines de xarxa
fr: Interface GNOME pour divers outils réseau
ru: Графический интерфейс GNOME для различных сетевых команд

source: GNOME Nettool is a set of front-ends to various networking command line tools, like ping, netstat, ifconfig, whois, traceroute, and finger.
ca: GNOME Nettool és un conjunt de frontals per a diverses eines de la línia d'ordres de xarxa, com ping, netstat, ifconfig, whois, traceroute i finger.
fr: GNOME Nettool est un ensemble d'interfaces pour divers outils de ligne de commande de réseau, tels que ping, netstat, ifconfig, whois, traceroute et finger.
ru: GNOME Nettool — это графический интерфейс для различных сетевых инструментов, работающих в командной строке, таких как: ping, netstat, ifconfig, whois, traceroute и finger.

source: Translations for package gnome-nettool
ca: Traduccions per al paquet gnome-nettool
fr: Traductions pour le paquet gnome-nettool
ru: Переводы для пакета gnome-nettool

source: Provides translations for the "gnome-nettool" package.
ca: Proporciona traduccions per al paquet «gnome-nettool».
fr: Fournit des traductions pour le paquet "gnome-nettool".
ru: Предоставляет переводы для пакета «gnome-nettool».

source: Worm Game for GNOME
ca: Joc de paraules per al GNOME
fr: Jeu Worm pour GNOME
ru: Игра «Червячки» для GNOME

source: Nibbles is a worm game for GNOME. The player controls a 2D worm while trying to get food. Getting food gives points, but hitting anything causes a loss of points. When all points are lost, the player loses.
ca: Nibbles és un joc de cucs per al GNOME. El jugador controla un cuc 2D mentre intenta aconseguir menjar. Obtenir menjar dona punts, però colpejar qualsevol cosa provoca una pèrdua de punts. Quan es perden tots els punts, el jugador perd.
fr: Nibbles est un jeu de ver pour GNOME. Le joueur contrôle un ver en 2D tout en essayant d'obtenir de la nourriture. Obtenir de la nourriture donne des points, mais toucher quoi que ce soit fait perdre des points. Lorsque tous les points sont perdus, le joueur perd.
ru: Nibbles — это игра в червяка для GNOME. Игрок управляет 2D-червяком, пытаясь достать еду. Получение еды дает очки, но попадание во что-либо приводит к потере очков. Когда все очки потеряны, игрок проигрывает.

source: Translations for package gnome-nibbles
ca: Traduccions per al paquet gnome-nibbles
fr: Traductions pour le paquet gnome-nibbles
ru: Переводы для пакета gnome-nibbles

source: Provides translations for the "gnome-nibbles" package.
ca: Proporciona traduccions per al paquet «gnome-nibbles».
fr: Fournit des traductions pour le paquet "gnome-nibbles".
ru: Предоставляет переводы для пакета «gnome-nibbles».

source: GNOME service to access online accounts
ca: Servei del GNOME per accedir a comptes en línia
fr: Service GNOME pour l'accès aux comptes en ligne
ru: Служба GNOME для доступа к сетевым учетным записям

source: gnome-online-accounts provides interfaces so applications and libraries in GNOME can access the user's online accounts.
ca: gnome-online-accounts proporciona interfícies perquè les aplicacions i les biblioteques del GNOME puguin accedir als comptes en línia de l'usuari.
fr: gnome-online-accounts fournit des interfaces permettant aux applications et aux bibliothèques de GNOME d'accéder aux comptes en ligne de l'utilisateur.
ru: gnome-online-accounts предоставляет интерфейс для приложений и библиотек к данным сетевых учетных записей пользователя в GNOME.

source: GNOME service to access online accounts -- Development Files
ca: Servei del GNOME per a accedir als comptes en línia -- Fitxers de desenvolupament
fr: Service GNOME pour accéder aux comptes en ligne -- Fichiers de développement
ru: Служба GNOME для доступа к учётным записям — Файлы разработки

source: Translations for package gnome-online-accounts
ca: Traduccions per a paquets gnome-online-accounts
fr: Traductions pour le paquet gnome-online-accounts
ru: Переводы для пакета gnome-online-accounts

source: Provides translations for the "gnome-online-accounts" package.
ca: Proporciona traduccions per al paquet «gnome-online-accounts».
fr: Fournit des traductions pour le paquet "gnome-online-accounts".
ru: Предоставляет переводы для пакета «gnome-online-accounts».

source: Crawls through your online content
ca: Travessa a través del teu contingut en línia
fr: Parcourez votre contenu en ligne
ru: Сканирует ваш онлайн-контент

source: GNOME Online Miners provides a set of crawlers that go through your online content and index them locally in Tracker. It has miners for Flickr, Google, OwnCloud and SkyDrive.
ca: Els Miners en línia del GNOME proporcionen un conjunt de rastrejadors que passen a través del vostre contingut en línia i els indexen localment al Tracker. Compta amb miners per a Flickr, Google, OwnCloud i SkyDrive.
fr: GNOME Online Miners fournit un ensemble de robots qui parcourent votre contenu en ligne et l'indexent localement dans Tracker. Il existe des robots pour Flickr, Google, OwnCloud et SkyDrive.
ru: GNOME Online Miners предоставляет набор сканеров, которые проходят через ваш онлайн-контент и индексируют его локально в Tracker. Он имеет для сканеры для Flickr, Google, OwnCloud и SkyDrive.

source: Applications for the PackageKit API
ca: Aplicacions per a l'API PackageKit
fr: Applications pour l'API PackageKit
ru: Приложения для PackageKit API

source: GNOME PackageKit provides session applications for the PackageKit API. There are several utilities designed for installing, updating and removing packages on your system.
ca: GNOME PackageKit proporciona aplicacions de sessió per a l'API PackageKit. Hi ha diverses utilitats dissenyades per instal·lar, actualitzar i eliminar paquets al vostre sistema.
fr: GNOME PackageKit fournit des applications de session pour l'API PackageKit. Il existe plusieurs utilitaires conçus pour installer, mettre à jour et supprimer des paquets sur votre système.
ru: GNOME PackageKit предоставляет приложения сеанса пользователя для PackageKit API. Это несколько утилит, разработанных для установки, обновления и удаления пакетов в вашей системе.

source: Extra applications for the PackageKit API
ca: Aplicacions addicionals per a l'API PackageKit
fr: Applications supplémentaires pour l'API PackageKit
ru: Дополнительные приложения для API PackageKit

source: GNOME PackageKit provides session applications for the PackageKit API. There are several utilities designed for installing, updating and removing packages on your system. This package contains tools that provide functionality also provided by YaST Software Management.
ca: GNOME PackageKit proporciona aplicacions de sessió per a l'API PackageKit. Hi ha diverses utilitats dissenyades per instal·lar, actualitzar i eliminar paquets al vostre sistema. Aquest paquet conté eines que proporcionen funcionalitats proporcionades també per YaST Software Management.
fr: GNOME PackageKit fournit des applications de session pour l'API PackageKit. Il existe plusieurs utilitaires conçus pour installer, mettre à jour et supprimer des paquets sur votre système. Ce paquet contient des outils qui offrent des fonctionnalités également fournies par YaST Software Management.
ru: GNOME PackageKit предоставляет приложения сеанса пользователя для PackageKit API. Это несколько утилит, разработанных для установки, обновления и удаления пакетов в вашей системе. Этот пакет содержит инструменты, которые предоставляют функциональность, также предоставляемую YaST Software Management.

source: Translations for package gnome-packagekit
ca: Traduccions per al paquet gnome-packagekit
fr: Traductions pour le paquet gnome-packagekit
ru: Переводы для пакета gnome-packagekit

source: Provides translations for the "gnome-packagekit" package.
ca: Proporciona traduccions per al paquet «gnome-packagekit».
fr: Fournit des traductions pour le paquet "gnome-packagekit".
ru: Предоставляет переводы для пакета «gnome-packagekit».

source: A password manager for GNOME
ca: Un gestor de contrasenyes per al GNOME
fr: Un gestionnaire de mots de passe pour GNOME
ru: Менеджер паролей для GNOME

source: Password Safe is a password manager which makes use of the Keepass v.4 format. It integrates with the GNOME desktop and provides an interface for the management of password databases.
ca: Password Safe és un gestor de contrasenyes que fa ús del format Keepass v.4. S'integra amb l'escriptori GNOME i proporciona una interfície per a la gestió de bases de dades de contrasenyes.
fr: Password Safe est un gestionnaire de mots de passe qui utilise le format Keepass v.4. Il s'intègre au bureau GNOME et fournit une interface pour la gestion des bases de données de mots de passe.
ru: Password Safe — это менеджер паролей, использующий формат Keepass v.4. Он интегрируется с рабочим столом GNOME и предоставляет интерфейс для управления базами паролей.

source: Translations for package gnome-passwordsafe
ca: Traduccions per al paquet gnome-passwordsafe
fr: Traductions pour le paquet gnome-passwordsafe
ru: Переводы для пакета gnome-passwordsafe

source: Provides translations for the "gnome-passwordsafe" package.
ca: Proporciona traduccions per al paquet «gnome-passwordsafe».
fr: Fournit des traductions pour le paquet "gnome-passwordsafe".
ru: Предоставляет переводы для пакета «gnome-passwordsafe».

source: Collect and Merge Translations From RPM Patches
ca: Recull i fusiona traduccions des dels pedaços RPM
fr: Collecter et fusionner les traductions des patches RPM
ru: Сбор переводов из исправлений RPM

source: This package provides scripts for collecting strings changed in RPM patches and merging them to one translation compendium.
ca: Aquest paquet proporciona scripts per recollir cadenes canviades en pedaços RPM i fusionar-les en un compendi de traducció.
fr: Ce paquet fournit des scripts pour collecter les chaînes de caractères modifiées dans les correctifs RPM et les fusionner dans un répertoire de traductions.
ru: Этот пакет предоставляет скрипты для сбора строк, изменённых в RPM-патчах, и объединения их в один словарь для перевода.

source: Photo viewer for GNOME
ca: Visor de fotografies per al GNOME
fr: Visionneur de photos pour GNOME
ru: Программа просмотра фотографий для GNOME

source: Photos, like Documents, Music and Videos, is one of the core GNOME applications meant for find and reminding the user about her content. The internal architecture Photos is based on Documents -- the document manager application for GNOME, because they share similar UI/UX patterns and objectives.
ca: Fotos, com Documents, Música i Vídeos, és una de les aplicacions bàsiques del GNOME per a trobar i recordar a l'usuari el seu contingut. L'arquitectura interna Fotos es basa en Documents -- l'aplicació del gestor de documents per al GNOME, perquè comparteixen patrons i objectius d'UI/UX similars.
fr: Photos, comme Documents, Musique et Vidéos, est l'une des applications centrales de GNOME destinées à retrouver et à rappeler à l'utilisateur son contenu. L'architecture interne de Photos est basée sur Documents, l'application de gestion de documents de GNOME, car elles partagent des modèles et des objectifs UI/UX similaires.
ru: Фотографии, как и Документы, Музыка и Видео, является одним из основных приложений GNOME, предназначенных для поиска и напоминания пользователю о своём содержимом. Внутренняя архитектура Фотографий основана на Документах — приложении для управления документами в GNOME, поскольку они имеют схожие UI/UX-шаблоны и цели.

source: Translations for package gnome-photos
ca: Traduccions per al paquet gnome-photos
fr: Traductions pour le paquet gnome-photos
ru: Переводы для пакета gnome-photos

source: Provides translations for the "gnome-photos" package.
ca: Proporciona traduccions per al paquet «gnome-photos».
fr: Fournit des traductions pour le paquet "gnome-photos".
ru: Предоставляет переводы для пакета «gnome-photos».

source: A circular application launcher for GNOME
ca: Un llançador d'aplicacions circular per al GNOME
fr: Un lanceur d'applications circulaire pour GNOME
ru: Круговая программа запуска приложений для GNOME

source: GNOME-Pie is a circular application launcher (pie menu). It is made of several pies, each consisting of multiple slices. The user presses a key stroke which opens the desired pie. By activating one of its slices, applications may be launched, key presses may be simulated or files can be opened.
ca: El GNOME-Pie és un llançador d'aplicacions circular (menú de sectors). Està fet de diversos pastissos, cadascun dels quals consta de múltiples llesques. L'usuari prem un traç de tecla que obre el pastís desitjat. Activant una de les seves llesques, es poden llançar aplicacions, simular premses de tecla o obrir fitxers.
fr: GNOME-Pie est un lanceur d'applications circulaire ("pie menu"). Il est composé de plusieurs tartes, chacune constituée de plusieurs tranches. L'utilisateur appuie sur une touche qui ouvre la tarte souhaitée. En activant l'une des tranches, des applications peuvent être lancées, des pressions de touches peuvent être simulées ou des fichiers peuvent être ouverts.
ru: GNOME-Pie — это круговая программа запуска приложений (круговое меню). Она состоит из нескольких кругов, каждый из которых состоит из нескольких секторов. Пользователь нажимает клавишу, открывающую желаемый круг. Активируя один из его фрагментов, можно запускать приложения, симулировать нажатия клавиш или открывать файлы.

source: A time management utility for GNOME
ca: Una utilitat de gestió del temps per al GNOME
fr: Un outil de gestion du temps pour GNOME
ru: Утилита управления временем для GNOME

source: A GNOME utility that helps managing time according to Pomodoro Technique. It intends to improve productivity and focus by taking short breaks after every 25 minutes of work.
ca: Una utilitat del GNOME que ajuda a gestionar el temps segons Pomodoro Technique. Pretén millorar la productivitat i l'enfocament realitzant descansos curts després de cada 25 minuts de treball.
fr: Un outil GNOME qui aide à gérer le temps selon la technique Pomodoro. Il vise à améliorer la productivité et la concentration en faisant de courtes pauses toutes les 25 minutes de travail.
ru: Утилита GNOME, помогающая управлять временем в соответствии с техникой Pomodoro. Она предназначена для повышения производительности и концентрации внимания за счёт коротких перерывов через каждые 25 минут работы.

source: Translations for package gnome-pomodoro
ca: Traduccions per al paquet gnome-pomodoro
fr: Traductions pour le paquet gnome-pomodoro
ru: Переводы для пакета gnome-pomodoro

source: Provides translations for the "gnome-pomodoro" package.
ca: Proporciona traduccions per al paquet «gnome-pomodoro».
fr: Fournit des traductions pour le paquet "gnome-pomodoro".
ru: Предоставляет переводы для пакета «gnome-pomodoro».

source: Power Management for GNOME
ca: Gestió d'energia per al GNOME
fr: Gestionnaire d'alimentation pour GNOME
ru: Управление питанием для GNOME

source: GNOME Power Manager is a GNOME session daemon that acts as a policy agent. It listens for system events and responds with user-configurable actions.
ca: El Gestor d'energia del GNOME és un dimoni de sessió del GNOME que actua com a agent de polítiques. Escolta esdeveniments del sistema i respon amb accions configurables per l'usuari.
fr: GNOME Power Manager est un démon de session GNOME qui agit comme un agent de stratégie. Il écoute les événements du système et répond par des actions configurables par l'utilisateur.
ru: Управление питанием GNOME — это демон сеанса GNOME, который действует как агент политик. Он следит за системными событиями и выполняет настроенные пользователем действия.

source: Translations for package gnome-power-manager
ca: Traduccions per al paquet gnome-power-manager
fr: Traductions pour le paquet gnome-power-manager
ru: Переводы для пакета gnome-power-manager

source: Provides translations for the "gnome-power-manager" package.
ca: Proporciona traduccions per al paquet «gnome-power-manager».
fr: Fournit des traductions pour le paquet "gnome-power-manager".
ru: Предоставляет переводы для пакета «gnome-power-manager».

source: A recipe app for GNOME
ca: Una aplicació de receptes per al GNOME
fr: Une application de recettes pour GNOME
ru: Приложение рецептов для GNOME

source: GNOME Recipes is an easy-to-use application that will help you to discover what to cook today, tomorrow, rest of the week and for your special occasions. Recipes comes with a collection of recipes that have been collected by GNOME contributors from all over the world. It also lets you store your own recipes, and share them with your friends.
ca: El GNOME Recipes és una aplicació fàcil d'utilitzar que us ajudarà a descobrir què cuinar avui, demà, resta de la setmana i per a les vostres ocasions especials. Receptes ve amb una col·lecció de receptes que han estat recollides per col·laboradors del GNOME de tot el món. També et permet guardar les teves pròpies receptes i compartir-les amb els teus amics.
fr: GNOME Recipes est une application facile à utiliser qui vous aidera à découvrir quoi cuisiner aujourd'hui, demain, le reste de la semaine et pour vos occasions spéciales. Recipes est livré avec une collection de recettes qui ont été rassemblées par des contributeurs GNOME du monde entier. Elle vous permet également de stocker vos propres recettes et de les partager avec vos amis.
ru: Рецепты GNOME — это простое в использовании приложение, которое поможет вам узнать, что готовить сегодня, завтра, в остальные дни недели и для особых случаев. Рецепты включает в себя сборник рецептов, собранных участниками GNOME со всего мира. Оно также позволяет вам хранить свои собственные рецепты и делиться ими с друзьями.

source: Translations for package gnome-recipes
ca: Traduccions per al paquet gnome-recipes
fr: Traductions pour le paquet gnome-recipes
ru: Переводы для пакета gnome-recipes

source: Provides translations for the "gnome-recipes" package.
ca: Proporciona traduccions per al paquet «gnome-recipes».
fr: Fournit des traductions pour le paquet "gnome-recipes".
ru: Предоставляет переводы для пакета «gnome-recipes».

source: GNOME Remote Desktop screen sharing service
ca: Servei de compartició de pantalla de l'escriptori remot del GNOME
fr: Service de partage d'écran du bureau à distance GNOME
ru: Служба демонстрации экрана удалённого рабочего стола GNOME

source: GNOME Remote Desktop is a remote desktop and screen sharing service for the GNOME desktop environment.
ca: L'escriptori remot del GNOME és un servei d'escriptori remot i compartició de pantalla per a l'entorn d'escriptori del GNOME.
fr: GNOME Remote Desktop est un service de bureau à distance et de partage d'écran pour l'environnement de bureau GNOME.
ru: GNOME Remote Desktop — это удалённый рабочий стол и служба совместного использования экрана для среды рабочего стола GNOME.

source: Robots Game for GNOME
ca: Joc de robots per al GNOME
fr: Jeu de robots pour GNOME
ru: Игра «Роботы» для GNOME

source: Robots is a graphical version of the original text based robots game, which can be found on a number of UNIX systems. The player must outwit the robots chasing him/her by getting them to run into each other.
ca: Robots és una versió gràfica del joc de robots basat en text original, que es pot trobar en una sèrie de sistemes UNIX. El jugador ha de superar els robots que el persegueixen fent que es toquin l'un a l'altre.
fr: Robots est une version graphique du jeu original de robots basé sur du texte, que l'on peut trouver sur un certain nombre de systèmes UNIX. Le joueur doit déjouer les robots qui le poursuivent en les faisant se heurter les uns aux autres.
ru: Роботы — это графическая версия оригинальной текстовой игры про роботов, которую можно найти в ряде систем UNIX. Игрок должен перехитрить преследующих его роботов, заставив их столкнуться друг с другом.

source: Translations for package gnome-robots
ca: Traduccions per al paquet gnome-robots
fr: Traductions pour le paquet gnome-robots
ru: Переводы для пакета gnome-robots

source: Provides translations for the "gnome-robots" package.
ca: Proporciona traduccions per al paquet «gnome-robots».
fr: Fournit des traductions pour le paquet "gnome-robots".
ru: Предоставляет переводы для пакета «gnome-robots».

source: Utility to take pictures of your screen
ca: Utilitat per a fer fotos de la pantalla
fr: Utilitaire pour prendre des photos de votre écran
ru: Утилита для создания снимков экрана

source: The screenshot tool captures the screen, a window, or an user-defined area and save the snapshot image to a file.
ca: L'eina de captura de pantalla captura la pantalla, una finestra o una àrea definida per l'usuari i desa la imatge de la instantània en un fitxer.
fr: L'outil de capture d'écran permet de capturer l'écran, une fenêtre ou une zone définie par l'utilisateur et d'enregistrer l'image instantanée dans un fichier.
ru: Инструмент для снятия снимков экрана, окна или области определённой пользователем, и сохранением изображения в файл.

source: Translations for package gnome-screenshot
ca: Traduccions per al paquet gnome-screenshot
fr: Traductions pour le paquet gnome-screenshot
ru: Переводы для пакета gnome-screenshot
