Repository: openSUSE/packages-i18n
Catalog: */po/golang.*.po
Languages: ca, fr

source: Docker Networking
ca: Xarxa de l'acoblador
fr: Mise en réseau de Docker

source: The docker-proxy binary used by Docker that provides Docker with libnetwork support.
ca: El binari «docker-proxy» utilitzat per Docker que proporciona a Docker el suport de la xarxa de xarxa.
fr: Le binaire docker-proxy utilisé par Docker qui fournit à Docker le support libnetwork.

source: Tool to converts markdown into man pages
ca: Eina per a convertir el markdown en pàgines man
fr: Outil de conversion de markdown en pages de documentation

source: Tool to converts markdown into man pages.
ca: Eina per a convertir el markdown en pàgines man.
fr: Outil permettant de convertir markdown en pages de documentation.

source: Reverse proxy designed for Prometheus exporters
ca: Servidor intermediari invers dissenyat per als exportadors de Prometheus
fr: Proxy inverse conçu pour les exportateurs de Prometheus

source: Squid Prometheus Exporter
ca: Exportador de Squid Prometheus
fr: Exportateur Squid Prometheus

source: Exports squid metrics in Prometheus format
ca: Exporta mètriques de calamars en format Prometheus
fr: Exportation des métriques squid au format Prometheus

source: Convert markdown into man pages
ca: Converteix markdown en pàgines man
fr: Convertit markdown en pages de documentation

source: Libnetwork provides a native Go implementation for connecting containers The goal of libnetwork is to deliver a robust Container Network Model that provides a consistent programming interface and the required network abstractions for applications.
ca: Libnetwork proporciona una implementació nativa de Go per connectar contenidors L'objectiu de la libnetwork és oferir un model de xarxa de contenidors robust que proporcioni una interfície de programació coherent i les abstraccions de xarxa necessàries per a les aplicacions.
fr: Libnetwork fournit une implémentation native de Go pour connecter les conteneurs L'objectif de libnetwork est de fournir un modèle de réseau de conteneurs robuste qui offre une interface de programmation cohérente et les abstractions de réseau nécessaires aux applications.

source: A small utility which generates Go code from any file
ca: Una utilitat petita que genera el codi Go des de qualsevol fitxer
fr: Un petit utilitaire qui génère du code Go à partir de n'importe quel fichier

source: This package converts any file into manageable Go source code. Useful for embedding binary data into a go program. The file data is optionally gzip compressed before being converted to a raw byte slice. It comes with a command line tool in the go-bindata sub directory. This tool offers a set of command line options, used to customize the output being generated.
ca: Aquest paquet converteix qualsevol fitxer en codi font Go gestionable. Útil per incrustar dades binàries en un programa go. Les dades del fitxer es comprimeixen de manera opcional a gzip abans de convertir-les en un tram de bytes en brut. Ve amb una eina de línia d'ordres al subdirectori go-bindata. Aquesta eina ofereix un conjunt d'opcions de línia d'ordres, usades per a personalitzar la sortida que es genera.
fr: Ce paquet convertit n'importe quel fichier en code source Go administrable. Utile pour intégrer des données binaires dans un programme Go. Les données du fichier sont optionnellement compressées par gzip avant d'être converties en blocs d'octets bruts. Il est livré avec un outil en ligne de commande dans le sous-répertoire go-bindata. Cet outil offre un ensemble d'options de ligne de commande, utilisées pour personnaliser la sortie générée.

source: Apache Exporter for Prometheus
ca: Exportador Apache per a Prometheus
fr: Exportateur Apache pour Prometheus

source: Exports apache mod_status statistics via HTTP for Prometheus consumption.
ca: Exporta les estadístiques de modstatus d'apache a través d'HTTP per al consum de Prometheus.
fr: Exporte les statistiques apache mod_status via HTTP pour la consommation de Prometheus.

source: Prometheus Alertmanager
fr: Gestionnaire d'alertes Prometheus

source: The Alertmanager handles alerts sent by client applications such as the Prometheus server. It takes care of deduplicating, grouping, and routing them to the correct receiver integration such as email, PagerDuty, or OpsGenie. It also takes care of silencing and inhibition of alerts.
ca: El Alertmanager gestiona alertes enviades per aplicacions del client com el servidor Prometheus. S'encarrega de desduplicar, agrupar i encaminar-los a la integració correcta del receptor com ara el correu electrònic, PagerDuty o OpsGenie. També s'encarrega de silenciar i inhibir les alertes.
fr: L'Alertmanager gère les alertes envoyées par des applications clientes telles que le serveur Prometheus. Il se charge de les dédupliquer, de les regrouper et de les acheminer vers l'intégration correcte du destinataire, comme le courriel, PagerDuty ou OpsGenie. Il s'occupe également de la mise en sourdine et de l'inhibition des alertes.

source: Prometheus exporter for machine metrics
ca: Exportador de Prometheus per a mètriques de màquina
fr: Exportateur Prometheus pour les métriques des machines

source: Prometheus exporter for hardware and OS metrics exposed by *NIX kernels, written in Go with pluggable metric collectors.
ca: Exportador de Prometheus per a maquinari i mètriques OS exposades per nuclis *NIX, escrit a Go amb col·lectors mètrics endollables.
fr: Exportateur Prometheus pour les métriques matérielles et OS exposées par les noyaux *NIX, écrit en Go avec des collecteurs de métriques connectables.

source: The Prometheus monitoring system and time series database
ca: El sistema de monitoratge de Prometheus i la base de dades de sèries temporals
fr: Le système de surveillance Prometheus et la base de données des séquences chronologiques

source: Prometheus's main features are: - a multi-dimensional data model (time series identified by metric name and key/value pairs) - a flexible query language to leverage this dimensionality - no reliance on distributed storage; single server nodes are autonomous - time series collection happens via a pull model over HTTP - pushing time series is supported via an intermediary gateway - targets are discovered via service discovery or static configuration - multiple modes of graphing and dashboarding support
ca: Les principals característiques de Prometeu són: - un model de dades multidimensional (sèries de temps identificades per nom mètric i parells clau/valor) - un llenguatge de consulta flexible per aprofitar aquesta dimensionalitat - no dependre de l'emmagatzematge distribuït; els nodes d'un sol servidor són autònoms - la col·lecció de sèries temporals passa a través d'un model d'arrossegament sobre HTTP - les sèries de temps d'empenta es suporta a través d'una passarel·la intermèdia - els objectius es descobreixen a través del descobriment de serveis o la configuració estàtica - múltiples modes de suport de gràfics i dashboard
fr: Les principales caractéristiques de Prometheus sont les suivantes - un modèle de données multidimensionnel (séquences chronologiques identifiées par le nom de la mesure et des paires clé/valeur) - un langage d'interrogation flexible pour exploiter cette dimensionnalité - aucune dépendance à l'égard du stockage distribué ; les nœuds de serveur unique sont autonomes - la collecte des séquences chronologiques s'effectue via un modèle de traction sur HTTP - la propagation des séquences chronologiques est prise en charge via une passerelle intermédiaire - les cibles sont découvertes via la découverte de services ou la configuration statique - de multiples modes de prise en charge des graphiques et des tableaux de bord

source: Prometheus Utility Tool
ca: Eina d'utilitat de Prometheus
fr: Utilitaire Prometheus

source: The Prometheus Utility Tool is used by the Prometheus project to build other components.
ca: L'eina d'utilitat de Prometeu és utilitzada pel projecte Prometeu per construir altres components.
fr: L'outil utilitaire Prometheus est utilisé par le projet Prometheus pour construire d'autres composants.

source: Markdown processor implemented in Go
ca: El processador Markdown està implementat a Go
fr: Processeur Markdown implémenté en Go

source: Blackfriday is a Markdown processor implemented in Go. It is paranoid about its input (so you can safely feed it user-supplied data), it is fast, it supports common extensions (tables, smart punctuation substitutions, etc.), and it is safe for all utf-8 (unicode) input. HTML output is currently supported, along with Smartypants extensions. An experimental LaTeX output engine is also included.
ca: Blackfriday és un processador Markdown implementat a Go. És paranoic quant a la seva entrada (de manera que es pot alimentar amb seguretat les dades subministrades per l'usuari), és ràpid, admet extensions comunes (taules, substitucions de puntuació intel·ligent, etc.), i és segur per a tota l'entrada utf-8 (unicode). La sortida HTML està suportada actualment, juntament amb les extensions Smartypants. També s'inclou un motor de sortida experimental de LaTeX.
fr: Blackfriday est un processeur Markdown implémenté en Go. Il est paranoïaque quant à ses entrées (vous pouvez donc lui fournir en toute sécurité des données fournies par l'utilisateur), il est rapide, il supporte les extensions courantes (tableaux, substitutions intelligentes de ponctuation, etc.), et il est sûr pour toutes les entrées utf-8 (unicode). La sortie HTML est actuellement supportée, ainsi que les extensions Smartypants. Un moteur de sortie LaTeX expérimental est également inclus.

source: Go function to create sanitized anchor names
ca: Ves a la funció per a crear noms d'ancoratge higienitzats
fr: Fonction Go pour créer des noms d'ancres assainis

source: Package sanitized_anchor_name provides a func to create sanitized anchor names. Its logic can be reused by multiple packages to create interoperable anchor names and links to those anchors. At this time, it does not try to ensure that generated anchor names are unique, that responsibility falls on the caller.
ca: El paquet sanitizedanchorname proporciona un func per crear noms d'ancoratge higienitzats. La seva lògica pot ser reutilitzada per múltiples paquets per crear noms d'ancoratge interoperables i enllaços a aquests ancoratges. En aquest moment, no intenta garantir que els noms d'ancoratge generats siguin únics, aquesta responsabilitat recau sobre el que truca.
fr: Le paquet sanitized_anchor_name fournit une fonction permettant de créer des noms d'ancres assainis. Sa logique peut être réutilisée par plusieurs paquets pour créer des noms d'ancres interopérables et des liens vers ces ancres. Pour l'instant, il n'essaie pas de s'assurer que les noms d'ancres générés sont uniques, cette responsabilité incombe à l'appelant.

source: Prometheus exporter for Slurm metrics
ca: Exportador de Prometheus per a mètriques Slurm
fr: Exportateur Prometheus pour les métriques Slurm

source: Prometheus collector and exporter for metrics extracted from the Slurm resource scheduling system.
ca: Recol·lector i exportador de Prometheus per a mètriques extretes del sistema de planificació de recursos Slurm.
fr: Collecteur et exportateur Prometheus pour les métriques extraites du système d'ordonnancement des ressources Slurm.

source: Prometheus exporter for PostgreSQL
ca: Exportador de Prometheus per a PostgreSQL
fr: Exportateur Prometheus pour PostgreSQL

source: Prometheus exporter for PostgreSQL server metrics. Supported PostgreSQL versions: 9.1 and up.
ca: Exportador de Prometheus per a mètriques de servidor PostgreSQL. Versions PostgreSQL suportades: 9.1 i posteriors.
fr: Exportateur Prometheus pour les métriques du serveur PostgreSQL. Versions de PostgreSQL supportées : 9.1 et plus.

source: Rich testing framework for the Go language
ca: Marc de treball de prova enriquit per a l'idioma Go
fr: Cadre de test avancé pour le langage Go

source: The Go language provides an internal testing library, named "testing", which is relatively slim due to the fact that the standard library correctness by itself is verified using it. The gocheck package, on the other hand, expects the standard library from Go to be working correctly, and builds on it to offer a richer testing framework for libraries and applications to use.
ca: El llenguatge Go proporciona una biblioteca de proves interna, anomenada "testing", que és relativament esvelta a causa del fet que la correcció estàndard de la biblioteca per si mateixa es verifica utilitzant-la. El paquet gocheck, d'altra banda, espera que la biblioteca estàndard de Go funcioni correctament, i es basa en ella per oferir un marc de proves més ric per a les biblioteques i aplicacions a utilitzar.
fr: Le langage Go fournit une bibliothèque de test interne, nommée "testing", qui est relativement mince en raison du fait que l'exactitude de la bibliothèque standard est vérifiée par elle-même en l'utilisant. Le paquet gocheck, quant à lui, s'attend à ce que la bibliothèque standard de Go fonctionne correctement, et s'appuie sur elle pour offrir un cadre de test plus riche pour les bibliothèques et les applications à utiliser.

source: Go packages for low-level interaction with the operating system
ca: Ves paquets per a la interacció de baix nivell amb el sistema operatiu
fr: Paquets Go pour l'interaction de bas niveau avec le système d'exploitation

source: This repository holds supplemental Go packages for low-level interactions with the operating system.
ca: Aquest repositori conté paquets Go addicionals per a interaccions de baix nivell amb el sistema operatiu.
fr: Ce dépôt contient des paquets Go supplémentaires pour les interactions de bas niveau avec le système d'exploitation.

source: A toolchain to help packaging golang
ca: Una cadena d'eines per ajudar a envasar el golang
fr: Une chaîne d'outils pour aider à empaqueter golang

source: A toolchain to help packaging golang, written in bash.
ca: Una cadena d'eines per ajudar a envasar el golang, escrita en bash.
fr: Une chaîne d'outils pour aider à empaqueter golang, écrite en bash.

source: Prometheus exporter for ICMP echo requests
ca: Exportador de Prometheus per a sol·licituds d'eco ICMP
fr: Exportateur Prometheus pour les demandes d'écho ICMP

source: This is a simple server that scrapes go-ping stats and exports them via HTTP for Prometheus consumption.
ca: Es tracta d'un servidor senzill que descarta les estadístiques de go-ping i les exporta a través d'HTTP per al consum de Prometheus.
fr: Il s'agit d'un simple serveur qui récupère les statistiques de go-ping et les exporte via HTTP pour la consommation de Prometheus.

source: Golang DBus factory
ca: Fàbrica Golang DBus
fr: Fabrique de DBus de Golang

source: Golang DBus factory for Deepin Desktop Environment.
ca: Fàbrica Golang DBus per a l'entorn d'escriptori Deepin.
fr: Fabrique de DBus de Golang pour l'environnement de bureau Deepin.

source: Go bindings for Deepin Desktop Environment development
ca: Ves les vinculacions per al desenvolupament de l'entorn d'escriptori del Deepin
fr: Liaisons Go pour le développement de l'environnement de bureau Deepin

source: DLib is a set of Go bindings/libraries for DDE development. Containing dbus (forking from guelfey), glib, gdkpixbuf, pulse and more.
ca: DLib és un conjunt d'enllaços/biblioteques Go per al desenvolupament de DDE. Contenint dbus (forcant de guelfey), glib, gdkpixbuf, pols i més.
fr: DLib est un ensemble de liaisons/bibliothèques Go pour le développement DDE. Il contient dbus ( à partir de guelfey), glib, gdkpixbuf, pulse et bien d'autres.
