Repository: openSUSE/packages-i18n
Catalog: */po/google.*.po
Languages: ca, ja

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular and Bold weights of Serif font for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté pesos regulars i negretes del tipus de lletra Serif per al xinès simplificat, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語 Serif レギュラー体およびボールド体のフォントが含まれています。

source: Noto Serif Simplified Chinese Font - All Weights
ca: Tipus de lletra xinès simplificat Noto Serif - Tots els pesos
ja: Noto Serif 簡体字中国語フォント - 全ウエイト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains All weights of Serif font for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté tots els pesos del tipus de lletra Serif per al xinès simplificat, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語 Serif フォントのうち、全ウエイトが含まれています。

source: Noto Serif Simplified Chinese Font - Light
ca: Tipus de lletra xinès simplificat Noto Serif - Llum
ja: Noto Serif 簡体字中国語フォント - ライト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Light weight of Serif font for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes lleuger del tipus de lletra Serif per al xinès simplificat, indicat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語 Serif ライト体フォントが含まれています。

source: Noto Serif Simplified Chinese Font - Medium
ca: Tipus de lletra simplificat del xinès Noto Serif - Mitjana
ja: Noto Serif 簡体字中国語フォント - ミディアム

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Medium weight of Serif font for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes mitjà del tipus de lletra Serif per al xinès simplificat, indicat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語 Serif ミディアム体フォントが含まれています。

source: Noto Serif Simplified Chinese Font - Regular
ca: Tipus de lletra xinès simplificat Noto Serif - Regular
ja: Noto Serif 簡体字中国語フォント - レギュラー

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular weight of Serif font for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes regular del tipus de lletra Serif per al xinès simplificat, indicat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語 Serif レギュラー体フォントが含まれています。

source: Noto Serif Simplified Chinese Font - SemiBold
ca: Noto Serif Tipus de lletra xinès simplificat - Seminegreta
ja: Noto Serif 簡体字中国語フォント - セミボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains SemiBold weight of Serif font for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes de SemiBold del tipus de lletra Serif per al xinès simplificat, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語 Serif セミボールド体フォントが含まれています。

source: Noto Sinhala Font
ja: Noto シンハラ語フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Sinhala font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Sinhala, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Sinhala フォントが含まれています。

source: Noto Tamil Font
ca: Tipus de lletra de Noto Tamil
ja: Noto タミル語フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Tamil font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un tipus de lletra tàmil, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きのタミル語フォントが含まれています。

source: Noto Serif Traditional Chinese Font - Black
ca: Tipus de lletra tradicional xinesa Noto Serif - Negre
ja: Noto Serif 繁体字中国語フォント - ブラック

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Black weight of Serif font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes negre del tipus de lletra Serif per al xinès tradicional, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Serif ブラック体フォントが含まれています。

source: Noto Serif Traditional Chinese Font - Bold
ca: Noto Serif Tipus de lletra tradicional xinesa - Negreta
ja: Noto Serif 繁体字中国語フォント - ボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Bold weight of Serif font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un pes negreta del tipus de lletra Serif per al xinès tradicional, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Serif ボールド体フォントが含まれています。

source: Noto Serif Traditional Chinese Font - Extralight
ca: Tipus de lletra tradicional xinesa Noto Serif - Extralight
ja: Noto Serif 繁体字中国語フォント - エクストラライト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Extralight weight of Serif font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un pes extra lleuger de la lletra Serif per al xinès tradicional, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Serif エクストラライト体フォントが含まれています。

source: Noto Serif Traditional Chinese Font - Regular and Bold
ca: Noto Serif Tipus de lletra tradicional xinesa - Regular i negreta
ja: Noto Serif 繁体字中国語フォント - レギュラーおよびボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular and Bold weights of Serif font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté pesos regulars i negres de tipus de lletra Serif per al xinès tradicional, insinuats.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Serif レギュラー体およびボールド体のフォントが含まれています。

source: Noto Serif Traditional Chinese Font - All Weights
ca: Tipus de lletra tradicional xinesa Noto Serif - Tots els pesos
ja: Noto Serif 繁体字中国語フォント - 全ウエイト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains All weights of Serif font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté tots els pesos del tipus de lletra Serif per al xinès tradicional, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Serif フォントのうち、全ウエイトが含まれています。

source: Noto Serif Traditional Chinese Font - Light
ca: Noto Serif Tipus de lletra tradicional xinesa - Llum
ja: Noto Serif 繁体字中国語フォント - ライト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Light weight of Serif font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un pes lleuger de tipus de lletra Serif per al xinès tradicional, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Serif ライト体フォントが含まれています。

source: Noto Serif Traditional Chinese Font - Medium
ca: Noto Serif Tipus de lletra tradicional xinesa - Mitjana
ja: Noto Serif 繁体字中国語フォント - ミディアム

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Medium weight of Serif font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un pes mitjà de la lletra Serif per al xinès tradicional, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Serif ミディアム体フォントが含まれています。

source: Noto Serif Traditional Chinese Font - Regular
ca: Tipus de lletra tradicional xinesa Noto Serif - Regular
ja: Noto Serif 繁体字中国語フォント - レギュラー

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular weight of Serif font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes regular del tipus de lletra Serif per al xinès tradicional, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Serif レギュラー体フォントが含まれています。

source: Noto Serif Traditional Chinese Font - SemiBold
ca: Noto Serif Tipus de lletra tradicional xinesa - Seminegre
ja: Noto Serif 繁体字中国語フォント - セミボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains SemiBold weight of Serif font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes de SemiBold del tipus de lletra Serif per al xinès tradicional, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Serif セミボールド体フォントが含まれています。

source: Noto Telugu Font
ca: Tipus de lletra Noto Telugu
ja: Noto テルグ語フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Telugu font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Telugu, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きのテルグ語フォントが含まれています。

source: Noto Thai Font
ca: Tipus de lletra noto tailandès
ja: Noto タイ語フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Thai font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un tipus de lletra tailandès, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きのタイ語フォントが含まれています。

source: Development files for the Google C++ Mocking Framework
ca: Fitxers de desenvolupament per al Mocking Framework de Google C++

source: Serif family, part of the Alegreya “super family”
ca: Família Serif, part de la “superfamília” d'Alegreya

source: Alegreya is a typeface originally intended for literature. Among its crowning characteristics, it conveys a dynamic and varied rhythm which facilitates the reading of long texts. Also, it provides freshness to the page while referring to the calligraphic letter, not as a literal interpretation, but rather in a contemporary typographic language. The italic has just as much care and attention to detail in the design as the roman. The bold weights are strong, and the Black weights are really experimental for the genre. There is also a Small Caps sister family. Not only does Alegreya provide great performance, but also achieves a strong and harmonious text by means of elements designed in an atmosphere of diversity. The Alegreya type system is a “super family”, originally intended for literature, and includes serif and sans serif sister families. It supports expert latin, greek and cyrillic character sets and provides advanced typography OpenType features such as small caps, dynamic ligatures and fractions, four set of figures, super and subscript characters, ordinals, localized accent forms for spanish, catalan, guaraní, dutch, turkish, romanian, serbian among others. Alegreya was chosen at the ATypI Letter2 competition in September 2011, and one of the top 14 text type systems. It was also selected in the 2nd Bienal Iberoamericana de Diseño, competition held in Madrid in 2010 and Tipos Latinos. Designed by Juan Pablo del Peral for Huerta Tipográfica.
ca: Alegreya és una tipografia originalment destinada a la literatura. Entre les seves característiques coronàries, transmet un ritme dinàmic i variat que facilita la lectura de textos llargs. A més, aporta frescor a la pàgina en referir-se a la lletra cal·ligràfica, no com a interpretació literal, sinó més aviat en un llenguatge tipogràfic contemporani. La cursiva té tanta cura i atenció al detall en el disseny com la romana. Els pesos en negreta són forts, i els pesos negres són realment experimentals per al gènere. També hi ha una família germana de Small Caps. Alegreya no només proporciona un gran rendiment, sinó que també aconsegueix un text fort i harmoniós mitjançant elements dissenyats en una atmosfera de diversitat. El sistema de tipus Alegreya és una “superfamília”, originalment destinada a la literatura, i inclou famílies germanes serif i sans serif. Suporta conjunts de caràcters llatins, grecs i ciríl·lics experts i proporciona tipografia avançada OpenType amb característiques com casquets petits, lligadures dinàmiques i fraccions, quatre conjunts de figures, superíndexs i subíndexs, ordinals, formes d'accent localitzades per a espanyol, català, guaraní, holandès, turkish, romanià, serbi entre d'altres. Alegreya va ser escollida a la competició ATypI Letter2 el setembre de 2011, i un dels 14 primers sistemes de tipus de text. També va ser seleccionat a la 2a Bienal Iberoamericana de Disseny, competició celebrada a Madrid el 2010 i Tipos Latinos. Dissenyat per Juan Pablo del Peral per a Huerta Tipogrficafica.

source: The Cabin font family is a humanist sans with 4 weights and true italics, inspired by Edward Johnston’s and Eric Gill’s typefaces, with a touch of modernism. Cabin incorporates modern proportions, optical adjustments, and some elements of the geometric sans. It remains true to its roots, but has its own personality. The weight distribution is almost monotone, although top and bottom curves are slightly thin. Counters of the b, g, p and q are rounded and optically adjusted. The curved stem endings have a 10 degree angle. E and F have shorter center arms. M is splashed. Designer: Pablo Impallari
ca: La família Cabin font és un sans humanista de 4 pesos i veritable cursiva, inspirat en les tipografies d'Edward Johnston i Eric Gill, amb un toc de modernisme. La cabina incorpora proporcions modernes, ajustos òptics i alguns elements de les sans geomètriques. Es manté fidel a les seves arrels, però té la seva pròpia personalitat. La distribució del pes és gairebé monòtona, encara que les corbes superior i inferior són lleugerament fines. Els comptadors de b, g, p i q són arrodonits i ajustats òpticament. Les terminacions de tija corbades tenen un angle de 10 graus. E i F tenen els braços centrals més curts. M és esquinçat. Dissenyador: Pablo Impallari

source: Java lib for conversion of Java objects into JSON representation
ca: Lib de Java per a la conversió d'objectes Java en representació JSON

source: Gson is a Java library that can be used to convert a Java object into its JSON representation. It can also be used to convert a JSON string into an equivalent Java object. Gson can work with arbitrary Java objects including pre-existing objects that you do not have source-code of.
ca: Gson és una biblioteca Java que es pot utilitzar per convertir un objecte Java en la seva representació JSON. També es pot utilitzar per convertir una cadena JSON en un objecte Java equivalent. Gson pot treballar amb objectes Java arbitraris, inclosos objectes preexistents dels quals no teniu codi font.

source: API documentation for google-gson
ca: Documentació de l'API per a google-gson

source: This package contains the API documentation for google-gson.
ca: Aquest paquet conté la documentació de l'API per a google-gson.

source: Google Cloud Guest Agent
ca: Agent convidat de Google Cloud

source: Google Cloud Guest Configs
ca: Configuració de Google Cloud Guest

source: Google Cloud Guest OS Login
ca: Inici de sessió de Google Cloud Guest OS

source: Dependency injection framework for Java 5 and above
ca: Marc d'injecció de dependència per a Java 5 i superior

source: Guice alleviates the need for factories and the use of "new" in Java code. Guice's @Inject is a different "new". Writing factories will still be needed in some cases, but code will not directly depend on them. Guice embraces Java's type safe nature, especially when it comes to features introduced in Java 5 such as generics and annotations.
ca: Guice alleuja la necessitat de fàbriques i l'ús de "nou" en codi Java. L'InInject de Guice és una "nova" diferent. Les fàbriques d'escriptura encara seran necessàries en alguns casos, però el codi no dependrà directament d'elles. Guice abraça la naturalesa segura de Java, especialment pel que fa a les característiques introduïdes en Java 5 com els genèrics i les anotacions.

source: API documentation for Guice
ca: Documentació de l'API per a Guice

source: This package provides API documentation for Guice.
ca: Aquest paquet proporciona documentació de l'API per a Guice.

source: Google HTTP Client Library for Java
ca: Biblioteca de client de Google HTTP per a Java

source: Google HTTP Client Library for Java. Functionality that works on all supported Java platforms, including Java 5 (or higher) desktop (SE) and web (EE), Android, and Google App Engine.
ca: Biblioteca de client de Google HTTP per a Java. Funcionalitat que funciona en totes les plataformes Java compatibles, incloent Java 5 (o superior) desktop (SE) i web (EE), Android, i Google App Engine.

source: Google HTTP Client Findbugs plugin
ca: Connector Findbugs del client de Google HTTP

source: Google APIs Client Library Findbugs custom plugin.
ca: Connector personalitzat de Google APIs Client Library Findbugs.

source: Google HTTP Client GSON extensions
ca: Extensions GSON de Google HTTP Client

source: GSON extensions to the Google HTTP Client Library for Java.
ca: Extensions de GSON a la Google HTTP Client Library per a Java.

source: Google HTTP Client Jackson extensions
ca: Extensions de Google HTTP Client Jackson

source: Jackson extensions to the Google HTTP Client Library for Java.
ca: Jackson extensions a la Google HTTP Client Library for Java.

source: Google HTTP Client Jackson 2 extensions
ca: Extensions de Google HTTP Client Jackson 2

source: Jackson 2 extensions to the Google HTTP Client Library for Java.
ca: Jackson 2 extensions a la Google HTTP Client Library per a Java.

source: Javadoc for google-http-java-client
ca: Javadoc per a google-http-java-client

source: This package contains javadoc for google-http-java-client.
ca: Aquest paquet conté javadoc per a google-http-java-client.

source: Google HTTP Client JDO extensions
ca: Extensions JDO de Google HTTP Client

source: JDO extensions to the Google HTTP Client Library for Java.
ca: JDO extensions a la Google HTTP Client Library per a Java.

source: Google HTTP Client Parent POM
ca: POM del client de Google HTTP

source: Parent POM for the Google HTTP Client Library for Java.
ca: Parent POM per a la Biblioteca de Clients HTTP de Google per a Java.

source: Google HTTP Client Protocol Buffer extensions
ca: Extensions Buffer de protocol de client de Google HTTP

source: Protocol Buffer extensions to the Google HTTP Client Library for Java.
ca: Protocol Buffer extensions a la Google HTTP Client Library per a Java.

source: Google HTTP Client Test support
ca: Suport per a proves del client HTTP de Google

source: Shared classes used for testing of artifacts in the Google HTTP Client Library for Java.
ca: Classes compartides que s'utilitzen per provar artefactes a la Google HTTP Client Library for Java.

source: Google HTTP Client XML extensions
ca: Extensions XML de Google HTTP Client

source: XML extensions to the Google HTTP Client Library for Java.
ca: Extensions XML a la Google HTTP Client Library per a Java.

source: Google OAuth Client Library for Java
ca: Biblioteca de client de Google OAuth per a Java

source: Google OAuth Client Library for Java. Functionality that works on all supported Java platforms, including Java 5 (or higher) desktop (SE) and web (EE), Android, and Google App Engine.
ca: Google OAuth Client Library for Java. Funcionalitat que funciona en totes les plataformes Java compatibles, incloent Java 5 (o superior) desktop (SE) i web (EE), Android, i Google App Engine.

source: Google OAuth Client Java 6 extensions
ca: Extensions de Google OAuth Client Java 6

source: Java 6 (and higher) extensions to the Google OAuth Client Library for Java.
ca: Extensions Java 6 (i superiors) a la Google OAuth Client Library for Java.

source: Javadoc for google-oauth-java-client
ca: Javadoc per a google-oauth-java-client

source: This package contains javadoc for google-oauth-java-client.
ca: Aquest paquet conté javadoc per a google-oauth-java-client.

source: Google OAuth Client Parent POM
ca: POM del client de Google OAuth

source: Parent POM for the Google OAuth Client Library for Java.
ca: Parent POM per a la Biblioteca de Clients de Google OAuth per a Java.

source: Google OAuth Client Servlet and JDO extensions
ca: Extensions Google OAuth Client Servlet i JDO

source: Servlet and JDO extensions to the Google OAuth Client Library for Java.
ca: Extensions Servlet i JDO a la Google OAuth Client Library per a Java.

source: Google Cloud OSConfig Agent
ca: Agent OSConfig de Google Cloud

source: Geometric sans serif typefaces
ca: Tipus de lletra geomètrics sans serif
