Repository: openSUSE/packages-i18n
Catalog: */po/google.*.po
Languages: ca, ja

source: Header files for libglog0
ca: Fitxers de capçalera per a la libglog0
ja: libglog0 向けヘッダファイル

source: The glog library implements application-level logging. This library provides logging APIs based on C++-style streams and various helper macros. This package provides development files for libglog0.
ca: La biblioteca glog implementa el registre a nivell d'aplicació. Aquesta biblioteca proporciona APIs de registre basades en fluxos d'estil C++ i diverses macros d'ajuda. Aquest paquet proporciona fitxers de desenvolupament per a la libglog0.
ja: glog ライブラリはアプリケーションレベルのログ機構を実装しています。このライブラリは C++ スタイルのストリームをベースにしたログ API のほか、さまざまなマクロが用意されています。 このパッケージには、 libglog0 向けの開発用ファイルが含まれています。

source: Google C++ Mocking Framework - Development files
ja: Google C++ Mocking フレームワーク - 開発用ファイル

source: Inspired by jMock, EasyMock, and Hamcrest, and designed with C++'s specifics in mind, Google C++ Mocking Framework (or Google Mock for short) is a library for writing and using C++ mock classes. This package provides shared libraries and header files for development with googlemock.
ca: Inspirat en jMock, EasyMock i Hamcrest, i dissenyat tenint en compte les especificacions de C++, Google C++ Mocking Framework (o Google Mock per abreujar) és una biblioteca per escriure i utilitzar classes de simulacres de C++. Aquest paquet proporciona biblioteques compartides i fitxers de capçalera per al desenvolupament amb googlemock.
ja: jMock, EasyMock, Hamcrest などからヒントを得ているほか、 C++ 言語固有の箇所に念頭をおいて作られた、 C++ モッククラスを作成し、使用するための Google C++ Mocking フレームワーク (単純に "Google Mock" と略す場合もあります) です。 このパッケージには、 googlemock を利用して開発を行なうのに必要な、共有ライブラリとヘッダファイルが含まれています。

source: Serif Font for Literature
ja: 文学用セリフフォント

source: Alegreya was chosen as one of 53 "Fonts of the Decade" at the ATypI Letter2 competition in September 2011, and one of the top 14 text type systems. It was also selected in the 2nd Bienal Iberoamericana de Diseño, competition held in Madrid in 2010. Alegreya is a typeface originally intended for literature. Among its crowning characteristics, it conveys a dynamic and varied rhythm which facilitates the reading of long texts. Also, it provides freshness to the page while referring to the calligraphic letter, not as a literal interpretation, but rather in a contemporary typographic language. Designed by Juan Pablo del Peral for Huerta Tipográfica.
ja: Alegreya は、 2011 年 9 月に行なわれた ATypI Letter2 コンペティションで "Fonts of the Decade" (10 年間を代表するフォント) のうちの 1 つに選ばれたフォントです。 2010 年マドリードで開かれたコンペティション 2nd Bienal Iberoamericana de Diseño でも選ばれています。 Alegreya はもともと文学向けに作られたタイプフェイスです。最高級の品質を保ち、ダイナミックで変化に富んだリズムを備えていて、長い文章を読みやすくするようになっています。また、筆記体の文字を参考にしながら、文字そのものの編集ではなく、現代的なタイポグラフィック言語として利用できるように作られています。

source: Easily Readable Sans Serif Font
ca: Llegeix fàcilment Sans Serif Font
ja: 読みやすいサンセリフフォント

source: Allerta is an open source typeface designed for use in signage. Allerta was designed to be easily and quickly read from a distance. Each letter exploits the most unique aspects of that individual letter so that each character can be easily distinguished from any other. Allerta has been released as an open source project so that those countries, communities, and/or organizations without a proper signage system may have a way of quickly designing and implementing one. While Allerta is complete with a large character set, because it is open source, modification and expansion is encouraged. For the more urgent of circumstances, Allerta Stencil and an accompanying kit have been designed so that signage can be created with nothing more than the kit of letters, a can of spray paint, and the nearest available substrate. Although the stencil kit may allude the finer points of typographic spacing, it is intended to serve the most basic purpose of signage: guiding people towards their destination or towards assistance. The name Allerta is derived from the origins of the word alert (adj. swift, v. to advise or warn). The Italian origin all'erta literally means on the lookout. Designer: Matt McInerney
ca: L'Allerta és una tipografia de codi obert dissenyada per al seu ús en la senyalització. L'Allerta va ser dissenyada per ser llegida fàcilment i ràpidament des de la distància. Cada lletra explota els aspectes més singulars d'aquesta lletra individual perquè cada caràcter es pugui distingir fàcilment de qualsevol altra. Allerta ha estat llançat com un projecte de codi obert de manera que aquells països, comunitats i/o organitzacions sense un sistema de senyalització adequat poden tenir una manera de dissenyar-lo i implementar-lo ràpidament. Mentre que Allerta es completa amb un joc de caràcters gran, perquè és de codi obert, es fomenta la modificació i l'expansió. Per a les circumstàncies més urgents, s'han dissenyat l'Allerta Stencil i un kit d'acompanyament perquè la senyalització es pugui crear amb res més que el kit de lletres, una llauna de pintura en esprai i el substrat més proper disponible. Tot i que el kit de plantilla pot al·ludir als punts més fins d'espaiat tipogràfic, està pensat per servir el propòsit més bàsic de la senyalització: guiar les persones cap al seu destí o cap a l'assistència. El nom Allerta deriva dels orígens de la paraula alert (adj. SWIFT, v. per aconsellar o advertir). L'origen italià all'erta significa literalment al mirador. Dissenyador: Matt McInerney
ja: Allerta は署名として利用するように設計されたオープンソースのタイプフェイスです。 Allerta は遠くからでも簡単かつ素早く読むことができるように作られています。それぞれの文字には多くのユニークな要素が含まれていて、個別の文字がきちんと識別できるようになっています。 Allerta はオープンソースのプロジェクトとして公開されているものであるため、署名システムの確立していない国やコミュニティ、団体などで素早く署名を設計して使うことができるようになっています。 Allerta は幅広い範囲の文字に対応していて、オープンソースのプロジェクトであることから、編集や拡張を歓迎しています。 状況の急激な変化により、 Allerta Stencil と関連するキットが設計され、これを利用するだけで署名を簡単に作成することができますし、そうでなくても近いサンプルを作成することができます。ステンシルキットではタイポグラフィにおける適切な位置を示すようになっていますが、これは署名の基本的な目的を達することができるようにするためのものです。 Allerta という名前は alert (通知や警告などの意味) という単語から作った独自の名前で、イタリア語で all'erta と言うところから名づけられています。 デザイナー: Matt McInerney

source: A Free Monospace Font
ca: Un tipus de lletra monoespai lliure
ja: フリーの等幅フォント

source: Anonymous Pro is a family of four fixed-width fonts designed especially with coding in mind. Characters that could be mistaken for one another (O, 0, I, l, 1, etc.) have distinct shapes to make them easier to tell apart in the context of source code. Anonymous Pro also features an international, Unicode-based character set, with support for most Western and European Latin-based languages, Greek, and Cyrillic. It also includes special "box drawing" characters for those who need them. Designer: Mark Simonson
ca: Anonymous Pro és una família de quatre tipus de lletra d'amplada fixa dissenyats especialment pensant en la codificació. Els caràcters que es poden confondre entre si (O, 0, I, l, 1, etc.) tenen formes diferents per fer-los més fàcils de distingir en el context del codi font. Anonymous Pro també presenta un conjunt de caràcters internacional basat en Unicode, amb suport per a la majoria de llengües llatines occidentals i europees, grec i ciríl·lic. També inclou caràcters especials de "box drawing" per a aquells que els necessitin. Dissenyador: Mark Simonson
ja: Anonymous Pro は特にコード作成時の使用を目的とした、 4 種類の等幅フォントファミリです。ソースコードの中でよくある、間違えやすい文字 (O, 0, I, l, 1 など) をきちんと識別できるように作られています。 Anonymous Pro は国際化にも対応していて、 Unicode ベースの文字セットを提供しています。もちろん多くの西洋／ヨーロッパラテンベース言語、ギリシャ語やキリル語にも対応しています。また、必要な方々に "罫線文字" も含まれています。 デザイナー: Mark Simonson

source: Monospace Sans Serif Font
ca: Tipus de lletra monoespai Sans Serif
ja: 等幅 Sans Serif フォント

source: Arimo was designed by Steve Matteson as a sans serif design that is metrically compatible with Arial. Arimo offers improved on-screen readability characteristics and the pan-European WGL character set and solves the needs of developers looking for width-compatible fonts to address document portability across platforms.
ca: Arimo va ser dissenyat per Steve Matteson com un disseny de sans serif que és mètricament compatible amb Arial. Arimo ofereix millors característiques de llegibilitat a la pantalla i el joc de caràcters WGL paneuropeu i resol les necessitats dels desenvolupadors que busquen fonts compatibles amb l'amplada per abordar la portabilitat de documents a través de plataformes.
ja: Arimo は Steve Matteson 氏が設計したフォントで、 Arial とメトリックの点で互換のある San Serif フォントです。 Arimo は画面上での視認性を向上させることができるほか、欧州における一般的な WGL 文字セットにも対応しています。また、複数のプラットフォームで文書の可搬性を維持する目的で、等幅のフォントを希望する開発者の要件を満たすこともできます。

source: Google Authenticator PAM module
ca: Mòdul PAM de Google Authenticator
ja: Google 認証 PAM モジュール

source: Integrate GOOGLE Authenticator into your login process for full 2FA.
ca: Integra a Google Authenticator en el teu procés d'inici de sessió complet per a 2FA.
ja: お使いのログイン処理に完全な二要素認証を導入するため、 Google Authenticator を導入します。

source: Humanist Sans Serif Font
ca: Humanista Sans Serif Font
ja: Humanist Sans Serif フォント

source: The Cabin font family is a humanist sans with 4 weights and true italics, inspired by Edward Johnston’s and Eric Gill’s typefaces, with a touch of modernism. Cabin incorporates modern proportions, optical adjustments, and some elements of the geometric sans. It remains true to its roots, but has its own personality. The weight distribution is almost monotone, although top and bottom curves are slightly thin. Counters of the b, g, p and q are rounded and optically adjusted. The curved stem endings have a 10 degree angle. E and F have shorter center arms. M is splashed. Designer: Pablo Impallari
ja: Cabin フォントファミリは 4 種類のウエイトと真のイタリック体に対応した、人間的な Sans 体フォントです。 Edward Johnston 氏と Eric Gill 氏のタイプファイスを参考にしていて、モダニズムを目指した作りになっています。 Cabin にはモダンなプロポーションのほか、光学的な調整や幾何学的な Sans 体の要素を取り入れて作られています。 Cabin はそのルーツを守りながら、独自の個性を兼ね備えています。 ウエイトの配置はモノトーンで、上下の曲線に比較的薄く作られています。 b, g, p, q などの反対側は丸められていて、光学的な調整が加えられています。曲線型の幹の終わり部分には、 10 度の角度が付けられています。 E, F にはそれぞれ短いセンターアームが付けられているほか、 M には跳ね上げが付けられています。 デザイナー: Pablo Impallari

source: Sans-serif Font Metrics-compatible with Cambria
ca: Font Sans-serif Compatible amb Cambria
ja: Cambria とメトリック互換のあるサンセリフフォント

source: Workhorse serif font that is designed to be a metrics-compatible drop-in replacement for Cambria. Contains Regular, Bold, Italic, and Bold Italic version. Designed by Huerta Típografica for Google.
ca: Tipus de lletra Workhorse serif que està dissenyat per ser un reemplaçament de gota compatible amb mètriques per Cambria. Conté la versió regular, negreta, itàlica i negreta. Dissenyat per Huerta Típografica per a Google.
ja: Workhorse Serif フォントは Cambria とのメトリック互換があり、その場で入れ替えて使用することのできるフォントです。レギュラーのほか、ボールド、イタリック、ボールドイタリックのそれぞれが含まれています。 デザイナー: Huerta Típografica

source: Serif Font for Classicists, Biblical Scholars, Medievalists, and Linguists
ca: Serif Font per a classicistes, erudits bíblics, medievalistes i lingüistes
ja: 古典文学者や聖書学者、中世研究家や言語学者のためのセリフフォント

source: Cardo is a large Unicode font specifically designed for the needs of classicists, Biblical scholars, medievalists, and linguists. It also works well for general typesetting in situations where a high-quality Old Style font is appropriate. Its large character set supports many modern languages as well as those needed by scholars. Cardo also contains features that are required for high-quality typography such as ligatures, text figures (also known as old style numerals), true small capitals and a variety of punctuation and space characters. Designer: David Perry
ca: Cardo és un gran tipus de lletra Unicode específicament dissenyat per a les necessitats dels classicistes, erudits bíblics, medievalistes i lingüistes. També funciona bé per a la tipografia general en situacions on és apropiat un tipus de lletra d'estil antic d'alta qualitat. El seu gran joc de caràcters suporta moltes llengües modernes, així com les necessàries pels estudiosos. Cardo també conté característiques que són necessàries per a una tipografia d'alta qualitat com ara lligadures, figures de text (també conegudes com a nombres d'estil antic), veritables capitells petits i una varietat de signes de puntuació i espai. Dissenyador: David Perry
ja: Cardo は古典文学者や聖書学者、中世研究家や言語学者のために設計された、広範囲な文字に対応する Unicode フォントです。高品質な古い形式のフォントが必要な場所にうまく適合するように作られています。また、学者が必要とする多くのモダンな言語に対応する幅広い文字セットが特長です。 Cardo には高品質な合字やテキストフィギュア (古い形式の数字表記) に必要な機能のほか、真のスモールキャピタルや様々な句読法やスペース文字にも対応しています。 デザイナー: David Perry

source: Sans-serif Font Metrics-compatible with Calibri
ca: Sans-serif Font Mètrica compatible amb Calibri
ja: Calibri とフォントの互換性がある Sans-serif フォント

source: Modern, friendly sans-serif font derived from the Lato font that is designed to be a metrics-compatible drop-in replacement for Calibri. Contains Regular, Bold, Italic, and Bold Italic version. Designed by Lukasz Dziedzic of tyPoland for Google.
ca: Font moderna i amigable sans-serif derivada de la font Lato que està dissenyada per ser una substitució de la mètrica compatible per Calibri. Conté la versió regular, negreta, itàlica i negreta. Dissenyat per Lukasz Dziedzic de tyPoland per a Google.
ja: Calibri フォントとメトリック互換があり、その場で置き換えることのできる Lato フォントを派生させた、モダンでフレンドリーな sans-serif フォントです。レギュラーとボールド、イタリックとボールドイタリックの各版があります。 Google 向けに tyPoland の Lukasz Dziedzic 氏がデザインしました。

source: GCE Instance Initialization
ca: Inicialització de la Instància GCE
ja: GCE インスタンス初期化

source: Initialization code for Google Compute Engine instances.
ca: Codi d'inicialització per a les instàncies de Google Compute Engine.
ja: Google Compute Engine インスタンスを初期化するためのコードです。

source: OS Login Functionality for Google Compute Engine
ca: Funcionalitat d'inici de sessió del SO per al motor de càlcul de Google
ja: Google Compute Engine 向け OS ログイン機能

source: Libraries and scripts to enable OS Login functionality for Google Compute Engine. Modifies sshd, nsswitch, and sshd_pam configurations.
ca: Biblioteques i scripts per activar la funcionalitat d'inici de sessió del SO per al Google Compute Engine. Modifica les configuracions sshd, nsswitch i sshdpam.
ja: Google Compute Engine に対して、 OS のログイン機能を提供するライブラリとスクリプトです。 sshd, nsswitch, sshd_pam の各設定を修正します。

source: Cousine was designed by Steve Matteson as a sans serif design that is metrically-compatible with Courier New. Cousine offers improved on-screen readability characteristics and the pan-European WGL character set and solves the needs of developers looking for width-compatible fonts to address document portability across platforms.
ca: Steve Matteson ha dissenyat Cousine com un tipus sense gràcies compatible mètricament amb Courier New. Cousine ofereix característiques de llegibilitat millorades i el joc de caràcters paneuropeu WGL. Gràcies a la seva amplada compatible, és una solució per als programadors que cerquen la compatibilitat entre plataformes dels seus documents.
ja: Cousine は Steve Matteson 氏が設計したフォントで、 Courier New とメトリックの点で互換のある San Serifフォントです。また、 ります。 Cousine は画面上での視認性を向上させることができるほか、欧州における一般的な WGL 文字セットにも対応しています。また、複数のプラットフォームで文書の可搬性を維持する目的で、等幅のフォントを希望する開発者の要件を満たすこともできます。

source: Croscore fonts
ca: Tipus de lletra Croscore
ja: Croscore フォント

source: A collection of fonts which are metric-compatible to "Arial", "Times New Roman" and "Courier New". Croscore fonts are based on the Liberation fonts and extend its glyph coverage.
ca: Una col·lecció de famílies tipográfiques que són compatibles en les seves métriques amb Arial, Times New Roman i Courier New. Els tipus de lletra Croscore es basen en la família Liberation i n'amplien la cobertura de glifs.
ja: "Arial", "Times New Roman", "Courier New" の各フォントとメトリック面での互換性があるフォント集です。 Croscore フォントは Liberation フォントをベースにしていて、グリフのカバー範囲を拡張しています。

source: Fonts With Extensive Style and Language Support Developed for Android
ca: Tipus de lletra amb molts estils i per a moltes llengües, desenvolupats per a l’Android
ja: Android 向けに開発された、広範囲のスタイルと言語に対応したフォント

source: The Droid family of fonts consists of Droid Sans, Droid Sans Mono and Droid Serif. Each contains extensive character set coverage including Western Europe, Eastern/Central Europe, Baltic, Cyrillic, Greek and Turkish support. The Droid Sans regular font also includes support for Simplified and Traditional Chinese, Japanese and Korean support for the GB2312, Big 5, JIS 0208 and KSC 5601 character sets respectively. Droid was designed by Ascender's Steve Matteson to provide optimal quality and comfort on a mobile handset when rendered in application menus, web browsers and for other screen text. - Ascender Press Release, http://www.ascendercorp.com/pr/2007-11-12/
ca: La família de fonts Droid consisteix en Droid Sans, Droid Sans Mono i Droid Serif. Cadascuna conté una àmplia cobertura de jocs de caràcters que inclouen l'Europa occidental, l'Europa Oriental/Central, el Bàltic, el ciríl·lic, el grec i el suport turc. La font regular de Droid Sans també inclou suport per a xinès simplificat i tradicional, japonès i coreà per als jocs de caràcters GB2312, Big 5, JIS 0208 i KSC 5601 respectivament. Droid va ser dissenyat per Steve Matteson d'Ascender per proporcionar una qualitat i comoditat òptimes en un dispositiu mòbil quan es representa en menús d'aplicacions, navegadors web i per a altres text de pantalla. - Nota de Premsa Ascender, http://www.ascendercorp.com/pr/2007-11-12/
ja: Droid フォントファミリーは、それぞれ Droid Sans, Droid Sans Mono, Droid Serif のフォントから構成されています。それぞれのフォントには西ヨーロッパや東／中央ヨーロッパ、バルト語やキリル語、ギリシャ語やトルコ語を含む広範囲の文字に対応しています。また Droid Sans レギュラーフォントには簡体字／繁体字中国語 (GB2312, Big5)や日本語 (JIS 0208)、韓国語 (KSC 5601) の文字に対応しています。 Droid は Ascender 社の Steve Matteson 氏が設計したもので、モバイルヘッドセットで利用する際にアプリケーションメニューや Web ブラウザ、その他の画面用テキストに対して、読みやすく心地よいフォントを提供する目的で作られています - Ascender プレスリリースhttp://www.ascendercorp.com/pr/2007-11-12/ より

source: Contemporary Geometric Sans Serif Typeface
ca: Tipus de lletra Geometric Sans Serif
ja: Contemporary Humanist Sans Serif タイプフェイス

source: Exo is a contemporary geometric sans serif typeface that tries to convey a technological/futuristic feeling while keeping an elegant design. Exo was meant to be a very versatile font, so it has 9 weights (the maximum on the web) each with a true italic version. It works great as a display face but it also works good for small to intermediate size texts. Designer: Natanael Gama
ca: Exo és una tipografia geomètrica contemporània de sans serif que intenta transmetre una sensació tecnològica/futurista alhora que manté un disseny elegant. Exo era una font molt versàtil, per la qual cosa té 9 pesos (el màxim a la web) cadascun amb una versió en cursiva veritable. Funciona molt bé com a pantalla, però també funciona bé per a textos de mida petita o intermèdia. Dissenyador: Natanael Gama
ja: Exo は現代的で幾何学的なサンセリフタイプフェイスで、上品なデザインでありながらも技術的かつ先進的なフィーリングを持つように設計されています。 Exo は非常に用途の多いフォントとなるように作られており、 9 種類のウエイト (Web 上では最も多い種類です) のほか、真のイタリック体にも対応しています。また、表示向けに適切なフォントでありながら、小さな表示のテキストでもうまく動作するように作られています。 デザイナー: Natanael Gama

source: Monospace Font Designed for Printed Code Listings
ca: Tipus de lletra monoespai dissenyat per a les llistes de codi impreses
ja: ソースコードの印刷に適した等幅フォント

source: Inconsolata Bold is a Unicode typeface family that supports languages that use the Latin script and its variants, and could be expanded to support other scripts. Designer: Raph Levien
ca: Inconsolata Bold és una família de tipografies Unicode que suporta llengües que utilitzen l'alfabet llatí i les seves variants, i que es podria ampliar per donar suport a altres scripts. Dissenyador: Raph Levien
ja: Inconsolata Bold は Unicode のタイプフェイスファミリで、ラテン文字とその派生形を使用する言語に対応していますが、それ以外の文字にも拡張可能な仕組みです。 デザイナー: Raph Levien

source: Monospaced Typewriter Font
ca: Tipus de lletra monoespaiada de la màquina d'escriure
ja: 等幅のタイプライターフォント

source: Lekton has been designed at ISIA Urbino, Italy, and is inspired by some of the typefaces used on the Olivetti typewriters. It was designed by: Paolo Mazzetti, Luciano Perondi, Raffaele Flaùto, Elena Papassissa, Emilio Macchia, Michela Povoleri, Tobias Seemiller, Riccardo Lorusso, Sabrina Campagna, Elisa Ansuini, Mariangela Di Pinto, Antonio Cavedoni, Marco Comastri, Luna Castroni, Stefano Faoro, Daniele Capo, and Jan Henrik Arnold.
ca: Lekton ha estat dissenyat a ISIA Urbino, Itàlia, i s'inspira en algunes de les tipografies utilitzades a les màquines d'escriure Olivetti. Va ser dissenyat per: Paolo Mazzetti, Luciano Perondi, Raffaele Flatoto, Elena Papassissa, Emilio Macchia, Michela Povoleri, Tobias Seemiller, Riccardo Lorusso, Sabrina Campagna, Elisa Ansuini, Mariangela Di Pinto, Antonio Cavedoni, Marco Comastri, Luna Castroni, Stefano Faoro, Daniele Capo, i Jan Henrik Arnold.
ja: Lekton はイタリアにある ISIA Urbino で設計されたフォントで、 Olivetti 社のタイプライターで使用されていたタイプフェイスを参考にして作られています。 デザイナー: Paolo Mazzetti, Luciano Perondi, Raffaele Flaùto, Elena Papassissa, Emilio Macchia, Michela Povoleri, Tobias Seemiller, Riccardo Lorusso, Sabrina Campagna, Elisa Ansuini, Mariangela Di Pinto, Antonio Cavedoni, Marco Comastri, Luna Castroni, Stefano Faoro, Daniele Capo, Jan Henrik Arnold

source: Readable Text Serif Font for Screen
ca: Tipus de lletra de serif de text llegible per a la pantalla
ja: 画面上で読みやすいテキストセリフフォント

source: Merriweather was designed to be a text face that is pleasant to read on screens. Merriweather is an evolving and will be updated. As of now there are 4 styles: Regular, Light, Bold, and Black. There will also be Italic in each of these weights. And fairly soon after that there will also be a sans serif version which mirrors the weights and styles of the Serif design. Designed by Eben Sorkin, Merriweather features a very large x height, slightly condensed letterforms, a mild diagonal stress, sturdy serifs and open forms. Because Merriweather is a work in progress and will be improved regularly. This means you can request improvements and even fund specific features if if they are outside of the current scope of work. For more information and to stay updated see Eben Sorkin's blog and Flickr stream and the Merriweather Twitter microblog. Designer: Eben Sorkin
ca: El Merriweather va ser dissenyat per ser una cara de text que és agradable de llegir a les pantalles. El Merriweather està en evolució i s'actualitzarà. A partir d'ara hi ha 4 estils: Regular, Light, Bold i Black. També hi haurà cursiva en cadascun d'aquests pesos. I poc després també hi haurà una versió sans serif que reflecteix els pesos i estils del disseny Serif. Dissenyat per Eben Sorkin, Merriweather té una alçada x molt gran, formes de lletra lleugerament condensades, un suau estrès diagonal, serifes robustes i formes obertes. Perquè el Merriweather és un treball en curs i es millorarà regularment. Això significa que es poden sol·licitar millores i fins i tot finançar característiques específiques si estan fora de l'àmbit de treball actual. Per obtenir més informació i mantenir-se actualitzat, consulteu el blog i el flux de Flickr d'Eben Sorkin i el microblog de Merriweather Twitter. Dissenyador: Eben Sorkin
ja: Merriweather は画面での閲覧に適したテキストフェイスとして設計されています。 Merriweather は今もなお進化中のフォントで、将来的に更新される予定です。現時点では 4 種類のスタイル (レギュラー, ライト, ボールド, ブラック) が用意されています。将来的にはこれらのスタイルに対してそれぞれイタリック体が作成される予定です。また、セリフ体のデザインを反映したサンセリフ版も作成される予定です。 デザイナー: Eben Sorkin Merriweather にはとても巨大なフォント高にも対応しているほか、比較的縮小されたレターフォームや対角ストレス、頑丈なセリフ体やオープンフォームなどにも対応しています。 Merriweather は現在進行中のプロジェクトであるため、定期的に改善が図られる予定です。言い換えると、改善を提案したり、現時点での作業範囲からは外れるような機能を求めたりすることができます。最新の情報について、詳しくは Eben Sorkin 氏のブログまたは Flickr ストリーム、 Merriweather の Twitter マイクロブログなどをご覧ください。 デザイナー: Eben Sorkin

source: Sans Serif Font
ja: サンセリフフォント
