Repository: openSUSE/packages-i18n
Catalog: */po/google.*.po
Languages: ca, ja

source: "Nobile" is designed to work with the technologies of digital screens and handheld devices without losing the distinctive look more usually found in fonts designed for printing. Going back to William Morris's baseline "Have nothing in your house that you do not know to be useful, or believe to be beautiful", the aim was to design a font that could function well, have good legibility on screen yet also be good loooking, not only at larger display sizes but also right down to small text sizes. Designer: Vernon Adams
ca: "Nobile" està dissenyat per treballar amb les tecnologies de pantalles digitals i dispositius de mà sense perdre l'aspecte distintiu que es troba més habitualment en les fonts dissenyades per a la impressió. Tornant a la línia de base de William Morris "No tens res a casa que no sàpigues que sigui útil, o creguis que és bonic", l'objectiu era dissenyar una font que pogués funcionar bé, tenir bona llegibilitat a la pantalla però també ser bona loooking, no només a mides de pantalla més grans sinó també a mides de text petites. Dissenyador: Vernon Adams
ja: "Nobile" は印刷用に設計されたフォントにおける独特の見た目を失うことなく、デジタル画面やハンドヘルドデバイスで作業を行なうことに目的としたフォントです。 William Morris 氏の基本的な考えである "使いやすくもなく、美しいとも思わないものを家に置いてはならない" という考えに戻り、十分な有用性を保ちながら、巨大なディスプレイサイズから小さなテキストサイズに至るまで、画面上における読みやすさと外観を保つようにフォントを設計することを目指しています。 デザイナー: Vernon Adams

source: Noto Font Families License
ca: Llicència Noto Font Famílies
ja: Noto フォントファミリライセンス

source: License for Google's Noto fonts.
ca: Llicència per als tipus de lletra Noto de Google.
ja: Google の Noto フォント向けライセンスです。

source: Humanist Sans Serif Typeface
ja: Humanist Sans Serif タイプフェイス

source: Open Sans is a humanist sans serif typeface designed by Steve Matteson, Type Director of Ascender Corp. This version contains the complete 897 character set, which includes the standard ISO Latin 1, Latin CE, Greek and Cyrillic character sets. Open Sans was designed with an upright stress, open forms and a neutral, yet friendly appearance. It was optimized for print, web, and mobile interfaces, and has excellent legibility characteristics in its letterforms. Designer: Steve Matteson
ca: Open Sans és una tipografia humanista de sans serif dissenyada per Steve Matteson, Director Tipus d'Ascender Corp. Aquesta versió conté el joc de caràcters complet de 897, que inclou l'estàndard ISO Latin 1, Latin CE, grec i ciríl·lic. Open Sans va ser dissenyat amb un estrès vertical, formes obertes i un aspecte neutre però amable. Va ser optimitzat per a interfícies d'impressió, web i mòbil, i té excel·lents característiques de llegibilitat en les seves formes de lletra. Dissenyador: Steve Matteson
ja: Open Sans は Ascender Corp のタイプディレクタである Steve Matteson 氏が設計した、 humanist sans serif タイプフェイスです。 このバージョンには 897 種類のキャラクタセット (ISO Latin 1, Latin CE, ギリシャ語／キリル語) が含まれています。 Open Sans は直立方向を強調し、オープンなフォームと中立性を重視しながら、親しみのある外観を持っています。印刷や Web 、モバイル用のインターフェイスに最適化されていて、読みやすさも素晴らしいものに仕上がっています。 設計者: Steve Matteson

source: Mechanical yet friendly fonts
ca: Tipus de lletra mecànics però amigables
ja: 機械的でありながらフレンドリーなフォント

source: The Material Design language relies on traditional typographic tools such as scale, space, rhythm, and alignment with an underlying grid. Successful deployment of these tools is essential to help users quickly understand a screen of information. To support such use of typography, Android 4.0 (Ice Cream Sandwich) introduced a new type family named Roboto, created specifically for the requirements of UI and high-resolution screens. This package contains the original Roboto sans-serif font, a condensed version of the sans-serif version, and a newer slab-serif version. Designer: Christian Robertson
ca: El llenguatge Material Design es basa en eines tipogràfiques tradicionals com l'escala, l'espai, el ritme i l'alineació amb una quadrícula subjacent. El desplegament amb èxit d'aquestes eines és essencial per ajudar els usuaris a entendre ràpidament una pantalla d'informació. Per donar suport a aquest ús de la tipografia, Android 4.0 (Ice Cream Sandwich) va introduir una nova família de tipus anomenada Roboto, creada específicament per als requisits de la interfície d'usuari i pantalles d'alta resolució. Aquest paquet conté la font original de Roboto sans-serif, una versió condensada de la versió de sans-serif i una versió més nova de slab-serif. Dissenyador: Christian Robertson
ja: Material Design 言語はスケールやスペース、リズムや枠内への調整など、さまざまな古典的タイポグラフィツールに依存しています。これらのツールを正しく配置することで、ユーザに画面情報を素早く伝えることができるようになります。 このようなタイポグラフィの仕様に対応するため、 Android 4.0 (Ice Cream Sandwich) では Rotobo と呼ばれる新しいタイプファミリが提供されるようになりました。これは特に、 UI の要件と高解像度画面の要件に適合するように作られています。 このパッケージには、オリジナルの Roboto サンセリフフォント (サンセリフの圧縮版) と、新しい slab-serif 版が含まれています。 デザイナー: Christian Robertson

source: Google Roboto Mono fonts
ca: Tipus de lletra de Google Roboto Mono
ja: Google Roboto Mono フォント

source: Roboto Mono is a monospaced addition to the Roboto type family. Like the other members of the Roboto family, the fonts are optimized for readability on screens across a wide variety of devices and reading environments. While the monospaced version is related to its variable width cousin, it doesn't hesitate to change forms to better fit the constraints of a monospaced environment. For example, narrow glyphs like 'I', 'l' and 'i' have added serifs for more even texture while wider glyphs are adjusted for weight. Curved caps like 'C' and 'O' take on the straighter sides from Roboto Condensed.
ca: Roboto Mono és una addició monoespacial a la família de tipus Roboto. Igual que els altres membres de la família Roboto, les fonts estan optimitzades per a la llegibilitat en pantalles en una àmplia varietat de dispositius i entorns de lectura. Mentre que la versió monoespaiada està relacionada amb el seu cosí d'amplada variable, no dubta a canviar les formes per adaptar-se millor a les restriccions d'un entorn monoespaiat. Per exemple, glifs estrets com 'I', 'l' i 'i' han afegit serifs per a una textura més uniforme, mentre que els glifs més amples s'ajusten per al pes. Els taps corbats com 'C' i 'O' prenen els costats més rectes de Roboto Condensed.
ja: Roboto Mono は Roboto タイプファミリにおける等幅フォントです。 Roboto ファミリの他のメンバーと同様に、このフォントは様々なデバイスや表示環境で可読性を高めるように最適化されています。等幅フォントは可変幅フォントと同様に等幅環境の制約にうまくフィットし、既存の使い勝手を変えないようになっています。たとえば 'I', 'l', 'i' のような幅の狭い文字にはセリフを加え、幅の広い文字とウエイトが合うように作られています。また、 'C' や 'O' のようなカーブのある文字の場合は、 Roboto Condensed からより直線的な形状を取り込んでいます。

source: Tinos was designed by Steve Matteson as an serif design that is metrically compatible with Times New Roman. Tinos offers improved on-screen readability characteristics and the pan-European WGL character set and solves the needs of developers looking for width-compatible fonts to address document portability across platforms.
ca: Tinos va ser dissenyat per Steve Matteson com un disseny serif que és mètricament compatible amb Times New Roman. Tinos ofereix característiques de llegibilitat millorades a la pantalla i el joc de caràcters WGL paneuropeu i resol les necessitats dels desenvolupadors que busquen fonts compatibles amb l'amplada per abordar la portabilitat de documents a través de plataformes.
ja: Tinos は Steve Matteson 氏が設計したフォントで、 Times New Roman とメトリックの点で互換のある Serifフォントです。また、 があります。 Tinos は画面上での視認性を向上させることができるほか、欧州における一般的な WGL 文字セットにも対応しています。また、複数のプラットフォームで文書の可搬性を維持する目的で、等幅のフォントを希望する開発者の要件を満たすこともできます。

source: Google C++ Testing Framework - Development files
ja: Google C++ テストフレームワーク - 開発用ファイル

source: Google\'s framework for writing C++ tests on a variety of platforms (Linux, Mac OS X, Windows, Cygwin, Windows CE, and Symbian). Based on the xUnit architecture. Supports automatic test discovery, a rich set of assertions, user-defined assertions, death tests, fatal and non-fatal failures, value- and type-parameterized tests, various options for running the tests, and XML test report generation. This package provides shared libraries and header files for development with googletest.
ja: C++ 向け Google フレームワークは、さまざまな種類のプラットフォーム (Linux, Mac OS X, Windows, Cygwin, Windows CE, Symbian) でテストすることができます。 xUnit アーキテクチャをベースにしていて、自動的なテスト検出やアサーションに対する豊富な機能のほか、ユーザ定義のアサーションやデステスト、致命的／非致命的エラーの扱いや値／型をパラメータ化したテストなどを行なうことができます。また、テストの実行に際しては様々なオプションを設定することができるほか、 XML 形式でのテストレポートも生成することができます。 このパッケージには、 googletest で開発を行なうのに必要な、共有ライブラリとヘッダファイルが含まれています。

source: Logging library for C++
ca: Biblioteca de registre per a C++
ja: C++ 向けログライブラリ

source: The glog library implements application-level logging. This library provides logging APIs based on C++-style streams and various helper macros.
ca: La biblioteca glog implementa el registre a nivell d'aplicació. Aquesta biblioteca proporciona APIs de registre basades en fluxos d'estil C++ i diverses macros d'ajuda.
ja: glog ライブラリはアプリケーションレベルのログ機構を実装しています。このライブラリは C++ スタイルのストリームをベースにしたログ API のほか、さまざまなマクロが用意されています。

source: Noto Color Emoji Font
ja: Noto 色絵文字フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains ColorEmoji font, hinted.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの ColorEmoji フォントが含まれています。

source: Noto Emoji Font
ja: Noto 絵文字フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Emoji font, hinted.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Emoji フォントが含まれています。

source: Noto Kufi Arabic Font
ca: Tipus de lletra àrab de Noto Kufi
ja: Noto アラビア語クーフィー体フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains KufiArabic font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra KufiArabic, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの KufiArabic フォントが含まれています。

source: Noto Mono Font
ca: Tipus de lletra del Noto Mono
ja: Noto Mono フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Mono font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Mono, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Mono フォントが含まれています。

source: Noto Naskh Arabic Font
ca: Tipus de lletra àrab Noto Naskh
ja: Noto アラビア語ナスフ体フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains NaskhArabic font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra NaskhArabic, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの NaskhArabic フォントが含まれています。

source: Noto Nastaliq Urdu Font
ja: Noto ウルドゥー語ナスタアリーク体フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains NastaliqUrdu font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra NastaliqUrdu, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの NastaliqUrdu フォントが含まれています。

source: Noto Adlam Sans Serif Font
ja: Noto Adlam Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Adlam Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Adlam Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Adlam Sans Serif フォントが含まれています。

source: Noto Adlam Unjoined Sans Serif Font
ca: Noto Adlam Sense unir Sans Serif Font
ja: Noto Adlam Unjoined Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains AdlamUnjoined Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra AdlamUnjoined Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの AdlamUnjoined Sans Serif フォントが含まれています。

source: Noto Anatolian Hieroglyphs Sans Serif Font
ja: Noto Anatolian Hieroglyphs Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains AnatolianHieroglyphs Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra AnatolianHieroglyphs Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの AnatolianHieroglyphs Sans Serif フォントが含まれています。

source: Noto Arabic Sans Serif Font
ja: Noto Arabic Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Arabic Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté lletra àrab Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Arabic Sans Serif フォントが含まれています。

source: Noto Armenian Sans Serif Font
ja: Noto Armenian Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Armenian Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra armeni Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Armenian Sans Serif フォントが含まれています。

source: Noto Avestan Sans Serif Font
ja: Noto Avestan Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Avestan Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Avestan Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Avestan Sans Serif フォントが含まれています。

source: Noto Balinese Sans Serif Font
ja: Noto Balinese Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Balinese Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra balinès Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Balinese Sans Serif フォントが含まれています。

source: Noto Bamum Sans Serif Font
ja: Noto Bamum Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Bamum Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Bamum Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Bamum Sans Serif フォントが含まれています。

source: Noto Batak Sans Serif Font
ja: Noto Batak Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Batak Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Batak Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Batak Sans Serif フォントが含まれています。

source: Noto Bengali Sans Serif Font
ja: Noto Bengali Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Bengali Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra bengalí Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Bengali Sans Serif フォントが含まれています。

source: Noto Brahmi Sans Serif Font
ja: Noto Brahmi Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Brahmi Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Brahmi Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Brahmi Sans Serif フォントが含まれています。

source: Noto Buginese Sans Serif Font
ja: Noto Buginese Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Buginese Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Buginese Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Buginese Sans Serif フォントが含まれています。

source: Noto Buhid Sans Serif Font
ja: Noto Buhid Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Buhid Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Buhid Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Buhid Sans Serif フォントが含まれています。

source: Noto Canadian Aboriginal Sans Serif Font
ja: Noto Canadian Aboriginal Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains CanadianAboriginal Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra CanadianAboriginal Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの CanadianAboriginal Sans Serif フォントが含まれています。

source: Noto Carian Sans Serif Font
ja: Noto Carian Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Carian Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Carian Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Carian Sans Serif フォントが含まれています。

source: Noto Chakma Sans Serif Font
ja: Noto Chakma Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Chakma Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Chakma Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Chakma Sans Serif フォントが含まれています。

source: Noto Cham Sans Serif Font
ja: Noto Cham Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Cham Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté la lletra Cham Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Cham Sans Serif フォントが含まれています。

source: Noto Cherokee Sans Serif Font
ja: Noto Cherokee Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Cherokee Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Cherokee Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Cherokee Sans Serif フォントが含まれています。

source: Noto Sans CJK Font - Regular and Bold
ca: Tipus de lletra CJK de Noto Sans - Regular i negreta
ja: Noto Sans CJK フォント - レギュラーおよびボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular and Bold weights for Noto Sans fonts for the four CJK languages.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté pesos regulars i negretes per als tipus de lletra Noto Sans per als quatre idiomes CJK.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、簡体字中国語／繁体字中国語／日本語／韓国語の 4 種類に対応した、レギュラー体およびボールド体のフォントが含まれています。

source: Noto Coptic Sans Serif Font
ja: Noto Coptic Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Coptic Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Coptic Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Coptic Sans Serif フォントが含まれています。

source: Noto Cuneiform Sans Serif Font
ja: Noto Cuneiform Sans Serif フォント
