Repository: openSUSE/packages-i18n
Catalog: */po/google.*.po
Languages: ca, ja

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Ugaritic Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Ugaritic Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Ugaritic Sans Serif フォントが含まれています。

source: Noto Vai Sans Serif Font
ja: Noto Vai Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Vai Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Vai Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Vai Sans Serif フォントが含まれています。

source: Noto Yi Sans Serif Font
ja: Noto Yi Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Yi Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Yi Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Yi Sans Serif フォントが含まれています。

source: Noto Armenian Font
ca: Tipus de lletra noto armeni
ja: Noto アルメニア語フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Armenian font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra armeni, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きのアルメニア語フォントが含まれています。

source: Noto Bengali Font
ca: Tipus de lletra noto bengalí
ja: Noto ベンガル語フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Bengali font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra bengalí, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きのベンガル語フォントが含まれています。

source: Noto Devanagari Font
ca: Tipus de lletra Noto Devanagari
ja: Noto デーヴァナーガリーフォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Devanagari font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Devanagari, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きのデーヴァナーガリーフォントが含まれています。

source: Noto Display Font
ca: Tipus de lletra Noto Display
ja: Noto Display フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Display font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra de la pantalla, indicat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Display フォントが含まれています。

source: Noto Ethiopic Font
ca: Tipus de lletra noto eutíop
ja: Noto Ethiopic フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Ethiopic font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un tipus de lletra eutiòpic, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Ethiopic フォントが含まれています。

source: Noto Serif Font
ca: Tipus de lletra del «Noto Serif»
ja: Noto Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Serif フォントが含まれています。

source: Noto Georgian Font
ca: Tipus de lletra noto georgià
ja: Noto グルジア語フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Georgian font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un tipus de lletra georgià, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きのグルジア語フォントが含まれています。

source: Noto Gujarati Font
ja: Noto グジャラート語フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Gujarati font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Gujarati, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きのグジャラート語フォントが含まれています。

source: Noto Hebrew Font
ca: Tipus de lletra hebrea Noto
ja: Noto Hebrew フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Hebrew font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra hebreu, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Hebrew フォントが含まれています。

source: Noto Serif Japanese Font - Black
ca: Tipus de lletra japonès Noto Serif - Negre
ja: Noro Serif 日本語フォント - ブラック

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Black weight of Serif font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes negre del tipus de lletra Serif per al japonès, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Serif ブラック体フォントが含まれています。

source: Noto Serif Japanese Font - Bold
ca: Tipus de lletra japonès Noto Serif - Negreta
ja: Noto Serif 日本語フォント - ボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Bold weight of Serif font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un pes negreta del tipus de lletra Serif per al japonès, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Serif ボールド体フォントが含まれています。

source: Noto Serif Japanese Font - Extralight
ca: Tipus de lletra japonès Noto Serif - Extralight
ja: Noto Serif 日本語フォント - エクストラライト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Extralight weight of Serif font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un pes extra lleuger del tipus de lletra Serif per al japonès, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Serif エクストラライト体フォントが含まれています。

source: Noto Serif Japanese Font - Regular and Bold
ca: Tipus de lletra japonès Noto Serif - Regular i negreta
ja: Noto Serif 日本語フォント - レギュラーおよびボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular and Bold weights of Serif font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté pesos regulars i negretes de tipus de lletra Serif per al japonès, insinuats.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Serif レギュラー体およびボールド体のフォントが含まれています。

source: Noto Serif Japanese Font - All Weights
ca: Tipus de lletra japonès Noto Serif - Tots els pesos
ja: Noto Serif 日本語フォント - 全ウエイト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains All weights of Serif font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté tots els pesos del tipus de lletra Serif per al japonès, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Serif フォントのうち、全ウエイトが含まれています。

source: Noto Serif Japanese Font - Light
ca: Tipus de lletra japonès Noto Serif - Llum
ja: Noto Serif 日本語フォント - ライト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Light weight of Serif font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes lleuger de la lletra Serif per al japonès, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Serif ライト体フォントが含まれています。

source: Noto Serif Japanese Font - Medium
ca: Tipus de lletra japonès Noto Serif - Mitjana
ja: Noto Serif 日本語フォント - ミディアム

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Medium weight of Serif font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un tipus de lletra Serif de pes mitjà per al japonès, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Serif ミディアム体フォントが含まれています。

source: Noto Serif Japanese Font - Regular
ca: Tipus de lletra japonès Noto Serif - Regular
ja: Noto Serif 日本語フォント - レギュラー

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular weight of Serif font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes regular del tipus de lletra Serif per al japonès, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Serif レギュラー体フォントが含まれています。

source: Noto Serif Japanese Font - SemiBold
ca: Tipus de lletra japonès Noto Serif - SemiBold
ja: Noto Serif 日本語フォント - セミボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains SemiBold weight of Serif font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes de SemiBold del tipus de lletra Serif per al japonès, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Serif セミボールド体フォントが含まれています。

source: Noto Kannada Font
ca: Tipus de lletra noto Kannada
ja: Noto カンナダ語フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Kannada font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Kannada, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きのカンナダ語フォントが含まれています。

source: Noto Khmer Font
ca: Tipus de lletra Noto Khmer
ja: Noto クメール語フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Khmer font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Khmer, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きのクメール語フォントが含まれています。

source: Noto Serif Korean Font - Black
ca: Tipus de lletra coreana Noto Serif - Negre
ja: Noto Serif 韓国語フォント - ブラック

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Black weight of Serif font for Korean, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes negre del tipus de lletra Serif per al coreà, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの韓国語 Serif ブラック体フォントが含まれています。

source: Noto Serif Korean Font - Bold
ca: Tipus de lletra coreà Noto Serif - Negreta
ja: Noto Serif 韓国語フォント - ボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Bold weight of Serif font for Korean, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un pes negreta del tipus de lletra Serif per al coreà, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの韓国語 Serif ボールド体フォントが含まれています。

source: Noto Serif Korean Font - Extralight
ca: Tipus de lletra coreà Noto Serif - Extralight
ja: Noto Serif 韓国語フォント - エクストラライト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Extralight weight of Serif font for Korean, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un pes extra lleuger del tipus de lletra Serif per al coreà, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの韓国語 Serif エクストラライト体フォントが含まれています。

source: Noto Serif Korean Font - Regular and Bold
ca: Tipus de lletra coreà Noto Serif - Regular i negreta
ja: Noto Serif 韓国語フォント - レギュラーおよびボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular and Bold weights of Serif font for Korean, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté pesos regulars i negretes de tipus de lletra Serif per a coreà, insinuats.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの韓国語 Serif レギュラー体およびボールド体のフォントが含まれています。

source: Noto Serif Korean Font - All Weights
ca: Tipus de lletra coreà Noto Serif - Tots els pesos
ja: Noto Serif 韓国語フォント - 全ウエイト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains All weights of Serif font for Korean, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté tots els pesos del tipus de lletra Serif per al coreà, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの韓国語 Serif フォントのうち、全ウエイトが含まれています。

source: Noto Serif Korean Font - Light
ca: Tipus de lletra coreana Noto Serif - Llum
ja: Noto Serif 韓国語フォント - ライト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Light weight of Serif font for Korean, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes lleuger del tipus de lletra Serif per al coreà, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの韓国語 Serif ライト体フォントが含まれています。

source: Noto Serif Korean Font - Medium
ca: Tipus de lletra coreana Noto Serif - Mitjana
ja: Noto Serif 韓国語フォント - ミディアム

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Medium weight of Serif font for Korean, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes mitjà del tipus de lletra Serif per al coreà, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの韓国語 Serif ミディアム体フォントが含まれています。

source: Noto Serif Korean Font - Regular
ca: Tipus de lletra coreana Noto Serif - Regular
ja: Noto Serif 韓国語フォント - レギュラー

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular weight of Serif font for Korean, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes regular del tipus de lletra Serif per al coreà, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの韓国語 Serif レギュラー体フォントが含まれています。

source: Noto Serif Korean Font - SemiBold
ca: Tipus de lletra coreana Noto Serif - SemiBold
ja: Noto Serif 韓国語フォント - セミボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains SemiBold weight of Serif font for Korean, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes de SemiBold del tipus de lletra Serif per al coreà, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの韓国語 Serif セミボールド体フォントが含まれています。

source: Noto Lao Font
ja: Noto ラーオ語フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Lao font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Lao, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きのラーオ語フォントが含まれています。

source: Noto Malayalam Font
ca: Tipus de lletra de Noto Malayalam
ja: Noto マラヤーラム語フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Malayalam font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Malayalam, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きのマラヤーラム語フォントが含まれています。

source: Noto Myanmar Font
ca: Tipus de lletra de Noto Myanmar
ja: Noto Myanmar フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Myanmar font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra de Myanmar, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Myanmar フォントが含まれています。

source: Noto Serif Simplified Chinese Font - Black
ca: Tipus de lletra xinès simplificat Noto Serif - Negre
ja: Noto Serif 簡体字中国語フォント - ブラック

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Black weight of Serif font for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes negre del tipus de lletra Serif per al xinès simplificat, indicat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語 Serif ブラック体フォントが含まれています。

source: Noto Serif Simplified Chinese Font - Bold
ca: Tipus de lletra xinès simplificat Noto Serif - Negreta
ja: Noto Serif 簡体字中国語フォント - ボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Bold weight of Serif font for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un pes negreta del tipus de lletra Serif per al xinès simplificat, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語 Serif ボールド体フォントが含まれています。

source: Noto Serif Simplified Chinese Font - Extralight
ca: Tipus de lletra xinès simplificat Noto Serif - Extralight
ja: Noto Serif 簡体字中国語フォント - エクストラライト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Extralight weight of Serif font for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un pes extra lleuger del tipus de lletra Serif per al xinès simplificat, indicat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語 Serif エクストラライト体フォントが含まれています。

source: Noto Serif Simplified Chinese Font - Regular and Bold
ca: Tipus de lletra xinès simplificat Noto Serif - Regular i negreta
ja: Noto Serif 簡体字中国語フォント - レギュラーおよびボールド
