Repository: openSUSE/packages-i18n
Catalog: */po/google.*.po
Languages: ca, ja

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular and Bold weights of Sans font for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté pesos regulars i negretes del tipus de lletra Sans per al xinès simplificat, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語 Sans レギュラー体およびボールド体のフォントが含まれています。

source: Noto Sans Simplified Chinese Font - All Weights
ca: Tipus de lletra xinès simplificat Noto Sans - Tots els pesos
ja: Noto Sans 簡体字中国語フォント - 全ウエイト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains All weights for Sans and Monospace fonts for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté tots els pesos per als tipus de lletra Sans i Monospace per al xinès simplificat, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語 Sans および等幅フォントのうち、全ウエイトが含まれています。

source: Noto Sans Simplified Chinese Font - Light
ca: Tipus de lletra xinès simplificat Noto Sans - Llum
ja: Noto Sans 簡体字中国語フォント - ライト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Light weight of Sans font for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes lleuger del tipus de lletra Sans per al xinès simplificat, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語 Sans ライト体フォントが含まれています。

source: Noto Sans Simplified Chinese Font - Medium
ca: Tipus de lletra simplificat del xinès Noto Sans - Mitjana
ja: Noto Sans 簡体字中国語フォント - ミディアム

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Medium weight of Sans font for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un tipus de lletra de pes mitjà de Sans per al xinès simplificat, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語 Sans ミディアム体フォントが含まれています。

source: Noto Sans Simplified Chinese Font - Monospace
ca: Tipus de lletra xinès simplificat Noto Sans - Monoespai
ja: Noto Sans 簡体字中国語フォント - 等幅

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Monospace fonts for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté tipus de lletra monoespai per al xinès simplificat, amb indicació.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語等幅フォントが含まれています。

source: Noto Sans Simplified Chinese Font - Regular
ca: Tipus de lletra xinès simplificat Noto Sans - Regular
ja: Noto Sans 簡体字中国語フォント - レギュラー

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular weight of Sans font for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes regular del tipus de lletra Sans per al xinès simplificat, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語 Sans レギュラー体フォントが含まれています。

source: Noto Sans Simplified Chinese Font - Thin
ca: Tipus de lletra xinès simplificat Noto Sans - Thin
ja: Noto Sans 簡体字中国語フォント - Thin

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Thin weight of Sans font for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes lleuger del tipus de lletra Sans per al xinès simplificat, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの簡体字中国語 Sans Thin 体フォントが含まれています。

source: Noto Shavian Sans Serif Font
ja: Noto Shavian Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Shavian Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Shavian Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Shavian Sans Serif フォントが含まれています。

source: Noto Sinhala Sans Serif Font
ja: Noto Sinhala Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Sinhala Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Sinhala Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Sinhala Sans Serif フォントが含まれています。

source: Noto Sundanese Sans Serif Font
ja: Noto Sundanese Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Sundanese Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Sundanese Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Sundanese Sans Serif フォントが含まれています。

source: Noto Syloti Nagri Sans Serif Font
ja: Noto Syloti Nagri Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains SylotiNagri Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra SylotiNagri Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの SylotiNagri Sans Serif フォントが含まれています。

source: Noto Symbols Sans Serif Font
ca: Símbols de Noto Sans Serif Font
ja: Noto Symbols Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Symbols Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Symbols Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Symbols Sans Serif フォントが含まれています。

source: Noto Symbols2 Sans Serif Font
ca: Símbols Noto2 Sans Serif Font
ja: Noto Symbols2 Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Symbols2 Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Symbols2 Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Symbols2 Sans Serif フォントが含まれています。

source: Noto Syriac Eastern Sans Serif Font
ja: Noto Syriac Eastern Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains SyriacEastern Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra SyriacEastern Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの SyriacEastern Sans Serif フォントが含まれています。

source: Noto Syriac Estrangela Sans Serif Font
ja: Noto Syriac Estrangela Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains SyriacEstrangela Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra SyriacEstrangela Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの SyriacEstrangela Sans Serif フォントが含まれています。

source: Noto Syriac Western Sans Serif Font
ja: Noto Syriac Western Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains SyriacWestern Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra SyriacWestern Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの SyriacWestern Sans Serif フォントが含まれています。

source: Noto Tagalog Sans Serif Font
ja: Noto Tagalog Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Tagalog Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Tagalog Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Tagalog Sans Serif フォントが含まれています。

source: Noto Tagbanwa Sans Serif Font
ja: Noto Tagbanwa Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Tagbanwa Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Tagbanwa Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Tagbanwa Sans Serif フォントが含まれています。

source: Noto Tai Le Sans Serif Font
ja: Noto Tai Le Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains TaiLe Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra TaiLe Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの TaiLe Sans Serif フォントが含まれています。

source: Noto Tai Tham Sans Serif Font
ja: Noto Tai Tham Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains TaiTham Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra TaiTham Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの TaiTham Sans Serif フォントが含まれています。

source: Noto Tai Viet Sans Serif Font
ja: Noto Tai Viet Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains TaiViet Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra TaiViet Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの TaiViet Sans Serif フォントが含まれています。

source: Noto Tamil Sans Serif Font
ja: Noto Tamil Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Tamil Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Tamil Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Tamil Sans Serif フォントが含まれています。

source: Noto Sans Traditional Chinese Font - Black
ca: Tipus de lletra tradicional xinesa Noto Sans - Negre
ja: Noto Sans 繁体字中国語フォント - ブラック

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Black weight of Sans font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes negre del tipus de lletra Sans per al xinès tradicional, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Sans ブラック体フォントが含まれています。

source: Noto Sans Traditional Chinese Font - Bold
ca: Noto Sans Tipus de lletra tradicional xinesa - Negreta
ja: Noto Sans 繁体字中国語フォント - ボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Bold weight of Sans font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté una lletra de pes negreta de Sans per al xinès tradicional, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Sans ブラック体フォントが含まれています。

source: Noto Sans Traditional Chinese Font - DemiLight
ca: Noto Sans Tipus de lletra tradicional xinesa - DemiLight
ja: Noto Sans 繁体字中国語フォント - デミライト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Demilight weight of Sans font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes del Demilight del tipus de lletra Sans per al xinès tradicional, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Sans デミライト体フォントが含まれています。

source: Noto Sans Traditional Chinese Font - Regular and Bold
ca: Tipus de lletra tradicional xinesa Noto Sans - Regular i negreta
ja: Noto Sans 繁体字中国語フォント - レギュラーおよびボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular and Bold weights of Sans font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté pesos regulars i negretes de la lletra Sans per al xinès tradicional, insinuats.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Sans レギュラー体およびボールド体のフォントが含まれています。

source: Noto Sans Traditional Chinese Font - All Weights
ca: Tipus de lletra tradicional xinesa de Noto Sans - Tots els pesos
ja: Noto Sans 繁体字中国語フォント - 全ウエイト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains All weights for Sans and Monospace fonts for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté tots els pesos per als tipus de lletra Sans i Monospace per al xinès tradicional, indicats.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Sans および等幅フォントのうち、全ウエイトが含まれています。

source: Noto Sans Traditional Chinese Font - Light
ca: Tipus de lletra tradicional xinesa Noto Sans - Llum
ja: Noto Sans 繁体字中国語フォント - ライト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Light weight of Sans font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté lletra de pes lleuger de Sans per al xinès tradicional, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Sans ライト体フォントが含まれています。

source: Noto Sans Traditional Chinese Font - Medium
ca: Tipus de lletra tradicional xinesa Noto Sans - Mitjana
ja: Noto Sans 繁体字中国語フォント - ミディアム

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Medium weight of Sans font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un tipus de lletra de pes mitjà de Sans per al xinès tradicional, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Sans ミディアム体フォントが含まれています。

source: Noto Sans Traditional Chinese Font - Monospace
ca: Tipus de lletra tradicional xinesa Noto Sans - Monospace
ja: Noto Sans 繁体字中国語 - 等幅

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Monospace fonts for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté tipus de lletra monoespacial per al xinès tradicional, amb indicació.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語等幅フォントが含まれています。

source: Noto Sans Traditional Chinese Font - Regular
ca: Tipus de lletra tradicional xinesa Noto Sans - Regular
ja: Noto Sans 繁体字中国語フォント - レギュラー

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular weight of Sans font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes regular del tipus de lletra Sans per al xinès tradicional, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Sans レギュラー体フォントが含まれています。

source: Noto Sans Traditional Chinese Font - Thin
ca: Tipus de lletra tradicional xinesa Noto Sans - Thin
ja: Noto Sans 繁体字中国語フォント - Thin

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Thin weight of Sans font for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un pes lleuger de lletra Sans per al xinès tradicional, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの繁体字中国語 Sans Thin 体フォントが含まれています。

source: Noto Telugu Sans Serif Font
ja: Noto Telugu Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Telugu Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Telugu Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Telugu Sans Serif フォントが含まれています。

source: Noto Thaana Sans Serif Font
ja: Noto Thaana Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Thaana Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Thaana Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Thaana Sans Serif フォントが含まれています。

source: Noto Thai Sans Serif Font
ja: Noto Thai Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Thai Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté la lletra Thai Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Thai Sans Serif フォントが含まれています。

source: Noto Tibetan Sans Serif Font
ja: Noto Tibetan Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Tibetan Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté la lletra tibetana Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Tibetan Sans Serif フォントが含まれています。

source: Noto Tifinagh Sans Serif Font
ja: Noto Tifinagh Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Tifinagh Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Tifinagh Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Tifinagh Sans Serif フォントが含まれています。

source: Noto Ugaritic Sans Serif Font
ja: Noto Ugaritic Sans Serif フォント
