Repository: openSUSE/packages-i18n
Catalog: */po/google.*.po
Languages: ca, ja

source: Geometric sans serif typefaces have been a popular design tool ever since these actors took to the world’s stage. Poppins is one of the new comers to this long tradition. With support for the Devanagari and Latin writing systems, it is an internationalist take on the genre. Many of the Latin glyphs (such as the ampersand) are more constructed and rationalist than is typical. The Devanagari design is particularly new, and is the first ever Devanagari typeface with a range of weights in this genre. Just like the Latin, the Devanagari is based on pure geometry, particularly circles. Each letterform is nearly monolinear, with optical corrections applied to stroke joints where necessary to maintain an even typographic color. The Devanagari base character height and the Latin ascender height are equal; Latin capital letters are shorter than the Devanagari characters, and the Latin x-height is set rather high. The Devanagari is designed by Ninad Kale. The Latin is by Jonny Pinhorn.
ca: Les tipografies geomètriques sans serif han estat una eina de disseny popular des que aquests actors van pujar a l'escenari mundial. Poppins és un dels nous entrants d'aquesta llarga tradició. Amb el suport dels sistemes de Devanagari i d'escriptura llatina, és una visió internacionalista del gènere. Molts dels glifs llatins (com l'ampersand) són més construïts i racionalistes del que és típic. El disseny de Devanagari és especialment nou, i és la primera tipografia de Devanagari amb una gamma de pesos en aquest gènere. Igual que el llatí, el devanagari es basa en la geometria pura, particularment en els cercles. Cada forma de lletra és gairebé monolineal, amb correccions òptiques aplicades a les articulacions de traç quan cal per mantenir un color tipogràfic parell. L'alçada del caràcter base Devanagari i l'alçada ascendent llatina són iguals; les lletres majúscules llatines són més curtes que els caràcters Devanagari, i l'alçada X llatina és força alta. El Devanagari és dissenyat per Ninad Kale. El llatí és de Jonny Pinhorn.

source: Source code of google-quiche
ca: Codi font de google-quiche

source: QUICHE (QUIC, Http/2, Etc) is Google‘s implementation of QUIC and related protocols. It powers Chromium as well as Google’s QUIC servers and some other projects. This package contains source code of google-quiche.
ca: QUICHE (QUIC, Http/2, Etc) és la implementació per part de Google de QUIC i protocols relacionats. Potencia Chromium, així com els servidors QUIC de Google i alguns altres projectes. Aquest paquet conté el codi font de google-quiche.

source: A Grotesque Sans Serif Font
ca: Una font Grotesca de Sans Serif

source: Work Sans is a typeface family with 9 weights, and based loosely on early Grotesques — for example, Stephenson Blake, Miller & Richard and Bauerschen Giesserei. Work Sans had been updated between 2018–2020 with accompanying italics, variable font files and the character set had been expanded to the Google Latin Expert glyph set, which supports Vietnamese.
ca: Work Sans és una família de tipografies amb 9 pesos, i es basa vagament en els primers Grotesques, per exemple, Stephenson Blake, Miller Richard i Bauerschen Giesserei. Work Sans s'havia actualitzat entre 2018–2020 amb l'acompanyament de cursiva, fitxers de tipus de lletra variables i el joc de caràcters s'havia expandit al conjunt de glifs de Google Latin Expert, que suporta el vietnamita.

source: Source code of googleapis
ca: Codi font de googleapis

source: Googleapis are the interface definitions of public Google APIs that support both REST and gRPC protocols. This package contains source code for googleapis.
ca: Googleapis són les definicions d'interfície de les API públiques de Google que admeten tant protocols REST com gRPC. Aquest paquet conté codi font per a googleapis.

source: Google Search, Google Site Search, Google News from the terminal
ca: Google Search, Google Site Search, Google News del terminal

source: googler is a power tool to Google (Web & News) and Google Site Search from the command-line. It shows the title, URL and abstract for each result, which can be directly opened in a browser from the terminal. Results are fetched in pages (with page navigation). Supports sequential searches in a single googler instance.
ca: googler és una eina d'energia per a Google (Web News) i Google Site Search des de la línia d'ordres. Mostra el títol, URL i resum de cada resultat, que es pot obrir directament en un navegador des del terminal. Els resultats s'obtenen a les pàgines (amb navegació per la pàgina). Permet cerques seqüencials en una sola instància de Google.

source: Development files for the Google C++ Testing Framework
ca: Fitxers de desenvolupament per al Framework de proves de Google C++

source: Google's framework for writing C++ tests on a variety of platforms (Linux, Mac OS X, Windows, Cygwin, Windows CE, and Symbian). Based on the xUnit architecture. Supports automatic test discovery, a rich set of assertions, user-defined assertions, death tests, fatal and non-fatal failures, value- and type-parameterized tests, various options for running the tests, and XML test report generation. This package provides shared libraries and header files for development with googletest.
ca: El marc de treball de Google per a l'escriptura de proves de C++ en una varietat de plataformes (Linux, Mac OS X, Windows, Cygwin, Windows CE i Symbian). Basat en l'arquitectura xUnit. Suporta el descobriment automàtic de proves, un ric conjunt d'assercions, afirmacions definides per l'usuari, proves de mort, fallades fatals i no fatals, proves amb paràmetres de valor i tipus, diverses opcions per executar les proves i generació d'informes de proves XML. Aquest paquet proporciona biblioteques compartides i fitxers de capçalera per al desenvolupament amb googletest.

source: AssistedInject extension module for Guice
ca: Mòdul d'extensió AssistedInject per a Guice

source: Guice is a dependency injection framework for Java 5 and above. This package provides AssistedInject module for Guice.
ca: Guice és un marc d'injecció de dependència per a Java 5 i superior. Aquest paquet proporciona el mòdul AssistedInject per a Guice.

source: Bill of Materials for Guice
ca: Carta de materials per a l'obtenció

source: Guice is a dependency injection framework for Java 5 and above. This package provides Bill of Materials module for Guice.
ca: Guice és un marc d'injecció de dependència per a Java 5 i superior. Aquest paquet proporciona el mòdul Bill of Materials per a Guice.

source: Extensions for Guice
ca: Extensions per a Guice

source: Guice is a dependency injection framework for Java 5 and above. This package provides extensions POM for Guice.
ca: Guice és un marc d'injecció de dependència per a Java 5 i superior. Aquest paquet proporciona extensions POM per a Guice.

source: Grapher extension module for Guice
ca: Mòdul d'extensió de graf per a Guice

source: Guice is a dependency injection framework for Java 5 and above. This package provides Grapher module for Guice.
ca: Guice és un marc d'injecció de dependència per a Java 5 i superior. Aquest paquet proporciona el mòdul Grapher per a Guice.

source: JMX extension module for Guice
ca: Mòdul d'extensió JMX per a Guice

source: Guice is a dependency injection framework for Java 5 and above. This package provides JMX module for Guice.
ca: Guice és un marc d'injecció de dependència per a Java 5 i superior. Aquest paquet proporciona el mòdul JMX per a Guice.

source: JNDI extension module for Guice
ca: Mòdul d'extensió JNDI per a Guice

source: Guice is a dependency injection framework for Java 5 and above. This package provides JNDI module for Guice.
ca: Guice és un marc d'injecció de dependència per a Java 5 i superior. Aquest paquet proporciona el mòdul JNDI per a Guice.

source: MultiBindings extension module for Guice
ca: Mòdul d'extensió MultiBindings per a Guice

source: Guice is a dependency injection framework for Java 5 and above. This package provides MultiBindings module for Guice.
ca: Guice és un marc d'injecció de dependència per a Java 5 i superior. Aquest paquet proporciona el mòdul MultiBindings per a Guice.

source: Guice is a dependency injection framework for Java 5 and above. This package provides parent POM for Guice modules.
ca: Guice és un marc d'injecció de dependència per a Java 5 i superior. Aquest paquet proporciona POM pare per als mòduls de Guice.

source: Servlet extension module for Guice
ca: Mòdul d'extensió Servlet per a Guice

source: Guice is a dependency injection framework for Java 5 and above. This package provides Servlet module for Guice.
ca: Guice és un marc d'injecció de dependència per a Java 5 i superior. Aquest paquet proporciona el mòdul Servlet per a Guice.

source: TestLib extension module for Guice
ca: Mòdul d'extensió TestLib per a Guice

source: Guice is a dependency injection framework for Java 5 and above. This package provides TestLib module for Guice.
ca: Guice és un marc d'injecció de dependència per a Java 5 i superior. Aquest paquet proporciona el mòdul TestLib per a Guice.

source: ThrowingProviders extension module for Guice
ca: Mòdul d'extensió ThrowingProviders per a Guice

source: Guice is a dependency injection framework for Java 5 and above. This package provides ThrowingProviders module for Guice.
ca: Guice és un marc d'injecció de dependència per a Java 5 i superior. Aquest paquet proporciona el mòdul ThrowingProviders per a Guice.

source: Humanist sans serif family, part of Alegreya “super family”
ca: Família humanista sans serif, part d'Alegreya “super família”

source: Alegreya Sans is a humanist sans serif family with a calligraphic feeling that conveys a dynamic and varied rhythm. This gives a pleasant feeling to readers of long texts. The family follows humanist proportions and principles, just like the serif version of the family, Alegreya. It achieves a ludic and harmonious paragraph through elements carefully designed in an atmosphere of diversity. The italics bring a strong emphasis to the roman styles, and each have seven weights to bring you a wide typographic palette. Alegreya Sans supports expert latin, greek and cyrillic character sets and provides advanced typography OpenType features such as small caps, dynamic ligatures and fractions, four set of figures, super and subscript characters, ordinals, localized accent forms for spanish, catalan, guaraní, dutch, turkish, romanian, serbian among others. The Alegreya type system is a “super family”, originally intended for literature, and includes sans and serif sister families.
ca: Alegreya Sans és una família humanista de sans serif amb una sensació cal·ligràfica que transmet un ritme dinàmic i variat. Això dona una sensació agradable als lectors de textos llargs. La família segueix proporcions i principis humanistes, igual que la versió serif de la família, Alegreya. Aconsegueix un paràgraf lúdic i harmònic a través d'elements acuradament dissenyats en un ambient de diversitat. La cursiva aporta un fort èmfasi als estils romans, i cadascun té set pesos per portar-te una àmplia paleta tipogràfica. Alegreya Sans dona suport a conjunts de caràcters llatins, grisos i ciríl·lics i proporciona tipografia avançada OpenType característiques com casquets petits, lligadures dinàmiques i fraccions, quatre conjunts de figures, superíndexs i subíndexs, ordinals, formes d'accent localitzades per a espanyol, català, guaraní, holandès, turkish, romanià, serbi entre d'altres. El sistema de tipus Alegreya és una “superfamília”, originalment destinada a la literatura, i inclou sans i famílies germanes serif.

source: Neo-grotesque sans-serif typeface family from Google
ca: Família de tipografia sans-serif neogrotesca de Google

source: Roboto is Google’s signature family of fonts, the default font on Android and Chrome OS, and the recommended font for Google’s visual language, Material Design. The font family supports all Latin, Cyrillic, and Greek characters in Unicode 7.0, as well as the currency symbol for the Georgian lari, to be published in Unicode 8.0. The fonts are currently available in eighteen different styles.
ca: Roboto és la família de fonts de signatura de Google, el tipus de lletra per defecte d'Android i Chrome OS, i el tipus de lletra recomanat per al llenguatge visual de Google, Material Design. La família de fonts suporta tots els caràcters llatins, ciríl·lics i grecs en Unicode 7.0, així com el símbol de moneda per als laris georgians, que es publicarà en Unicode 8.0. Les fonts estan disponibles actualment en divuit estils diferents.

source: Neo-grotesque sans-serif typeface family
ca: Família de tipografia sans-serif neogrotesca

source: Work Sans is a typeface family with 9 weights, and based loosely on early Grotesques — for example, Stephenson Blake, Miller & Richard and Bauerschen Giesserei. Work Sans had been updated between 2018–2020 with accompanying italics, variable font files and the character set had been expanded to the Google Latin Expert glyph set, which supports Vietnamese.
ca: Work Sans és una família de tipografies amb 9 pesos, i es basa vagament en els primers Grotesques, per exemple, Stephenson Blake, Miller Richard i Bauerschen Giesserei. Work Sans s'havia actualitzat entre 2018–2020 amb l'acompanyament de cursiva, fitxers de tipus de lletra variables i el joc de caràcters s'havia expandit al conjunt de glifs de Google Latin Expert, que suporta el vietnamita.

source: Documentation for google-worksans-fonts
ca: Documentació per a google-worksans-fonts

source: This package contains the documentation of google-worksans-fonts.
ca: Aquest paquet conté la documentació de google-worksans-fonts.

source: Noto Sans Traditional Chinese Font for HongKong- Black
ca: Tipus de lletra tradicional xinesa de Noto Sans per a HongKong- Negre

source: Noto Sans Traditional Chinese Font for HongKong- Bold
ca: Tipus de lletra tradicional xinesa de Noto Sans per a HongKong-Bold

source: Noto Sans Traditional Chinese Font for HongKong- DemiLight
ca: Tipus de lletra tradicional xinesa de Noto Sans per a HongKong-DemiLight

source: Noto Sans Traditional Chinese Font for HongKong- Regular and Bold
ca: Tipus de lletra tradicional xinesa de Noto Sans per a HongKong Regular i Negreta

source: Noto Sans Traditional Chinese Font for HongKong- All Weights
ca: Tipus de lletra tradicional xinesa de Noto Sans per a HongKong- All Weights

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains All weights for Sans fonts for Traditional Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté tots els pesos per a les lletres Sans per al xinès tradicional, insinuades.

source: Noto Sans Traditional Chinese Font for HongKong - Light
ca: Tipus de lletra tradicional xinesa de Noto Sans per a HongKong - Llum

source: Noto Sans Traditional Chinese Font for HongKong- Medium
ca: Tipus de lletra tradicional xinesa de Noto Sans per a HongKong-Mig

source: Noto Sans Traditional Chinese Font for HongKong- Monospace
ca: Tipus de lletra tradicional xinesa de Noto Sans per a HongKong- Monospace

source: Noto Sans Traditional Chinese Font for HongKong - Regular
ca: Tipus de lletra tradicional xinesa de Noto Sans per a HongKong - Regular

source: Noto Sans Traditional Chinese Font for HongKong - Thin
ca: Tipus de lletra tradicional xinesa de Noto Sans per a HongKong - Thin

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains All weights for Sans fonts for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté tots els pesos per a les lletres Sans per al japonès, insinuades.

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains All weights for Sans fonts for Korean, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté tots els pesos per als tipus de lletra Sans per al coreà, indicats.

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains All weights for Sans fonts for Simplified Chinese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté tots els pesos per als tipus de lletra Sans per al xinès simplificat, insinuat.
