Repository: openSUSE/packages-i18n
Catalog: */po/google.*.po
Languages: ca, ja

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Cuneiform Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté la lletra Cuneiform Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Cuneiform Sans Serif フォントが含まれています。

source: Noto Cypriot Sans Serif Font
ja: Noto Cypriot Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Cypriot Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté la lletra xipriota Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Cypriot Sans Serif フォントが含まれています。

source: Noto Deseret Sans Serif Font
ja: Noto Deseret Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Deseret Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Deseret Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Deseret Sans Serif フォントが含まれています。

source: Noto Devanagari Sans Serif Font
ja: Noto Devanagari Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Devanagari Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Devanagari Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Devanagari Sans Serif フォントが含まれています。

source: Noto Display Sans Serif Font
ca: Tipus de lletra «Sans Serif» de la pantalla Noto
ja: Noto Display Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Display Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Display Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Display Sans Serif フォントが含まれています。

source: Noto Egyptian Hieroglyphs Sans Serif Font
ja: Noto Egyptian Hieroglyphs Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains EgyptianHieroglyphs Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra EgyptianHieroglyphs Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの EgyptianHieroglyphs Sans Serif フォントが含まれています。

source: Noto Ethiopic Sans Serif Font
ja: Noto Ethiopic Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Ethiopic Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Ethiopic Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Ethiopic Sans Serif フォントが含まれています。

source: Noto Sans Font
ja: Noto Sans フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Sans font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Sans, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Sans フォントが含まれています。

source: Noto Georgian Sans Serif Font
ja: Noto Georgian Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Georgian Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra georgià Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Georgian Sans Serif フォントが含まれています。

source: Noto Glagolitic Sans Serif Font
ja: Noto Glagolitic Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Glagolitic Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté una font Glagolitic Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Glagolitic Sans Serif フォントが含まれています。

source: Noto Gothic Sans Serif Font
ja: Noto Gothic Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Gothic Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté la lletra gòtica Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Gothic Sans Serif フォントが含まれています。

source: Noto Gujarati Sans Serif Font
ja: Noto Gujarati Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Gujarati Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Gujarati Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Gujarati Sans Serif フォントが含まれています。

source: Noto Gurmukhi Sans Serif Font
ja: Noto Gurmukhi Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Gurmukhi Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Gurmukhi Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Gurmukhi Sans Serif フォントが含まれています。

source: Noto Hanunoo Sans Serif Font
ja: Noto Hanunoo Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Hanunoo Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Hanunoo Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Hanunoo Sans Serif フォントが含まれています。

source: Noto Hebrew Sans Serif Font
ja: Noto Hebrew Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Hebrew Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra hebreu Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Hebrew Sans Serif フォントが含まれています。

source: Noto Imperial Aramaic Sans Serif Font
ja: Noto Imperial Aramaic Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains ImperialAramaic Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra ImperialAramaic Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの ImperialAramaic Sans Serif フォントが含まれています。

source: Noto Inscriptional Pahlavi Sans Serif Font
ca: Noto Inscripcional Pahlavi Sans Serif Font
ja: Noto Inscriptional Pahlavi Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains InscriptionalPahlavi Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra InscriptionalPahlavi Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの InscriptionalPahlavi Sans Serif フォントが含まれています。

source: Noto Inscriptional Parthian Sans Serif Font
ca: Noto Inscriptionan Parthian Sans Serif Font
ja: Noto Inscriptional Parthian Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains InscriptionalParthian Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra InscriptionalParthian Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの InscriptionalParthian Sans Serif フォントが含まれています。

source: Noto Javanese Sans Serif Font
ja: Noto Javanese Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Javanese Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra javanès Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Javanese Sans Serif フォントが含まれています。

source: Noto Sans Japanese Font - Black
ca: Tipus de lletra japonès Noto Sans - Negre
ja: Noto Sans 日本語フォント - ブラック

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Black weight of Sans font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes negre del tipus de lletra Sans per al japonès, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Sans ブラック体のフォントが含まれています。

source: Noto Sans Japanese Font - Bold
ca: Tipus de lletra japonès Noto Sans - Negreta
ja: Noto Sans 日本語フォント - ボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Bold weight of Sans font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté una lletra de pes negreta de Sans per al japonès, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Sans ボールド体のフォントが含まれています。

source: Noto Sans Japanese Font - DemiLight
ca: Tipus de lletra japonès Noto Sans - DemiLight
ja: Noto Sans 日本語フォント - デミライト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Demilight weight of Sans font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes del Demilight del tipus de lletra Sans per al japonès, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Sans デミライト体のフォントが含まれています。

source: Noto Sans Japanese Font - Regular and Bold
ca: Tipus de lletra japonès Noto Sans - Regular i negreta
ja: Noto Sans 日本語フォント - レギュラーおよびボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular and Bold weights of Sans font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté pesos regulars i negretes de la lletra Sans per al japonès, insinuats.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Sans レギュラー体およびボールド体のフォントが含まれています。

source: Noto Sans Japanese Font - All Weights
ca: Tipus de lletra japonès Noto Sans - Tots els pesos
ja: Noto Sans 日本語フォント - 全ウエイト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains All weights for Sans and Monospace fonts for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté tots els pesos per als tipus de lletra Sans i Monospace per al japonès, indicats.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Sans および等幅フォントのうち、全ウエイトが含まれています。

source: Noto Sans Japanese Font - Light
ca: Tipus de lletra japonès Noto Sans - Llum
ja: Noto Sans 日本語フォント - ライト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Light weight of Sans font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes lleuger de la lletra Sans per al japonès, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Sans ライト体のフォントが含まれています。

source: Noto Sans Japanese Font - Medium
ca: Tipus de lletra japonès Noto Sans - Mitjana
ja: Noto Sans 日本語フォント - ミディアム

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Medium weight of Sans font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté un tipus de lletra de pes mitjà de Sans per al japonès, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Sans ミディアム体フォントが含まれています。

source: Noto Sans Japanese Font - Monospace
ca: Tipus de lletra japonès Noto Sans - Monospace
ja: Noto Sans 日本語フォント - 等幅

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Monospace fonts for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté tipus de lletra monoespai per al japonès, amb indicació.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語等幅フォントが含まれています。

source: Noto Sans Japanese Font - Regular
ca: Tipus de lletra japonès Noto Sans - Regular
ja: Noto Sans 日本語フォント - レギュラー

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular weight of Sans font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes regular del tipus de lletra Sans per al japonès, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Sans レギュラー体フォントが含まれています。

source: Noto Sans Japanese Font - Thin
ca: Tipus de lletra japonès Noto Sans - Thin
ja: Noto Sans 日本語フォント - Thin

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Thin weight of Sans font for Japanese, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes lleuger de la lletra Sans per al japonès, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの日本語 Sans Thin 体フォントが含まれています。

source: Noto Kaithi Sans Serif Font
ja: Noto Kaithi Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Kaithi Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Kaithi Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Kaithi Sans Serif フォントが含まれています。

source: Noto Kannada Sans Serif Font
ja: Noto Kannada Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Kannada Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Kannada Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Kannada Sans Serif フォントが含まれています。

source: Noto Kayah Li Sans Serif Font
ja: Noto Kayah Li Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains KayahLi Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra KayahLi Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの KayahLi Sans Serif フォントが含まれています。

source: Noto Kharoshthi Sans Serif Font
ja: Noto Kharoshthi Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Kharoshthi Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Kharoshthi Sans Serif, insinuada.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Kharoshthi Sans Serif フォントが含まれています。

source: Noto Khmer Sans Serif Font
ja: Noto Khmer Sans Serif フォント

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Khmer Sans Serif font, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el tipus de lletra Khmer Sans Serif, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの Khmer Sans Serif フォントが含まれています。

source: Noto Sans Korean Font - Black
ca: Tipus de lletra coreana de Noto Sans - Negre
ja: Noto Sans 韓国語フォント - ブラック

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Black weight of Sans font for Korean, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes negre del tipus de lletra Sans per al coreà, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの韓国語 Sans ブラック体フォントが含まれています。

source: Noto Sans Korean Font - Bold
ca: Tipus de lletra coreana de Noto Sans - Negreta
ja: Noto Sans 韓国語フォント - ボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Bold weight of Sans font for Korean, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes negreta del tipus de lletra Sans per al coreà, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの韓国語 Sans ボールド体フォントが含まれています。

source: Noto Sans Korean Font - DemiLight
ca: Tipus de lletra coreana de Noto Sans - DemiLight
ja: Noto Sans 韓国語フォント - デミライト

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Demilight weight of Sans font for Korean, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté el pes del Demilight del tipus de lletra Sans per al coreà, insinuat.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの韓国語 Sans デミライト体フォントが含まれています。

source: Noto Sans Korean Font - Regular and Bold
ca: Tipus de lletra coreana de Noto Sans - Regular i negreta
ja: Noto Sans 韓国語フォント - レギュラーおよびボールド

source: Noto's design goal is to achieve visual harmonization (e.g., compatible heights and stroke thicknesses) across languages. This package contains Regular and Bold weights of Sans font for Korean, hinted.
ca: L'objectiu de disseny de Noto és aconseguir l'harmonització visual (p. ex., alçades compatibles i gruixos d'ictus) a través de llenguatges. Aquest paquet conté pesos regulars i negretes de la lletra Sans per a coreà, insinuats.
ja: Noto のデザインは、複数の言語間で視覚的な調和 (高さや太さなど) を図ることを目的としています。このパッケージには、ヒント付きの韓国語 Sans レギュラー体およびボールド体のフォントが含まれています。

source: Noto Sans Korean Font - All Weights
ca: Tipus de lletra coreana de Noto Sans - Tots els pesos
ja: Noto Sans 韓国語フォント - 全ウエイト
