Repository: openSUSE/packages-i18n
Catalog: */po/gstreamer.*.po
Languages: ca

source: Streaming-Media Framework Runtime
ca: Temps d'execució de l'entorn de treball Streaming-Media

source: GStreamer is a streaming-media framework, based on graphs of filters which operate on media data. Applications using this library can do anything from real-time sound processing to playing videos, and just about anything else media-related. Its plug-in-based architecture means that new data types or processing capabilities can be added by installing new plug-ins.
ca: El GStreamer és un marc de treball multimèdia basat en gràfics de filtres que operen en dades multimèdia. Les aplicacions que utilitzen aquesta biblioteca poden fer qualsevol cosa, des del processament de so en temps real fins a la reproducció de vídeos, i gairebé qualsevol altra cosa relacionada amb els mitjans de comunicació. La seva arquitectura basada en connectors significa que es poden afegir nous tipus de dades o capacitats de processament mitjançant la instal·lació de nous connectors.

source: GStreamer Editing Services
ca: Serveis d'edició del GStreamer

source: The GStreamer multimedia framework and the accompanying GNonLin set of plugins for non-linear editing offer all the building blocks for: Decoding and encoding to a wide variety of formats, through all the available GStreamer plugins. Easily choosing segments of streams and arranging them through time through the GNonLin set of plugins. But all those building blocks only offer stream-level access, which results in developers who want to write non-linear editors to write a consequent amount of code to get to the level of non-linear editing notions which are closer and more meaningful for the end-user (and therefore the application). The GStreamer Editing Services (hereafter GES) aims to fill the gap between GStreamer/GNonLin and the application developer by offering a series of classes to simplify the creation of many kind of editing-related applications.
ca: El marc multimèdia GStreamer i el conjunt de connectors GNonLin que l'acompanyen per a l'edició no lineal ofereixen tots els blocs de construcció per a: Decodificació i codificació a una àmplia varietat de formats, a través de tots els connectors GStreamer disponibles. Escollir fàcilment segments de fluxos i organitzar-los a través del temps a través del conjunt de connectors GNonLin. Però tots aquests blocs de construcció només ofereixen accés a nivell de flux, cosa que resulta en desenvolupadors que volen escriure editors no lineals per escriure una quantitat de codi conseqüent per arribar al nivell de nocions d'edició no lineals que són més properes i significatives per a l'usuari final (i per tant l'aplicació). El GStreamer Editing Services (d'ara endavant GES) té com a objectiu omplir el buit entre GStreamer/GNonLin i el desenvolupador d'aplicacions oferint una sèrie de classes per simplificar la creació de molts tipus d'aplicacions relacionades amb l'edició.

source: GStreamer Editing Services - Development files
ca: Serveis d'edició del GStreamer - Fitxers de desenvolupament

source: Translations for package gstreamer
ca: Traduccions per al gstreamer del paquet

source: Provides translations for the "gstreamer" package.
ca: Proporciona traduccions per al paquet «gstreamer».

source: GStreamer Streaming-Media Framework Plug-Ins
ca: Connector de l'entorn de treball GStreamer Streaming-Media

source: GStreamer is a streaming media framework based on graphs of filters that operate on media data. Applications using this library can do anything media-related,from real-time sound processing to playing videos. Its plug-in-based architecture means that new data types or processing capabilities can be added simply by installing new plug-ins.
ca: GStreamer és un entorn de treball multimèdia basat en gràfiques de filtres que operen en dades multimèdia. Les aplicacions que utilitzen aquesta biblioteca poden fer qualsevol cosa relacionada amb els mitjans, des del processament de so en temps real fins a la reproducció de vídeos. La seva arquitectura basada en connectors significa que es poden afegir nous tipus de dades o capacitats de processament simplement instal·lant nous connectors.

source: Chromaprint plugin for GStreamer
ca: Connector Chromaprint per al GStreamer

source: Add chromaprint (Audio Fingerprinting) support to any GStreamer based tool.
ca: Afegeix la implementació de chromaprint (Audio Fingerprinting) a qualsevol eina basada en GStreamer.

source: Fluidsynth plugin for GStreamer
ca: Connector Fluidsynth per al GStreamer

source: Add fluidsynth midi support to any GStreamer based tool.
ca: Afegeix suport per a midi fluidsynth a qualsevol eina basada en GStreamer.

source: Translations for package gstreamer-plugins-bad
ca: Traduccions per al paquet gstreamer-plugins-bad

source: Provides translations for the "gstreamer-plugins-bad" package.
ca: Proporciona traduccions per al paquet «gstreamer-plugins-bad».

source: GStreamer is a streaming media framework based on graphs of filters that operate on media data. Applications using this library can do anything media-related, from real-time sound processing to playing videos. Its plug-in-based architecture means that new data types or processing capabilities can be added simply by installing new plug-ins.
ca: El GStreamer és un entorn de treball multimèdia basat en gràfiques de filtres que operen en dades multimèdia. Les aplicacions que usen aquesta biblioteca poden fer qualsevol cosa relacionada amb els mitjans, des del processament de so en temps real fins a la reproducció de vídeos. La seva arquitectura basada en connectors significa que es poden afegir nous tipus de dades o capacitats de processament simplement instal·lant connectors nous.

source: Include files and librs mandatory for development with gstreamer-plugins-base
ca: Inclou fitxers i llibreries obligatòries per al desenvolupament amb gstreamer-plugins-base

source: This package contains all necessary include files and libraries needed to compile and link applications that use gstreamer-plugins-base.
ca: Aquest paquet conté tots els fitxers d'inclusió i biblioteques necessaris per a compilar i enllaçar aplicacions que utilitzen gstreamer-plugins-base.

source: Translations for package gstreamer-plugins-base
ca: Traduccions per al paquet gstreamer-plugins-base

source: Provides translations for the "gstreamer-plugins-base" package.
ca: Proporciona traduccions per al paquet «gstreamer-plugins-base».

source: Complementary plugins for gstreamer-plugins-good
ca: Connectors complementaris per a gstreamer-plugins-good

source: This package provides complementary plugins for gstreamer-plugins-good.
ca: Aquest paquet proporciona connectors complementaris per a gstreamer-plugins-good.

source: Gtksink plugin for gstreamer-plugins-good
ca: Connector Gtksink per a gstreamer-plugins-good

source: This package provides the gtksink output plugin for gstreamer-plugins-good.
ca: Aquest paquet proporciona el connector de sortida gtksink per a gstreamer-plugins-good.

source: Jack plugin for gstreamer-plugins-good
ca: Connector Jack per a gstreamer-plugins-good

source: This package provides the jack plugin for gstreamer-plugins-good.
ca: Aquest paquet proporciona el connector jack per a gstreamer-plugins-good.

source: Translations for package gstreamer-plugins-good
ca: Traduccions per al paquet gstreamer-plugins-good

source: Provides translations for the "gstreamer-plugins-good" package.
ca: Proporciona traduccions per al paquet «gstreamer-plugins-good».

source: Qmlglsink plugin for gstreamer-plugins-good
ca: Connector Qmlglsink per a gstreamer-plugins-good

source: This package provides the qmlglsink output plugin for gstreamer-plugins-good.
ca: Aquest paquet proporciona el connector de sortida «qmlglsink» per a «gstreamer-plugins-good».

source: A ffmpeg/libav plugin for GStreamer
ca: Un connector «ffmpeg/libav» per al GStreamer

source: GStreamer is a streaming media framework, based on graphs of filters which operate on media data. Applications using this library can do anything from real-time sound processing to playing videos, and just about anything else media-related. Its plugin-based architecture means that new data types or processing capabilities can be added simply by installing new plug-ins. This plugin contains the FFmpeg codecs, containing codecs for most popular multimedia formats.
ca: GStreamer és un entorn de treball multimèdia de transmissió, basat en gràfiques de filtres que operen en dades multimèdia. Les aplicacions que utilitzen aquesta biblioteca poden fer qualsevol cosa, des del processament de so en temps real fins a la reproducció de vídeos, i gairebé qualsevol altra cosa relacionada amb els mitjans de comunicació. La seva arquitectura basada en connectors significa que es poden afegir nous tipus de dades o capacitats de processament simplement instal·lant nous connectors. Aquest connector conté els còdecs FFmpeg, que contenen còdecs per als formats multimèdia més populars.

source: GStreamer is a streaming media framework, based on graphs of filters which operate on media data. Applications using this library can do anything from real-time sound processing to playing videos, and just about anything else media-related. Its plugin-based architecture means that new data types or processing capabilities can be added simply by installing new plug-ins. This plugin contains the documentation
ca: GStreamer és un entorn de treball multimèdia de transmissió, basat en gràfiques de filtres que operen en dades multimèdia. Les aplicacions que utilitzen aquesta biblioteca poden fer qualsevol cosa, des del processament de so en temps real fins a la reproducció de vídeos, i gairebé qualsevol altra cosa relacionada amb els mitjans de comunicació. La seva arquitectura basada en connectors significa que es poden afegir nous tipus de dades o capacitats de processament simplement instal·lant nous connectors. Aquest connector conté la documentació

source: GStreamer is a streaming media framework based on graphs of filters that operate on media data. Applications using this library can do anything media-related, from real-time sound processing to playing videos. Its plug-in-based architecture means that new data types or processing capabilities can be added simply by installing newplug-ins. This package contains well-written plug-ins that can't be shipped in gstreamer-plugins-good because: - the license is not LGPL - the license of the library is not LGPL - there are possible licensing issues with the code.
ca: GStreamer és un entorn de treball multimèdia basat en gràfiques de filtres que operen en dades multimèdia. Les aplicacions que utilitzen aquesta biblioteca poden fer qualsevol cosa relacionada amb els mitjans, des del processament de so en temps real fins a la reproducció de vídeos. La seva arquitectura basada en connectors significa que es poden afegir nous tipus de dades o capacitats de processament simplement instal·lant nous connectors. Aquest paquet conté connectors ben escrits que no es poden enviar a gstreamer-plugins-good perquè: - la llicència no és LGPL - la llicència de la biblioteca no és LGPL - Hi ha possibles problemes de llicència amb el codi.

source: Translations for package gstreamer-plugins-ugly
ca: Traduccions per al paquet gstreamer-plugins-ugly

source: Provides translations for the "gstreamer-plugins-ugly" package.
ca: Proporciona traduccions per al paquet «gstreamer-plugins-ugly».

source: Gstreamer VA-API plugins
ca: Connectors VA-API de Gstreamer

source: gstreamer-vaapi is a collection of GStreamer plugins and helper libraries that allow hardware accelerated video decoding through VA-API.
ca: gstreamer-vaapi és una col·lecció de connectors de GStreamer i biblioteques d'ajuda que permeten descodificar vídeo accelerat per maquinari a través de VA-API.

source: Development files for the GStreamer-based RTSP server library
ca: Fitxers de desenvolupament per a la biblioteca de servidors RTSP basada en GStreamer

source: Development files for the GStreamer library for building an RTSP server.
ca: Fitxers de desenvolupament per a la biblioteca GStreamer per a construir un servidor RTSP.

source: GStreamer Transcoding API
ca: API de transcodificació de GStreamer

source: GStreamer Transcoding cli tool and API
ca: Eina de transcodificació GStreamer i API

source: Development files for the GStreamer Transcoding API
ca: Fitxers de desenvolupament per a l'API de transcodificació GStreamer

source: This subpackage contains the header files needed to build applications making use of the GStreamer Transcoding API.
ca: Aquest subpaquet conté els fitxers de capçalera necessaris per a construir aplicacions que fan ús de l'API de transcodificació GStreamer.

source: GStreamer pipeline validator
ca: Validador de canonades GStreamer

source: GstValidate detects when elements are not behaving as expected and report it to the user so he knows how things are supposed to work inside a GstPipeline. In the end, fixing issues found by the tool will ensure that all elements behave all together in the expected way. The easiest way of using GstValidate is to use one of its command-line tools, located at tools/ directory. It is also possible to monitor GstPipelines from any application by using the LD_PRELOAD gstvalidate lib. The third way of using it is to write your own application that links and uses libgstvalidate.
ca: GstValidate detecta quan els elements no es comporten com s'esperava i ho informa a l'usuari perquè sàpiga com se suposa que les coses han de funcionar dins d'un GstPipeline. Al final, la correcció de problemes trobats per l'eina garantirà que tots els elements es comportin tots junts de la manera esperada. La manera més fàcil d'utilitzar GstValidate és utilitzar una de les seves eines de línia d'ordres, situada a tools/ directory. També és possible monitoritzar GstPipelines des de qualsevol aplicació utilitzant la biblioteca LDPRELOAD gstvalidate. La tercera manera d'utilitzar-lo és escriure la teva pròpia aplicació que enllaci i utilitzi libgstvalidate.

source: Header files for the GStreamer pipeline validator
ca: Fitxers de capçalera per al validador de canonades GStreamer

source: GstValidate detects when elements are not behaving as expected and report it to the user so he knows how things are supposed to work inside a GstPipeline. In the end, fixing issues found by the tool will ensure that all elements behave all together in the expected way.
ca: GstValidate detecta quan els elements no es comporten com s'esperava i ho informa a l'usuari perquè sàpiga com se suposa que les coses han de funcionar dins d'un GstPipeline. Al final, la correcció de problemes trobats per l'eina garantirà que tots els elements es comportin tots junts de la manera esperada.

source: C++ bindings for the GStreamer streaming multimedia library
ca: Vinculacions C++ per a la biblioteca multimèdia de transmissió GStreamer

source: gstreamermm provides C++ bindings for the GStreamer streaming multimedia library (http://gstreamer.freedesktop.org). With gstreamermm it is possible to develop applications that work with multimedia in C++.
ca: gstreamermm proporciona vinculacions C++ per a la biblioteca multimèdia de flux GStreamer (http://gstreamer.freedesktop.org). Amb gstreamermm és possible desenvolupar aplicacions que funcionen amb multimèdia en C++.

source: GStreamer Editing Services - Libraries
ca: Serveis d'edició del GStreamer - Biblioteques

source: GStreamer-based RTSP server library
ca: Biblioteca de servidor RTSP basada en GStreamer

source: Library on top of GStreamer for building an RTSP server - Library files.
ca: Biblioteca a la part superior de GStreamer per a construir un servidor RTSP - Fitxers de biblioteca.

source: GStreamer Transcoder API
ca: API del transcodificador GStreamer

source: This subpackage contains the implementation of the GStreamer API.
ca: Aquest subpaquet conté la implementació de l'API GStreamer.

source: GStreamer Streaming-Media Framework Plug-Ins - Wayland backend
ca: Connector del Framework GStreamer Streaming-Media - dorsal del Wayland

source: Streaming-Media Framework Runtime -- Introspection bindings
ca: Streaming-Media Framework Runtime -- Vinculacions d'introspecció

source: GStreamer is a streaming-media framework, based on graphs of filters which operate on media data. Applications using this library can do anything from real-time sound processing to playing videos, and just about anything else media-related. Its plug-in-based architecture means that new data types or processing capabilities can be added by installing new plug-ins. This package provides the GObject Introspection bindings for GStreamer.
ca: El GStreamer és un marc de treball multimèdia basat en gràfics de filtres que operen en dades multimèdia. Les aplicacions que utilitzen aquesta biblioteca poden fer qualsevol cosa, des del processament de so en temps real fins a la reproducció de vídeos, i gairebé qualsevol altra cosa relacionada amb els mitjans de comunicació. La seva arquitectura basada en connectors significa que es poden afegir nous tipus de dades o capacitats de processament mitjançant la instal·lació de nous connectors. Aquest paquet proporciona els lligams GObject Introspection per al GStreamer.

source: GStreamer Streaming-Media Framework Plug-Ins -- Introspection bindings
ca: Connectors de l'entorn de treball GStreamer Streaming-Media -- Vinculacions d'introducció

source: GStreamer is a streaming media framework based on graphs of filters that operate on media data. Applications using this library can do anything media-related, from real-time sound processing to playing videos. Its plug-in-based architecture means that new data types or processing capabilities can be added simply by installing new plug-ins. This package provides the GObject Introspection bindings for GStreamer plug-ins.
ca: GStreamer és un entorn de treball multimèdia basat en gràfiques de filtres que operen en dades multimèdia. Les aplicacions que utilitzen aquesta biblioteca poden fer qualsevol cosa relacionada amb els mitjans, des del processament de so en temps real fins a la reproducció de vídeos. La seva arquitectura basada en connectors significa que es poden afegir nous tipus de dades o capacitats de processament simplement instal·lant nous connectors. Aquest paquet proporciona les vinculacions GObject Introspection per als connectors GStreamer.

source: Introspection bindings for the GStreamer-based RTSP server library
ca: Vinculacions d'introspecció per a la biblioteca del servidor RTSP basada en GStreamer

source: Introspection bindings for the GStreamer library for building an RTSP server.
ca: Vinculacions d'introspecció per a la biblioteca GStreamer per a construir un servidor RTSP.

source: Introspection bindings for the GStreamer Transcoder API
ca: Vinculacions d'introspecció per a l'API del transcodificador GStreamer

source: This subpackage contains the introspection bindings for the GStreamer Transcoding API.
ca: Aquest subpaquet conté les vinculacions d'introspecció per a l'API de transcodificació de GStreamer.

source: GObject introspection bindings for the GStreamer pipeline validator
ca: Vinculacions d'introspecció GObject per al validador de canonades GStreamer

source: Development and debugging tools for GStreamer
ca: Eines de desenvolupament i depuració per al GStreamer

source: Development and debugging tools for GStreamer GstValidate detects when elements are not behaving as expected and report it to the user so he knows how things are supposed to work inside a GstPipeline. In the end, fixing issues found by the tool will ensure that all elements behave all together in the expected way. The easiest way of using GstValidate is to use one of its command-line tools, located at tools/ directory. It is also possible to monitor GstPipelines from any application by using the LD_PRELOAD gstvalidate lib. The third way of using it is to write your own application that links and uses libgstvalidate.
ca: Eines de desenvolupament i depuració per al GStreamer GstValidate detecta quan els elements no es comporten com s'esperava i ho informa a l'usuari perquè sàpiga com se suposa que les coses han de funcionar dins d'un GstPipeline. Al final, la correcció de problemes trobats per l'eina garantirà que tots els elements es comportin tots junts de la manera esperada. La manera més fàcil d'utilitzar GstValidate és utilitzar una de les seves eines de línia d'ordres, situada a tools/ directory. També és possible monitoritzar GstPipelines des de qualsevol aplicació utilitzant la biblioteca LDPRELOAD gstvalidate. La tercera manera d'utilitzar-lo és escriure la teva pròpia aplicació que enllaci i utilitzi libgstvalidate.

source: Header files for the GStreamer development and debugging tools
ca: Fitxers de capçalera per a les eines de desenvolupament i depuració del GStreamer

source: GStreamer documentation
ca: Documentació del GStreamer

source: GStreamer documentation.
ca: Documentació del GStreamer.

source: GStreamer Streaming-Media Framework Plug-Ins development files
ca: Fitxers de desenvolupament de connectors de l'entorn de treball GStreamer Streaming-Media

source: GStreamer is a streaming media framework based on graphs of filters that operate on media data. Applications using this library can do anything media-related, from real-time sound processing to playing videos. Its plug-in-based architecture means that new data types or processing capabilities can be added simply by installing new plug-ins. This package contains the pkgconfig development files for the rust plugins.
ca: GStreamer és un entorn de treball multimèdia basat en gràfiques de filtres que operen en dades multimèdia. Les aplicacions que utilitzen aquesta biblioteca poden fer qualsevol cosa relacionada amb els mitjans, des del processament de so en temps real fins a la reproducció de vídeos. La seva arquitectura basada en connectors significa que es poden afegir nous tipus de dades o capacitats de processament simplement instal·lant nous connectors. Aquest paquet conté els fitxers de desenvolupament pkgconfig per als connectors oxida.
