Repository: openSUSE/packages-i18n
Catalog: */po/gtk.*.po
Languages: ca

source: The GTK+ toolkit library (version 3) -- openSUSE theme configuration
ca: La biblioteca del joc d'eines GTK+ (versió 3) -- configuració del tema openSUSE

source: Upstream theme configuration for the GTK+ toolkit library v3
ca: Configuració del tema actual per a la biblioteca de jocs d'eines GTK+ v3

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package provides the upstream theme configuration for widgets and icon themes.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet proporciona la configuració del tema de la font per als ginys i temes d'icones.

source: Data files for the GTK+ toolkit library v3
ca: Fitxers de dades per a la biblioteca del joc d'eines GTK+ v3

source: Development files for the GTK+ toolkit library v3
ca: Fitxers de desenvolupament per a la biblioteca de jocs d'eines GTK+ v3

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package contains the development files for GTK+ 3.x.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet conté els fitxers de desenvolupament per a GTK+ 3.x.

source: API documentation for the GTK+ toolkit library v3
ca: Documentació de l'API per a la biblioteca del joc d'eines GTK+ v3

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package contains the API documentation for GTK+ 3.x.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet conté la documentació de l'API per a GTK+ 3.x.

source: Amharic input method for the GTK+ toolkit library v3
ca: Mètode d'entrada amhàric per a la biblioteca de jocs d'eines GTK+ v3

source: Broadway input method for the GTK+ toolkit library v3
ca: Mètode d'entrada de Broadway per a la biblioteca d'eines GTK+ v3

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package provides an input method for Broadway.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet proporciona un mètode d'entrada per a Broadway.

source: Inuktitut input method for the GTK+ toolkit library v3
ca: Mètode d'entrada de l'Inuktitut per a la biblioteca de jocs d'eines GTK+ v3

source: Multipress input method for the GTK+ toolkit library v3
ca: Mètode d'entrada multipremsa per a la biblioteca de jocs d'eines GTK+ v3

source: Thai-Lao input method for the GTK+ toolkit library v3
ca: Mètode d'entrada Thai-Lao per a la biblioteca de jocs d'eines GTK+ v3

source: Tigrigna input method for the GTK+ toolkit library v3
ca: Mètode d'entrada Tigrigna per a la biblioteca de jocs d'eines GTK+ v3

source: Vietnamese input method for the GTK+ toolkit library v3
ca: Mètode d'entrada vietnamita per a la biblioteca GTK+ toolkit v3

source: Wayland input method for the GTK+ toolkit library (version 3)
ca: Mètode d'entrada del Wayland per a la biblioteca d'eines GTK+ (versió 3)

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package provides an input method which allows text entry via wayland.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet proporciona un mètode d'entrada que permet l'entrada de text a través del wayland.

source: X input method for the GTK+ toolkit library v3
ca: Mètode d'entrada X per a la biblioteca de jocs d'eines GTK+ v3

source: Translations for package gtk3
ca: Traduccions per al paquet gtk3

source: Provides translations for the "gtk3" package.
ca: Proporciona traduccions per al paquet «gtk3».

source: Config schema for the GTK+ toolkit library v3
ca: Esquema de configuració per a la biblioteca de jocs d'eines GTK+ v3

source: Auxiliary utilities for the GTK+ toolkit library v3
ca: Utilitats auxiliars per a la biblioteca de jocs d'eines GTK+ v3

source: Upstream theme configuration for the GTK+ toolkit library v4
ca: Configuració del tema actual per a la biblioteca de jocs d'eines GTK+ v4

source: Development files for the GTK+ toolkit library v4
ca: Fitxers de desenvolupament per a la biblioteca de jocs d'eines GTK+ v4

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package contains the development files for GTK+ 4.x.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet conté els fitxers de desenvolupament per a GTK+ 4.x.

source: Translations for package gtk4
ca: Traduccions per al paquet gtk4

source: Provides translations for the "gtk4" package.
ca: Proporciona traduccions per al paquet «gtk4».

source: Config schema for the GTK+ toolkit library v4
ca: Esquema de configuració per a la biblioteca del joc d'eines GTK+ v4

source: Auxiliary utilities for the GTK+ toolkit library v4
ca: Utilitats auxiliars per a la biblioteca de jocs d'eines GTK+ v4

source: A GTK Digital Camera Tool
ca: Una eina de càmera digital GTK

source: GTKam is a GTK and GNOME based tool for accessing a digital camera, viewing thumbnails, and downloading pictures from the camera.
ca: GTKam és una eina basada en GTK i GNOME per accedir a una càmera digital, veure miniatures i descarregar imatges de la càmera.

source: Documentation for gtkcam
ca: Documentació per a gtkcam

source: Documentation for gtkam.
ca: Documentació per a gtkam.

source: Translations for package gtkam
ca: Traduccions per al paquet gtkam

source: Provides translations for the "gtkam" package.
ca: Proporciona traduccions per al paquet «gtkam».

source: GtkD devel and header files
ca: Fitxers de desenvolupament i capçalera del GtkD

source: This package contains the header files for GtkD a D binding and OO wrapper of GTK+
ca: Aquest paquet conté els fitxers de capçalera per a GtkD, una vinculació D i un embolcall OO de GTK+

source: OpenGL Extension to GTK
ca: Extensió OpenGL a GTK

source: GtkGLExt is an OpenGL extension to GTK. It provides the GDK objects which support OpenGL rendering in GTK, and GtkWidget API add-ons to make GTK+ widgets OpenGL-capable.
ca: GtkGLExt és una extensió OpenGL a GTK. Proporciona els objectes GDK que admeten la renderització OpenGL a GTK, i els complements de l'API GtkWidget per a fer que els ginys GTK+ siguin capaços d'OpenGL.

source: Documentation of the OpenGL Extension to GTK
ca: Documentació de l'extensió OpenGL a GTK

source: This package contains additional documentation for gtkglext. GtkGLExt is an OpenGL extension to GTK. It provides the GDK objects which support OpenGL rendering in GTK, and GtkWidget API add-ons to make GTK+ widgets OpenGL-capable.
ca: Aquest paquet conté documentació addicional per a gtkglext. GtkGLExt és una extensió OpenGL a GTK. Proporciona els objectes GDK que admeten la renderització OpenGL a GTK, i els complements de l'API GtkWidget per a fer que els ginys GTK+ siguin capaços d'OpenGL.

source: GTK+ utility for computing message digests or checksums
ca: Utilitat GTK+ per a calcular resums de missatges o sumes de verificació

source: GtkHash is a GTK+ utility for computing message digests or checksums. Currently supported hash functions include: * MD2, MD4, MD5, MD6-224, MD6-256, MD6-384, MD6-512 * SHA1, SHA224, SHA256, SHA384, SHA512 * SHA3-224, SHA3-256, SHA3-384, SHA3-512 * RIPEMD128, RIPEMD160, RIPEMD256, RIPEMD320 * TIGER192, WHIRLPOOL, GOST, CRC32, ADLER32 This package contains the GTK+3 version of the program.
ca: GtkHash és una utilitat GTK+ per a calcular resums de missatges o sumes de verificació. Les funcions de resum suportades actualment inclouen: * MD2, MD4, MD5, MD6-224, MD6-256, MD6-384, MD6-512 * SHA1, SHA224, SHA256, SHA384, SHA512 * SHA3-224, SHA3-256, SHA3-384, SHA3-512 * RIPEMD128, RIPEMD160, RIPEMD256, RIPEMD320 * TIGER192, HIDROMASSATGE, GOST, CRC32, ADLER32 Aquest paquet conté la versió GTK+3 del programa.

source: Translations for package gtkhash
ca: Traduccions per al paquet gtkhash

source: Provides translations for the "gtkhash" package.
ca: Proporciona traduccions per al paquet «gtkhash».

source: Translations for package gtkhtml
ca: Traduccions per al paquet gtkhtml

source: Provides translations for the "gtkhtml" package.
ca: Proporciona traduccions per al paquet «gtkhtml».

source: Lightweight HTML rendering/printing/editing engine -- Development Files
ca: Motor de renderització/impressió/edició d'HTML lleuger -- Fitxers de desenvolupament

source: GtkHTML is a lightweight HTML rendering/printing/editing engine. It was originally based on KHTMLW, part of the KDE project, but is now being developed independently. This package contains all necessary include files and libraries needed to develop applications that require these.
ca: GtkHTML és un motor lleuger de representació/impressió/edició d'HTML. Originalment es basava en el KHTMLW, part del projecte KDE, però ara s'està desenvolupant de forma independent. Aquest paquet conté tots els fitxers d'inclusió i biblioteques necessaris per desenvolupar aplicacions que ho requereixin.

source: Development files for gtkimageview
ca: Fitxers de desenvolupament per a gtkimageview

source: GtkImageView is a widget that provides a zoomable and panable view of a GdkPixbuf. It is intended to be usable in most types of image viewing applications.
ca: GtkImageView és un giny que proporciona una vista ampliable i panable d'un GdkPixbuf. Està pensat per ser usable en la majoria dels tipus d'aplicacions de visualització d'imatges.

source: C++ Interface for GTK2 (a GUI library for X)
ca: Interfície de C++ per a GTK2 (una biblioteca GUI per a X)

source: Gtkmm provides a C++ interface to the GTK+ GUI library. gtkmm2 wraps GTK+ 2. Highlights include typesafe callbacks, widgets extensible via inheritance and a comprehensive set of widget classes that can be freely combined to quickly create complex user interfaces.
ca: Gtkmm proporciona una interfície C++ a la biblioteca GTK+ GUI. gtkmm2 ajusta GTK+ 2. Els ressaltats inclouen crides de retorn segur al tipus, ginys extensibles via herència i un conjunt complet de classes de ginys que es poden combinar lliurement per crear ràpidament interfícies d'usuari complexes.

source: C++ Bindings for GTK+ -- Tutorial
ca: Vinculacions de C++ per a GTK+ -- Tutorial

source: Gtkmm provides a C++ interface to the GTK+ GUI library. gtkmm wraps GTK+. Highlights include typesafe callbacks, widgets extensible via inheritance, and a comprehensive set of widget classes that can be freely combined to quickly create complex user interfaces.
ca: Gtkmm proporciona una interfície C++ a la biblioteca GTK+ GUI. gtkmm ajusta GTK+. Els ressaltats inclouen crides de retorn segur al tipus, ginys extensibles via herència, i un conjunt complet de classes de ginys que es poden combinar lliurement per crear ràpidament interfícies d'usuari complexes.

source: Translations for package gtkmm2-documentation
ca: Traduccions per al paquet gtkmm2-documentation

source: Provides translations for the "gtkmm2-documentation" package.
ca: Proporciona traduccions per al paquet «gtkmm2-documentation».

source: C++ Interface for GTK3 (a GUI library for X)
ca: Interfície de C++ per a GTK3 (una biblioteca GUI per a X)

source: Gtkmm provides a C++ interface to the GTK+ GUI library. gtkmm3 wraps GTK+ 3. Highlights include typesafe callbacks, widgets extensible via inheritance and a comprehensive set of widget classes that can be freely combined to quickly create complex user interfaces.
ca: Gtkmm proporciona una interfície C++ a la biblioteca GTK+ GUI. gtkmm3 ajusta GTK+ 3. Els ressaltats inclouen crides de retorn segur al tipus, ginys extensibles via herència i un conjunt complet de classes de ginys que es poden combinar lliurement per crear ràpidament interfícies d'usuari complexes.

source: C++ Interface for GTK3 (a GUI Library for X)
ca: Interfície de C++ per a GTK3 (una biblioteca d'IGU per a X)

source: Gtkmm provides a C++ interface to the GTK+ GUI library. gtkmm3 wraps GTK+ 3. Highlights include typesafe callbacks, widgets extensible via inheritance, and a comprehensive set of widget classes that can be freely combined to quickly create complex user interfaces.
ca: Gtkmm proporciona una interfície C++ a la biblioteca GTK+ GUI. gtkmm3 ajusta GTK+ 3. Els ressaltats inclouen crides de retorn segur al tipus, ginys extensibles via herència, i un conjunt complet de classes de ginys que es poden combinar lliurement per crear ràpidament interfícies d'usuari complexes.

source: Translations for package gtkmm-documentation
ca: Traduccions per al paquet gtkmm-documentation

source: Provides translations for the "gtkmm-documentation" package.
ca: Proporciona traduccions per al paquet «gtkmm-documentation».

source: GTK+ debugging tool similar to Firebug
ca: Eina de depuració GTK+ similar al Firebug

source: Parasite is a debugging and development tool that runs inside your GTK+ application's process. It can inspect your application, giving you detailed information on your UI, such as the hierarchy, X window IDs, widget properties, and more. You can modify properties on the fly in order to experiment with the look of your UI. If you've used Firebug, it's sort of like that, but for GTK+ applications.
ca: El paràsit és una eina de depuració i desenvolupament que s'executa dins del procés de l'aplicació GTK+. Pot inspeccionar la teva aplicació, donant-te informació detallada de la teva interfície d'usuari, com ara la jerarquia, els ID de les finestres X, les propietats dels ginys i molt més. Pots modificar les propietats sobre la marxa per experimentar amb l'aspecte de la teva interfície d'usuari. Si heu utilitzat Firebug, és com això, però per a aplicacions GTK+.

source: A platform independent GUI for the Apple iPod
ca: Una IGU independent de plataforma per a l'iPod d'Apple

source: gtkpod is a Platform-Independent GUI for the Apple iPod using GTK2. It allows you to upload songs and play lists to your iPod. It supports ID3 tag editing with multiple charsets for ID3 tags, detects duplicate songs, allows offline modification of the database with later synchronization, and more.
ca: gtkpod és una IGU independent de la plataforma per a l'iPod d'Apple que utilitza GTK2. Et permet pujar cançons i reproduir llistes al teu iPod. És compatible amb l'edició d'etiquetes ID3 amb múltiples jocs de caràcters per a etiquetes ID3, detecta cançons duplicades, permet la modificació fora de línia de la base de dades amb la sincronització posterior, i més.

source: Development files for gtkpod, a GUI for Apple iPods
ca: Fitxers de desenvolupament per a gtkpod, una IGU per a iPods d'Apple

source: This package contains development headers for libgtkpod gtkpod is a Platform-Independent GUI for the Apple iPod using GTK2. It allows you to upload songs and play lists to your iPod. It supports ID3 tag editing with multiple charsets for ID3 tags, detects duplicate songs, allows offline modification of the database with later synchronization, and more.
ca: Aquest paquet conté capçaleres de desenvolupament per a la libgtkpod gtkpod és una IGU independent de la plataforma per a l'iPod d'Apple que utilitza GTK2. Et permet pujar cançons i reproduir llistes al teu iPod. És compatible amb l'edició d'etiquetes ID3 amb múltiples jocs de caràcters per a etiquetes ID3, detecta cançons duplicades, permet la modificació fora de línia de la base de dades amb la sincronització posterior, i més.

source: Translations for package gtkpod
ca: Traduccions per al paquet gtkpod

source: Provides translations for the "gtkpod" package.
ca: Proporciona traduccions per al paquet «gtkpod».

source: Development files for the GTK+ source editing widget
ca: Fitxers de desenvolupament per al giny d'edició de codi GTK+

source: GtkSourceView is a text widget that extends GtkTextView, the standard GTK+ text widget. It improves GtkTextView by implementing syntax highlighting and other features typical of a source editor.
ca: GtkSourceView és un giny de text que amplia GtkTextView, el giny de text estàndard GTK+. Millora GtkTextView implementant el ressaltat de sintaxi i altres característiques típiques d'un editor de codi font.

source: Translations for package gtksourceview
ca: Traduccions per al paquet gtksourceview

source: Provides translations for the "gtksourceview" package.
ca: Proporciona traduccions per al paquet «gtksourceview».

source: GTK+ 2.0 Source Editing Widget
ca: Giny d'edició del codi font GTK+ 2.0

source: GtkSourceView is a text widget that extends the standard GTK+ 2.x text widget, GtkTextView. GtkSourceView improves GtkTextView by implementing syntax highlighting and other features typical of a source editor.
ca: GtkSourceView és un giny de text que amplia el giny de text estàndard GTK+ 2.x, GtkTextView. GtkSourceView millora GtkTextView implementant el ressaltat de la sintaxi i altres característiques típiques d'un editor de codi font.

source: GtkSourceView is a text widget that extends GtkTextView, the standard GTK+ 2.x text widget. It improves GtkTextView by implementing syntax highlighting and other features typical of a source editor.
ca: GtkSourceView és un giny de text que amplia GtkTextView, el giny de text estàndard GTK+ 2.x. Millora GtkTextView implementant el ressaltat de sintaxi i altres característiques típiques d'un editor de codi font.

source: Additional Package Documentation.
ca: Documentació addicional del paquet.

source: GTK+ Source Editing Widget
ca: Giny d'edició del codi font GTK+

source: Translations for package gtksourceview2
ca: Traduccions per al paquet gtksourceview2

source: Provides translations for the "gtksourceview2" package.
ca: Proporciona traduccions per al paquet «gtksourceview2».

source: Translations for package gtksourceview4
ca: Traduccions per al paquet gtksourceview4

source: Provides translations for the "gtksourceview4" package.
ca: Proporciona traduccions per al paquet «gtksourceview4».

source: Development files for the gtksourceview C++ interface
ca: Fitxers de desenvolupament per a la interfície gtksourceview C++

source: gtksourceviewmm provides a C++ interface to the gtksourceview library.
ca: gtksourceviewmm proporciona una interfície C++ a la biblioteca gtksourceview.

source: Static libraries and header files from gtkspell
ca: Biblioteques estàtiques i fitxers de capçalera de gtkspell

source: Static libraries and header files from gtkspell.
ca: Biblioteques estàtiques i fitxers de capçalera des de gtkspell.

source: GTK2 Spell Checker Interface Library
ca: Biblioteca d'interfície GTK2 del corrector ortogràfic

source: GtkSpell provides MSWord-style and MacOSX-style highlighting of misspelled words in a GtkTextView widget. Right-clicking a misspelled word opens a menu of suggested replacements.
ca: GtkSpell proporciona ressaltat de l'estil MSWord i de l'estil MacOSX de paraules mal escrites en un giny GtkTextView. En fer clic amb el botó dret, una paraula mal escrita obre un menú de reemplaçaments suggerits.

source: Translations for package gtkspell
ca: Traduccions per al paquet gtkspell

source: Provides translations for the "gtkspell" package.
ca: Proporciona traduccions per al paquet «gtkspell».

source: GTK3 Spell Checker Interface Library -- Development Files
ca: Biblioteca de la interfície GTK3 del corrector ortogràfic -- Fitxers de desenvolupament

source: Translations for package gtkspell3
ca: Traduccions per al paquet gtkspell3

source: Provides translations for the "gtkspell3" package.
ca: Proporciona traduccions per al paquet «gtkspell3».

source: Waveform viewer for Ditital Signals
ca: Visor de formes d'ona per a senyals dititals

source: GTKWave is a waveform viewer that can view VCD files produced by most Verilog simulation tools, as well as LXT files produced by certain Verilog simulation tools.
ca: GTKWave és un visualitzador de formes d'ona que pot veure fitxers VCD produïts per la majoria d'eines de simulació Verilog, així com fitxers LXT produïts per certes eines de simulació Verilog.

source: Documentation for GTKWave
ca: Documentació per al GTKWave

source: GTKWave is a waveform viewer that can view VCD files produced by most Verilog simulation tools, as well as LXT files produced by certain Verilog simulation tools. This package contains documentation for GTKWave
ca: GTKWave és un visualitzador de formes d'ona que pot veure fitxers VCD produïts per la majoria d'eines de simulació Verilog, així com fitxers LXT produïts per certes eines de simulació Verilog. Aquest paquet conté documentació per a GTKWave

source: Examples for GTKWave
ca: Exemples per al GTKWave

source: GTKWave is a waveform viewer that can view VCD files produced by most Verilog simulation tools, as well as LXT files produced by certain Verilog simulation tools. This package contains examples for GTKWave
ca: GTKWave és un visualitzador de formes d'ona que pot veure fitxers VCD produïts per la majoria d'eines de simulació Verilog, així com fitxers LXT produïts per certes eines de simulació Verilog. Aquest paquet conté exemples per a GTKWave

source: Atomic parsley in gtkpod
ca: Julivert atòmic a gtkpod

source: This is the core library for atomic parsley of mp4 files in gtkpod. Library including read/write lyric support for the first time and write metadata function.
ca: Aquesta és la biblioteca principal per al julivert atòmic de fitxers mp4 a gtkpod. Biblioteca que inclou el suport líric de lectura/escriptura per primera vegada i la funció d'escriptura de metadades.

source: GtkD gstreamerd library
ca: Biblioteca GtkD gstreamerd

source: This package contains the GtkD gstreamerd library.
ca: Aquest paquet conté la biblioteca GtkD gstreamerd.

source: The GTK+ toolkit library (version 2)
ca: La biblioteca del joc d'eines GTK+ (versió 2)

source: The GTK+ toolkit library (version 3)
ca: La biblioteca del joc d'eines GTK+ (versió 3)

source: The GTK+ toolkit library (version 4)
ca: La biblioteca del joc d'eines GTK+ (versió 4)

source: Library to create desktop components for Wayland
ca: Biblioteca per a crear components d'escriptori per al Wayland
