Repository: openSUSE/packages-i18n
Catalog: */po/gtk.*.po
Languages: ca

source: A library to create panels and other desktop components for Wayland using the Layer Shell protocol
ca: Una biblioteca per a crear plafons i altres components d'escriptori per al Wayland utilitzant el protocol Layer Shell

source: A GTK widget for VNC clients
ca: Un giny GTK per a clients VNC

source: GtkD base library
ca: Biblioteca base del GtkD

source: This package contains the GtkD base library.
ca: Aquest paquet conté la biblioteca base GtkD.

source: GtkD gtkdgl library
ca: Biblioteca GtkD gtkdgl

source: This package contains the GtkDGL library.
ca: Aquest paquet conté la biblioteca GtkDGL.

source: GtkD sourceview library
ca: Biblioteca de visualització de fonts del GtkD

source: This package contains the GtkD sourceview library.
ca: Aquest paquet conté la biblioteca sourceview del GtkD.

source: GtkGLExt is an OpenGL extension to GTK. It provides the GDK objects that support OpenGL rendering in GTK and GtkWidget API add-ons, to make GTK+ widgets OpenGL-capable.
ca: GtkGLExt és una extensió OpenGL a GTK. Proporciona els objectes GDK que admeten la renderització OpenGL en els complements de l'API GTK i GtkWidget, per a fer que els ginys GTK+ siguin capaços d'OpenGL.

source: Platform Independent Hotkey Handling for GTK+ Applications -- Development Files
ca: Gestió independent de les dreceres de teclat per a aplicacions GTK+ -- Fitxers de desenvolupament

source: GtkHotkey is simple library offering a platform independent way for GTK+ applications to manage and bind desktop-wide hotkeys. This package contains all necessary include files and libraries needed to develop applications that require these.
ca: GtkHotkey és una biblioteca senzilla que ofereix una forma independent de plataforma per a les aplicacions GTK+ per gestionar i vincular dreceres de tot l'escriptori. Aquest paquet conté tots els fitxers d'inclusió i biblioteques necessaris per desenvolupar aplicacions que ho requereixin.

source: Platform Independent Hotkey Handling for GTK+ Applications
ca: Gestió independent de les dreceres de teclat per a aplicacions GTK+

source: GtkHotkey is simple library offering a platform independent way for GTK+ applications to manage and bind desktop-wide hotkeys.
ca: GtkHotkey és una biblioteca senzilla que ofereix una forma independent de plataforma per a les aplicacions GTK+ per gestionar i vincular dreceres de tot l'escriptori.

source: Lightweight HTML rendering/printing/editing engine
ca: Motor de renderització/impressió/edició d'HTML lleuger

source: GtkHTML is a lightweight HTML rendering/printing/editing engine. It was originally based on KHTMLW, part of the KDE project, but is now being developed independently.
ca: GtkHTML és un motor lleuger de representació/impressió/edició d'HTML. Originalment es basava en el KHTMLW, part del projecte KDE, però ara s'està desenvolupant de forma independent.

source: Library providing an advanced widget for GdkPixbuf
ca: Biblioteca que proporciona un giny avançat per a GdkPixbuf

source: A platform independent GUI for the Apple® iPod® - System Library
ca: Una interfície d'usuari independent de plataforma per a l'Apple i iPod the - Biblioteca del sistema

source: gtkpod is a Platform-Independent GUI for the Apple iPod using GTK2. It allows you to upload songs and play lists to your iPod. It supports ID3 tag editing with multiple charsets for ID3 tags, detects duplicate songs, allows offline modification of the database with later synchronization, and more. Shared Library, to be installed by package dependencies.
ca: gtkpod és una IGU independent de la plataforma per a l'iPod d'Apple que utilitza GTK2. Et permet pujar cançons i reproduir llistes al teu iPod. És compatible amb l'edició d'etiquetes ID3 amb múltiples jocs de caràcters per a etiquetes ID3, detecta cançons duplicades, permet la modificació fora de línia de la base de dades amb la sincronització posterior, i més. Biblioteca compartida, a instal·lar per dependències de paquets.

source: C++ interface for gtksourceview
ca: Interfície C++ per a gtksourceview

source: GTK3 Spell Checker Interface Library
ca: Biblioteca d'interfície de correcció ortogràfica GTK3

source: GObject-based library to interact with the RFB protocol
ca: Biblioteca basada en GObject per interactuar amb el protocol RFB

source: gtk-vnc is a VNC viewer widget for GTK+. It is built using coroutines allowing it to be completely asynchronous while remaining single threaded. This package contains the GObject-based library to interact with the RFB protocol.
ca: gtk-vnc és un giny visor VNC per a GTK+. Es construeix utilitzant coroutines que permeten que sigui completament asíncrona mentre es manté un sol fil. Aquest paquet conté la biblioteca basada en GObject per interactuar amb el protocol RFB.

source: Pulse audio bridge for VNC client connections
ca: Pont d'àudio Pulse per a connexions de clients VNC

source: gtk-vnc is a VNC viewer widget for GTK+. It is built using coroutines allowing it to be completely asynchronous while remaining single threaded. This package contains the Pulse audio bridge for VNC client connections.
ca: gtk-vnc és un giny visor VNC per a GTK+. Es construeix utilitzant coroutines que permeten que sigui completament asíncrona mentre es manté un sol fil. Aquest paquet conté el pont d'àudio Pulse per a les connexions del client VNC.

source: Profiler for gtk-sharp3
ca: Perfilador per a gtk-sharp3

source: A profiler called "gui-thread-check" is included as part of the install for debugging purposes.
ca: S'inclou un perfilador anomenat "gui-thread-check" com a part de la instal·lació amb finalitats de depuració.

source: GtkD peasd library
ca: Biblioteca GtkD peasd

source: This package contains the GtkD peasd library.
ca: Aquest paquet conté la biblioteca GtkD peasd.

source: GtkD vted library
ca: Biblioteca Vted de GtkD

source: This package contains the GtkD vted library.
ca: Aquest paquet conté la biblioteca Vted de GtkD.

source: GTK+, Xfwm4 and Metacity Sonar Theme -- Common Files
ca: GTK+, Xfwm4 i Tema de Sonar Metacity -- Fitxers comuns

source: Nimbus Icon Theme
ca: Tema d'icones Nimbus

source: Sonar Icon Theme
ca: Tema d'icones del Sonar

source: Sonar icon theme based on the upcoming GNOME icon theme.
ca: Tema d'icones del Sonar basat en el tema d'icones del GNOME.

source: GtkHash extension for Thunar
ca: Extensió GtkHash per a Thunar

source: GtkHash extension for the Thunar file manger. It adds an additional tab called "Digests" to the file properties dialog.
ca: Extensió GtkHash per al gestor de fitxers Thunar. Afegeix una pestanya addicional anomenada «Digests» al diàleg de propietats del fitxer.

source: Introspection bindings for gtk-vnc
ca: Vinculacions d'introspecció per a gtk-vnc

source: gtk-vnc is a VNC viewer widget for GTK+. It is built using coroutines allowing it to be completely asynchronous while remaining single threaded. This package provides the GObject Introspection bindings for the libgvnc library.
ca: gtk-vnc és un giny visor VNC per a GTK+. Es construeix utilitzant coroutines que permeten que sigui completament asíncrona mentre es manté un sol fil. Aquest paquet proporciona les vinculacions d'introspecció GObject per a la biblioteca libgvnc.

source: Pulse audio bridge for VNC client connections -- Introspection bindings
ca: Pont d'àudio de Pulse per a connexions de client VNC -- Enllaços d'introspecció

source: gtk-vnc is a VNC viewer widget for GTK+. It is built using coroutines allowing it to be completely asynchronous while remaining single threaded. This package provides the GObject Introspection bindings for the libgvncpulse library.
ca: gtk-vnc és un giny visor VNC per a GTK+. Es construeix utilitzant coroutines que permeten que sigui completament asíncrona mentre es manté un sol fil. Aquest paquet proporciona les vinculacions d'introspecció GObject per a la biblioteca libgvncpulse.

source: Introspection bindings for the GTK+ toolkit library v2
ca: Vinculacions d'introspecció per a la biblioteca de jocs d'eines GTK+ v2

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package provides the GObject Introspection bindings for GTK+.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet proporciona les vinculacions d'introspecció GObject per a GTK+.

source: Introspection bindings for the GTK+ toolkit library (version 3)
ca: Vinculacions d'introspecció per a la biblioteca del joc d'eines GTK+ (versió 3)

source: Introspection bindings for the GTK+ toolkit library v4
ca: Vinculacions d'introspecció per a la biblioteca de jocs d'eines GTK+ v4

source: This library is a companion library to GObject and Gtk+. It provides various features that are wished in the underlying library but are not for various reasons. In most cases, they are wildly out of scope for those libraries. In other cases, the design isn't quite generic enough to work for everyone.. This package provides the GObject Introspection bindings for gtk-layer-shell.
ca: Aquesta biblioteca és una biblioteca d'acompanyament per al GObject i el Gtk+. Proporciona diverses característiques que són desitjades a la biblioteca subjacent, però no per diverses raons. En la majoria dels casos, estan fora de l'abast d'aquestes biblioteques. En altres casos, el disseny no és prou genèric per treballar per a tothom. Aquest paquet proporciona les vinculacions d'introspecció GObject per a gtk-layer-shell.

source: Introspection bindings for the GTK+ source editing widget
ca: Vinculacions d'introspecció per al giny d'edició de codi GTK+

source: GtkSourceView is a text widget that extends GtkTextView, the standard GTK+ text widget. It improves GtkTextView by implementing syntax highlighting and other features typical of a source editor. This package provides the GObject Introspection bindings for GtkSourceView.
ca: GtkSourceView és un giny de text que amplia GtkTextView, el giny de text estàndard GTK+. Millora GtkTextView implementant el ressaltat de sintaxi i altres característiques típiques d'un editor de codi font. Aquest paquet proporciona les vinculacions GObject Introspection per a GtkSourceView.

source: GTK+ Source Editing Widget -- Introspection bindings
ca: Giny d'edició del codi font GTK+ -- Vinculacions d'introspecció

source: GTK3 Spell Checker Interface Library -- Introspection bindings
ca: Biblioteca de la interfície GTK3 del corrector ortogràfic -- Vinculacions d'introspecció

source: A GTK widget for VNC clients -- Introspection bindings
ca: Un giny GTK per a clients VNC -- Vinculacions d'introspecció

source: gtk-vnc is a VNC viewer widget for GTK+. It is built using coroutines allowing it to be completely asynchronous while remaining single threaded. This package provides the GObject Introspection bindings for the libgtk-vnc library.
ca: gtk-vnc és un giny visor VNC per a GTK+. Es construeix utilitzant coroutines que permeten que sigui completament asíncrona mentre es manté un sol fil. Aquest paquet proporciona les vinculacions d'introspecció GObject per a la biblioteca libgtk-vnc.

source: Glade catalog for GTKDataBox
ca: Catàleg del Glade per a GTKDataBox

source: GtkDatabox is a widget for the Gtk+-3 library designed to display large amounts of numerical data fast and easy.
ca: GtkDatabox és un giny per a la biblioteca Gtk+-3 dissenyat per mostrar grans quantitats de dades numèriques de manera ràpida i fàcil.

source: Developer documentation for GTK
ca: Documentació del desenvolupador per a GTK

source: This package contains developer documentation for version 4 of the GTK widget toolkit.
ca: Aquest paquet conté documentació del desenvolupador per a la versió 4 del joc d'eines del giny GTK.

source: Example code for using the library
ca: Codi d'exemple per a utilitzar la biblioteca

source: GtkDatabox is a widget for the Gtk+-3 library designed to display large amounts of numerical data fast and easy. This package contains some example code for developing using GTKDataBox.
ca: GtkDatabox és un giny per a la biblioteca Gtk+-3 dissenyat per mostrar grans quantitats de dades numèriques de manera ràpida i fàcil. Aquest paquet conté algun codi d'exemple per a desenvolupar utilitzant GTKDataBox.

source: Documentation for GTKDataBox
ca: Documentació per a GTKDataBox

source: GTK based greeter for greetd
ca: Salutació basada en GTK per a salutació

source: GTK based greeter for greetd, to be run under cage or similar.
ca: Salutació basada en GTK per a rebre, per a executar-se sota gàbia o similar.

source: C++ Interface for GTK4 (a GUI library for X)
ca: Interfície de C++ per a GTK4 (una biblioteca GUI per a X)

source: C++ Interface for GTK4 (a GUI Library for X)
ca: Interfície de C++ per a GTK4 (una biblioteca d'IGU per a X)

source: Translations for package gtksourceview5
ca: Traduccions per al paquet gtksourceview5

source: Provides translations for the "gtksourceview5" package.
ca: Proporciona traduccions per al paquet «gtksourceview5».
