Repository: openSUSE/packages-i18n
Catalog: */po/gtk.*.po
Languages: ca

source: International Tag Set for GTK+ 3
ca: Conjunt d'etiquetes internacionals per a GTK+ 3

source: This package enhances gettext with an International Tag Set for GTK+ 3
ca: Aquest paquet millora el gettext amb un conjunt d'etiquetes internacional per a GTK+ 3

source: International Tag Set for GTK+ 4
ca: Conjunt d'etiquetes internacionals per a GTK+ 4

source: This package enhances gettext with an International Tag Set for GTK+ 4
ca: Aquest paquet millora el gettext amb un conjunt d'etiquetes internacional per a GTK+ 4

source: Files for developing programs that use gio-sharp
ca: Fitxers per a desenvolupar programes que utilitzen gio-sharp

source: Mono bindings for gio
ca: Vinculacions mono per al gio

source: This package contains Mono bindings for gio-sharp.
ca: Aquest paquet conté enquadernacions Mono per a gio-sharp.

source: .NET/C-Sharp Bindings for GIO
ca: Vinculacions .NET/C-Sharp per a GIO

source: Lightweight HTML rendering/printing/editing engine -- Catalog for Glade
ca: Motor de renderització/impressió/edició d'HTML lleuger -- Catàleg per al Glade

source: GtkHTML is a lightweight HTML rendering/printing/editing engine. It was originally based on KHTMLW, part of the KDE project, but is now being developed independently. This package provides a catalog for Glade, to allow the use of GtkHTML widgets in Glade.
ca: GtkHTML és un motor lleuger de representació/impressió/edició d'HTML. Originalment es basava en el KHTMLW, part del projecte KDE, però ara s'està desenvolupant de forma independent. Aquest paquet proporciona un catàleg per al Glade, per permetre l'ús de ginys GtkHTML al Glade.

source: Glade catalog for the GTK+ source editing widget
ca: Catàleg del Glade per al giny d'edició de codi GTK+

source: GtkSourceView is a text widget that extends GtkTextView, the standard GTK+ text widget. It improves GtkTextView by implementing syntax highlighting and other features typical of a source editor. This package provides a catalog for Glade, to allow the use the GtkSourceView widget in Glade.
ca: GtkSourceView és un giny de text que amplia GtkTextView, el giny de text estàndard GTK+. Millora GtkTextView implementant el ressaltat de sintaxi i altres característiques típiques d'un editor de codi font. Aquest paquet proporciona un catàleg per al Glade, per permetre l'ús del giny GtkSourceView al Glade.

source: GTK+ Source Editing Widget -- Catalog for Glade
ca: Giny d'edició del codi font GTK+ -- Catàleg per al Glade

source: Mono bindings for glade
ca: Vinculacions mono per al glade

source: This package contains Mono bindings for glade.
ca: Aquest paquet conté vinculacions Mono per al glade.

source: Mono bindings for glib
ca: Vinculacions mono per a la glib

source: This package contains Mono bindings for glib.
ca: Aquest paquet conté enllaços Mono per a la «glib».

source: GTK+ Documentation Generator
ca: Generador de documentació GTK+

source: Gtkdoc is a set of Python scripts that generates API reference documentation in e.g DocBook, HTML or PDF format. It can extract documentation from source code comments in a manner similar to Java-doc. It is used to generate the documentation for GLib, Gtk+, and GNOME.
ca: Gtkdoc és un conjunt de scripts Python que genera documentació de referència de l'API en format, per exemple, DocBook, HTML o PDF. Pot extreure documentació de comentaris de codi font d'una manera similar a Java-doc. S'utilitza per generar la documentació per a GLib, Gtk+ i GNOME.

source: Manual for Gtkdoc
ca: Manual per al Gtkdoc

source: User manual for Gtkdoc
ca: Manual d'usuari per a Gtkdoc

source: Translations for package gtk-doc-manual
ca: Traduccions per al paquet gtk-doc-manual

source: Provides translations for the "gtk-doc-manual" package.
ca: Proporciona traduccions per al paquet «gtk-doc-manual».

source: Gtkdoc PDF Generator
ca: Generador de PDF Gtkdoc

source: PDF generator for Gtkdoc.
ca: Generador de PDF per a Gtkdoc.

source: GTK key theme that sets ctrl-u in text entries
ca: Tema de claus GTK que estableix ctrl-u en entrades de text

source: A GTK key theme that makes ctrl-u, ctrl-w and ctrl-h work in text entries and text views. In contrast to the Emacs key theme which redefines many other common key bindings (like ctrl-p) this is one is reduced to the bare minimum to make text entries usable.
ca: Un tema de claus GTK que fa que ctrl-u, ctrl-w i ctrl-h funcionin en entrades de text i vistes de text. En contrast amb el tema de claus Emacs, que redefineix moltes altres vinculacions de claus comunes (com ctrl-p), aquesta és una es redueix al mínim per fer que les entrades de text siguin usables.

source: Development files for gtk-layer-shell
ca: Fitxers de desenvolupament per a gtk-layer-shell

source: Development files and headers for gtk-layer-shell
ca: Fitxers de desenvolupament i capçaleres per a la capa gtk-shell

source: Extra Gtk# bindings
ca: Vinculacions addicionals de Gtks

source: Gtk# Beans aims to fill the gap between the current Gtk# packages state and all the blings and desktop integration stuffs anyone would want to use. It builds on top of Gtk# and extend it by adding new classes and extension methods.
ca: Gtk. Beans té com a objectiu omplir el buit entre l'estat actual dels paquets de Gtk. i tots els elements d'integració d'escriptori i blings que qualsevol voldria utilitzar. Es construeix sobre Gtk. i s'estén afegint noves classes i mètodes d'extensió.

source: Files for developing programs that use gtk-sharp-beans
ca: Fitxers per a desenvolupar programes que utilitzen gtk-sharp-beans

source: .Net Language Bindings for GTK+
ca: .Vinculacions de llengua en xarxa per a GTK+

source: This package contains Mono bindings for gtk+, gdk, atk, and pango.
ca: Aquest paquet conté vinculacions Mono per a gtk+, gdk, atk i pango.

source: GTK+ and GNOME bindings for Mono (virtual package)
ca: Vinculacions GTK+ i GNOME per a Mono (paquet virtual)

source: Gtk# is a library that allows you to build fully native graphical GNOME applications using Mono. Gtk# is a binding to GTK+, the cross platform user interface toolkit used in GNOME. It includes bindings for Gtk, Atk, Pango, Gdk, libgnome, libgnomeui and libgnomecanvas. (Virtual package which depends on all gtk-sharp2 subpackages)
ca: El Gtk. és una biblioteca que us permet construir aplicacions gràfiques completament natives del GNOME utilitzant el Mono. Gtk. és un enllaç a GTK+, el joc d'eines d'interfície d'usuari de plataforma creuada utilitzat al GNOME. Inclou vinculacions per a Gtk, Atk, Pango, Gdk, libgnome, libgnomeui i libgnomecanvas. (Paquet virtual que depèn de tots els subpaquets gtk-sharp2)

source: Monodoc documentation for gtk-sharp2
ca: Documentació monodoc per a gtk-sharp2

source: This package contains the gtk-sharp2 documentation for monodoc.
ca: Aquest paquet conté la documentació gtk-sharp2 per al monodoc.

source: C Source Parser and C Generator
ca: Analitzador de codi font C i generador de C

source: The gtk-sharp-gapi package includes the parser and code generator used by the GTK if you want to bind GObject-based libraries, or need to compile a project that uses it to bind such a library.
ca: El paquet gtk-sharp-gapi inclou l'analitzador i el generador de codi utilitzat per la GTK si voleu vincular les biblioteques basades en GObject, o necessiteu compilar un projecte que l'utilitzi per vincular aquesta biblioteca.

source: C-Sharp Language Bindings for GTK+
ca: Vinculacions de llenguatge C-Sharp per a GTK+

source: This package contains C-Sharp bindings for Gtk+, Gdk, Atk, and Pango. for use with Mono.
ca: Aquest paquet conté vinculacions C-Sharp per a Gtk+, Gdk, Atk i Pango. per utilitzar amb Mono.

source: Gtk-Sharp is a library that allows you to build fully native graphical GNOME applications using Mono. Gtk-Sharp is a binding to GTK+, the cross platform user interface toolkit used in GNOME. It includes bindings for Gtk, Atk, Pango, Gdk, libgnome, libgnomeui and libgnomecanvas. This is a virtual package which depends on all gtk-sharp3 subpackages)
ca: Gtk-Sharp és una biblioteca que us permet construir aplicacions gràfiques totalment natives del GNOME utilitzant Mono. El Gtk-Sharp és un enllaç al GTK+, el joc d'eines d'interfície d'usuari de plataforma creuada utilitzat al GNOME. Inclou vinculacions per a Gtk, Atk, Pango, Gdk, libgnome, libgnomeui i libgnomecanvas. Aquest és un paquet virtual que depèn de tots els subpaquets gtk-sharp3)

source: Files for developing programs using the C-Sharp bindings for Gtk+, Gdk, Atk, and Pango.
ca: Fitxers per a desenvolupar programes utilitzant les vinculacions C-Sharp per a Gtk+, Gdk, Atk i Pango.

source: Files for developing programs that use gapi-sharp3.
ca: Fitxers per a desenvolupar programes que utilitzen gapi-sharp3.

source: A GTK widget for VNC clients -- Development Files
ca: Un giny GTK per a clients VNC -- Fitxers de desenvolupament

source: gtk-vnc is a VNC viewer widget for GTK+. It is built using coroutines allowing it to be completely asynchronous while remaining single threaded.
ca: gtk-vnc és un giny visor VNC per a GTK+. Es construeix utilitzant coroutines que permeten que sigui completament asíncrona mentre es manté un sol fil.

source: Translations for package gtk-vnc
ca: Traduccions per al paquet gtk-vnc

source: Provides translations for the "gtk-vnc" package.
ca: Proporciona traduccions per al paquet «gtk-vnc».

source: VNC Tools based on gtk-vnc
ca: Eines VNC basades en gtk-vnc

source: This package contains tools based on gtk-vnc: - gvnccapture: a tool to capture a screenshot of the VNC desktop - gvncviewer: a simple VNC client
ca: Aquest paquet conté eines basades en gtk-vnc: - gvnccapture: una eina per a capturar una captura de pantalla de l'escriptori VNC - gvncviewer: un client VNC simple

source: The GTK+ toolkit library (version 2) -- openSUSE theme configuration
ca: La biblioteca del joc d'eines GTK+ (versió 2) -- configuració del tema openSUSE

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package provides the openSUSE theme configuration for widgets and icon themes.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet proporciona la configuració del tema openSUSE per a ginys i temes d'icones.

source: Upstream theme configuration for the GTK+ toolkit library v2
ca: Configuració del tema actual per a la biblioteca de jocs d'eines GTK+ v2

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets.

source: Data files for the GTK+ toolkit library v2
ca: Fitxers de dades per a la biblioteca del joc d'eines GTK+ v2

source: Development files for the GTK+ toolkit library v2
ca: Fitxers de desenvolupament per a la biblioteca de jocs d'eines GTK+ v2

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package contains the development files for GTK+ 2.x.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet conté els fitxers de desenvolupament per a GTK+ 2.x.

source: Another GTK2 engine theme
ca: Un altre tema de motor GTK2

source: The Aurora Gtk Engine themes all common Gtk widgets to provide an attractive, complete and consistent look for Gtk applications.
ca: El motor Gtk d'Aurora tematitza tots els ginys Gtk comuns per proporcionar una cerca atractiva, completa i consistent per a les aplicacions Gtk.

source: CleanIce GTK Theme Engine
ca: Motor de tema GTK CleanIce

source: Simple, clean theme engine for GTK2.
ca: Motor de tema senzill i net per a GTK2.

source: Clearlooks GTK+ 2 Theme Engine
ca: Motor de temes GTK+ 2 de Clearlooks

source: The Clearlooks engine was the default theme of GNOME 2 since 2.12. It is a modular engine providing multiple styles such as glossy and gummy.
ca: El motor Clearlooks era el tema predeterminat del GNOME 2 des de la 2.12. És un motor modular que proporciona múltiples estils com el brillant i el gom a gom.

source: Crux GTK+ 2 Theme Engine
ca: Motor de temes del Crux GTK+ 2

source: The Crux engine was a popular theme in the early GNOME 2 days.
ca: El motor Crux va ser un tema popular a principis dels dies del GNOME 2.

source: Equinox GTK+ Theme Engine
ca: Motor de temes GTK+ de l'equinocci

source: Equinox is a theme engine for GTK+. It is a heavily modified derivative of the Aurora engine (version 1.40).
ca: Equinox és un motor de tema per a GTK+. És un derivat molt modificat del motor Aurora (versió 1.40).

source: Glide GTK+ 2 Theme Engine
ca: Motor de temes del Glide GTK+ 2

source: This packages provides the Glide engine for GTK+ 2, originally written for the Glider theme.
ca: Aquest paquet proporciona el motor Glide per a GTK+ 2, originalment escrit per al tema Glider.

source: HC GTK+ 2 Theme Engine
ca: Motor de temes HC GTK+ 2

source: The High Contrast engine is targeted for usability themes, such as the GNOME HighContrast theme.
ca: El motor High Contrast està dirigit a temes d'usabilitat, com el tema HighContrast del GNOME.

source: Industrial GTK+ 2 Theme Engine
ca: Motor de tema industrial GTK+ 2

source: The Industrial engine provides a simple and consistent appearance for applications.
ca: El motor Industrial proporciona una aparença senzilla i consistent per a les aplicacions.

source: The Mist engine is a minimalist engine designed to provide a simple UI experience.
ca: El motor Mist és un motor minimalista dissenyat per proporcionar una experiència d'interfície d'usuari senzilla.

source: Murrine GTK Theme Engine
ca: Motor del tema GTK del Murrine

source: Murrine is a GTK+ 2 theme engine, that uses the Cairo vector drawing library to render widgets. It features a modern glassy look, is elegant and clean on the eyes, and is extremely customizable.
ca: Murrine és un motor de tema GTK+ 2, que utilitza la biblioteca de dibuix vectorial Cairo per a renderitzar ginys. Presenta un aspecte modern de vidre, és elegant i net als ulls, i és extremadament personalitzable.

source: Nimbus GTK Theme Engine
ca: Motor de tema GTK de Nimbus

source: Nimbus is the name of a look-and-feel designed by Sun for the Java Desktop System.
ca: Nimbus és el nom d'un look-and-feel dissenyat per Sun per al Java Desktop System.

source: Redmond GTK+ 2 Theme Engine
ca: Motor de temes de Redmond GTK+ 2

source: The Redmond engine and theme are designed to mimic the appearance of another well known OS.
ca: El motor i el tema Redmond estan dissenyats per imitar l'aparença d'un altre sistema operatiu ben conegut.

source: ThinIce GTK+ 2 Theme Engine
ca: Motor de tema GTK+ 2 ThinIce

source: The ThinIce engine features thin edges and Icy Colors, and provides a simple mostly clean appearance many find satisfying.
ca: El motor ThinIce presenta vores fines i colors gelats, i proporciona una aparença simple, majoritàriament neta, que molts troben satisfactòria.

source: GTK+ 2 Theme Engines
ca: Motors de temes GTK+ 2

source: This package installs the theme engine libraries for GTK+ 2.
ca: Aquest paquet instal·la les biblioteques de motors de temes per a GTK+ 2.

source: Development files for gtk2-engines
ca: Fitxers de desenvolupament per a gtk2-engines

source: This package contains development files for gtk2-engines.
ca: Aquest paquet conté fitxers de desenvolupament per a gtk2-engines.

source: Amharic input method for the GTK+ toolkit library v2
ca: Mètode d'entrada amhàric per a la biblioteca de jocs d'eines GTK+ v2

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package provides an input method for Amharic.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet proporciona un mètode d'entrada per a l'amhàric.

source: Inuktitut input method for the GTK+ toolkit library v2
ca: Mètode d'entrada de l'Inuktitut per a la biblioteca de jocs d'eines GTK+ v2

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package provides an input method for Inuktitut.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet proporciona un mètode d'entrada per a l'Inuktitut.

source: Multipress input method for the GTK+ toolkit library v2
ca: Mètode d'entrada multipremsa per a la biblioteca de jocs d'eines GTK+ v2

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package provides an input method which allows text entry via the multi-press method, as on a mobile phone.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet proporciona un mètode d'entrada que permet l'entrada de text a través del mètode multipremsa, com en un telèfon mòbil.

source: Thai-Lao input method for the GTK+ toolkit library v2
ca: Mètode d'entrada Thai-Lao per a la biblioteca de jocs d'eines GTK+ v2

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package provides an input method for Thai-Lao.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet proporciona un mètode d'entrada per a Thai-Lao.

source: Tigrigna input methods for the GTK+ toolkit library v2
ca: Mètodes d'entrada de Tigrigna per a la biblioteca de jocs d'eines GTK+ v2

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package provides two input methods for Tigrigna.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet proporciona dos mètodes d'entrada per a Tigrigna.

source: Vietnamese input method for the GTK+ toolkit library v2
ca: Mètode d'entrada vietnamita per a la biblioteca GTK+ toolkit v2

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package provides an input method for Vietnamese.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet proporciona un mètode d'entrada per a Vietnamita.

source: X input method for the GTK+ toolkit library v2
ca: Mètode d'entrada X per a la biblioteca de jocs d'eines GTK+ v2

source: GTK+ is a multi-platform toolkit for creating graphical user interfaces. Offering a complete set of widgets, GTK+ is suitable for projects ranging from small one-off projects to complete application suites. This package provides an input method based on the X Input Method.
ca: GTK+ és un conjunt d'eines multiplataforma per a crear interfícies gràfiques d'usuari. Ofereix un conjunt complet de ginys, GTK+ és adequat per a projectes que van des de petits projectes puntuals fins a paquets d'aplicacions complets. Aquest paquet proporciona un mètode d'entrada basat en el mètode d'entrada X.

source: Translations for package gtk2
ca: Traduccions per al paquet gtk2

source: Provides translations for the "gtk2" package.
ca: Proporciona traduccions per al paquet «gtk2».

source: Equinox Metathemes for GTK+
ca: Metatemes d'equinocci per a GTK+

source: This package provides a set of elegant GTK+ themes that use the Equinox engine.
ca: Aquest paquet proporciona un conjunt d'elegants temes GTK+ que utilitzen el motor Equinox.

source: openSUSE themes and metathemes for gtk2, Xfwm4 and metacity
ca: openSUSE temes i metàtesis per a gtk2, Xfwm4 i metacity

source: OpenSUSE themes and metathemes for gtk2, Xfwm4 and metacity contains several themes in openSUSE look: Gilouche, GreyGilouche and Synchonicity.
ca: Els temes i metàtesis OpenSUSE per a gtk2, Xfwm4 i metacity contenen diversos temes en l'aspecte d'OpenSUSE: Gilouche, GreyGilouche i Synchonicity.

source: Industrial Metatheme for GNOME
ca: Metatema industrial per al GNOME

source: Metatheme for GNOME: Industrial strength WM theme for Metacity and Industrial icon theme for GNOME.
ca: Metatheme for GNOME: Intensitat industrial Tema WM per a Metacity i tema d'icones industrial per a GNOME.

source: Nimbus Metatheme for GNOME
ca: Metatema de Nimbus per al GNOME

source: GTK+, Xfwm4 and Metacity Sonar Theme
ca: GTK+, Xfwm4 i el tema Metacity Sonar

source: GTK+, Xfwm4 and Metacity theme created for openSUSE 11.2.
ca: S'han creat GTK+, Xfwm4 i el tema Metacity per a l'openSUSE 11.2.

source: Clearlooks Theme for GTK+ 2
ca: Tema Clearlooks per a GTK+ 2

source: This package provides the Clearlooks GTK+ 2 theme.
ca: Aquest paquet proporciona el tema Clearlooks GTK+ 2.

source: Crux Theme for GTK+ 2
ca: Tema del Crux per al GTK+ 2

source: This package provides the Crux GTK+ 2 theme.
ca: Aquest paquet proporciona el tema del Crux GTK+ 2.

source: Industrial Theme for GTK+ 2
ca: Tema industrial per a GTK+ 2

source: This package provides the Industrial GTK+ 2 theme.
ca: Aquest paquet proporciona el tema Industrial GTK+ 2.

source: Mist Theme for GTK+ 2
ca: Mist Theme per al GTK+ 2

source: This package provides the Mist GTK+ 2 theme.
ca: Aquest paquet proporciona el tema Mist GTK+ 2.

source: Redmond Theme for GTK+ 2
ca: Tema de Redmond per al GTK+ 2

source: ThinIce Theme for GTK+ 2
ca: Tema ThinIce per a GTK+ 2

source: This package provides the ThinIce GTK+ 2 theme.
ca: Aquest paquet proporciona el tema ThinIce GTK+ 2.

source: Auxiliary utilities for the GTK+ toolkit library v2
ca: Utilitats auxiliars per a la biblioteca de jocs d'eines GTK+ v2
