Repository: openSUSE/packages-i18n
Catalog: */po/leechcraft.*.po
Languages: ca

source: This package provides a settings importer plugin for LeechCraft which can import settings, preferences, etc. from various applications. Currently it supports * Kopete: chat history. * Psi+: account settings, chat history. * Vacuum IM: account settings, chat history. * Akregator: feeds list, individual settings for each feed, like update interval and custom storage parameters, Akregator's settings. * Firefox: history, bookmarks, RSS feeds (aka Live bookmarks). * Liferea: feeds list.
ca: Aquest paquet proporciona un connector d'importació de configuració per a LeechCraft que pot importar paràmetres, preferències, etc. des de diverses aplicacions. Actualment admet * Kopete: historial de xat. * Psi+: configuració del compte, historial de xats. * IM del buit: configuració del compte, historial de xat. * Akregator: llista de canals, configuració individual per a cada canal, com l'interval d'actualització i els paràmetres d'emmagatzematge personalitzats, la configuració de l'Akregator. * Firefox: historial, adreces d'interès, canals RSS (també coneguts com a adreces d'interès en directe). * Liferea: llista de fonts.

source: LeechCraft Text and Images Handler Module
ca: Mòdul del gestor de text i imatges LeechCraft

source: This package provides a Leechcraft quark handling text and images dropped on it. The dropped data is then sent to a data filter chosen by the user. See more at http://leechcraft.org/concepts-data-filters .
ca: Aquest paquet proporciona un quark de Leechcraft que gestiona el text i les imatges que s'hi deixen anar. Les dades deixades anar s'envien a un filtre de dades escollit per l'usuari. Vegeu més a http://leechcraft.org/concepts-data-filters .

source: LeechCraft ToDo manager Module
ca: Mòdul del gestor de tasques pendents del LeechCraft

source: This package provides a GTD-inspired ToDo manager plugin for LeechCraft.
ca: Aquest paquet proporciona un connector del gestor de tasques ToDo inspirat en GTD per a LeechCraft.

source: LeechCraft Pinned tabs Module
ca: Mòdul de pestanyes fixades del LeechCraft

source: This package provides a pinning tab module for LeechCraft with which it is possible to pin important tabs so that they occupy less space.
ca: Aquest paquet proporciona un mòdul de pestanyes de fixació per a LeechCraft amb el qual és possible fixar pestanyes importants perquè ocupin menys espai.

source: LeechCraft Poshuku Google Search plugin
ca: Connector de cerca de Google LeechCraft Poshuku

source: This package provides a LeechCraft plugin to do a Google search with some selected text.
ca: Aquest paquet proporciona un connector LeechCraft per fer una cerca a Google amb algun text seleccionat.

source: LeechCraft Web Browser Module
ca: Mòdul del navegador web LeechCraft

source: This package provides a WebKit-based web browser plugin for LeechCraft. Poshuku is extensible with plugins. Currently it features: * integration with other plugins; * autodiscovery; * tagging bookmarks; * support for SQLite or PostgreSQL storage.
ca: Aquest paquet proporciona un connector de navegador web basat en WebKit per a LeechCraft. Poshuku és extensible amb connectors. Actualment compta amb: * integració amb altres connectors; * descobriment automàtic; * marques d'adreces d'interès; * suport per a l'emmagatzematge SQLite o PostgreSQL.

source: LeechCraft Poshuku Autosearch Module
ca: Mòdul de cerca automàtica de LeechCraft Poshuku

source: This package provides an autosearch plugin for LeechCraft Poshuku.
ca: Aquest paquet proporciona un connector de cerca automàtica per a LeechCraft Poshuku.

source: LeechCraft Poshuku Ad Filter Module
ca: Mòdul de filtre d'anuncis de LeechCraft

source: This package provides an advertisement filter for LeechCraft Poshuku. Features: * Support for Firefox AdBlock+ block lists. * Support for detection and subscription to such lists. * Automatic updates of block lists. * User filters: blocking arbitrary images. * Support for replacing Adobe Flash objects with a "Load flash" button. * Whitelists for the Flash blocker.
ca: Aquest paquet proporciona un filtre d'anuncis per a LeechCraft Poshuku. Característiques: * Suport per a les llistes de blocs del Firefox AdBlock+. * Suport per a la detecció i subscripció a aquestes llistes. * Actualitzacions automàtiques de les llistes de blocs. * Filtres d'usuari: bloqueig d'imatges arbitràries. * Suport per a reemplaçar objectes Adobe Flash amb un botó "Llamp de la càmera". * Llistes blanques per al bloquejador Flash.

source: LeechCraft Poshuku DC/AC Module
ca: Mòdul LeechCraft Poshuku DC/AC

source: This package provides the DC/AC plugin for LeechCraft Poshuku which inverts colors on web pages.
ca: Aquest paquet proporciona el connector DC/AC per a LeechCraft Poshuku que inverteix colors a les pàgines web.

source: LeechCraft Poshuku Greasemonkey Module
ca: Mòdul LeechCraft Poshuku Greasemonkey

source: This package provides a Greasemonkey script plugin for LeechCraft Poshuku. These scripts could be used for adding new features to web pages (for example, embedding price comparisons within shopping sites), fixing rendering bugs, combining data from multiple webpages, and numerous other purposes. This plugin supports almost all of the GreaseMonkey API and is compatible with most userscripts present "in the wild". FatApe usage is documented on the corresponding user guide page.
ca: Aquest paquet proporciona un connector de script Greasemonkey per a LeechCraft Poshuku. Aquests scripts es podrien utilitzar per afegir noves característiques a les pàgines web (per exemple, incrustar comparacions de preus dins dels llocs de compra), esmenar errors de renderització, combinar dades de múltiples pàgines web i molts altres propòsits. Aquest connector suporta gairebé tota l'API de GreaseMonkey i és compatible amb la majoria dels scripts d'usuari presents "en llibertat". L'ús de FatApe està documentat a la pàgina de guia d'usuari corresponent.

source: LeechCraft Poshuku file: scheme module
ca: Fitxer LeechCraft Poshuku: mòdul d'esquema

source: This package provides file: scheme support for LeechCraft Poshuku, allowing to navigate local resources. FileScheme also supports "downloading" files from there.
ca: Aquest paquet proporciona fitxer: suport d'esquema per al LeechCraft Poshuku, permetent navegar pels recursos locals. FileScheme també admet fitxers de "descàrrega" des d'allà.

source: LeechCraft Poshuku Flash-on-Click module
ca: Mòdul LeechCraft Poshuku Flash-on-Click

source: This package provides Flash-on-Click support for LeechCraft Poshuku browser.
ca: Aquest paquet proporciona suport Flash-on-Click per al navegador LeechCraft Poshuku.

source: LeechCraft Poshuku module to change the user agent
ca: Mòdul LeechCraft Poshuku per a canviar l'agent d'usuari

source: This package provides a fake user agent plugin for LeechCraft Poshuku for setting different User-Agent strings for different URLs. Features: * URLs are defined either by their substring or by regular expression. * Several popular predefined user agents are present. * Support for custom user-defined strings. * Support for automatic insertion of current platform, language, WebKit's version etc. into the User-Agent string in arbitrary places.
ca: Aquest paquet proporciona un connector d'agent d'usuari fals per a LeechCraft Poshuku per establir diferents cadenes d'agent d'usuari per a diferents URL. Característiques: * Els URL es defineixen per la seva subcadena o per expressió regular. * Hi ha diversos agents d'usuari predefinits populars. * Suport per a cadenes personalitzades definides per l'usuari. * Suport per a la inserció automàtica de la plataforma actual, l'idioma, la versió de WebKit, etc. a la cadena d'agent d'usuari en llocs arbitraris.

source: LeechCraft Poshuku URL Keyword Support Module
ca: Mòdul de suport per a paraules clau de l'URL del LeechCraft Poshuku

source: This package provides an LeechCraft Poshuku module for URL keywords.
ca: Aquest paquet proporciona un mòdul LeechCraft Poshuku per a paraules clau URL.

source: LeechCraft Poshuku Online Bookmarks Module
ca: Mòdul de punts en línia LeechCraft Poshuku

source: This package provides an online bookmarks plugin for LeechCraft Poshuku for synchronization of bookmarks with services like Read It Later or Del.icio.us.
ca: Aquest paquet proporciona un connector d'adreces d'interès en línia per a LeechCraft Poshuku per a la sincronització d'adreces d'interès amb serveis com Read It Later o Del.icio.us.

source: LeechCraft Poshuku Onlinebookmarks Delicious Module
ca: Mòdul Deliciós de LeechCraft Poshuku Onlinebookmarks

source: This package contains a plugin for LeechCraft Poshuku Online Bookmarks to support the Del.icio.us service.
ca: Aquest paquet conté un connector per a les adreces d'interès en línia LeechCraft Poshuku per donar suport al servei Del.icio.us.

source: LeechCraft Poshuku Onlinebookmarks ReadItLater Module
ca: Mòdul ReadItLater del LeechCraft Poshuku Onlinebookmarks

source: This package contains a plugin for LeechCraft Poshuku Online Bookmarks to support the Read it Later service.
ca: Aquest paquet conté un connector per a les adreces d'interès en línia LeechCraft Poshuku per donar suport al servei Read it Later.

source: LeechCraft Poshuku QR coDe Module
ca: Mòdul coDe QR de LeechCraft Poshuku

source: This package provides a QR coDe support plugin for LeechCraft Poshuku which can represent the URL of a web page as a QR code.
ca: Aquest paquet proporciona un connector de suport de codi QR per a LeechCraft Poshuku que pot representar l'URL d'una pàgina web com un codi QR.

source: LeechCraft Poshuku Speed Dial Module
ca: Mòdul de marcatge ràpid de LeechCraft Poshuku

source: This package provides the Speed Dial support plugin for LeechCraft Poshuku.
ca: Aquest paquet proporciona el connector de suport Speed Dial per a LeechCraft Poshuku.

source: LeechCraft Poshuku WebKit-based backend Module
ca: Mòdul de dorsal basat en WebKit de LeechCraft

source: This package provides WebKit-based backend for LeechCraft Poshuku browser.
ca: Aquest paquet proporciona el dorsal basat en WebKit per al navegador LeechCraft Poshuku.

source: LeechCraft Spell Checker Module
ca: Mòdul del corrector ortogràfic LeechCraft

source: This package provides a spell checker plugin for LeechCraft. It is based on Hunspell or Myspell dictionaries.
ca: Aquest paquet proporciona un connector corrector ortogràfic per al LeechCraft. Es basa en diccionaris Hunspell o Myspell.

source: LeechCraft SideBar2 Module
ca: Mòdul LeechCraft SideBar2

source: This package provides another side bar plugin for Leechcraft. It is a sidebar with quick launch, tabs and tray areas.
ca: Aquest paquet proporciona un altre connector de barra lateral per a Leechcraft. És una barra lateral amb llançament ràpid, pestanyes i zones de safata.

source: LeechCraft Submissions Protocol Scrobble Module
ca: Mòdul d'Scrobble del protocol LeechCraft

source: This package contains a Scroblibre plugin for LeechCraft. It is an implementation of the submissions protocol 1.2 with support ( http://www.audioscrobbler.net/development/protocol ) for sites other than last.fm (libre.fm for now). It can potentially handle arbitrary scrobbling URLs implementing the submissions protocol, but it is not exposed in the GUI (yet). Scroblibre is a supplement for the LastFMScrobble module, and the latter is still the recommended one because of all the social features it offers which Scroblibre lacks.
ca: Aquest paquet conté un connector Scroblibre per al LeechCraft. Es tracta d'una implementació del protocol d'enviaments 1.2 amb suport ( http://www.audioscrobbler.net/development/protocol ) per a llocs diferents de last.fm (libre.fm per ara). Pot ser que pugui gestionar URLs arbitràries que implementen el protocol d'enviaments, però no s'exposa a la IGU (encara). Scroblibre és un suplement per al mòdul LastFMScrobble, i aquest últim segueix sent el recomanat a causa de totes les característiques socials que ofereix que falta Scroblibre.

source: LeechCraft Security manager Module
ca: Mòdul del gestor de seguretat LeechCraft

source: This package provides a security manager plugin for LeechCraft. It is the base module for secure storage. Particular storage backends are implemented by subplugins.
ca: Aquest paquet proporciona un connector del gestor de seguretat per a LeechCraft. És el mòdul base per a l'emmagatzematge segur. Els dorsals d'emmagatzematge especials són implementats per subplugins.

source: LeechCraft Simple storage Module
ca: Mòdul d'emmagatzematge senzill de LeechCraft

source: This package provides a simple unencrypted storage backend for LeechCraft SecMan.
ca: Aquest paquet proporciona un dorsal d'emmagatzematge sense xifrar senzill per a LeechCraft SecMan.

source: LeechCraft OpenSearch Module
ca: Mòdul OpenSearch de LeechCraft

source: This package contains an OpenSearch plugin for LeechCraft which provides a search client for OpenSearch-enabled web sites and engines. Features: * Support for autodiscovery of OpenSearch-capable web sites. * Tagging of search engines. * Support for queries to several search engines at once. * Support search results in RSS/Atom format and subscribe to them with a suitable plugin like Aggregator. * Show results in HTML format with a suitable plugin like Poshuku.
ca: Aquest paquet conté un connector OpenSearch per a LeechCraft que proporciona un client de cerca per als llocs web i motors habilitats per a OpenSearch. Característiques: * Suport per al descobriment automàtic de llocs web amb capacitat d'OpenSearch. * Etiquetatge de motors de cerca. * Suport per a consultes a diversos motors de cerca alhora. * Admet resultats de cerca en format RSS/Atom i subscriu-te a ells amb un connector adequat com Aggregator. * Mostra els resultats en format HTML amb un connector adequat com Poshuku.

source: LeechCraft Summary info Module
ca: Mòdul d'informació del resum de LeechCraft

source: This package provides a summary plugin for LeechCraft which shows a quick overview of LeechCraft's state. It shows current tasks like leeching or seeding torrents and downloading files with context-dependent actions and views. It also can collect status information from other plugins like unread channels. Summary also allows to perform searches via the installed plugins like SeekThru or HistoryHolder. Features: * List of current tasks and events with context-dependent actions and views for selected items. * Support for gathering status information from other plugins. * Category-based search query support via other plugins.
ca: Aquest paquet proporciona un connector de resum per a LeechCraft que mostra una visió general ràpida de l'estat de LeechCraft. Mostra tasques actuals com leeching o sembrar torrents i descarregar fitxers amb accions i vistes dependents del context. També pot recollir informació d'estat d'altres connectors com canals sense llegir. El resum també permet realitzar cerques a través dels connectors instal·lats com SeekThru o HistoryHolder. Característiques: * Llista de tasques i esdeveniments actuals amb accions i visualitzacions dependents del context per als elements seleccionats. * Suport per a recollir informació d'estat d'altres connectors. * Implementació de la consulta de cerca basada en categories a través d'altres connectors.

source: LeechCraft System notification Module
ca: Mòdul de notificació del sistema LeechCraft

source: This package contains a system notification plugin for LeechCraft. Notifications are provided implementations supporting FreeDesktop's notification standard, like KDE 4.4 (or higher), Gnome, XFCE and others.
ca: Aquest paquet conté un connector de notificació del sistema per al LeechCraft. Les notificacions es proporcionen implementacions que suporten l'estàndard de notificacions FreeDesktop, com ara KDE 4.4 (o superior), Gnome, XFCE i altres.

source: LeechCraft Tab Session Manager Module
ca: Mòdul del gestor de sessions de pestanyes LeechCraft

source: This package provides a Tab Session Manager plugin for Leechcraft which allows to automatically restore the last session and allows to create named sessions.
ca: Aquest paquet proporciona un connector del gestor de sessions de pestanyes per a Leechcraft que permet restaurar automàticament l'última sessió i permet crear sessions amb nom.

source: LeechCraft TabsList Module
ca: Mòdul de llista de pestanyes de LeechCraft

source: This package provides a tabs list plugin for Leechcraft which can show the list of currently opened tabs and allows to navigate between them.
ca: Aquest paquet proporciona un connector de llista de pestanyes per a Leechcraft que pot mostrar la llista de pestanyes obertes actualment i permet navegar entre elles.

source: LeechCraft Script-Based Lyrics Module
ca: Mòdul Lírica basada en scripts LeechCraft

source: This package provides a lyrics finder plugin for LeechCraft. Textogroose is a kind of supplement to DeadLyrics for sites too complex to be described by DeadLyrics rules.
ca: Aquest paquet proporciona un connector de cerca de lletres per a LeechCraft. Textogroose és un tipus de complement de DeadLyrics per a llocs massa complexos per ser descrits per les regles de DeadLyrics.

source: LeechCraft VK.com Streaming Module
ca: Mòdul Streaming VK.com de LeechCraft

source: This package provides a VK.com music streaming plugin for Leechcraft.
ca: Aquest paquet proporciona un connector de transmissió de música VK.com per a Leechcraft.

source: LeechCraft Task Progress Indicator Module
ca: Mòdul d'indicador de progrés de tasques del LeechCraft

source: This package provides a Task Progress Indicator quark plugin for Leechcraft.
ca: Aquest paquet proporciona un connector de quark d'indicador de progrés de tasques per a Leechcraft.

source: LeechCraft Removable storage devices Manager
ca: Gestor de dispositius d'emmagatzematge extraïbles LeechCraft

source: This package provides a Vrooby plugin for LeechCraft which allows to watch removable storage devices via D-Bus and udisks.
ca: Aquest paquet proporciona un connector Vrooby per a LeechCraft que permet veure dispositius d'emmagatzematge extraïbles a través de D-Bus i udisks.

source: LeechCraft Proxy manager Module
ca: Mòdul del gestor del servidor intermediari LeechCraft

source: This package provides an advanced proxy manager for LeechCraft with which you can configure and use proxy servers.
ca: Aquest paquet proporciona un gestor intermediari avançat per a LeechCraft amb el qual podeu configurar i utilitzar servidors intermediaris.

source: LeechCraft Current user tune Module
ca: Mòdul de melodia d'usuari actual del LeechCraft

source: This package provides a tune wrapper plugin for LeechCraft with which you can get the current user tune via mpris protocol.
ca: Aquest paquet proporciona un connector d'ajustament de melodia per a LeechCraft amb el qual podeu obtenir la melodia actual de l'usuari a través del protocol mpris.

source: LeechCraft File Uploader Module
ca: Mòdul de càrrega de fitxers LeechCraft

source: This package provides a file uploader plugin for LeechCraft with which files can be uploaded to accountless filebin services.
ca: Aquest paquet proporciona un connector de càrrega de fitxers per al LeechCraft amb el qual es poden carregar fitxers als serveis de combinació de fitxers sense compte.

source: Database utility library for LeechCraft
ca: Biblioteca d'utilitats de la base de dades per a LeechCraft

source: A library providing some commonly used database-related classes and functions.
ca: Una biblioteca que proporciona algunes classes i funcions relacionades amb la base de dades d'ús comú.

source: GUI utility library for LeechCraft
ca: Biblioteca d'utilitats de la interfície gràfica per a LeechCraft

source: A library providing some commonly used GUI-related widgets, classes and functions.
ca: Una biblioteca que proporciona alguns ginys, classes i funcions relacionats amb la interfície gràfica d'usuari d'ús comú.

source: MVC utility library for LeechCraft
ca: Biblioteca d'utilitats MVC per a LeechCraft

source: A library providing some commonly used models (as in MVC), as well as model-related classes and functions.
ca: Una biblioteca que proporciona alguns models d'ús comú (com en MVC), així com classes i funcions relacionades amb el model.

source: Network utility library for LeechCraft
ca: Biblioteca d'utilitats de xarxa per a LeechCraft

source: A library providing some commonly used network classes and functions.
ca: Una biblioteca que proporciona algunes classes i funcions de xarxa d'ús comú.

source: QML utility library for LeechCraft
ca: Biblioteca d'utilitats QML per a LeechCraft

source: A library providing some commonly used QML items as well as QML-related classes and functions.
ca: Una biblioteca que proporciona alguns elements QML d'ús comú, així com classes i funcions relacionades amb el QML.

source: Shortcut utility library for LeechCraft
ca: Biblioteca d'utilitats de drecera per a LeechCraft

source: A library easing shortcut usage in LeechCraft, particularly the configurable shortcuts subsystem.
ca: Una biblioteca que facilita l'ús de dreceres a LeechCraft, en particular el subsistema de dreceres configurables.

source: Standard LeechCraft Library
ca: Biblioteca estàndard de LeechCraft

source: A library providing some classes and algorithms, not directly related to any other library.
ca: Una biblioteca que proporciona algunes classes i algoritmes, no directament relacionats amb cap altra biblioteca.

source: Authenticators library for LeechCraft
ca: Biblioteca d'autenticadors per a LeechCraft

source: A library providing authenticators for various services like VKontakte.
ca: Una biblioteca que proporciona autenticadors per a diversos serveis com VKontakte.

source: System utility library for LeechCraft
ca: Biblioteca d'utilitats del sistema per a LeechCraft

source: A library providing some commonly used system-related classes and functions, like OS version parser, paths utilities or MIME detector.
ca: Una biblioteca que proporciona algunes classes i funcions relacionades amb el sistema d'ús comú, com l'analitzador de versions del SO, les utilitats de camins o el detector MIME.

source: Tag utility library for LeechCraft
ca: Biblioteca d'utilitats d'etiquetes per a LeechCraft

source: A library providing some classes and functions commonly used with the LeechCraft tags subsystem.
ca: Una biblioteca que proporciona algunes classes i funcions que s'utilitzen habitualment amb el subsistema d'etiquetes LeechCraft.

source: Thread utility library for LeechCraft
ca: Biblioteca d'utilitats de fils per a LeechCraft

source: A library providing some classes and functions commonly used with the LeechCraft threads subsystem.
ca: Una biblioteca que proporciona algunes classes i funcions comunament utilitzades amb el subsistema de fils LeechCraft.

source: X11 utility library for LeechCraft
ca: Biblioteca d'utilitats X11 per a LeechCraft

source: A library providing X11 wrappers for LeechCraft.
ca: Una biblioteca que proporciona embolcalls X11 per a LeechCraft.

source: XDG utility library for LeechCraft
ca: Biblioteca d'utilitats XDG per a LeechCraft

source: A library providing XDG parsers and other support methods and classes for LeechCraft.
ca: Una biblioteca que proporciona analitzadors XDG i altres mètodes i classes de suport per a LeechCraft.

source: Cross-plugin communication utility library for LeechCraft
ca: Biblioteca d'utilitats de comunicació entre connectors per a LeechCraft

source: A library providing some commonly used primitives for communications between different plugins in LeechCraft.
ca: Una biblioteca que proporciona algunes primitives d'ús comú per a les comunicacions entre diferents connectors a LeechCraft.

source: XSD utility library for LeechCraft
ca: Biblioteca d'utilitats XSD per a LeechCraft
