Repository: openSUSE/packages-i18n
Catalog: */po/leechcraft.*.po
Languages: ca

source: Modular Internet Client
ca: Client d'Internet modular

source: LeechCraft is a modular "Internet client" application. LeechCraft allows to browse the web, read RSS/Atom feeds, download files via BitTorrent, HTTP, FTP and DC, automatically stream, download or play podcasts and other media files and much more. Features can be added via plugins that can be integrated with each other, while staying abstract from the exact implementation. This package contains the main LeechCraft executable, which connects all the plugins with each other, routes requests between them, tracks dependencies and performs several other housekeeping tasks.
ca: LeechCraft és una aplicació modular "client d'Internet". LeechCraft permet navegar per la web, llegir fonts RSS/Atom, descarregar fitxers via BitTorrent, HTTP, FTP i DC, transmetre automàticament, descarregar o reproduir podcasts i altres fitxers multimèdia i molt més. Les característiques es poden afegir a través de connectors que es poden integrar entre si, mentre es mantenen abstractes de la implementació exacta. Aquest paquet conté l'executable principal de LeechCraft, que connecta tots els connectors entre si, rutes de sol·licituds entre ells, rastreja dependències i realitza diverses altres tasques de neteja.

source: LeechCraft Notifications framework Module
ca: Mòdul de marc de notificacions LeechCraft

source: This package provides an advanced notifications plugin for Leechcraft which allows to customize notifications better.
ca: Aquest paquet proporciona un connector avançat de notificacions per a Leechcraft que permet personalitzar millor les notificacions.

source: LeechCraft RSS/Atom Aggregator Module
ca: Mòdul Agregador RSS/Atom de LeechCraft

source: This package provides a RSS/Atom feed reader plugin for LeechCraft. It features: * RSS 0.92/0.93/1.0/2.0, Atom 0.3/1.0; * extensions like GeoRSS, MediaRSS, Comment API etc; * OPML support; * broadcatching and fetching arbitrary data with regexps; * tape mode for news display; * individual options for each channel like update interval; * storage either in SQLite or PostgreSQL; * exporting feeds to FB2 for further reading on handheld devices. A web browser plugin is recommended to show the news in a fancy way.
ca: Aquest paquet proporciona un connector de lector de fonts RSS/Atom per a LeechCraft. Inclou: * RSS 0.92/0.93/1.0/2.0, Atom 0.3/1.0; * extensions com GeoRSS, MediaRSS, Comment API etc; * suport OPML; * ampliant i obtenint dades arbitràries amb expressions regulars; * mode cinta per a la visualització de notícies; * opcions individuals per a cada canal com interval d'actualització; * emmagatzematge ja sigui en SQLite o PostgreSQL; * exportant canals a FB2 per a més lectura en dispositius portàtils. Es recomana un connector del navegador web per mostrar les notícies d'una manera elegant.

source: LeechCraft Aggregator Bodyfetch Module
ca: Mòdul Bodyfetch de l'agregador de LeechCraft

source: This package provides a LeechCraft Aggregator plugin to automatically fetch full bodies of news items and replace the original teasers from RSS feeds with them, so that it appears like the full news stories were originally there. Fetching is done according to little scripts called recipes. For this to work, a script provider like Qrosp should be installed. Please refer to the guide to writing recipes if you are interested in writing your own.
ca: Aquest paquet proporciona un connector d'Agregador LeechCraft per obtenir automàticament cossos complets d'articles de notícies i reemplaçar els teasers originals dels canals RSS amb ells, de manera que apareix com les notícies completes eren originalment allà. L'obtenció es fa d'acord amb petits scripts anomenats receptes. Perquè això funcioni, s'hauria d'instal·lar un proveïdor de scripts com Qrosp. Si us plau, consulteu la guia d'escriptura de receptes si esteu interessats en escriure la vostra pròpia.

source: LeechCraft Aggregator Web Interface Module
ca: Mòdul d'interfície web de l'agregador de LeechCraft

source: WebAccess provides a basic web interface for the Aggregator feed reader, so one can read news articles from a mobile device or another machine.
ca: WebAccess proporciona una interfície web bàsica per al lector de fonts d'Agregador, de manera que es poden llegir articles de notícies des d'un dispositiu mòbil o una altra màquina.

source: LeechCraft Crash handler Module
ca: Mòdul del gestor d'errors del LeechCraft

source: This package provides a crash handler plugin for LeechCraft which shows backtraces and aids in sending bug reports.
ca: Aquest paquet proporciona un connector de gestió de fallades per a LeechCraft que mostra traces inverses i ajuda en l'enviament d'informes d'errors.

source: LeechCraft Screenshooter Module
ca: Mòdul de resolució de pantalles LeechCraft

source: This package provides a LeechCraft plugin to make screenshots of LeechCraft and then either save them locally or upload them to an imagebin.
ca: Aquest paquet proporciona un connector LeechCraft per fer captures de pantalla de LeechCraft i després desar-les localment o carregar-les a una combinació d'imatges.

source: LeechCraft Instant messenger Module
ca: Mòdul de missatgeria instantània LeechCraft

source: This package provides a modular, multi-protocol IM client for LeechCraft. Protocol support is provided by corresponding plugins. Unlike other multiprotocol clients which tend to implement only those features that are present in all the protocols, Azoth is modelled after the XMPP protocol, aiming to provide extensive and full support for XMPP while remaining usable for other protocols.
ca: Aquest paquet proporciona un client de MI modular i multiprotocol per a LeechCraft. El suport de protocol és proporcionat pels connectors corresponents. A diferència d'altres clients multiprotocol que tendeixen a implementar només aquelles característiques que estan presents en tots els protocols, Azoth es modela seguint el protocol XMPP, amb l'objectiu de proporcionar un suport ampli i complet per a XMPP mentre es manté utilitzable per a altres protocols.

source: LeechCraft Azoth Abbreviations Module
ca: Mòdul d'abreviatures de LeechCraft

source: This package provides abbreviations via commands like /abbrev, /unabbrev and /listabbrevs for LeechCraft Azoth.
ca: Aquest paquet proporciona abreviatures a través d'ordres com /abbrev, /unabbrev i /listabbrevs per a LeechCraft Azoth.

source: LeechCraft Azoth IRC Module
ca: Mòdul IRC LeechCraft Azoth

source: This package provides an IRC protocol plugin for LeechCraft Azoth. Features: * Secure Sockets Layer (SSL) cryptographic protocol. * Channel bookmarks. * Automatic password entry. * Automatic login.
ca: Aquest paquet proporciona un connector de protocol IRC per a LeechCraft Azoth. Característiques: * Protocol criptogràfic Secure Sockets Layer (SSL). * Adreces d'interès del canal. * Entrada automàtica de contrasenya. * Inici de sessió automàtic.

source: LeechCraft Azoth Adium Styles Module
ca: Mòdul d'estils Adium de LeechCraft

source: This package provides an Adium styles support plugin for LeechCraft Azoth.
ca: Aquest paquet proporciona un connector de suport d'estils Adium per a LeechCraft Azoth.

source: LeechCraft Azoth Module for automatic status change
ca: Mòdul LeechCraft Azoth per al canvi automàtic d'estat

source: This package provides a LeechCraft Azoth plugin which can automatically change your status based on an inactivity period.
ca: Aquest paquet proporciona un connector LeechCraft Azoth que pot canviar automàticament el vostre estat en funció d'un període d'inactivitat.

source: LeechCraft Azoth Autopaste Module
ca: Mòdul d'enganxament automàtic LeechCraft

source: This package provides a plugin for LeechCraft Azoth with which long messages can automatically be pasted to pastebins.
ca: Aquest paquet proporciona un connector per a LeechCraft Azoth amb el qual els missatges llargs es poden enganxar automàticament a pastebins.

source: LeechCraft Azoth Birthday Notifier Module
ca: Mòdul de Notificador d'aniversari Azoth de LeechCraft

source: This package provides a plugin for LeechCraft Azoth with which you will be notified of your contacts' birthdays if they are present in vCards.
ca: Aquest paquet proporciona un connector per a LeechCraft Azoth amb el qual se us notificarà l'aniversari dels vostres contactes si estan presents a vCards.

source: LeechCraft Azoth Chat history Module
ca: Mòdul d'història del xat Azoth de LeechCraft

source: This package provides a chat history plugin for LeechCraft Azoth. It supports storing history from normal one-to-one chats as well as from multiuser conferences and private chats in conferences. It also allows to search the logs with SQL's LIKE expressions. SQLite is used for storage.
ca: Aquest paquet proporciona un connector d'historial de xat per a LeechCraft Azoth. Suporta l'emmagatzematge de l'historial des de xats normals d'un a un, així com des de conferències multiusuari i xats privats en conferències. També permet cercar els registres amb expressions LIKE de SQL. SQLite s'utilitza per a l'emmagatzematge.

source: LeechCraft Azoth Ignore Module
ca: Mòdul d'ignoració de l'Azoth del LeechCraft

source: This package provides a plugin for LeechCraft Azoth to ignore unwanted participants.
ca: Aquest paquet proporciona un connector per a LeechCraft Azoth per ignorar els participants no desitjats.

source: LeechCraft Azoth Documentation
ca: Documentació de LeechCraft Azoth

source: This packages provides documentation of LeechCraft Azoth API. It contains description of Azoth API used for developing LeechCraft Azoth sub-plugins. For developing first-lexel plugins, please refer to corresponding packages (like leechcraft-doc). This documentation is also available online at http://doc.leechcraft.org/azoth/
ca: Aquest paquet proporciona documentació de l'API LeechCraft Azoth. Conté la descripció de l'API d'Azoth utilitzada per al desenvolupament de subplugins de LeechCraft Azoth. Per al desenvolupament de connectors de primer lèxel, consulteu els paquets corresponents (com leechcraft-doc). Aquesta documentació també està disponible en línia a http://doc.leechcraft.org/azoth/

source: LeechCraft Azoth Media Objects Module
ca: Mòdul d'objectes multimèdia Azoth de LeechCraft

source: This package provides an plugin for LeechCraft Azoth which allows embedding different media objects in chat tabs.
ca: Aquest paquet proporciona un connector per a LeechCraft Azoth que permet incrustar diferents objectes multimèdia en pestanyes de xat.

source: LeechCraft Azoth Antispam Module
ca: Mòdul antispam LeechCraft

source: This package provides a basic antispam plugin for LeechCraft Azoth.
ca: Aquest paquet proporciona un connector antispam bàsic per a LeechCraft Azoth.

source: LeechCraft Azoth Conference highlights Module
ca: Mòdul destacat de la conferència LeechCraft Azoth

source: This package provides a plugin for LeechCraft Azoth to customize conference highlights.
ca: Aquest paquet proporciona un connector per a LeechCraft Azoth per personalitzar els aspectes destacats de les conferències.

source: LeechCraft Azoth Module to remove CAPS
ca: Mòdul LeechCraft Azoth per eliminar els CAP

source: This package provides a plugin for LeechCraft Azoth which can remove excessive CAPS usage from incoming messages.
ca: Aquest paquet proporciona un connector per a LeechCraft Azoth que pot eliminar l'ús excessiu de CAPS dels missatges entrants.

source: LeechCraft Azoth Juick.com service Module
ca: Mòdul de servei LeechCraft Azoth Juick.com

source: This package contains a plugin for LeechCraft Azoth which provides an enhanced experience with the juick.com microblogging service.
ca: Aquest paquet conté un connector per a LeechCraft Azoth que proporciona una experiència millorada amb el servei de microblogging juick.com.

source: LeechCraft Azoth Text transform Module
ca: Mòdul de transformació de text Azoth de LeechCraft

source: This package provides a text transform plugin for LeechCraft Azoth.
ca: Aquest paquet proporciona un connector de transformació de text per a LeechCraft Azoth.

source: LeechCraft Azoth module for "Last Seen" functionality
ca: Mòdul LeechCraft Azoth per a la funcionalitat "Last Seen"

source: This package provides a plugin for LeechCraft Azoth which records contacts' last online and availability time on the client side. It does not depend on a concrete protocol implementation.
ca: Aquest paquet proporciona un connector per a LeechCraft Azoth que registra l'últim temps en línia dels contactes i la disponibilitat al costat del client. No depèn d'una aplicació concreta del protocol.

source: LeechCraft Azoth Metacontacts Module
ca: Mòdul de Metacontactes de LeechCraft Azoth

source: This package provides a metacontacts support plugin for LeechCraft Azoth.
ca: Aquest paquet proporciona un connector de suport de metacontactes per a LeechCraft Azoth.

source: LeechCraft Azoth LaTeX support Module
ca: Mòdul de suport de LeechCraft Azoth LaTeX

source: This package provides a plugin for LeechCraft Azoth which can render and display LaTeX formulae directly in chat windows. It does not depend on the underlying protocol, and if the protocol supports rich text formatting in outgoing messages, it is able to replace the formulas with corresponding images in outgoing messages as well, so your buddies would see nice rendered formulas instead of raw LaTeX code, even if their client does not have a LaTeX formatter.
ca: Aquest paquet proporciona un connector per a LeechCraft Azoth que pot renderitzar i mostrar fórmules LaTeX directament en finestres de xat. No depèn del protocol subjacent, i si el protocol suporta format de text ric en missatges sortints, és capaç de reemplaçar les fórmules amb imatges corresponents en missatges sortints, de manera que els vostres amics veurien bones fórmules renderitzades en lloc del codi LaTeX cru, fins i tot si el seu client no té un formatador LaTeX.

source: LeechCraft Azoth module for conference-oriented commands
ca: Mòdul LeechCraft Azoth per a ordres orientades a conferències

source: This package provides some common conference-oriented commands like /vcard, /time, /last, /subject, /kick, /ban and so on for LeechCraft Azoth.
ca: Aquest paquet proporciona algunes ordres comunes orientades a conferències com /vcard, /time, /last, /subject, /kick, /ban i així successivament per LeechCraft Azoth.

source: LeechCraft Azoth - VKontakte Module
ca: LeechCraft Azoth - Mòdul VKontakte

source: This package provides a special protocol subplugin for extensive VKontakte messaging support for LeechCraft Azoth.
ca: Aquest paquet proporciona un subconnector de protocol especial per a una àmplia implementació de missatgeria VKontakte per a LeechCraft Azoth.

source: LeechCraft Azoth Emoticon pack support
ca: Implementació del paquet Emoticona LeechCraft Azoth

source: This package provides an emoticons plugin for LeechCraft Azoth which permits to use emoticon packs which are stored in Psi+, Kopete format or Azoth format.
ca: Aquest paquet proporciona un connector d'emoticones per a LeechCraft Azoth que permet utilitzar paquets d'emoticones que s'emmagatzemen en format Psi+, Kopete o Azoth.

source: LeechCraft Azoth Off-the-Record Module
ca: Mòdul LeechCraft Azoth Off-the-Record

source: This package provides support for Off-the-Record messaging for LeechCraft Azoth.
ca: Aquest paquet proporciona suport per a missatges fora de registre per a LeechCraft Azoth.

source: LeechCraft Azoth Spell Checker Module
ca: Mòdul del corrector ortogràfic LeechCraft Azoth

source: This package provides a spell checker plugin for LeechCraft Azoth. It is based on Hunspell or Myspell dictionaries.
ca: Aquest paquet proporciona un connector corrector ortogràfic per a LeechCraft Azoth. Es basa en diccionaris Hunspell o Myspell.

source: LeechCraft Azoth Shell command runner Module
ca: Mòdul d'execució d'ordres del LeechCraft Azoth Shell

source: This package provides a shell command runner plugin for LeechCraft Azoth.
ca: Aquest paquet proporciona un connector d'execució d'ordres per a LeechCraft Azoth.

source: LeechCraft Azoth Standard chat styles Module
ca: Mòdul d'estils de xat estàndard de LeechCraft Azoth

source: This package provides a standard styles support plugin for LeechCraft Azoth. Standard styles are the ones in LeechCraft's own format.
ca: Aquest paquet proporciona un connector de suport d'estils estàndard per a LeechCraft Azoth. Els estils estàndard són els del propi format de LeechCraft.

source: LeechCraft Azoth MrIM Module
ca: Mòdul LeechCraft Azoth MrIM

source: This package provides a MRIM protocol plugin for LeechCraft Azoth. The MRIM protocol is used in the Mail.Ru Agent IM service. Vader is based on an own implementation of the MRIM protocol, partially based on available (and outdated) official specs, and is partly reverse-engineered. The following protocol features are supported: * Extended statuses. * Attention requests (alarms). * Publishing current tune and fetching others' tune. * Message delivery receipts. * Mailbox notifications. * Opening mailbox without login. * Authorization management. * Grouping contacts.
ca: Aquest paquet proporciona un connector de protocol MRIM per a LeechCraft Azoth. El protocol MRIM s'utilitza al Mail.Servei de l'agent de Ru. Vader es basa en una implementació pròpia del protocol MRIM, parcialment basat en especificacions oficials disponibles (i antiquades), i en part és d'enginyeria inversa. S'admeten les següents característiques de protocol: * Estat ampliat. * Sol·licituds d'atenció (armes). * S'està publicant la melodia actual i s'està recuperant la d'altres. * Rebuts de lliurament de missatges. * Notificacions de bústia. * Obertura de la bústia sense inici de sessió. * Gestió d'autorització. * Agrupació de contactes.

source: LeechCraft Azoth libpurple Module
ca: Mòdul Libpurple Azoth de LeechCraft

source: This package provides a plugin for LeechCraft Azoth which makes the various protocols supported by libpurple available in Azoth.
ca: Aquest paquet proporciona un connector per a LeechCraft Azoth que fa que els diversos protocols suportats per libpurple estiguin disponibles a Azoth.

source: LeechCraft Azoth XMPP Module
ca: Mòdul XMPP de LeechCraft

source: This package provides an XMPP protocol plugin for LeechCraft Azoth. Feature highlights: * Media calls support (Jingle). * Support for PEP and current user activity, mood, tune and location. * Bookmarks with autojoin support. * Full support for MUCs. * Notifications about chat state participation. * Service discovery support. * Gateway support, with registration. * Support for various file transfer methods. * In-band registration of accounts (right from the client). * Privacy lists. * Encrypted and signed messages and presences. * Full CAPTCHA support. * Support for ad-hoc commands. * Support for exchanging roster items. * Search for contacts in Jabber.
ca: Aquest paquet proporciona un connector de protocol XMPP per a LeechCraft Azoth. Característiques destacades: * Suport de trucades multimèdia (Jingle). * Suport per a PEP i l'activitat actual de l'usuari, l'estat d'ànim, la melodia i la ubicació. * Adreces d'interès amb suport d'unió automàtica. * Suport complet per a MUCs. * Notificacions sobre la participació de l'estat del xat. * Suport per al descobriment de serveis. * Suport de passarel·la, amb inscripció. * Suport per a diversos mètodes de transferència de fitxers. * Registre en banda de comptes (dret del client). * Llistes de privacitat. * Missatges i presències xifrats i signats. * Suport complet de CAPTCHA. * Suport per a ordres ad-hoc. * Suport per a l'intercanvi d'elements de la llista. * Cerca de contactes a Jabber.

source: LeechCraft Azoth Module for publishing current user tune
ca: Mòdul LeechCraft Azoth per publicar la melodia actual de l'usuari

source: This package provides an Azoth plugin which allows to publish the current user tune.
ca: Aquest paquet proporciona un connector Azoth que permet publicar la melodia actual de l'usuari.

source: LeechCraft BitTorrent client Module
ca: Mòdul client de BitTorrent de LeechCraft

source: This package provides a BitTorrent client for Leechcraft. Features: * Support for DHT and magnet links * Sequential download mode where torrent is download sequentially. * Torrents queue, limiting number of seeding/leeching torrents. * Ability to rename files and directories in the torrent. * Selective download: possibility to select specific files from torrent. * Continue downloads left by any other client. * Support for sparse files. * Tags for torrents. * Global and per-torrent speed limits. * Connection number limits. * Fast resume support to avoid long startup times. * IP filter to block/unblock unwanted peers. * Support for extension protocol
ca: Aquest paquet proporciona un client BitTorrent per a Leechcraft. Característiques: * Suport per a enllaços DHT i magnet * Mode de descàrrega seqüencial on el torrent es descarrega seqüencialment. * Cua de torrents, limitant el nombre de torrents sembrats/llevats. * Capacitat per a canviar el nom dels fitxers i directoris en el torrent. * Baixada selectiva: possibilitat de seleccionar fitxers específics del torrent. * Continuar les baixades deixades per qualsevol altre client. * Suport per a fitxers dispersos. * Etiquetes per a torrents. * Límits de velocitat globals i pertorrents. * Límits numèrics de connexió. * Ràpid suport per a reprendre per evitar temps d'inici llargs. * Filtre IP per bloquejar/desbloquejar els parells no desitjats. * Suport per al protocol d'extensió

source: LeechCraft Image storage Module
ca: Mòdul d'emmagatzematge d'imatges LeechCraft

source: This package provides a modular image storage plugin for LeechCraft which supports different cloud image stores like Picasa or Flickr.
ca: Aquest paquet proporciona un connector d'emmagatzematge d'imatges modular per a LeechCraft que admet diferents botigues d'imatges al núvol com Picasa o Flickr.

source: LeechCraft Blasq LiveJournal/FotoBilder client Module
ca: Mòdul client LeechCraft Blasq LiveJournal/FotoBilder

source: This package provides a LiveJournal FotoBilder image storage client subplugin for LeechCraft Blasq.
ca: Aquest paquet proporciona un subconnector d'emmagatzematge d'imatges LiveJournal FotoBilder per a LeechCraft Blasq.

source: LeechCraft Blasq VKontakte client Module
ca: Mòdul client VKontakte de LeechCraft

source: This package provides a VKontakte image storage client subplugin for LeechCraft Blasq.
ca: Aquest paquet proporciona un subconnector de client d'emmagatzematge d'imatges VKontakte per a LeechCraft Blasq.

source: LeechCraft Blasq Picasa client Module
ca: Mòdul client de LeechCraft Blasq Picasa

source: This package provides a Picasa image storage client subplugin for LeechCraft Blasq.
ca: Aquest paquet proporciona un subconnector d'emmagatzematge d'imatges Picasa per a LeechCraft Blasq.

source: LeechCraft Blogging client Module
ca: Mòdul client de blogs LeechCraft

source: This package provides a modular blogging client plugin for LeechCraft which itself supports different blogging platforms via different submodules.
ca: Aquest paquet proporciona un connector modular per a clients de blogs per a LeechCraft que en si mateix admet diferents plataformes de blogs a través de diferents submòduls.

source: LeechCraft Blogique "Local blogging" Module
ca: Mòdul «Bloging local» de LeechCraft Blogique

source: This package provides a local blogging subplugin for LeechCraft Blogique.
ca: Aquest paquet proporciona un subllinatge de blogs local per a LeechCraft Blogique.

source: LeechCraft Blogique LiveJournal Module
ca: Mòdul LiveJournal de LeechCraft

source: This package provides a LiveJournal subplugin for LeechCraft Blogique.
ca: Aquest paquet proporciona un subllinatge LiveJournal per a LeechCraft Blogique.
