Repository: openSUSE/packages-i18n
Catalog: */po/leechcraft.*.po
Languages: ca

source: LeechCraft SSL certificate Module
ca: Mòdul de certificat SSL LeechCraft

source: This package provides an SSL certificate manager plugin.
ca: Aquest paquet proporciona un connector per al gestor de certificats SSL.

source: LeechCraft CPU Usage Monitoring Module
ca: Mòdul de monitorització de l'ús de la CPU LeechCraft

source: This package provides a quark for monitoring the CPU usage for LeechCraft SB2. It currently uses /proc/stat.
ca: Aquest paquet proporciona un quark per monitoritzar l'ús de la CPU per a LeechCraft SB2. Actualment utilitza /proc/stat.

source: LeechCraft HTTP Module
ca: Mòdul HTTP del LeechCraft

source: This package provides a HTTP implementation plugin for LeechCraft which will mainly used by many other plugins like Aggregator or SeekThru. Features: * Support for redirects. * Automatic downloads from other plugins. * Support for continuing interrupted downloads.
ca: Aquest paquet proporciona un connector d'implementació HTTP per a LeechCraft que serà utilitzat principalment per molts altres connectors com Aggregator o SeekThru. Característiques: * Suport per a redireccions. * Baixades automàtiques des d'altres connectors. * Suport per a continuar amb les baixades interrompudes.

source: LeechCraft D-Bus Module
ca: Mòdul D-Bus de LeechCraft

source: This package provides a D-Bus implementation plugin for LeechCraft.
ca: Aquest paquet proporciona un connector d'implementació de D-Bus per a LeechCraft.

source: LeechCraft Lyrics finder Module
ca: Mòdul de cerca de lletres LeechCraft

source: This package provides a lyrics finder plugin for LeechCraft. It is a simple client for searching song lyrics on various sites. The search interface is available via LeechCraft Summary.
ca: Aquest paquet proporciona un connector de cerca de lletres per a LeechCraft. És un client senzill per buscar lletres de cançons en diversos llocs. La interfície de cerca està disponible a través del resum de LeechCraft.

source: LeechCraft Development Files
ca: Fitxers de desenvolupament de LeechCraft

source: This package provides files required for development of new LeechCraft modules.
ca: Aquest paquet proporciona fitxers necessaris per al desenvolupament de nous mòduls LeechCraft.

source: LeechCraft Device Monitor Module
ca: Mòdul del monitor del dispositiu LeechCraft

source: This package provides a devices monitor plugin for LeechCraft.
ca: Aquest paquet proporciona un connector de monitor de dispositius per a LeechCraft.

source: Modular Internet Client Documentation
ca: Documentació modular del client d'Internet

source: This packages provides documentation of LeechCraft core API. It contains description of core API used for developing first-level LeechCraft plugins. For developing sub-plugins, please refer to corresponding packages (like leechcraft-azoth-doc). This documentation is also available online at http://doc.leechcraft.org/core/
ca: Aquest paquet proporciona documentació de l'API del nucli de LeechCraft. Conté la descripció de l'API del nucli utilitzada per desenvolupar connectors LeechCraft de primer nivell. Per al desenvolupament de subplugins, consulteu els paquets corresponents (com leechcraft-azoth-doc). Aquesta documentació també està disponible en línia a http://doc.leechcraft.org/core/

source: LeechCraft Issue reporting Module
ca: Mòdul d'informe d'incidències de LeechCraft

source: This package provides a Dolozhee plugin for LeechCraft which allows submitting bug reports and feature requests to the LeechCraft issue tracker.
ca: Aquest paquet proporciona un connector Dolozhee per a LeechCraft que permet enviar informes d'errors i sol·licituds de funcionalitats al rastrejador d'errors de LeechCraft.

source: LeechCraft DumBeep Module
ca: Mòdul DumBeep LeechCraft

source: This package provides a dumb sound notifier plugin for LeechCraft. It uses Phonon as a backend, or something like aplay/mplayer.
ca: Aquest paquet proporciona un connector de notificador de so estúpid per a LeechCraft. Utilitza Phonon com a dorsal, o alguna cosa així com aplay/mplayer.

source: LeechCraft terminal plugin
ca: Connector del terminal LeechCraft

source: This package provides a terminal plugin for Leechcraft.
ca: Aquest paquet proporciona un connector de terminal per a Leechcraft.

source: LeechCraft Window Manager Module
ca: Mòdul del gestor de finestres LeechCraft

source: This package provides a WM control plugin for Leechcraft.
ca: Aquest paquet proporciona un connector de control WM per a Leechcraft.

source: Awesome Window Manager integration for LeechCraft
ca: Integració impressionant del gestor de finestres per a LeechCraft

source: This package allows to start Leechcraft as a Desktop Environment with the Awesome Window Manager.
ca: Aquest paquet permet iniciar Leechcraft com a entorn d'escriptori amb el gestor de finestres Awesome.

source: Kwin integration for LeechCraft
ca: Integració del Kwin per a LeechCraft

source: This package allows to start Leechcraft as a Desktop Environment with the KDE Window Manager.
ca: Aquest paquet permet iniciar Leechcraft com a entorn d'escriptori amb el gestor de finestres del KDE.

source: OpenBox Window Manager integration for LeechCraft
ca: Integració amb el gestor de finestres OpenBox per a LeechCraft

source: This package allows to start Leechcraft as a Desktop Environment with the Openbox Window Manager.
ca: Aquest paquet permet iniciar Leechcraft com a entorn d'escriptori amb el gestor de finestres Openbox.

source: LeechCraft Global actions Module
ca: Mòdul d'accions globals de LeechCraft

source: This package provides a global shortcut manager for LeechCraft with which global hotkeys can be set and used.
ca: Aquest paquet proporciona un gestor de dreceres global per a LeechCraft amb el qual es poden establir i utilitzar les dreceres globals.

source: LeechCraft Opened tabs overview Module
ca: Mòdul de resum de pestanyes obertes del LeechCraft

source: This package provides a tabs overview plugin for Leechcraft which shows a grid of overview thumbnails.
ca: Aquest paquet proporciona un connector de resum de pestanyes per a Leechcraft que mostra una quadrícula de miniatures de resum.

source: LeechCraft GMail notifier Module
ca: Mòdul de notificador del GMail LeechCraft

source: This package provides a GMail notifications plugin for Leechcraft which allows to show notifications about new mail in your GMail account. It has a configurable frequency for updates and the number of last unread messages shown.
ca: Aquest paquet proporciona un connector de notificacions de GMail per a Leechcraft que permet mostrar notificacions sobre el correu nou al vostre compte de GMail. Té una freqüència configurable per a les actualitzacions i el nombre d'últims missatges no llegits mostrats.

source: LeechCraft History Module
ca: Mòdul d'història de LeechCraft

source: This package provides a history keeper plugin for LeechCraft which stores information about finished downloads and similar events, and allows to search it by text, wildcard, regular expressions or tags.
ca: Aquest paquet proporciona un connector per al manteniment de l'historial per a LeechCraft que emmagatzema informació sobre les baixades acabades i esdeveniments similars, i permet cercar-lo per text, comodí, expressions regulars o etiquetes.

source: LeechCraft Radio streams Module
ca: Mòdul de fluxos de ràdio LeechCraft

source: This package provides a radio streams provider plugin for LeechCraft.
ca: Aquest paquet proporciona un connector de proveïdor de fluxos de ràdio per a LeechCraft.

source: LeechCraft HTTP Server Module
ca: Mòdul del servidor HTTP LeechCraft

source: This package provides content from local filesystem over LANs. (Possibly also WANs, but, by default, only LAN interfaces are listened on).
ca: Aquest paquet proporciona contingut del sistema de fitxers local sobre LANs. (Possiblement també WAN, però, per defecte, només s'escolten les interfícies LAN).

source: LeechCraft Image Paster Module
ca: Mòdul Paster de la imatge LeechCraft

source: This module provides a simple image paster plugin from LeechCraft.
ca: Aquest mòdul proporciona un connector d'enganxament d'imatges senzill de LeechCraft.

source: LeechCraft HTTP Accept-Language header Module
ca: Mòdul de capçalera LeechCraft HTTP Accept-Language

source: This module provides a HTTP Accept-Language header configurator.
ca: Aquest mòdul proporciona un configurador de capçalera HTTP Accept-Language.

source: LeechCraft keyboard switcher Module
ca: Mòdul del commutador de teclat LeechCraft

source: This module allows changing keyboard layouts from LeechCraft.
ca: Aquest mòdul permet canviar les disposicions de teclat de LeechCraft.

source: LeechCraft Kinetic notifications Module
ca: Mòdul de notificacions cinètiques del LeechCraft

source: This package contains a fancy notifications plugin for LeechCraft. It provides fancy kinetic notifications LeechCraft-wide instead of old-style tray-based ones. It supports notifications with HTML markup, notification actions (for example, "Open chat" action in a notification about incoming IM message) and is fully themable.
ca: Aquest paquet conté un connector de notificacions elegant per al LeechCraft. Proporciona notificacions cinètiques elegants a tot LeechCraft en lloc de les basades en safata d'estil antic. És compatible amb notificacions amb marcatge HTML, accions de notificació (per exemple, acció "Obre xat" en una notificació sobre el missatge entrant de MI) i és totalment temable.

source: LeechCraft "Tip of the day" Module
ca: Mòdul LeechCraft "Tip of the day"

source: This package provides a tips plugin for LeechCraft which displays a "tip of the day" window after launching LeechCraft.
ca: Aquest paquet proporciona un connector de consells per a LeechCraft que mostra una finestra de "consell del dia" després de llançar LeechCraft.

source: LeechCraft Applications Switcher Module
ca: Mòdul del commutador d'aplicacions LeechCraft

source: This package provides an applications switcher quark for LeechCraft SB2.
ca: Aquest paquet proporciona un quark de commutador d'aplicacions per a LeechCraft SB2.

source: LeechCraft Package manager Module
ca: Mòdul del gestor de paquets LeechCraft

source: This package provides a package manager plugin for Leechcraft. It allows to install script plugins, iconsets, translations, additional data and other similar packages. It also supports dependencies between packages as well as versioning and automatic updates of the packages. Features: * Allows installation of script plugins, icons and various other data. * Supports versioning and automatic updates of packages. * Supports dependencies between packages. * Operates in user's home directory.
ca: Aquest paquet proporciona un connector del gestor de paquets per a Leechcraft. Permet instal·lar connectors de script, icones, traduccions, dades addicionals i altres paquets similars. També admet dependències entre paquets, així com versions i actualitzacions automàtiques dels paquets. Característiques: * Permet la instal·lació de connectors de script, icones i altres dades. * Permet versions i actualitzacions automàtiques de paquets. * Permet dependències entre paquets. * Opera en el directori d'inici de l'usuari.

source: LeechCraft Last.FM Scrobble Module
ca: Mòdul d'Scrobble de LeechCraft Last.FM

source: This package contains the LastFMScrobble plugin for LeechCraft which supports the Last.FM service. For example, it scrobbles tracks from other players, requests similar artists (on demand by other players as well), supports fetching album art, etc. Features: * Scrobbling listened tracks from other players like LMP to Last.FM. * "Loving" listened tracks. * Support for requesting artists that are similar to a given artist. * Automatic fetching of album art. * Support for Last.FM radio. * Fetching personalized recommendations. * Fetching recent releases of artists that are in the user's collection. * Fetching artists biography. * Configurable language of the fetched information.
ca: Aquest paquet conté el connector LastFMScrobble per a LeechCraft que admet el servei Last.FM. Per exemple, escorcolla pistes d'altres jugadors, sol·licita artistes similars (a petició d'altres jugadors també), suport per obtenir l'art de l'àlbum, etc. Característiques: * Retallant les pistes escoltades d'altres jugadors com LMP a Last.FM. * "Amant" de les pistes escoltades. * Suport per a sol·licitar artistes similars a un artista determinat. * Recuperació automàtica de l'art de l'àlbum. * Suport per a la ràdio Last.FM. * Obtenció de recomanacions personalitzades. * Recollint llançaments recents d'artistes que es troben a la col·lecció de l'usuari. * Recollida de la biografia dels artistes. * Llenguatge configurable de la informació recuperada.

source: LeechCraft Notification Server Module
ca: Mòdul del servidor de notificacions LeechCraft

source: This package provides a desktop notifications server plugin for Leechcraft.
ca: Aquest paquet proporciona un connector de servidor de notificacions d'escriptori per a Leechcraft.

source: LeechCraft Launcher Module
ca: Mòdul de llançador LeechCraft

source: This package provides a third-party application launcher plugin for Leechcraft.
ca: Aquest paquet proporciona un connector de llançador d'aplicacions de tercers per a Leechcraft.

source: LeechCraft Network Monitor Module
ca: Mòdul de monitor de xarxa LeechCraft

source: This package provides another Network Monitor plugin for Leechcraft.
ca: Aquest paquet proporciona un altre connector de monitor de xarxa per a Leechcraft.

source: LeechCraft HTML WYSIWYG editor Module
ca: Mòdul d'editor WYSIWYG d'HTML LeechCraft

source: This package provides a HTML WYSIWYG editor plugin for Leechcraft, usable with mail and blog modules.
ca: Aquest paquet proporciona un connector d'editor WYSIWYG HTML per a Leechcraft, usable amb mòduls de correu i blog.

source: LeechCraft Power management module
ca: Mòdul de gestió d'energia de LeechCraft

source: This package provides a power manager plugin for Leechcraft which makes use of upower. Features: * Displays battery status in LeechCraft tray. * Displays battery charge and power consumption history. * Notifies other plugins about sleep and resume events. This way, plugins like Azoth can disconnect from servers gracefully on hibernation and reconnect properly on startup. * Allows the user to sleep/hibernate the system. * Notifies the user when device starts discharging or charging. * Notifies the user on low capacity.
ca: Aquest paquet proporciona un connector de gestor d'energia per a Leechcraft que fa ús de upower. Característiques: * Mostra l'estat de la bateria a la safata LeechCraft. * Mostra l'historial de càrrega de la bateria i de consum d'energia. * Notifica altres connectors sobre els esdeveniments de son i de represa. D'aquesta manera, els connectors com Azoth poden desconnectar-se dels servidors amb gràcia en la hibernació i tornar a connectar-se correctament en iniciar. * Permet a l'usuari dormir/hibernar el sistema. * Notifica a l'usuari quan el dispositiu comença a descarregar o a carregar. * Notifica a l'usuari en baixa capacitat.

source: LeechCraft Media player Module
ca: Mòdul del reproductor multimèdia LeechCraft

source: This package provides an audio player plugin for LeechCraft. It uses Gstreamer as a backend, thus supporting major codecs. Features: * Streaming media over Internet. * Play queue. * Support for automatic podcast playing (with a plugin like Aggregator).
ca: Aquest paquet proporciona un connector de reproductor d'àudio per a LeechCraft. Utilitza Gstreamer com a dorsal, suportant així còdecs importants. Característiques: * Streaming media a través d'Internet. * Reprodueix la cua. * Suport per a la reproducció automàtica de podcasts (amb un connector com Aggregator).

source: LeechCraft Collection Checker Module
ca: Mòdul de comprovació de col·lecció LeechCraft

source: This package provides a collection checker plugin for LeechCraft to check the completeness of collections.
ca: Aquest paquet proporciona un connector de comprovador de col·leccions per a LeechCraft per a comprovar la integritat de les col·leccions.

source: LeechCraft Media synchronization Module
ca: Mòdul de sincronització multimèdia LeechCraft

source: This package provides an audio syncing plugin for LeechCraft to synchronize with Flash-like media players.
ca: Aquest paquet proporciona un connector de sincronització d'àudio per al LeechCraft per sincronitzar-se amb reproductors multimèdia similars al Flash.

source: LeechCraft Equalizer Module
ca: Mòdul Equalitzador LeechCraft

source: This package provides a 10-band equalizer.
ca: Aquest paquet proporciona un equalitzador de 10 bandes.

source: LeechCraft Tag Manipulating Module
ca: Mòdul de manipulació d'etiquetes LeechCraft

source: This package provides a tag editor plugin for LeechCraft with with audio file tags can be manipulated.
ca: Aquest paquet proporciona un connector d'editor d'etiquetes per a LeechCraft amb etiquetes de fitxer d'àudio que es poden manipular.

source: LeechCraft Music Streamer Module
ca: Mòdul Streamer de música LeechCraft

source: This package provides a streamer plugin for LeechCraft player to stream music from LMP via HTTP.
ca: Aquest paquet proporciona un connector de streamer per al reproductor LeechCraft per transmetre música des de LMP a través d'HTTP.

source: LeechCraft mp3tunes.com Module
ca: Mòdul LeechCraft mp3tunes.com

source: This package provides a LeechCraft plugin to synchronizing with, and use the mp3tunes.com service. Features: * Using many accounts. * Getting playlists.
ca: Aquest paquet proporciona un connector LeechCraft per sincronitzar-se i utilitzar el servei mp3tunes.com. Característiques: * Utilitzant molts comptes. * Obtenció de llistes de reproducció.

source: LeechCraft MtpSync Module
ca: Mòdul MtpSync de LeechCraft

source: This package allows to synchronize with MTP devices via LeechCraft.
ca: Aquest paquet permet sincronitzar-se amb dispositius MTP a través de LeechCraft.

source: LeechCraft Portable Player Logging Module
ca: Mòdul de registre del jugador portàtil LeechCraft

source: This package provides Portable Player Logging support for the LeechCraft audio player.
ca: Aquest paquet proporciona suport de registre del jugador portàtil per al reproductor d'àudio LeechCraft.

source: LeechCraft Tray Area Module
ca: Mòdul de l'àrea de la safata LeechCraft

source: This package provides a tray area quark for third-party apps for LeechCraft SB2.
ca: Aquest paquet proporciona un quark d'àrea de safata per a aplicacions de tercers per a LeechCraft SB2.

source: LeechCraft Document viewer Module
ca: Mòdul del visor de documents LeechCraft

source: This package provides a modular document viewer plugin for LeechCraft which supports different formats via backends.
ca: Aquest paquet proporciona un connector modular de visualització de documents per a LeechCraft que admet diferents formats a través de dorsals.

source: MOBI support for LeechCraft Monocle
ca: Suport MOBI per a LeechCraft Monocle

source: This package contains the MOBI subplugin for LeechCraft Monocle.
ca: Aquest paquet conté el subllinatge MOBI per a LeechCraft Monocle.

source: LeechCraft Monocle Documentation
ca: Documentació del Monocle LeechCraft

source: This packages provides documentation of LeechCraft Monocle API. It contains description of Monocle API used for developing LeechCraft Monocle sub-plugins. For developing first-lexel plugins, please refer to corresponding packages (like leechcraft-doc). This documentation is also available online at http://doc.leechcraft.org/monocle/
ca: Aquest paquet proporciona documentació de l'API de LeechCraft Monocle. Conté la descripció de l'API de Monocle utilitzada per al desenvolupament de subplugins de LeechCraft Monocle. Per al desenvolupament de connectors de primer lèxel, consulteu els paquets corresponents (com leechcraft-doc). Aquesta documentació també està disponible en línia a http://doc.leechcraft.org/monocle/

source: FictionBook support for LeechCraft Monocle
ca: Implementació de FictionBook per a LeechCraft Monocle

source: This package contains the FictionBook subplugin for LeechCraft Monocle.
ca: Aquest paquet conté el subconnector FictionBook per a LeechCraft Monocle.

source: PDF support for LeechCraft Monocle
ca: Implementació de PDF per a LeechCraft Monocle

source: This package contains the PDF subplugin for LeechCraft Monocle. PDF support is provided via the libpoppler backend.
ca: Aquest paquet conté el subllinatge PDF per a LeechCraft Monocle. El suport PDF es proporciona a través del dorsal libpoppler.

source: PostScript support for LeechCraft Monocle
ca: Suport PostScript per a LeechCraft Monocle

source: This package contains the PostRus subplugin for LeechCraft Monocle which supports PostScript document support via the ghostscript utilities.
ca: Aquest paquet conté el subllinatge PostRus per al LeechCraft Monocle que admet el suport de documents PostScript a través de les utilitats ghostscript.

source: Djvu support for LeechCraft Monocle
ca: Suport per a LeechCraft Monocle

source: This package contains a LeechCraft Monocle subplugin for djvu document support via the djvulibre backend.
ca: Aquest paquet conté un subconnector LeechCraft Monocle per al suport de documents djvu a través del dorsal djvulibre.

source: LeechCraft Azoth MusicBrainz.org client Module
ca: Mòdul client LeechCraft Azoth MusicBrainz.org

source: This package provides a MusicBrainz.org client plugin for LeechCraft.
ca: Aquest paquet proporciona un connector de client MusicBrainz.org per a LeechCraft.

source: LeechCraft HTTP authentication Module
ca: Mòdul d'autenticació HTTP del LeechCraft

source: This package provides providing standard HTTP authentication facilities for LeechCraft.
ca: Aquest paquet proporciona instal·lacions d'autenticació HTTP estàndard per a LeechCraft.

source: LeechCraft Network file storages Module
ca: Mòdul d'emmagatzematge de fitxers de xarxa LeechCraft

source: This package provides a network storage plugin for Leechcraft. It allows to manage network storages such as Google Drive. Different storages can be added to it without modifying the plugin itself. Features: * Upload files from LeechCraft. * Maintain the list of uploaded files. * Delete the uploaded files (if supported by service). * Support for prolongating uploaded files (if supported by service).
ca: Aquest paquet proporciona un connector d'emmagatzematge de xarxa per a Leechcraft. Permet gestionar magatzems de xarxa com Google Drive. Es poden afegir diferents emmagatzematges sense modificar el propi connector. Característiques: * Puja fitxers de LeechCraft. * Mantenir la llista de fitxers carregats. * Suprimeix els fitxers carregats (si és compatible amb el servei). * Suport per a prolongar els fitxers carregats (si és compatible amb el servei).

source: LeechCraft Google Drive storage Module
ca: Mòdul d'emmagatzematge de Google Drive de LeechCraft

source: This package provides a Google Drive subplugin for Leechcraft NetStoreManager.
ca: Aquest paquet proporciona un subconnector de Google Drive per a Leechcraft NetStoreManager.

source: This package provides a network monitor plugin for LeechCraft. It allows to watch for HTTP requests and allows to inspect them and search through the list.
ca: Aquest paquet proporciona un connector de monitor de xarxa per a LeechCraft. Permet vigilar les sol·licituds HTTP i permet inspeccionar-les i cercar a través de la llista.

source: LeechCraft Importer Module
ca: Mòdul d'importació LeechCraft
