Repository: openSUSE/packages-i18n
Catalog: */po/leechcraft.*.po
Languages: ca

source: A library providing some classes to be used with the XmlSettingsDialog LeechCraft subsystem.
ca: Una biblioteca que proporciona algunes classes que s'utilitzaran amb el subsistema XmlSettingsDialog LeechCraft.

source: LeechCraft Visualization Effects Module
ca: Mòdul d'efectes de visualització de LeechCraft

source: This package provides visualization effects for the LeechCraft audio player.
ca: Aquest paquet proporciona efectes de visualització per al reproductor d'àudio LeechCraft.

source: LeechCraft LMP MusicBrainz.org client Module
ca: Mòdul client de LeechCraft LMP MusicBrainz.org

source: This package provides a WebEngine-based web browser plugin for LeechCraft. Poshuku is extensible with plugins. Currently it features: * integration with other plugins; * autodiscovery; * tagging bookmarks; * support for SQLite or PostgreSQL storage.
ca: Aquest paquet proporciona un connector de navegador web basat en WebEngine per a LeechCraft. Poshuku és extensible amb connectors. Actualment compta amb: * integració amb altres connectors; * descobriment automàtic; * marques d'adreces d'interès; * suport per a l'emmagatzematge SQLite o PostgreSQL.

source: This package provides a fake user agent plugin for LeechCraft Poshuku for setting different User-Agent strings for different URLs. Features: * URLs are defined either by their substring or by regular expression. * Several popular predefined user agents are present. * Support for custom user-defined strings. * Support for automatic insertion of current platform, language, etc. into the User-Agent string in arbitrary places.
ca: Aquest paquet proporciona un connector d'agent d'usuari fals per a LeechCraft Poshuku per establir diferents cadenes d'agent d'usuari per a diferents URL. Característiques: * Els URL es defineixen per la seva subcadena o per expressió regular. * Hi ha diversos agents d'usuari predefinits populars. * Suport per a cadenes personalitzades definides per l'usuari. * Suport per a la inserció automàtica de la plataforma actual, l'idioma, etc. a la cadena d'agent d'usuari en llocs arbitraris.

source: LeechCraft Poshuku WebEngine-based backend Module
ca: Mòdul de dorsal basat en WebEngine LeechCraft

source: This package provides WebEngine-based backend for LeechCraft Poshuku browser.
ca: Aquest paquet proporciona el dorsal basat en WebEngine per al navegador LeechCraft Poshuku.
