Repository: openSUSE/packages-i18n
Catalog: */po/libqt.*.po
Languages: ca

source: Development files for the Qt 5 3D Animation library
ca: Fitxers de desenvolupament per a la biblioteca d'animació 3D Qt 5

source: Development files for the Qt 5 3D Animation library.
ca: Fitxers de desenvolupament per a la biblioteca d'animació 3D Qt 5.

source: Qt 5 3D Addon
ca: Complement 3D de les Qt 5

source: Qt is a set of libraries for developing applications. This Qt 3D module contains functionality to support near-realtime simulation systems.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. Aquest mòdul 3D de les Qt conté funcionalitats per a admetre sistemes de simulació en temps real.

source: Development files for the Qt 5 Core 3D library
ca: Fitxers de desenvolupament per a la biblioteca 3D del nucli Qt 5

source: Development files for the Qt 5 Core 3D library.
ca: Fitxers de desenvolupament per a la biblioteca 3D del nucli de les Qt 5.

source: Qt is a set of libraries for developing applications. Qt 3D provides functionality for near-realtime simulation systems with support for 2D and 3D rendering in both Qt C++ and Qt Quick applications.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. Qt 3D proporciona funcionalitat per a sistemes de simulació en temps real amb suport per a la representació 2D i 3D tant en Qt C++ com en Qt Quick.

source: Development files for the Qt 5 3D Extras libary
ca: Fitxers de desenvolupament per a la biblioteca 3D Extras de les Qt 5

source: Development files for the Qt 5 3D Extras library.
ca: Fitxers de desenvolupament per a la biblioteca Extres 3D Qt 5.

source: Development files for the Qt 5 Input 3D library
ca: Fitxers de desenvolupament per a la biblioteca 3D d'entrada de les Qt 5

source: Development files for the Qt 5 Input 3D library.
ca: Fitxers de desenvolupament per a la biblioteca 3D Input de les Qt 5.

source: Qt is a set of libraries for developing applications. The Qt 3D Input module provides classes for handling user input in applications using Qt3D.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. El mòdul d'entrada 3D de les Qt proporciona classes per a gestionar l'entrada de l'usuari a les aplicacions que usen les Qt3D.

source: Development files for the Qt 5 Logic 3D library
ca: Fitxers de desenvolupament per a la biblioteca lògica 3D de les Qt 5

source: Development files for the Qt 5 Logic 3D library.
ca: Fitxers de desenvolupament per a la biblioteca 3D de lògica de les Qt 5.

source: Qt is a set of libraries for developing applications. Qt 3D Logic module enables synchronizing frames with the Qt 3D backend.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. El mòdul lògic 3D de les Qt permet sincronitzar fotogrames amb el dorsal 3D de les Qt.

source: Development files for the Qt 5 Quick 3D library
ca: Fitxers de desenvolupament per a la biblioteca 3D ràpida de les Qt 5

source: Development files for the Qt 5 Quick 3D library.
ca: Fitxers de desenvolupament per a la biblioteca Qt 5 Quick 3D.

source: Qt is a set of libraries for developing applications. This package provides core Qt 3D QML types.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. Aquest paquet proporciona els tipus QML en 3D de les Qt.

source: Development files for the Qt 5 3D Quick Animation library
ca: Fitxers de desenvolupament per a la biblioteca d'animació ràpida 3D de les Qt 5

source: Development files for the Qt 5 3D Quick Animation library.
ca: Fitxers de desenvolupament per a la biblioteca d'animació ràpida 3D de les Qt 5.

source: Development files for the Qt 5 3D QuickExtras library
ca: Fitxers de desenvolupament per a la biblioteca 3D QuickExtras de les Qt 5

source: Development files for the Qt 5 QuickInput 3D library
ca: Fitxers de desenvolupament per a la biblioteca 3D QuickInput de les Qt 5

source: Development files for the Qt 5 Quick Input 3D library.
ca: Fitxers de desenvolupament per a la biblioteca 3D Quick Input de les Qt 5.

source: Development files for the Qt 5 QuickRenderer 3D library
ca: Fitxers de desenvolupament per a la biblioteca 3D QuickRenderer de les Qt 5

source: Development files for the Qt 5 QuickRenderer 3D library.
ca: Fitxers de desenvolupament per a la biblioteca 3D QuickRenderer de les Qt 5.

source: Qt is a set of libraries for developing applications. This package provides Qt 3D QML types for rendering.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. Aquest paquet proporciona els tipus QML 3D de les Qt per a renderitzar.

source: Development files for the Qt 5 3D Quick Scene 2D library
ca: Fitxers de desenvolupament per a la biblioteca 2D d'Escena ràpida 3D de les Qt 5

source: Development files for the Qt 5 3D Quick Scene 2D library.
ca: Fitxers de desenvolupament per a la biblioteca 2D d'Escena ràpida 3D de les Qt 5.

source: Development files for the Qt 5 Renderer 3D library
ca: Fitxers de desenvolupament per a la biblioteca 3D del Renderitzador de les Qt 5

source: Development files for the Qt 5 Renderer 3D library.
ca: Fitxers de desenvolupament per a la biblioteca 3D del Renderitzador de les Qt 5.

source: Qt is a set of libraries for developing applications. The Qt 3D Render module contains functionality to support 2D and 3D rendering using Qt 3D.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. El mòdul de renderització 3D de les Qt conté funcionalitats per a admetre la representació 2D i 3D utilitzant les Qt 3D.

source: Qt 5 Bluez Addon
ca: Complement Bluez de les Qt 5

source: Qt is a set of libraries for developing applications.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions.

source: Qt Development Kit
ca: Kit de desenvolupament Qt

source: You need this package if you want to compile programs with the Qt BodyMovin library.
ca: Necessiteu aquest paquet si voleu compilar programes amb la biblioteca BodyMovin de les Qt.

source: Headers for the unstable API of the Qt5 BodyMovin library
ca: Capçaleres per a l'API inestable de la biblioteca BodyMovin de les Qt5

source: You need this package if you want to compile programs against the unstable API of the Qt5 BodyMovin library.
ca: Necessiteu aquest paquet si voleu compilar programes contra l'API inestable de la biblioteca BodyMovin de les Qt5.

source: Qt 5 BodyMovin Library
ca: Biblioteca BodyMovin de les Qt 5

source: Qt is a set of libraries for developing applications. This package includes a library for reading BodyMovin animation files.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. Aquest paquet inclou una biblioteca per a llegir fitxers d'animació BodyMovin.

source: Qt Bootstrap module
ca: Mòdul Bootstrap de les Qt

source: Qt Bootstrap module.
ca: Mòdul Bootstrap de les Qt.

source: Qt 5 Charts Library
ca: Biblioteca de diagrames de les Qt 5

source: Qt Charts module provides a set of chart components. It uses the Qt Graphics View Framework, therefore charts can be integrated to user interfaces. Qt Charts can be used as QWidgets, QGraphicsWidget, or QML types. Users can create graphs by selecting one of the charts themes. This package contains a shared library for the QtChart.
ca: El mòdul Qt Charts proporciona un conjunt de components de diagrama. Utilitza el Qt Graphics View Framework, per tant, els diagrames es poden integrar a les interfícies d'usuari. Els diagrames de les Qt es poden utilitzar com a tipus QWidgets, QGraphicsWidget o QML. Els usuaris poden crear gràfiques seleccionant un dels temes dels diagrames. Aquest paquet conté una biblioteca compartida per al QtChart.

source: Designer plugin for the Qt 5 Charts library
ca: Connector de disseny per a la biblioteca Qt 5 Charts

source: This package provides Qt Designer plugin for development with Qt Charts.
ca: Aquest paquet proporciona el connector Qt Designer per al desenvolupament amb Qt Charts.

source: Development files for the Qt 5 Charts Library
ca: Fitxers de desenvolupament per a la biblioteca de diagrames de les Qt 5

source: This package provides header files and shared libraries for development with Qt Charts.
ca: Aquest paquet proporciona fitxers de capçalera i biblioteques compartides per al desenvolupament amb Qt Charts.

source: Development files for the Qt5 Concurrent library
ca: Fitxers de desenvolupament per a la biblioteca concurrent de les Qt5

source: Development files for the Qt5 Concurrent library.
ca: Fitxers de desenvolupament per a la biblioteca concurrent de les Qt5.

source: Qt 5 Concurrent Library
ca: Biblioteca concurrent de les Qt 5

source: The QtConcurrent namespace provides high-level APIs that help write multi-threaded programs without using low-level threading primitives such as mutexes, read-write locks, wait conditions, or semaphores. Programs written with QtConcurrent automatically adjust the number of threads used according to the number of processor cores available. QtConcurrent includes functional programming style APIs for parallel list processing, including a MapReduce and FilterReduce implementation for shared-memory (non-distributed) systems, and classes for managing asynchronous computations in GUI applications.
ca: L'espai de noms QtConcurrent proporciona APIs d'alt nivell que ajuden a escriure programes multifils sense utilitzar primitives de fils de baix nivell com ara mutexes, panys de lectura-escriptura, condicions d'espera o semàfors. Els programes escrits amb QtConcurrent ajusten automàticament el nombre de fils utilitzats segons el nombre de nuclis de processador disponibles. QtConcurrent inclou APIs d'estil de programació funcional per al processament de llistes paral·leles, inclosa una implementació de MapReduce i FilterReduce per a sistemes de memòria compartida (no distribuïts), i classes per a la gestió de càlculs asincrònics en aplicacions GUI.

source: Development files for the Qt5 core library
ca: Fitxers de desenvolupament per a la biblioteca del nucli de les Qt5

source: Development files for the Qt5 core library.
ca: Fitxers de desenvolupament per a la biblioteca del nucli de les Qt5.

source: Non-ABI stable experimental API for the Qt5 core library
ca: API experimental estable no-ABI per a la biblioteca del nucli de les Qt5

source: This package provides private headers of libQt5Core that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libQt5Core que normalment no s'utilitzen per al desenvolupament d'aplicacions i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 Core Library
ca: Biblioteca del nucli de les Qt 5

source: The Qt 5 Core library. It adds these features to C++: * a mechanism for object communication called signals and slots * queryable and designable object properties * hierarchical and queryable object trees that organize * object ownership in a natural way with guarded pointers (QPointer) * a dynamic cast that works across library boundaries
ca: La biblioteca Qt 5 Core. Afegeix aquestes característiques a C++: * un mecanisme de comunicació d'objectes anomenat senyals i ranures * propietats d'objecte consultables i dissenyables * arbres d'objectes jeràrquics i consultables que organitzen * la propietat de l'objecte d'una manera natural amb punters vigilats (QPointer) * un repartiment dinàmic que funciona més enllà dels límits de les biblioteques

source: Development files for the Qt5 D-Bus library
ca: Fitxers de desenvolupament per a la biblioteca D-Bus de les Qt5

source: Development files for the Qt5 D-Bus library. This package also contains Qt5's qdbusxml2cpp and qdbuscpp2xml binaries.
ca: Fitxers de desenvolupament per a la biblioteca D-Bus de les Qt5. Aquest paquet també conté els binaris qdbusxml2cpp i qdbuscpp2xml de les Qt5.

source: Non-ABI stable experimental API for the Qt5 D-Bus library
ca: API experimental estable no-ABI per a la biblioteca D-Bus de les Qt5

source: This package provides private headers of libQt5DBus that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libQt5DBus que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt5 D-Bus library
ca: Biblioteca D-Bus de les Qt5

source: The Qt D-Bus module is a library that can be used to perform inter-process communication using the D-Bus protocol.
ca: El mòdul D-Bus de les Qt és una biblioteca que es pot utilitzar per a realitzar comunicacions entre processos utilitzant el protocol D-Bus.

source: Qt5 Data Visualization module
ca: Mòdul de visualització de dades de les Qt5

source: Qt Data Visualization module provides a way to visualize data in 3D. This package contains a shared library for the QtDataVisualization.
ca: El mòdul de visualització de dades de les Qt proporciona una manera de visualitzar les dades en 3D. Aquest paquet conté una biblioteca compartida per a la QtDataVisualization.

source: Development files for the Qt5 Data Visualization module
ca: Fitxers de desenvolupament per al mòdul de visualització de dades de les Qt5

source: This package provides header files and shared libraries for development with Qt Data Visualization.
ca: Aquest paquet proporciona fitxers de capçalera i biblioteques compartides per al desenvolupament amb Qt Data Visualization.

source: Qt 5 Designer Library
ca: Biblioteca de disseny de les Qt 5

source: The Qt 5 Designer library.
ca: La biblioteca Qt 5 Designer.

source: Qt 5 Designer Components Library
ca: Biblioteca Qt 5 Designer Components

source: The Qt 5 Designer Components library.
ca: La biblioteca Qt 5 Designer Components.

source: Qt 5 Gamepad Library
ca: Biblioteca del Gamepad de les Qt 5

source: Qt Gamepad is an add-on library that enables Qt applications to support the use of gamepad hardware. The module provides both QML and C++ interfaces.
ca: El Qt Gamepad és una biblioteca de complements que permet a les aplicacions Qt admetre l'ús del maquinari del gamepad. El mòdul proporciona interfícies tant en QML com en C++.

source: Development files for the Qt5 GUI library
ca: Fitxers de desenvolupament per a la biblioteca GUI de les Qt5

source: Development files for the Qt5 GUI library.
ca: Fitxers de desenvolupament per a la biblioteca GUI de les Qt5.

source: Non-ABI stable experimental API for the Qt5 GUI library
ca: API experimental estable no-ABI per a la biblioteca GUI de les Qt5

source: This package provides private headers of libQt5Gui that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de la libQt5Gui que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 GUI related libraries
ca: Biblioteques relacionades amb la IGU de les Qt 5

source: The Qt GUI module provides classes for windowing system integration, event handling, OpenGL and OpenGL ES integration, 2D graphics, basic imaging, fonts and text. These classes are used internally by Qt's user interface code and can also be used directly, for instance, to write applications using low-level OpenGL ES graphics APIs. For application developers writing user interfaces, Qt provides higher level APIs, like Qt Quick, which are much more suitable than the enablers found in the Qt GUI module.
ca: El mòdul IGU de les Qt proporciona classes per a la integració del sistema de finestres, la gestió d'esdeveniments, la integració OpenGL i OpenGL ES, gràfics 2D, imatges bàsiques, fonts i text. Aquestes classes s'utilitzen internament pel codi d'interfície d'usuari de les Qt i també es poden utilitzar directament, per exemple, per a escriure aplicacions utilitzant APIs gràfiques OpenGL ES de baix nivell. Per als desenvolupadors d'aplicacions que escriuen interfícies d'usuari, Qt proporciona APIs de més nivell, com Qt Quick, que són molt més adequades que els activadors que es troben al mòdul IGU de les Qt.

source: Qt 5 Help Library
ca: Biblioteca d'ajuda de les Qt 5

source: The Qt 5 Help library.
ca: La biblioteca d'ajuda de les Qt5.

source: Non-ABI stable API for libQt5HunspellInputMethod
ca: API estable no ABI per a libQt5HunspellInputMethod

source: This package provides private headers of libQt5HunspellInputMethod that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libQt5HunspellInputMethod que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt5 Hunspell Input Method
ca: Mètode d'entrada Hunspell de les Qt5

source: Internal library used by Qt for providing Hunspell support.
ca: Biblioteca interna utilitzada per les Qt per a proporcionar suport per a Hunspell.

source: Qt KMS support module
ca: Mòdul de suport per a les Qt KMS

source: Qt module to support Kernel Mode Setting.
ca: Mòdul de les Qt per a admetre l'establiment del mode del nucli.

source: Non-ABI stable experimental API for the Qt5 KMS support library
ca: API experimental estable no-ABI per a la biblioteca de suport Qt5 KMS

source: This package provides private headers of libQt5KmsSupport that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libQt5KmsSupport que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 Location Library
ca: Biblioteca d'ubicació de les Qt 5

source: The Qt Location API facilitates creating mapping solutions using the data available from some contemporary location services. Using Qt Location, one can * access and present map data, * support touch gesture on a specific area of the map, * query for a specific geographical location and route, * add additional layers on top, such as polylines and circles, * and search for places and related images.
ca: L'API de localització de les Qt facilita la creació de solucions de mapatge utilitzant les dades disponibles d'alguns serveis d'ubicació contemporanis. Utilitzant la ubicació de les Qt, es pot * accés i presentació de dades del mapa, * suport del gest tàctil sobre una àrea específica del mapa, * consulta d'una ubicació geogràfica i ruta específiques, * afegir capes addicionals a la part superior, com polilínies i cercles, * i cerca de llocs i imatges relacionades.

source: Qt 5 Multimedia Library
ca: Biblioteca multimèdia Qt 5

source: Qt Multimedia is a module that provides a set of QML types and C++ classes to handle multimedia content. It also provides APIs to access the camera and radio functionality. The included Qt Audio Engine provides types for 3D positional audio playback and content management.
ca: Qt Multimedia és un mòdul que proporciona un conjunt de tipus QML i classes de C++ per a gestionar el contingut multimèdia. També proporciona APIs per accedir a la funcionalitat de càmera i ràdio. El Qt Audio Engine inclòs proporciona tipus per a la reproducció d'àudio posicional en 3D i la gestió de continguts.

source: Development files for the Qt5 network library
ca: Fitxers de desenvolupament per a la biblioteca de xarxa Qt5

source: Development files for the Qt5 network library.
ca: Fitxers de desenvolupament per a la biblioteca de xarxa Qt5.

source: Non-ABI stable experimental API for the Qt5 network library
ca: API experimental estable no-ABI per a la biblioteca de xarxa Qt5

source: This package provides private headers of libQt5Network that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de la libQt5Network que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 Network Library
ca: Biblioteca de xarxa Qt 5

source: Qt Network provides a set of APIs for programming applications that use TCP/IP. Operations such as requests, cookies, and sending data over HTTP are handled by various C++ classes.
ca: Qt Network proporciona un conjunt d'APIs per a la programació d'aplicacions que utilitzen TCP/IP. Operacions com ara sol·licituds, galetes i l'enviament de dades a través de HTTP són gestionades per diverses classes de C++.

source: Qt 5 NetworkAuth Library
ca: Biblioteca NetworkAuth de les Qt 5

source: Qt Network Authorization provides a set of APIs that enable Qt applications to obtain limited access to online accounts and HTTP services without exposing users' passwords. It supports OAuth versions 1 and 2.
ca: L'autorització de xarxa de Qt proporciona un conjunt d'API que permeten a les aplicacions Qt obtenir un accés limitat als comptes en línia i als serveis HTTP sense exposar les contrasenyes dels usuaris. És compatible amb les versions 1 i 2 d'OAuth.

source: Qt 5 Nfc Addon
ca: Complement Nfc de les Qt 5

source: Development files for the Qt5 OpenGL library
ca: Fitxers de desenvolupament per a la biblioteca OpenGL de les Qt5

source: Development files for the Qt5 OpenGL library. Warning: This module should not be used anymore for new code. Please use the corresponding OpenGL classes in Qt GUI.
ca: Fitxers de desenvolupament per a la biblioteca OpenGL de les Qt5. Avís: Aquest mòdul ja no s'ha d'utilitzar per al codi nou. Utilitzeu les classes OpenGL corresponents a la IGU de les Qt.

source: Non-ABI stable experimental API for the Qt5 OpenGL library
ca: API experimental estable no-ABI per a la biblioteca OpenGL de les Qt5

source: This package provides private headers of libQt5OpenGL that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libQt5OpenGL que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 OpenGL Library
ca: Biblioteca OpenGL de les Qt 5

source: The Qt OpenGL module provides an OpenGL widget class that can be used like any other Qt widget, except that it opens an OpenGL display buffer where the OpenGL API can be used to render the contents.
ca: El mòdul Qt OpenGL proporciona una classe de giny OpenGL que es pot utilitzar com qualsevol altre giny Qt, excepte que obre una memòria intermèdia de visualització OpenGL on es pot utilitzar l'API OpenGL per a renderitzar el contingut.

source: Qt OpenGLExtensions module
ca: Mòdul de Qt OpenGLExtensions

source: Qt OpenGLExtensions module.
ca: Mòdul de Qt OpenGLExtensions.

source: Qt5 PDF library
ca: Biblioteca PDF Qt5

source: Main library of the Qt PDF module.
ca: Biblioteca principal del mòdul PDF de les Qt.
