Repository: openSUSE/packages-i18n
Catalog: */po/libqt.*.po
Languages: ca

source: This package provides private headers of libqt5-qtscxml that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtscxml que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 State Chart XML tools
ca: Eines XML del diagrama d'estats de les Qt 5

source: Qt is a set of libraries for developing applications. This package contains tools for handling Qt SCXML files.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. Aquest paquet conté eines per a gestionar fitxers SCXML de les Qt.

source: Development files for the Qt 5 Sensors library
ca: Fitxers de desenvolupament per a la biblioteca de sensors de les Qt 5

source: The Qt Sensors API provides access to sensor hardware via QML and C++ interfaces. This subpackage contains the header files for developing applications that want to make use of libQt5Sensors5.
ca: L'API de sensors Qt proporciona accés al maquinari de sensors mitjançant interfícies QML i C++. Aquest subpaquet conté els fitxers de capçalera per a desenvolupar aplicacions que volen fer ús de la libQt5Sensors5.

source: Qt5 sensors examples
ca: Exemples de sensors Qt5

source: Examples for libqt5-qtsensors module.
ca: Exemples per al mòdul libqt5-qtsensors.

source: Non-ABI stable experimental API for the Qt5 Sensors library
ca: API experimental estable no-ABI per a la biblioteca de sensors de les Qt5

source: The Qt Serial Bus API provides classes and functions to access the various industrial serial buses and protocols, such as CAN, ModBus, and others.
ca: L'API de Qt Serial Bus proporciona classes i funcions per accedir als diversos autobusos i protocols de sèrie industrial, com CAN, ModBus i altres.

source: Development files for the Qt5 SerialBus library
ca: Fitxers de desenvolupament per a la biblioteca SerialBus de les Qt5

source: You need this package if you want to compile programs with qtserialbus.
ca: Necessiteu aquest paquet si voleu compilar programes amb qtserialbus.

source: Qt5 Serial Port examples
ca: Exemples del port sèrie de les Qt5

source: Examples for the libqt5-qtserialbus module.
ca: Exemples per al mòdul libqt5-qtserialbus.

source: Non-ABI stable experimental API for the Qt5 SerialBus library
ca: API experimental estable no-ABI per a la biblioteca SerialBus de les Qt5

source: This package provides private headers of libqt5-qtserialbus that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtserialbus que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Development files for the Qt5 SerialPort library
ca: Fitxers de desenvolupament per a la biblioteca SerialPort de les Qt5

source: You need this package if you want to compile programs with qtserialport.
ca: Necessiteu aquest paquet si voleu compilar programes amb qtserialport.

source: Examples for the libqt5-qtserialport module.
ca: Exemples per al mòdul libqt5-qtserialport.

source: Non-ABI stable experimental API for the Qt5 SerialPort library
ca: API experimental estable no-ABI per a la biblioteca SerialPort de les Qt5

source: This package provides private headers of libqt5-qtserialport that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtserialport que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Development files for the Qt5 Speech library
ca: Fitxers de desenvolupament per a la biblioteca de parla de les Qt5

source: You need this package if you want to compile programs with qtspeech.
ca: Necessiteu aquest paquet si voleu compilar programes amb qtspeech.

source: Qt5 Speech examples
ca: Exemples de veu de les Qt5

source: Examples for the libqt5-qtspeech module.
ca: Exemples per al mòdul de parla libqt5-qts.

source: Qt5 Speech Module - Speech Dispatcher support
ca: Mòdul de parla de les Qt5 - Implementació de l'emissor de veu

source: This plugin adds support for using speech-dispatcher for speech synthesis with the Qt5 Speech module.
ca: Aquest connector afegeix la implementació per a usar el «speech-dispatcher» per a la síntesi de veu amb el mòdul de veu de les Qt5.

source: Qt 5 Style Plugins
ca: Connectors d'estil de les Qt 5

source: Qt is a set of libraries for developing applications. This package contains additional style plugins.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. Aquest paquet conté connectors d'estil addicionals.

source: Qt 5 Style Plugins Development Files
ca: Fitxers de desenvolupament de connectors d'estil de les Qt 5

source: You need this package, if you want to compile programs with qtstyleplugins.
ca: Necessiteu aquest paquet, si voleu compilar programes amb qtstyleplugins.

source: Qt 5 gtk2 plugin
ca: Connector Qt 5 gtk2

source: Qt 5 plugin for better integration with gtk-based desktop enviroments.
ca: Connector de les Qt 5 per a una millor integració amb els entorns d'escriptori basats en gtk.

source: Development files for the Qt5 SVG library
ca: Fitxers de desenvolupament per a la biblioteca SVG de les Qt5

source: You need this package if you want to compile programs with QtSvg.
ca: Necessiteu aquest paquet si voleu compilar programes amb QtSvg.

source: Qt5 SVG examples
ca: Exemples SVG de les Qt5

source: Examples for the libqt5-qtsvg modules.
ca: Exemples per als mòduls libqt5-qtsvg.

source: Non-ABI stable experimental API for the Qt5 SVG library
ca: API experimental estable no-ABI per a la biblioteca SVG de les Qt5

source: This package provides private headers of libqt5-qtsvg that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtsvg que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 QtTools Module
ca: Mòdul QtTools de les Qt 5

source: The QtTools modules contains some tools mostly useful for application development. Included are QtAssistant (help browser), QtDesigner (GUI design), QDbusViewer and several more.
ca: Els mòduls QtTools contenen algunes eines principalment útils per al desenvolupament d'aplicacions. S'inclouen QtAssistant (navegador d'ajuda), QtDesigner (disseny GUI), QDbusViewer i diversos més.

source: Development files for the Qt5 Tools library
ca: Fitxers de desenvolupament per a la biblioteca Qt5 Tools

source: You need this package if you want to compile programs with qttools.
ca: Necessiteu aquest paquet si voleu compilar programes amb qttools.

source: Qt 5 tool used by Qt Developers to generate documentation
ca: Eina Qt 5 utilitzada pels desenvolupadors de les Qt per a generar documentació

source: Qt 5 tool used by Qt Developers to generate documentation for software projects.
ca: L'eina Qt 5 utilitzada pels desenvolupadors de les Qt per a generar documentació per a projectes de programari.

source: Example plugins for Qt5 Designer
ca: Connectors d'exemple per al Qt5 Designer

source: Example plugins for Qt5 Designer, e.g. a TicTacToe and a World Clock widget.
ca: Exemple de connectors per al Qt5 Designer, p. ex. un giny TicTacToe i World Clock.

source: Qt5 tools examples
ca: Exemples d'eines Qt5

source: Examples for the libqt5-qttools module.
ca: Exemples per al mòdul libqt5-qttools.

source: Non-ABI stable experimental API for the Qt5 Tools library
ca: API experimental estable no-ABI per a la biblioteca d'eines de les Qt5

source: This package provides private headers of libqt5-qttools that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qttools que normalment no s'utilitzen per al desenvolupament d'aplicacions i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Generator for Qt5 Help files (qch)
ca: Generador per als fitxers d'ajuda de les Qt5 (qch)

source: Binaries for generating .qch help catalogs.
ca: Binaris per a generar catàlegs d'ajuda .qch.

source: Qt 5 translations
ca: Traduccions de les Qt 5

source: Qt is a set of libraries for developing applications. This package contains translations for Qt5 toolkit and it's applications.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. Aquest paquet conté traduccions per al joc d'eines Qt5 i les seves aplicacions.

source: Qt 5 Virtual Keyboard
ca: Teclat virtual Qt 5

source: Qt is a set of libraries for developing applications. This package contains a virtual keyboard.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. Aquest paquet conté un teclat virtual.

source: You need this package if you want to compile programs or plugins with Qt Virtual Keyboard.
ca: Necessiteu aquest paquet si voleu compilar programes o connectors amb el teclat virtual de les Qt.

source: Qt5 virtualkeyboard examples
ca: Exemples de teclat virtual Qt5

source: Examples for libqt5-qtvirtualkeyboard module.
ca: Exemples per al mòdul libqt5-qtvirtualkeyboard.

source: Hunspell Plugin for the Qt5 Virtual Keyboard
ca: Connector Hunspell per al teclat virtual de les Qt5

source: This package provides a hunspell spell checking plugin for the Qt Virtual Keyboard.
ca: Aquest paquet proporciona un connector de verificació ortogràfica hunspell per al teclat virtual de les Qt.

source: Non-ABI stable API for the Qt5 Virtual Keyboard
ca: API estable no-ABI per al teclat virtual de les Qt5

source: This package provides private headers of libqt5-qtvirtualkeyboard that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtvirtualkeyboard que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Development package to build Qt-based compositors.
ca: Paquet de desenvolupament per a construir compositors basats en Qt.

source: Qt5 wayland examples
ca: Exemples de Wayland de les Qt5

source: Examples for libqt5-qtwayland module.
ca: Exemples per al mòdul libqt5-qtwayland.

source: Qt 5 Wayland Addon Non-ABI stable experimental API files
ca: Qt 5 Wayland Addon Fitxers experimentals de l'API no-ABI estables

source: This package provides private headers of libqt5-qtwayland that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtwayland que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Development files for the Qt5 WebChannel library
ca: Fitxers de desenvolupament per a la biblioteca WebChannel de les Qt5

source: You need this package if you want to compile programs with qtwebchannel.
ca: Necessiteu aquest paquet si voleu compilar programes amb qtwebchannel.

source: Qt5 WebChannel examples
ca: Exemples de WebChannel de les Qt5

source: Examples for the libqt5-qtwebchannel module.
ca: Exemples per al mòdul libqt5-qtwebchannel.

source: Non-ABI stable experimental API for the Qt5 WebChannel library
ca: API experimental estable no-ABI per a la biblioteca WebChannel de les Qt5

source: This package provides private headers of libqt5-qtwebchannel that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtwebchannel que normalment no s'utilitzen per al desenvolupament d'aplicacions i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 WebEngine Library
ca: Biblioteca del WebEngine de les Qt 5

source: Qt WebEngine provides functionality for rendering regions of dynamic web content. The functionality in Qt WebEngine is divided into the following modules: * QtWebEngineCore: Provides public API shared by both QtWebEngine and QtWebEngineWidgets * QtWebEngine: Provides QML types for rendering web content within a QML application * QtWebEngineWidgets: Provides a web browser engine as well as C++ classes to render and interact with web content
ca: Qt WebEngine proporciona funcionalitats per a la representació de regions de contingut web dinàmic. La funcionalitat en el Qt WebEngine es divideix en els següents mòduls: * QtWebEngineCore: proporciona una API pública compartida tant per QtWebEngine com per QtWebEngineWidgets * QtWebEngine: proporciona tipus QML per a renderitzar el contingut web dins d'una aplicació QML * QtWebEngineWidgets: proporciona un motor de navegador web, així com classes de C++ per a renderitzar i interactuar amb el contingut web

source: Development files for the Qt5 WebEngine library
ca: Fitxers de desenvolupament per a la biblioteca WebEngine de les Qt5

source: You need this package if you want to compile programs with Qt WebEngine.
ca: Necessiteu aquest paquet si voleu compilar programes amb el Qt WebEngine.

source: Qt5 WebEngine examples
ca: Exemples de Qt5 WebEngine

source: Examples for the libqt5-qtwebengine module.
ca: Exemples per al mòdul libqt5-qtwebengine.

source: Non-ABI stable experimental API for the Qt5 WebEngine library
ca: API experimental estable no-ABI per a la biblioteca WebEngine de les Qt5

source: This package provides private headers of libqt5-qtwebengine that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtwebengine que normalment no s'utilitzen per al desenvolupament d'aplicacions i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 QtWebKit Examples and Demos
ca: Qt 5 QtWebKit Exemples i demostracions

source: Development files for the Qt5 WebSockets library
ca: Fitxers de desenvolupament per a la biblioteca WebSockets de les Qt5

source: You need this package if you want to compile programs with QtWebSockets.
ca: Necessiteu aquest paquet si voleu compilar programes amb QtWebSockets.

source: Qt5 websockets examples
ca: Exemples de websockets de les Qt5

source: Examples for the libqt5-qtwebsockets module.
ca: Exemples per al mòdul libqt5-qtwebsockets.

source: Non-ABI stable experimental API for the Qt5 WebSocket library
ca: API experimental estable no-ABI per a la biblioteca WebSocket de les Qt5

source: This package provides private headers of libqt5-qtwebsockets that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtwebsockets que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Development files for the Qt5's Webview library
ca: Fitxers de desenvolupament per a la biblioteca Webview de les Qt5

source: You need this package if you want to compile programs with QtWebView.
ca: Necessiteu aquest paquet si voleu compilar programes amb QtWebView.

source: Qt5 webview examples
ca: Exemples de la vista web Qt5

source: Examples for libqt5-qtwebview module.
ca: Exemples per al mòdul libqt5-qtwebview.

source: Non-ABI stable experimental API for Qt5's Webview library
ca: API experimental estable no-ABI per a la biblioteca Webview de les Qt5

source: This package provides private headers of libqt5-qtwebview that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtwebview que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Development files for the Qt5 X11 Extras library
ca: Fitxers de desenvolupament per a la biblioteca Extres X11 de les Qt5

source: You need this package if you want to compile programs with qtx11extras.
ca: Necessiteu aquest paquet si voleu compilar programes amb qtx11extras.

source: Development files for the Qt5 XML Patterns library
ca: Fitxers de desenvolupament per a la biblioteca de patrons XML de les Qt5

source: You need this package if you want to compile programs with QtXmlPatterns.
ca: Necessiteu aquest paquet si voleu compilar programes amb QtXmlPatterns.

source: Qt5 xmlpatterns examples
ca: Exemples de «xmlpatterns» de les Qt5

source: Examples for the libqt5-qtxmlpatterns module.
ca: Exemples per al mòdul libqt5-qtxmlpatterns.

source: QML imports for the XmlPatterns module
ca: Importacions en QML per al mòdul XmlPatterns

source: This package provides the QtQuick.XmlListModel QML import.
ca: Aquest paquet proporciona el QtQuick.Importació en QML de XmlListModel.

source: Non-ABI stable experimental API for the Qt5 XML Patterns library
ca: API experimental estable no-ABI per a la biblioteca de patrons XML de les Qt5

source: This package provides private headers of libqt5-qtxmlpatterns that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtxmlpatterns que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Devel files for libqtxdg
ca: Desenvolupa els fitxers per a libqtxdg

source: Tools for QtXdg
ca: Eines per a QtXdg

source: Tools for QtXdg.
ca: Eines per a QtXdg.

source: Qt wrapper for libolm
ca: Embolcall de les Qt per al libolm

source: This is a Qt wrapper for libolm.
ca: Aquest és un embolcall de les Qt per al libolm.

source: Development files for libqtolm
ca: Fitxers de desenvolupament per a la libqtolm

source: The libqtolm-devel package contains libraries and header files for developing applications that use libqtolm.
ca: El paquet libqtolm-devel conté biblioteques i fitxers de capçalera per al desenvolupament d'aplicacions que utilitzen libqtolm.
