Repository: openSUSE/packages-i18n
Catalog: */po/libqt.*.po
Languages: ca

source: Development files for the Qt 5 Linguist tools
ca: Fitxers de desenvolupament per a les eines Linguist de les Qt 5

source: The Qt 5 Linguist Tools - development files.
ca: Les Qt 5 Linguist Tools - fitxers de desenvolupament.

source: Command line client for communication over D-Bus
ca: Client de línia d'ordres per a la comunicació sobre D-Bus

source: Command line client for communication over D-Bus.
ca: Client de línia d'ordres per a la comunicació a través de D-Bus.

source: Development files for the Qt5 3D library
ca: Fitxers de desenvolupament per a la biblioteca 3D de les Qt5

source: You need this package if you want to compile programs with qt3d.
ca: Necessiteu aquest paquet si voleu compilar programes amb qt3d.

source: Qt5 3D examples
ca: Exemples 3D de les Qt5

source: Examples for the libqt5-qt3d module.
ca: Exemples per al mòdul libqt5-qt3d.

source: Qt 5 3D Library - QML imports
ca: Biblioteca 3D de les Qt 5 - Importacions en QML

source: Non-ABI stable experimental API for the Qt5 3D library
ca: API experimental estable no-ABI per a la biblioteca 3D de les Qt5

source: This package provides private headers of libqt5-qt3d that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qt3d que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt5 3D tools
ca: Eines 3D de les Qt5

source: Tools for libqt5-qt3d module.
ca: Eines per al mòdul libqt5-qt3d.

source: Qt 5 Core Development Binaries
ca: Binaris de desenvolupament del nucli de les Qt 5

source: Qt 5 Core Development Binaries. It contains Qt5's moc, qmake, rcc, uic and syncqt.pl binaries.
ca: Binaris de desenvolupament del nucli de les Qt 5. Conté els binaris moc, qmake, rcc, uic i syncqt.pl de les Qt5.

source: Development files for the Qt5 base library
ca: Fitxers de desenvolupament per a la biblioteca base de les Qt5

source: You need this package if you want to compile programs with Qt. It contains the "Qt Crossplatform Development Kit". It does contain include files and development applications like GUI designers, translator tools and code generators.
ca: Necessiteu aquest paquet si voleu compilar programes amb les Qt. Conté el "Qt Crossplatform Development Kit". Conté fitxers d'inclusió i aplicacions de desenvolupament com dissenyadors d'IGU, eines de traductor i generadors de codi.

source: Qt5 base examples
ca: Exemples de base de les Qt5

source: Examples for the libqt5-qtbase modules.
ca: Exemples per als mòduls libqt5-qtbase.

source: Qt 5 gtk3 plugin
ca: Connector Qt 5 gtk3

source: Qt 5 plugin for better integration with gtk3-based desktop enviroments.
ca: Connector de les Qt 5 per a una millor integració amb els entorns d'escriptori basats en gtk3.

source: Qt 5 XDG Desktop Portal Plugin
ca: Connector de portal d'escriptori XDG de les Qt 5

source: Qt 5 plugin for integration with flatpak and snap.
ca: Connector de les Qt 5 per a la integració amb flatpak i snap.

source: Non-ABI stable experimental API
ca: API experimental estable no-ABI

source: This package provides private headers of libqt5-qtbase-devel that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtbase-devel que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 Canvas3D Addon
ca: Complement Canvas3D de les Qt 5

source: Qt Canvas 3D module provides a way to make OpenGL-like 3D drawing calls from Qt Quick JavaScript. Qt Canvas3D is a fully supported Qt module starting from Qt 5.5. Just like WebGL, Canvas3D offers a low level OpenGL-like API that enables you to execute 3D drawing commands from JavaScript. It allows easy porting of WebGL content from HTML to Qt Quick or even sharing the same WebGL code between Qt Quick and HTML applications.
ca: El mòdul 3D del Qt Canvas proporciona una manera de fer crides de dibuix en 3D semblants a l'OpenGL des del Qt Quick JavaScript. Qt Canvas3D és un mòdul Qt totalment admès que comença des de les Qt 5.5. Igual que WebGL, Canvas3D ofereix una API OpenGL de baix nivell que permet executar ordres de dibuix 3D des de JavaScript. Permet portar fàcilment el contingut WebGL des d'HTML a Qt Quick o fins i tot compartir el mateix codi WebGL entre les aplicacions Qt Quick i HTML.

source: Qt5 Canvas 3D examples
ca: Exemples 3D del llenç de les Qt5

source: Examples for libqt5-qtcanvas3d module.
ca: Exemples per al mòdul libqt5-qtcanvas3d.

source: Example programs for the Qt 5 Charts Library
ca: Programes d'exemple per a la biblioteca de diagrames de les Qt 5

source: Examples for Qt5 Charts module.
ca: Exemples per al mòdul Gràfics de les Qt5.

source: QML imports for the Qt 5 Charts Library
ca: Importacions en QML per a la biblioteca de diagrames de les Qt 5

source: This package contains QML import files.
ca: Aquest paquet conté fitxers d'importació en QML.

source: You need this package, if you want to compile programs with qtsensors.
ca: Necessiteu aquest paquet, si voleu compilar programes amb qtsensors.

source: Qt5 location examples
ca: Exemples d'ubicació de les Qt5

source: Examples for libqt5-qtconnectivity module.
ca: Exemples per al mòdul libqt5-qtconnectivity.

source: This package provides private headers of libqt5-qtsensors that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtsensors que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Examples for the Qt5 Data Visualization module
ca: Exemples per al mòdul de visualització de dades de les Qt5

source: This package provides examples for Qt 5 Data Visualization module.
ca: Aquest paquet proporciona exemples per al mòdul de visualització de dades Qt 5.

source: QML imports for the Qt5 Data Visualization module
ca: Importacions en QML per al mòdul de visualització de dades de les Qt5

source: This package contains QML import files for Qt5 Data Visualization module.
ca: Aquest paquet conté fitxers d'importació en QML per al mòdul de visualització de dades de les Qt5.

source: You need this package, if you want to compile programs with qtdeclarative.
ca: Necessiteu aquest paquet, si voleu compilar programes amb qtdeclarative.

source: Qt5 quick/qml examples
ca: Exemples de Qt5 quick/qml

source: Examples for libqt5-qtdeclarative (quick/qml) modules.
ca: Exemples de mòduls libqt5-qtdeclaratiu (quick/qml).

source: This package provides private headers of libqt5-qtdeclarative that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtdeclarative que normalment no s'utilitzen per al desenvolupament d'aplicacions i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 Declarative Tools
ca: Eines declaratives de les Qt 5

source: Qt is a set of libraries for developing applications. This package contains aditional tools for inspecting, testing, viewing, etc, QML imports and files.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. Aquest paquet conté eines addicionals per a inspeccionar, provar, visualitzar, etc., importacions i fitxers en QML.

source: Qt 5 API Documentation
ca: Documentació de l'API de les Qt 5

source: Qt is a set of libraries for developing applications. This package pulls in the API documentation in HTML and QCH format.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. Aquest paquet treu la documentació de l'API en format HTML i QCH.

source: QDoc index files and doxygen tag files for Qt 5 API Documentation
ca: Fitxers d'índex QDoc i fitxers d'etiquetes doxygen per a la documentació de l'API de les Qt 5

source: This package contains the QDoc index files and the doxygen tag files to create cross links between the QCH documentation files. This package is normally not required.
ca: Aquest paquet conté els fitxers d'índex QDoc i els fitxers d'etiquetes doxygen per a crear enllaços creuats entre els fitxers de documentació QCH. Aquest paquet normalment no és necessari.

source: Qt 5 API Documentation in HTML format
ca: Documentació de l'API de les Qt 5 en format HTML

source: This package contains the Qt API documentation in html format.
ca: Aquest paquet conté la documentació de l'API de les Qt en format HTML.

source: Qt 5 API Documentation in QCH format
ca: Documentació de l'API de les Qt 5 en format QCH

source: This package contains the Qt API Documentation in QCH format, which can be used by tools like KDevelop, Qt Assistant, Qt Creator, etc.
ca: Aquest paquet conté la documentació de l'API de les Qt en format QCH, la qual es pot utilitzar amb eines com KDevelop, Qt Assistant, Qt Creator, etc.

source: Development files for the Qt5 gamepad library
ca: Fitxers de desenvolupament per a la biblioteca del gamepad de les Qt5

source: You need this package if you want to compile programs with QtGamepad.
ca: Necessiteu aquest paquet si voleu compilar programes amb el QtGamepad.

source: Qt5 gamepad examples
ca: Exemples del comandament de joc Qt5

source: Examples for the libqt5-qtgamepad module.
ca: Exemples per al mòdul libqt5-qtgamepad.

source: QML imports for the Qt5 Gamepad module
ca: Importacions en QML per al mòdul del Gamepad de les Qt5

source: This package contains QML import files for the Qt5 Gamepad module.
ca: Aquest paquet conté fitxers d'importació en QML per al mòdul del Gamepad de les Qt5.

source: Non-ABI stable experimental API for the Qt5 gamepad library
ca: API experimental estable no-ABI per a la biblioteca del gamepad de les Qt5

source: This package provides private headers of libqt5-qtgamepad that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtgamepad que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 Graphical Effects
ca: Efectes gràfics de les Qt 5

source: Qt 5 Image Format Plugins
ca: Connectors de format d'imatge de les Qt 5

source: Qt is a set of libraries for developing applications. This package contains qtimageformats. You need this package, if you want to compile programs with qtimageformats.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. Aquest paquet conté qtimageformats. Necessiteu aquest paquet, si voleu compilar programes amb qtimageformats.

source: Development files for the Qt5 Location Library
ca: Fitxers de desenvolupament per a la biblioteca d'ubicació de les Qt5

source: The Qt Location API facilitates creating mapping solutions using the data available from some contemporary location services. This subpackage contains the header files for developing applications that want to make use of the Qt Location libraries.
ca: L'API de localització de les Qt facilita la creació de solucions de mapatge utilitzant les dades disponibles d'alguns serveis d'ubicació contemporanis. Aquest subpaquet conté els fitxers de capçalera per a desenvolupar aplicacions que volen fer ús de les biblioteques de localització de les Qt.

source: Examples for libqt5-qtlocation module.
ca: Exemples per al mòdul libqt5-qtlocation.

source: Non-ABI stable experimental API for the Qt5 Location Library
ca: API experimental estable no-ABI per a la biblioteca d'ubicació de les Qt5

source: This package provides private headers of libqt5-qtlocation that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtlocation que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 Quick Lottie Addon
ca: Addó de «Lottie» ràpida de les Qt 5

source: This package provides a QML module for Qt 5 which allows playing of BodyMovin files from QML.
ca: Aquest paquet proporciona un mòdul QML per a les Qt 5 que permet reproduir fitxers BodyMovin des del QML.

source: Development files for the Qt5 Multimedia library
ca: Fitxers de desenvolupament per a la biblioteca multimèdia Qt5

source: You need this package if you want to compile programs with qtmultimedia.
ca: Necessiteu aquest paquet si voleu compilar programes amb qtmultimedia.

source: Qt5 multimedia examples
ca: Exemples multimèdia de les Qt5

source: Examples for the libqt5-qtmultimedia module.
ca: Exemples per al mòdul libqt5-qtmultimedia.

source: Non-ABI stable experimental API for the Qt5 Multimedia library
ca: API experimental estable no-ABI per a la biblioteca multimèdia Qt5

source: This package provides private headers of libqt5-qtmultimedia that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtmultimedia que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Development files for the Qt5 NetworkAuth Library
ca: Fitxers de desenvolupament per a la biblioteca NetworkAuth de les Qt5

source: Qt Network Authorization provides a set of APIs that enable Qt applications to obtain limited access to online accounts and HTTP services without exposing users' passwords. This subpackage contains the header files for developing applications that want to make use of libQt5NetworkAuth5.
ca: L'autorització de xarxa de Qt proporciona un conjunt d'API que permeten a les aplicacions Qt obtenir un accés limitat als comptes en línia i als serveis HTTP sense exposar les contrasenyes dels usuaris. Aquest subpaquet conté els fitxers de capçalera per a desenvolupar aplicacions que volen fer ús de la libQt5NetworkAuth5.

source: Qt5 networkauth examples
ca: Exemples de networkauth de les Qt5

source: Examples for libqt5-qtnetworkauth module.
ca: Exemples per al mòdul libqt5-qtnetworkauth.

source: Non-ABI stable experimental API for the Qt5 NetworkAuth Library
ca: API experimental estable no-ABI per a la biblioteca NetworkAuth de les Qt5

source: This package provides private headers of libqt5-qtnetworkauth that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtnetworkauth que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Command line client to QStandardPaths
ca: Client de línia d'ordres a QStandardPaths

source: Command line client to QStandardPaths.
ca: Client de línia d'ordres a QStandardPaths.

source: Development files for the Qt5 PDF library
ca: Fitxers de desenvolupament per a la biblioteca PDF de les Qt5

source: You need this package if you want to compile programs with Qt PDF.
ca: Necessiteu aquest paquet si voleu compilar programes amb Qt PDF.

source: Qt5 PDF examples
ca: Exemples de PDF de les Qt5

source: Examples for the libqt5-qtpdf module.
ca: Exemples per al mòdul libqt5-qtpdf.

source: Qt5 PDF module for QML
ca: Mòdul PDF de les Qt5 per al QML

source: Qt Quick module for the Qt PDF library.
ca: Mòdul Qt Quick per a la biblioteca Qt PDF.

source: Non-ABI stable experimental API for the Qt5 PDF library
ca: API experimental estable no-ABI per a la biblioteca PDF de les Qt5

source: This package provides private headers of libqt5-qtpdf that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtpdf que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: You need this package if you want to compile programs with Qt Quick 3D.
ca: Necessiteu aquest paquet si voleu compilar programes amb Qt Quick 3D.

source: Qt5 Quick 3D examples
ca: Exemples 3D ràpids de les Qt5

source: Examples for the Qt Quick 3D module.
ca: Exemples per al mòdul 3D de les Qt Quick.

source: QML API for Qt Quick 3D.
ca: API QML per a Qt Quick 3D.

source: Headers for the unstable API of the Qt5 Quick 3D module
ca: Capçaleres per a l'API inestable del mòdul 3D ràpid de les Qt5

source: You need this package if you want to compile programs against the unstable API of the Qt5 Quick 3D module.
ca: Necessiteu aquest paquet si voleu compilar programes contra l'API inestable del mòdul 3D ràpid de les Qt5.

source: Tools for working with the Qt Quick 3D module.
ca: Eines per a treballar amb el mòdul 3D de les Qt Quick.

source: Qt 5 Quick Controls Addon
ca: Complement de controls ràpids de les Qt 5

source: The Qt Quick Controls module provides a set of controls that can be used to build complete interfaces in Qt Quick.
ca: El mòdul Qt Quick Controls proporciona un conjunt de controls que es poden utilitzar per a construir interfícies completes a Qt Quick.

source: Qt5 quickcontrols examples
ca: Exemples de controls ràpids de les Qt5

source: Examples for libqt5-qtquickcontrols module.
ca: Exemples per al mòdul libqt5-qtquickcontrols.

source: The Qt Quick Controls2 module provides a set of controls that can be used to build complete interfaces in Qt Quick.
ca: El mòdul Qt Quick Controls2 proporciona un conjunt de controls que es poden utilitzar per a construir interfícies completes a Qt Quick.

source: Qt5 quickcontrols2 examples
ca: Exemples de controls ràpids de les Qt52

source: Examples for libqt5-qtquickcontrols2 module.
ca: Exemples per al mòdul libqt5-qtquickcontrols2.

source: Headers for the unstable API of the Qt5 QuickControls2 module
ca: Capçaleres per a l'API inestable del mòdul QuickControls2 de les Qt5

source: You need this package if you want to compile programs against the unstable API of the Qt5 QuickControls 2 module.
ca: Necessiteu aquest paquet si voleu compilar programes contra l'API inestable del mòdul Qt5 QuickControls 2.

source: Qt 5 Quick Timeline Addon
ca: Complement de línia de temps ràpida de les Qt 5

source: The Qt Quick Timeline module provides QML types to use timelines and keyframes to animate Qt Quick user interfaces.
ca: El mòdul Línia de temps ràpida de les Qt proporciona tipus QML per a utilitzar línies de temps i fotogrames clau per a animar les interfícies d'usuari de Qt Quick.

source: Development files for the Qt5 RemoteObjects library
ca: Fitxers de desenvolupament per a la biblioteca RemoteObjects de les Qt5

source: Qt Remote Objects (QtRO) is an inter-process communication (IPC) processes or computers. You need this package if you want to compile programs with QtRemoteObjects.
ca: Qt Remote Objects (QtRO) és un procés de comunicació entre processos (IPC) o ordinadors. Necessiteu aquest paquet si voleu compilar programes amb QtRemoteObjects.

source: Qt5 remoteobjects examples
ca: Exemples d'objectes remots de les Qt5

source: Examples for the libqt5-qtremoteobjects module.
ca: Exemples per al mòdul libqt5-qtremoteobjects.

source: Non-ABI stable experimental API for the Qt5 RemoteObjects library
ca: API experimental estable no-ABI per a la biblioteca RemoteObjects de les Qt5

source: This package provides private headers of libqt5-qtremoteobjects that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtremoteobjects que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 RemoteObjects Tools
ca: Eines d'objectes remots de les Qt 5

source: Qt Remote Objects (QtRO) is an inter-process communication (IPC) processes or computers. This package contains REPC, a compiler for Qt RemoteObjects API definition files.
ca: Qt Remote Objects (QtRO) és un procés de comunicació entre processos (IPC) o ordinadors. Aquest paquet conté REPC, un compilador per als fitxers de definició de l'API de Qt RemoteObjects.

source: Development files for the Qt 5 Script library
ca: Fitxers de desenvolupament per a la biblioteca de scripts de les Qt 5

source: Qt Script is a module for adding scripting to applications. This subpackage contains the header files for developing applications that want to make use of libQt5Script5.
ca: Qt Script és un mòdul per a afegir scripts a les aplicacions. Aquest subpaquet conté els fitxers de capçalera per a desenvolupar aplicacions que volen fer ús de la libQt5Script5.

source: Qt5 Script examples
ca: Exemples de script de les Qt5

source: Examples for libqt5-qtscript module.
ca: Exemples per al mòdul libqt5-qtscript.

source: Non-ABI stable experimental API for the Qt5 Script library
ca: API experimental estable no-ABI per a la biblioteca de scripts de les Qt5

source: This package provides private headers of libqt5-qtscript that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtscript que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Development files for Qt5's State Chart XML library
ca: Fitxers de desenvolupament per a la biblioteca XML de diagrama d'estats de les Qt5

source: You need this package if you want to compile programs with QtScxml.
ca: Necessiteu aquest paquet si voleu compilar programes amb QtScxml.

source: Qt5 State Chart XML examples
ca: Exemples XML de diagrama d'estats de les Qt5

source: Examples for libqt5-qtscxml module.
ca: Exemples per al mòdul libqt5-qtscxml.

source: Non-ABI stable experimental API for Qt5's State Chart XML library
ca: API experimental estable no-ABI per a la biblioteca XML de diagrama d'estats de les Qt5
