Repository: openSUSE/packages-i18n
Catalog: */po/libqt.*.po
Languages: ca

source: Qt5 PDF library for Qt Widgets
ca: Biblioteca PDF Qt5 per als ginys de les Qt

source: Library of the Qt PDF module with support for Qt Widgets.
ca: Biblioteca del mòdul PDF de les Qt amb suport per als ginys de les Qt.

source: Qt 5 PlatformHeaders
ca: Capçaleres de plataforma Qt 5

source: Qt 5 PlatformHeaders.
ca: Capçaleres de plataforma Qt 5.

source: Qt PlatformSupport module
ca: Mòdul d'assistència a la plataforma Qt

source: Qt PlatformSupport module.
ca: Mòdul Qt PlatformSupport.

source: Non-ABI stable experimental API for the Qt5 platform support library
ca: API experimental estable no-ABI per a la biblioteca de suport a la plataforma Qt5

source: This package provides private headers of libQt5PlatformSupport that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libQt5PlatformSupport que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 Positioning Library
ca: Biblioteca de posicionament de les Qt 5

source: The Qt Positioning API gives developers the ability to determine a position by using a variety of possible sources, including satellite, WiFi, text file, and so on. That information can then be used to, for example, determine a position on a map. In addition, satellite information can be retrieved and area-based monitoring be performed.
ca: L'API de posicionament de les Qt dona als desenvolupadors la possibilitat de determinar una posició utilitzant una varietat de fonts possibles, incloent satèl·lit, WiFi, fitxer de text, etc. Aquesta informació pot utilitzar-se per a, per exemple, determinar una posició en un mapa. A més, es pot recuperar la informació per satèl·lit i realitzar un seguiment basat en l'àrea.

source: Qt5 Positioning Library for Qt Quick
ca: Biblioteca de posicionament de les Qt5 per a les Qt Quick

source: This library contains glue code for using the Qt Location module in Qt Quick applications.
ca: Aquesta biblioteca conté el codi d'adhesió per a utilitzar el mòdul Qt Location a les aplicacions Qt Quick.

source: Development files for the Qt5 print support library
ca: Fitxers de desenvolupament per a la biblioteca de suport d'impressió de les Qt5

source: Development files for the Qt5 print support library.
ca: Fitxers de desenvolupament per a la biblioteca de suport d'impressió de les Qt5.

source: Non-ABI stable experimental API for the Qt5 print support library
ca: API experimental estable no-ABI per a la biblioteca de suport d'impressió de les Qt5

source: This package provides private headers of libQt5PrintSupport that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libQt5PrintSupport que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 Print Support Library
ca: Biblioteca de suport a la impressió de les Qt 5

source: An abstraction over the platform-specific printing systems. Using this library, Qt applications can print to attached printers and across networks to remote printers. Qt's printing system also supports PDF file generation, providing the foundation for basic report generation facilities.
ca: Una abstracció sobre els sistemes d'impressió específics de la plataforma. Utilitzant aquesta biblioteca, les aplicacions Qt poden imprimir a impressores adjuntes i a través de xarxes a impressores remotes. El sistema d'impressió de les Qt també admet la generació de fitxers PDF, proporcionant la base per a les instal·lacions bàsiques de generació d'informes.

source: Qt5 Quick3D Library
ca: Biblioteca Quick3D de les Qt5

source: Qt Quick 3D is a high level 3D API for Qt Quick. Qt Quick 3D enables anyone to introduce 3D content into their Qt Quick applications. Rather than requiring the end user to know advanced details of the graphicsrendering pipeline (building framegraphs and materials), it is now possible to simply build up a 3D scene using high level primitives.
ca: Qt Quick 3D és una API 3D d'alt nivell per a Qt Quick. Qt Quick 3D permet que qualsevol persona introdueixi contingut 3D a les seves aplicacions Qt Quick. En lloc d'exigir a l'usuari final que conegui detalls avançats de la canonada de renderització gràfica (construint fotogrames i materials), ara és possible simplement construir una escena 3D utilitzant primitives d'alt nivell.

source: Qt5 Quick3D Asset Importing Library
ca: Biblioteca d'importació d'actius Quick3D de les Qt5

source: Qt Quick 3D Library for importing of 3D assets.
ca: Biblioteca 3D ràpida de les Qt per a la importació d'actius 3D.

source: Qt 5 QuickControl2 Library
ca: Biblioteca QuickControl2 de les Qt 5

source: Qt is a set of libraries for developing applications. This package contains base tools, like string, xml, and network handling.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. Aquest paquet conté eines base, com cadenes, xml i gestió de xarxa.

source: You need this package if you want to compile programs with qtquickcontrols2.
ca: Necessiteu aquest paquet si voleu compilar programes amb qtquickcontrols2.

source: Qt5 QuickTemplates2 Library
ca: Biblioteca QuickTemplates2 de les Qt5

source: Qt 5 RemoteObjects Library
ca: Biblioteca d'objectes remots de les Qt 5

source: Qt Remote Objects (QtRO) is an inter-process communication (IPC) processes or computers.
ca: Qt Remote Objects (QtRO) és un procés de comunicació entre processos (IPC) o ordinadors.

source: Qt 5 Script library
ca: Biblioteca de scripts de les Qt 5

source: Qt Script is a module for adding scripting to applications. It allows evaluating and debugging of scripts, and advanced use of objects and functions. It also gives access to a low-level ECMAScript engine API.
ca: Qt Script és un mòdul per a afegir scripts a les aplicacions. Permet avaluar i depurar scripts, i l'ús avançat d'objectes i funcions. També dona accés a una API de motor ECMAScript de baix nivell.

source: Qt 5 State Chart XML Library
ca: Biblioteca XML del diagrama d'estats de les Qt 5

source: Qt is a set of libraries for developing applications. The Qt SCXML module provides functionality to create state machines from SCXML files. This includes both dynamically creating state machines (loading the SCXML file and instantiating states and transitions) and generating a C++ file that has a class implementing the state machine. It also contains functionality to support data models and executable content.
ca: Qt és un conjunt de biblioteques per a desenvolupar aplicacions. El mòdul SCXML de les Qt proporciona funcionalitat per a crear màquines d'estat a partir de fitxers SCXML. Això inclou tant la creació dinàmica de màquines d'estat (carregant el fitxer SCXML i els estats i transicions instantànies) com la generació d'un fitxer C++ que tingui una classe implementant la màquina d'estats. També conté funcionalitats per donar suport a models de dades i contingut executable.

source: Qt 5 Scxml Addon - QML imports
ca: Addó Scxml de les Qt 5 - Importacions en QML

source: The Qt SCXML module provides functionality to create state machines from SCXML files. The Qt SCXML module provides functionality to create state machines from SCXML files. It also contains functionality to support data models and executable content.
ca: El mòdul SCXML de les Qt proporciona funcionalitat per a crear màquines d'estat a partir de fitxers SCXML. El mòdul SCXML de les Qt proporciona funcionalitat per a crear màquines d'estat a partir de fitxers SCXML. També conté funcionalitats per donar suport a models de dades i contingut executable.

source: Qt 5 Sensors library
ca: Biblioteca de sensors de les Qt 5

source: The Qt Sensors API provides access to sensor hardware via QML and C++ interfaces. The Qt Sensors API also provides a motion gesture recognition API for devices.
ca: L'API de sensors Qt proporciona accés al maquinari de sensors mitjançant interfícies QML i C++. L'API dels Sensors de les Qt també proporciona una API de reconeixement de gestos de moviment per als dispositius.

source: QML imports for the Qt 5 Sensors library
ca: Importacions en QML per a la biblioteca de sensors de les Qt 5

source: Qt 5 Serial Bus Addon
ca: Complement de bus sèrie de les Qt 5

source: The Qt Serial Bus API provides classes and functions to access the various industrial serial buses and protocols, such as CAN, ModBus, and others. This package contains base tools, like string, xml, and network handling.
ca: L'API de Qt Serial Bus proporciona classes i funcions per accedir als diversos autobusos i protocols de sèrie industrial, com CAN, ModBus i altres. Aquest paquet conté eines base, com cadenes, xml i gestió de xarxa.

source: Qt 5 Serial Port Addon
ca: Complement del port sèrie de les Qt 5

source: Qt Serial Port provides the basic functionality, which includes configuring, I/O operations, getting and setting the control signals of the RS-232 pinouts. This module does not support terminal features (echo, CR/LF control, text mode, timeouts/delays, or poinout signal change notification).
ca: El port sèrie de les Qt proporciona la funcionalitat bàsica, que inclou la configuració, les operacions d'E/S, obtenir i establir els senyals de control dels pinouts RS-232. Aquest mòdul no admet característiques de terminal (echo, control CR/LF, mode de text, temps d'espera/retard o notificació de canvi de senyal poinout).

source: Development files for the Qt5 SQL library
ca: Fitxers de desenvolupament per a la biblioteca SQL de les Qt5

source: Qt 5 libraries which are used for connection with an SQL server. You will need also a plugin package for a supported SQL server.
ca: Biblioteques de les Qt 5 que s'utilitzen per a la connexió amb un servidor SQL. També necessitareu un paquet de connectors per a un servidor SQL compatible.

source: Non-ABI stable experimental API for the Qt5 SQL library
ca: API experimental estable no-ABI per a la biblioteca SQL de les Qt5

source: This package provides private headers of libQt5Sql that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libQt5Sql que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 SQL related libraries
ca: Biblioteques relacionades amb SQL de les Qt 5

source: Qt 5 MySQL support
ca: Implementació de MySQL de les Qt 5

source: A plugin to support MySQL server in Qt applications.
ca: Un connector per a admetre el servidor MySQL a les aplicacions Qt.

source: Qt 5 PostgreSQL plugin
ca: Connector PostgreSQL de les Qt 5

source: The Qt SQL module uses driver plugins to communicate with the different database APIs. The QPSQL driver supports version 7.3 and higher of the PostgreSQL server.
ca: El mòdul SQL de les Qt utilitza connectors de controlador per a comunicar-se amb les diferents API de la base de dades. El controlador QPSQL suporta la versió 7.3 i superior del servidor PostgreSQL.

source: Qt 5 sqlite plugin
ca: Connector sqlite de les Qt 5

source: The Qt SQL module uses driver plugins to communicate with the different database APIs. The Qt SQLite plugin makes it possible to access SQLite databases. SQLite is an in-process database, which means that it is not necessary to have a database server. SQLite operates on a single file, which must be set as the database name when opening a connection.
ca: El mòdul SQL de les Qt utilitza connectors de controlador per a comunicar-se amb les diferents API de la base de dades. El connector SQLite de les Qt permet accedir a bases de dades SQLite. SQLite és una base de dades en procés, el que significa que no és necessari tenir un servidor de base de dades. SQLite opera sobre un sol fitxer, el qual s'ha d'establir com a nom de la base de dades en obrir una connexió.

source: Qt 5 unixODBC plugin
ca: Connector unixODBC de les Qt 5

source: The Qt SQL module uses driver plugins to communicate with the different database APIs. The QODBC driver allows to connect to an ODBC driver manager and access the available data sources. Note that you also need to install and configure ODBC drivers for the ODBC driver manager that is installed on your system.
ca: El mòdul SQL de les Qt utilitza connectors de controlador per a comunicar-se amb les diferents API de la base de dades. El controlador QODBC permet connectar-se a un gestor de controladors ODBC i accedir a les fonts de dades disponibles. Tingueu en compte que també heu d'instal·lar i configurar els controladors ODBC per al gestor de controladors ODBC que està instal·lat al vostre sistema.

source: Qt 5 SVG Library
ca: Biblioteca SVG de les Qt 5

source: The Qt SVG module provides functionality for displaying SVG images as a widget, and to create SVG files using drawing commands.
ca: El mòdul SVG de les Qt proporciona funcionalitat per a mostrar imatges SVG com a giny i per a crear fitxers SVG utilitzant ordres de dibuix.

source: Development files for the Qt5 testing library
ca: Fitxers de desenvolupament per a la biblioteca de proves de les Qt5

source: Development files for the Qt5 testing library.
ca: Fitxers de desenvolupament per a la biblioteca de proves de les Qt5.

source: Non-ABI stable experimental API for the Qt5 test library
ca: API experimental estable no-ABI per a la biblioteca de proves de les Qt5

source: This package provides private headers of libQt5Test that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libQt5Test que normalment no s'utilitzen per al desenvolupament d'aplicacions i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 Test Library
ca: Biblioteca de proves de les Qt 5

source: Qt Test is a framework for unit testing Qt based applications and libraries. Qt Test provides functionality commonly found in unit testing frameworks as well as extensions for testing graphical user interfaces.
ca: Qt Test és un marc de treball per a provar unitats basades en aplicacions i biblioteques Qt. Qt Test proporciona funcionalitats que es troben comunament en els marcs de treball de prova d'unitats, així com extensions per provar interfícies gràfiques d'usuari.

source: Qt 5 Speech Addon
ca: Complement de veu de Qt 5

source: Qt is a set of libraries for developing applications. The module enables a Qt application to support accessibility features such as text-to-speech, which is useful for end-users who are visually challenged or cannot access the application for whatever reason.
ca: Les Qt són un conjunt de biblioteques per a desenvolupar aplicacions. El mòdul permet que una aplicació Qt admeti característiques d'accessibilitat com ara text a veu, que és útil per als usuaris finals que tenen problemes visuals o que no poden accedir a l'aplicació per qualsevol motiu.

source: Qt5 Virtual Keyboard library
ca: Biblioteca de teclat virtual Qt5

source: Qt 5 Wayland Addon
ca: Complement Wayland de Qt 5

source: Qt 5 WebChannel Addon
ca: Complement WebChannel de les Qt 5

source: Qt WebChannel enables peer-to-peer communication between a server (QML/C++ application) and a client (HTML/JavaScript or QML application). The module provides a JavaScript library for seamless integration of C++ and QML applications with HTML/JavaScript and QML clients. The clients must use the JavaScript library to access the serialized QObjects published by the host applications.
ca: Qt WebChannel permet la comunicació entre parells entre un servidor (aplicació QML/C++) i un client (aplicació HTML/JavaScript o QML). El mòdul proporciona una biblioteca JavaScript per a la integració perfecta d'aplicacions C++ i QML amb clients HTML/JavaScript i QML. Els clients han d'utilitzar la biblioteca JavaScript per accedir als QObjects serialitzats publicats per les aplicacions host.

source: QML imports for the Qt5 WebSockets library
ca: Importacions en QML per a la biblioteca WebSockets de les Qt5

source: The module provides a JavaScript library for seamless integration of C++ and QML applications with HTML/JavaScript and QML clients.
ca: El mòdul proporciona una biblioteca JavaScript per a la integració perfecta d'aplicacions C++ i QML amb clients HTML/JavaScript i QML.

source: Non-ABI stable experimental API for the Qt5 WebKit library
ca: API experimental estable no-ABI per a la biblioteca WebKit de les Qt5

source: This package provides private headers of libqt5-qtwebkit that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libqt5-qtwebkit que normalment no s'utilitzen per al desenvolupament d'aplicacions i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt5 WebKit Library
ca: Biblioteca WebKit de les Qt5

source: You need this package if you want to compile programs with QtWebKit.
ca: Necessiteu aquest paquet si voleu compilar programes amb QtWebKit.

source: Development files for the Qt5 WebKit library
ca: Fitxers de desenvolupament per a la biblioteca WebKit de les Qt5

source: QML imports for the Qt5 WebKit library
ca: Importacions en QML per a la biblioteca WebKit de les Qt5

source: Development files for the Qt5 WebKit Widgets library
ca: Fitxers de desenvolupament per a la biblioteca de ginys WebKit de les Qt5

source: Non-ABI stable experimental API for the Qt5 WebKit Widgets library
ca: API experimental estable no-ABI per a la biblioteca de ginys WebKit de les Qt5

source: Qt 5 WebKit Widget library
ca: Biblioteca de ginys WebKit de les Qt 5

source: The QtWebKit module provides the WebView API which allows QML applications to render regions of dynamic web content. A WebView component may share the screen with other QML components or encompass the full screen as specified within the QML application.
ca: El mòdul QtWebKit proporciona l'API WebView que permet a les aplicacions QML renderitzar regions de contingut web dinàmic. Un component WebView pot compartir la pantalla amb altres components QML o incloure la pantalla completa com s'especifica dins de l'aplicació QML.

source: Qt 5 WebSockets Library
ca: Biblioteca WebSockets de les Qt 5

source: The Qt WebSockets module provides C++ and QML interfaces that enable Qt applications to act as a server that can process WebSocket requests, or a client that can consume data received from the server, or both.
ca: El mòdul Qt WebSockets proporciona interfícies C++ i QML que permeten a les aplicacions Qt actuar com un servidor que pot processar les sol·licituds del WebSocket, o un client que pot consumir les dades rebudes del servidor, o ambdues.

source: QML imports for the Qt 5 WebSockets library
ca: Importacions en QML per a la biblioteca WebSockets de les Qt 5

source: Qt 5 WebView Library
ca: Biblioteca WebView de les Qt 5

source: Qt WebView provides a way to display web content in a QML application without necessarily including a full web browser stack by using native APIs where it makes sense.
ca: Qt WebView proporciona una manera de mostrar el contingut web en una aplicació en QML sense incloure necessàriament una pila completa de navegador web mitjançant l'ús d'APIs natives, on té sentit.

source: Qt 5 WebView Library - QML imports
ca: Biblioteca WebView de les Qt 5 - Importacions en QML

source: Development files for the Qt5 widgets library
ca: Fitxers de desenvolupament per a la biblioteca de ginys de les Qt5

source: Development files for the Qt5 widgets library.
ca: Fitxers de desenvolupament per a la biblioteca de ginys de les Qt5.

source: Non-ABI stable experimental API for the Qt5 widgets library
ca: API experimental estable no-ABI per a la biblioteca de ginys de les Qt5

source: This package provides private headers of libQt5Widgets that are normally not used by application development and that do not have any ABI or API guarantees. The packages that build against these have to require the exact Qt version.
ca: Aquest paquet proporciona capçaleres privades de libQt5Widgets que normalment no s'utilitzen per al desenvolupament de l'aplicació i que no tenen cap garantia ABI o API. Els paquets que es construeixen contra aquests han de requerir la versió exacta de les Qt.

source: Qt 5 Widgets Library
ca: Biblioteca de ginys de les Qt 5

source: The Qt Widgets Module provides a set of UI elements to create classic desktop-style user interfaces.
ca: El mòdul de ginys de les Qt proporciona un conjunt d'elements d'interfície d'usuari per a crear interfícies d'usuari clàssiques d'estil d'escriptori.

source: Qt 5 X11 Extras Addon
ca: Complement extra de les Qt 5 X11

source: Qt X11 Extras enables the Qt programmer to write applications for the Linux/X11 platform. (Applications developed with Qt can also be deployed across several other desktop and embedded operating systems without having to rewrite the source code.)
ca: Qt X11 Extras permet al programador Qt escriure aplicacions per a la plataforma Linux/X11. (Les aplicacions desenvolupades amb Qt també es poden desplegar a través de diversos altres sistemes operatius incrustats sense haver de reescriure el codi font.)

source: Libraries for qtxdg
ca: Biblioteques per a qtxdg

source: QtXDG libraries for development
ca: Biblioteques QtXDG per al desenvolupament

source: Devel files for libQt5XdgIconLoader
ca: Desenvolupa els fitxers per a libQt5XdgIconLoader

source: Development files for QtXDG icon loader libraries used in LXQt
ca: Fitxers de desenvolupament per a les biblioteques del carregador d'icones QtXDG utilitzades a LXQt

source: IconLoader library for QtXDG
ca: Biblioteca IconLoader per al QtXDG

source: QtXDG icon loader libraries used in LXQt
ca: Biblioteques del carregador d'icones QtXDG utilitzades a LXQt

source: Development files for the Qt5 XML library
ca: Fitxers de desenvolupament per a la biblioteca XML de les Qt5

source: Development files for the Qt5 XML library. (The module is not actively maintained anymore. Please use the QXmlStreamReader and QXmlStreamWriter classes in Qt Core instead.)
ca: Fitxers de desenvolupament per a la biblioteca XML de les Qt5. (El mòdul ja no es manté activament. Utilitzeu les classes QXmlStreamReader i QXmlStreamWriter al Qt Core.)

source: Qt 5 Xml Library
ca: Biblioteca Xml de les Qt 5

source: The Qt XML module provides C++ implementations of the SAX and DOM standards for XML.
ca: El mòdul Qt XML proporciona implementacions de C++ dels estàndards SAX i DOM per a XML.

source: Qt 5 XmlPatterns Library
ca: Biblioteca XmlPatterns de les Qt 5

source: The Qt XML Patterns module provides support for XPath, XQuery, XSLT, and XML Schema validation.
ca: El mòdul Patrons XML de les Qt proporciona suport per a la validació de l'esquema XPath, XQuery, XSLT i XML.

source: Qt 5 Declarative Library
ca: Biblioteca Declarativa de les Qt 5

source: Qt 5 Linguist Tools
ca: Eines de Linguist de les Qt 5

source: The Qt 5 Linguist Tools.
ca: Les Qt 5 Linguist Tools.
