Repository: openSUSE/packages-i18n
Catalog: */po/mate.*.po
Languages: ca, fr

source: Translations for package mate-tweak
ca: Traduccions per al paquet mate-tweak
fr: Traductions pour le paquet mate-tweak

source: Provides translations for the "mate-tweak" package.
ca: Proporciona traduccions per al paquet «mate-tweak».
fr: Fournit les traductions pour le paquet "mate-tweak".

source: User guide for the MATE desktop
ca: Guia d'usuari per a l'escriptori MATE
fr: Guide utilisateur pour le bureau MATE

source: This package contains documentation targeted for end-users of MATE Desktop Environment with general MATE applicability.
ca: Aquest paquet conté documentació dirigida als usuaris finals de l'entorn d'escriptori MATE amb aplicabilitat general MATE.
fr: Ce paquet contient de la documentation destinée aux utilisateurs finaux de l'environnement de bureau MATE, avec une compatibilité générale avec MATE.

source: Translations for package mate-user-guide
ca: Traduccions per al paquet mate-user-guide
fr: Traductions pour le paquet mate-user-guide

source: Provides translations for the "mate-user-guide" package.
ca: Proporciona traduccions per al paquet «mate-user-guide».
fr: Fournit les traductions pour le paquet "mate-user-guide".

source: MATE Desktop file sharing for the masses
ca: Compartició de fitxers d'escriptori MATE per a les masses
fr: Partage de fichiers sur le bureau MATE pour les masses

source: mate-user-share is a small package that binds together various free software projects to bring easy to use user-level file sharing to the masses.
ca: mate-user-share és un petit paquet que uneix diversos projectes de programari lliure per a facilitar l'ús de la compartició de fitxers a nivell d'usuari a les masses.
fr: mate-user-share est un petit paquet qui rassemble plusieurs projets de logiciels libres afin d'apporter au plus grand nombre un partage de fichiers au niveau de l'utilisateur facile à utiliser.

source: Documentation how to Use mate-user-share
ca: Documentació sobre com utilitzar mate-user-share
fr: Documentation sur l'utilisation de mate-user-share

source: This package contains the documentation for mate-user-share
ca: Aquest paquet conté la documentació per a mate-user-share
fr: Ce paquet contient la documentation pour mate-user-share

source: Translations for package mate-user-share
ca: Traduccions per al paquet mate-user-share
fr: Traductions pour le paquet mate-user-share

source: Provides translations for the "mate-user-share" package.
ca: Proporciona traduccions per al paquet «mate-user-share».
fr: Fournit les traductions pour le paquet "mate-user-share".

source: Languages for MATE utilities
ca: Llengües per a utilitats de MATE
fr: Langues pour les utilitaires MATE

source: Provides common translations shared by Caja extensions
ca: Proporciona traduccions comunes compartides per les extensions de Caja
fr: Fournit les traductions communes utilisées par les extensions de Caja

source: Documentation how to mate-utils
ca: Documentació de com fer mate-utils
fr: Documentation sur l'utilisation de mate-utils

source: This package contains the documentation for mate-utils
ca: Aquest paquet conté la documentació per a mate-utils
fr: Ce paquet contient la documentation pour mate-utils

source: A Material Design theme for GNOME/GTK+ based desktop environments
ca: Un tema de Material Design per a entorns d'escriptori basats en GNOME/GTK+
fr: Un thème Material Design pour les environnements de bureau basés sur GNOME/GTK

source: Materia (formerly Flat-Plat) is a Material Design theme for GNOME/GTK+ based desktop environments. It supports GTK+ 3, GTK+ 2, GNOME Shell, Budgie, Cinnamon, MATE, Unity, LightDM, GDM, Chrome theme, etc.
ca: Materia (anteriorment Flat-Plat) és un tema de Material Design per a entorns d'escriptori basats en GNOME/GTK+. És compatible amb GTK+ 3, GTK+ 2, GNOME Shell, Budgie, Cinnamon, MATE, Unity, LightDM, GDM, tema de Chrome, etc.
fr: Materia (anciennement Flat-Plat) est un thème Material Design pour les environnements de bureau basés sur GNOME/GTK+. Il supporte GTK+ 3, GTK+ 2, GNOME Shell, Budgie, Cinnamon, MATE, Unity, LightDM, GDM, le thème Chrome, etc.

source: Common API for various MATE modules typelib
ca: API comuna per a diversos mòduls de MATE typelib
fr: API commune à divers modules MATE typelib

source: Introspection bindings for the MATE Desktop Menu
ca: Vinculacions d'introspecció per al menú MATE Desktop
fr: Liaisons d'introspection pour le menu du bureau de MATE

source: Introspection bindings for the MATE panel applet library
ca: Vinculacions d'introspecció per a la biblioteca de miniaplicacions del plafó MATE
fr: Liaisons d'introspection pour la bibliothèque d'applets du panneau MATE
