Repository: openSUSE/packages-i18n
Catalog: */po/mate.*.po
Languages: ca, fr

source: Caja extension for the ACL viewer and editor
ca: Extensió Caja per al visor i editor ACL
fr: Extension Caja pour le visualiseur et l'éditeur ACL

source: A Caja extension that allows viewing and editing ACL permissions.
ca: Una extensió Caja que permet veure i editar permisos ACL.
fr: Une extension de Caja qui permet d'afficher et de modifier les autorisations ACL.

source: Library with common API for various MATE modules
ca: Biblioteca amb API comuna per a diversos mòduls MATE
fr: Bibliothèque avec des API communes pour divers modules de MATE

source: This package contains the library with common API for various MATE modules.
ca: Aquest paquet conté la biblioteca amb l'API comuna per a diversos mòduls MATE.
fr: Ce paquetage contient la bibliothèque avec les API communes pour divers modules de MATE.

source: MATE Desktop Menu
ca: Menú de l'escriptori MATE
fr: Menu de bureau MATE

source: The libmate-menu library implements the "Desktop Menu Specification" from freedesktop.org.
ca: La biblioteca libmate-menu implementa l'«Especificació del menú de l'escriptori» des de freedesktop.org.
fr: La bibliothèque libmate-menu met en œuvre la "Desktop Menu Specification" originaire de freedesktop.org.

source: matecomponent-based library for the MATE Panel Applet
ca: Biblioteca basada en components per a la miniaplicació del plafó de MATE
fr: bibliothèque basée sur les composants mate pour l'applet MATE Panel

source: This package contains the MATE Desktop Panel. The panel is an interface to manage the desktop, launch applications, and organise access to data.
ca: Aquest paquet conté el plafó d'escriptori MATE. El plafó és una interfície per gestionar l'escriptori, llançar aplicacions i organitzar l'accés a les dades.
fr: Ce paquet contient le panneau de bureau MATE. Le panneau est une interface qui permet de gérer le bureau, de lancer des applications et d'organiser l'accès aux données.

source: MATE Desktop sensors applet shared libraries
ca: Servidors d'escriptori MATE miniaplicacions compartides
fr: Bibliothèques partagées de l'applet capteurs du bureau MATE

source: MATE Sensors Applet is an applet for the MATE Panel to display readings from hardware sensors, including CPU temperature, fan speeds and voltage readings under Linux.
ca: La miniaplicació de sensors MATE és una miniaplicació per al panell MATE per mostrar lectures des de sensors de maquinari, inclosa la temperatura de la CPU, la velocitat del ventilador i les lectures de voltatge sota Linux.
fr: "MATE Sensors Applet" est une applet pour le panneau de MATE afin d'afficher des données lues par des capteurs de matériel, y compris la température du CPU, les vitesses des ventilateurs et des lectures de tension sous Linux.

source: Header files for libslab
ca: Fitxers de capçalera per al «libslab»
fr: Fichiers d'en-tête pour libslab

source: This library makes it easy to create tile-based UI for MATE, as seen in gnome-main-menu. This package provides libslab development files.
ca: Aquesta biblioteca facilita la creació d'interfície d'usuari basada en fitxes per a MATE, com es veu al menú principal del gnome. Aquest paquet proporciona fitxers de desenvolupament del libslab.
fr: Cette bibliothèque facilite la création d'une interface utilisateur basée sur des tuiles pour MATE, comme dans gnome-main-menu. Ce paquet fournit les fichiers de développement de libslab.

source: MATE Desktop libslab port
ca: Port del «libslab» de l'escriptori MATE
fr: Port libslab du bureau MATE

source: This library makes it easy to create tile-based UI for MATE, as seen in gnome-main-menu.
ca: Aquesta biblioteca facilita la creació d'interfície d'usuari basada en fitxes per a MATE, com es veu al menú principal del gnome.
fr: Cette bibliothèque facilite la création d'une interface utilisateur basée sur des tuiles ("tile") pour MATE, comme dans gnome-main-menu.

source: Utility library for getting window manager settings
ca: Biblioteca d'utilitat per a obtenir la configuració del gestor de finestres
fr: Bibliothèque utilitaire pour obtenir les paramètres du gestionnaire de fenêtres

source: This library is used by MATE control center to change preferences of window managers.
ca: El centre de control MATE utilitza aquesta biblioteca per canviar les preferències dels gestors de finestres.
fr: Cette bibliothèque est utilisée par le centre de contrôle MATE pour modifier les préférences des gestionnaires de fenêtres.

source: Header files for MATE's dictionary library
ca: Fitxers de capçalera per a la biblioteca de diccionaris del MATE
fr: Fichiers d'en-tête pour la bibliothèque de dictionnaires de MATE

source: The matedict library is an engine to look up words in dictionary sources. This package contains development files for libmatedict.
ca: La biblioteca de matedictes és un motor per cercar paraules en fonts de diccionari. Aquest paquet conté fitxers de desenvolupament per a la libmatedict.
fr: La bibliothèque matedict est un moteur de recherche de mots dans les dictionnaires. Ce paquet contient les fichiers de développement de libmatedict.

source: Library to look up words in dictionary sources
ca: Biblioteca per a cercar paraules a les fonts de diccionari
fr: Bibliothèque pour rechercher des mots dans les dictionnaires

source: The matedict library is an engine to look up words in dictionary sources.
ca: La biblioteca de matedictes és un motor per cercar paraules en fonts de diccionari.
fr: La bibliothèque matedict est un moteur de recherche de mots dans les dictionnaires.

source: Dock applet for the MATE panel
ca: Miniaplicació d'acoblador per al plafó MATE
fr: Applet Dock pour le panneau MATE

source: An application dock applet for the MATE panel. The applet allows you to: * Place a dock on any MATE panel, of any size, on any side of the desktop you desire. * Pin and unpin applications to the dock. * Rearrange application icons on the dock. * Launch applications by clicking on their icons in the dock. * Minimise/restore the running application windows by clicking the applications dock icon. * Detect changes in the current icon theme and update the dock accordingly. * Use an indicator by each application to show when it is running. * Optionally, use multiple indicators for each window an application has opened. * Use either a light or dark indicator that it can always be seen no matter what colour the panel is.
ca: Una miniaplicació d'acoblador d'aplicacions per al plafó MATE. La miniaplicació us permet: * Col·loqueu un acoblador a qualsevol plafó MATE, de qualsevol mida, a qualsevol costat de l'escriptori que vulgueu. * Fixa i deixa de fixar les aplicacions a l'acoblador. * Reorganitzar les icones de l'aplicació a l'acoblador. * Llança les aplicacions fent clic a les seves icones a l'acoblador. * Minimitza/restaura les finestres d'aplicació en execució fent clic a la icona acoblador d'aplicacions. * Detecta els canvis en el tema d'icones actual i actualitza l'acoblador en conseqüència. * Utilitzeu un indicador de cada aplicació per a mostrar quan s'està executant. * Opcionalment, utilitzeu múltiples indicadors per a cada finestra que ha obert una aplicació. * Utilitzeu un indicador clar o fosc que sempre es pot veure sigui quin sigui el color del panell.
fr: Une applet de dock d'application pour le panneau MATE. L'applet vous permet de : * Placer un dock sur n'importe quel panneau MATE, de n'importe quelle taille, sur n'importe quel côté du bureau. * Épingler et désépingler des applications dans le dock. * Réorganiser les icônes des applications sur le dock. * Lancer des applications en cliquant sur leurs icônes dans le dock. * Réduire/restaurer les fenêtres des applications en cours d'exécution en cliquant sur l'icône du dock des applications. * Détecter les changements dans le thème d'icônes courant et mettre à jour le dock en conséquence. * Utiliser un indicateur pour chaque application afin de montrer qu'elle est en cours d'exécution. * En option, utilisez plusieurs indicateurs pour chaque fenêtre ouverte par une application. * Utiliser un indicateur clair ou foncé pour qu'il soit toujours visible, quelle que soit la couleur du panneau.

source: Translations for package mate-applet-dock
ca: Traduccions per al paquet mate-applet-dock
fr: Traductions pour le paquet mate-applet-dock

source: Provides translations for the "mate-applet-dock" package.
ca: Proporciona traduccions per al paquet «mate-applet-dock».
fr: Fournit des traductions pour le paquet "mate-applet-dock".

source: Information from applications consistently on the panel
ca: Informació de les aplicacions coherentment al plafó
fr: Informations sur les demandes régulièrement inscrites au panel

source: The indicator applet exposes Ayatana Indicators in the MATE Panel. Ayatana Indicators are an initiative by Canonical to provide crisp and clean system and application status indication. They take the form of an icon and associated menu, displayed (usually) in the desktop panel. Existing indicators include the Message Menu, Battery Menu and Sound menu.
ca: La miniaplicació d'indicadors exposa indicadors d'Ayatana al plafó MATE. Els Indicadors Ayatana són una iniciativa de Canonical per proporcionar un sistema cruixent i net i una indicació de l'estat de l'aplicació. Prenen la forma d'una icona i un menú associat, que es mostren (normalment) al plafó d'escriptori. Els indicadors existents inclouen el menú Missatge, el menú Bateria i el menú So.
fr: L'applet indicateur expose les indicateurs Ayatana dans le panneau MATE. Les indicateurs Ayatana sont une initiative de Canonical visant à fournir des indications claires et nettes sur l'état du système et des applications. Ils prennent la forme d'une icône et d'un menu associé, affichés (généralement) dans le panneau du bureau. Les indicateurs existants comprennent le menu Message, le menu Batterie et le menu Son.

source: Translations for package mate-indicator-applet
ca: Traduccions per al paquet mate-indicator-applet
fr: Traductions pour le paquet mate-indicator-applet

source: Provides translations for the "mate-indicator-applet" package.
ca: Proporciona traduccions per al paquet «mate-indicator-applet».
fr: Fournit des traductions pour le paquet "mate-indicator-applet".

source: MATE Desktop panel applet to display sensor readings
ca: Miniaplicació del plafó d'escriptori MATE per a mostrar les lectures dels sensors
fr: L'applet du panneau MATE Desktop pour afficher les relevés des capteurs

source: Development files for mate-sensors-applet
ca: Fitxers de desenvolupament per a mate-sensors-applet
fr: Fichiers de développement pour mate-sensors-applet

source: Translations for package mate-sensors-applet
ca: Traduccions per al paquet mate-sensors-applet
fr: Traductions pour le paquet mate-sensors-applet

source: Provides translations for the "mate-sensors-applet" package.
ca: Proporciona traduccions per al paquet «mate-sensors-applet».
fr: Fournit des traductions pour le paquet "mate-sensors-applet".

source: MATE panel applet for software update notifications
ca: Miniaplicació del plafó MATE per a les notificacions d'actualització de programari
fr: Applet du panneau MATE pour les notifications de mise à jour du logiciel

source: This is a MATE panel applet to notify when software updates are available. The notification is displayed in two ways: 1) by changing the icon of the applet. 2) by sending a notification to the notification-daemon. The information is obtained from PackageKit.
ca: Aquesta és una miniaplicació del plafó MATE per a notificar quan hi ha actualitzacions de programari disponibles. La notificació es mostra de dues maneres: 1) canviant la icona de la miniaplicació. 2) mitjançant l'enviament d'una notificació al butlletí-notificació. La informació s'obté del PackageKit.
fr: Il s'agit d'une applet du panneau MATE permettant de notifier la disponibilité de mises à jour logicielles. La notification est affichée de deux manières : 1) en changeant l'icône de l'applet. 2) en envoyant une notification au démon de notification. Les informations sont obtenues à partir de PackageKit.

source: Translations for package mate-applet-softupd
ca: Traduccions per al paquet mate-applet-softupd
fr: Traductions pour le paquet mate-applet-softupd

source: Provides translations for the "mate-applet-softupd" package.
ca: Proporciona traduccions per al paquet «mate-applet-softupd».
fr: Fournit des traductions pour le paquet "mate-applet-softupd".

source: A set of applets for the MATE Desktop
ca: Un conjunt de miniaplicacions per a l'escriptori MATE
fr: Un jeu d'applets pour le bureau MATE

source: This package provides a set of applets to use with the MATE panel.
ca: Aquest paquet proporciona un conjunt de miniaplicacions per utilitzar amb el plafó MATE.
fr: Ce paquet fournit un ensemble d'applets à utiliser avec le panneau MATE.

source: Documentation how to use mate-applets
ca: Documentació sobre com utilitzar les miniaplicacions mat
fr: Documentation sur l'utilisation des mate-applets

source: This package contains the documentation for mate-applets
ca: Aquest paquet conté la documentació per a miniaplicacions mat
fr: Ce paquet contient la documentation pour mate-applets

source: Translations for package mate-applets
ca: Traduccions per a miniaplicacions de paquets
fr: Traductions pour le paquet mate-applets

source: Provides translations for the "mate-applets" package.
ca: Proporciona traduccions per al paquet «mate-applets».
fr: Fournit des traductions pour le paquet "mate-applets".

source: A set of backgrounds packaged with the MATE desktop
ca: Un conjunt de fons empaquetats amb l'escriptori MATE
fr: Un ensemble d'arrière-plans fournis avec le bureau MATE

source: This is a collection of desktop wallpapers created with MATE users in mind.
ca: Aquesta és una col·lecció de fons de pantalla d'escriptori creats pensant en els usuaris de MATE.
fr: Ceci est une collection de fonds d'écran créés pour les utilisateurs de MATE.

source: Translations for package mate-backgrounds
ca: Traduccions per al fons de mat del paquet
fr: Traductions pour le paquet mate-backgrounds

source: Provides translations for the "mate-backgrounds" package.
ca: Proporciona traduccions per al paquet «mate-backgrounds».
fr: Fournit des traductions pour le paquet "mate-backgrounds".

source: MATE Desktop calculator application
ca: Aplicació de calculadora d'escriptori MATE
fr: MATE Application de calculatrice de bureau

source: mate-calc is a calculator application that was part of the OpenWindows Deskset of the Solaris 8 operating system. It incorporates multiple precision arithmetic packages based on the work of Professor Richard Brent.
ca: mate-calc és una aplicació de calculadora que formava part de l'OpenWindows Deskset del sistema operatiu Solaris 8. Incorpora múltiples paquets aritmètics de precisió basats en el treball del professor Richard Brent.
fr: mate-calc est une application de calculatrice qui faisait partie de l'OpenWindows Deskset du système d'exploitation Solaris 8. Elle incorpore des paquets arithmétiques à précision multiple basés sur les travaux du professeur Richard Brent.

source: Translations for package mate-calc
ca: Traduccions per al paquet mate-calc
fr: Traductions pour le paquet mate-calc

source: Provides translations for the "mate-calc" package.
ca: Proporciona traduccions per al paquet «mate-calc».
fr: Fournit des traductions pour le paquet "mate-calc".

source: Common scripts and macros to develop with MATE
ca: Scripts i macros comuns a desenvolupar amb MATE
fr: Scripts et macros courants pour développer avec MATE

source: mate-common is an extension to autoconf, automake and libtool for the MATE desktop environment and MATE applications. mate-autogen, and several macros are included to help in MATE source trees.
ca: mate-common és una extensió a autoconf, automake i libtool per a l'entorn d'escriptori MATE i aplicacions MATE. L'autogen mat i diverses macros s'inclouen per ajudar en els arbres font de MATE.
fr: mate-common est une extension de autoconf, automake et libtool pour l'environnement de bureau MATE et les applications MATE. mate-autogen, et plusieurs macros sont inclus pour aider dans les structures de source MATE.

source: MATE Desktop control center
ca: Centre de control de l'escriptori MATE
fr: Centre de contrôle du bureau MATE

source: The control center is MATE's main interface for configuration of various aspects of your desktop.
ca: El centre de control és la interfície principal de MATE per a la configuració de diversos aspectes de l'escriptori.
fr: Le centre de contrôle est l'interface principale de MATE pour la configuration de divers aspects de votre bureau.

source: openSUSE Branding of mate-control-center
ca: openSUSE Branding de mate-control-center
fr: Marquage openSUSE de mate-control-center

source: This package provides the openSUSE definition of what appears in the control centre.
ca: Aquest paquet proporciona la definició d'openSUSE del que apareix al centre de control.
fr: Ce paquet fournit la configuration openSUSE de ce qui apparaît dans le centre de contrôle.

source: The MATE Control Center -- Upstream Definition of Shell Content
ca: El centre de control MATE -- Definició del contingut del Shell
fr: Le centre de contrôle MATE -- Définition en amont du contenu du shell

source: The control center is MATE's main interface for configuration of various aspects of your desktop. This package provides the upstream definition of what appears in the control center.
ca: El centre de control és la interfície principal de MATE per a la configuració de diversos aspectes de l'escriptori. Aquest paquet proporciona la definició de la font del que apareix al centre de control.
fr: Le centre de contrôle est l'interface principale de MATE pour la configuration de divers aspects de votre bureau. Ce paquet fournit la configuration en amont de ce qui apparaît dans le centre de contrôle.

source: Header files for MATE Control Center
ca: Fitxers de capçalera per al centre de control MATE
fr: Fichiers d'en-tête pour le centre de contrôle MATE

source: The control center is MATE's main interface for configuration of various aspects of your desktop. This package provides MATE control center development files.
ca: El centre de control és la interfície principal de MATE per a la configuració de diversos aspectes de l'escriptori. Aquest paquet proporciona fitxers de desenvolupament del centre de control MATE.
fr: Le centre de contrôle est l'interface principale de MATE pour la configuration de divers aspects de votre bureau. Ce paquetage fournit les fichiers de développement du centre de contrôle de MATE.

source: Translations for package mate-control-center
ca: Traduccions per al paquet mate-control-center
fr: Traductions pour le paquet mate-control-center

source: Provides translations for the "mate-control-center" package.
ca: Proporciona traduccions per al paquet «mate-control-center».
fr: Fournit les traductions pour le paquet "mate-control-center".

source: MATE module API library development files
ca: Fitxers de desenvolupament de la biblioteca API del mòdul MATE
fr: Fichiers de développement de la bibliothèque API du module MATE

source: MATE Desktop GSchemas
ca: GEsquemes de l'escriptori MATE
fr: GSchemas du bureau MATE

source: This package provides the GSettings schemas for MATE Desktop Environment.
ca: Aquest paquet proporciona els esquemes GSettings per a l'entorn d'escriptori MATE.
fr: Ce paquet fournit les schémas GSettings pour l'environnement de bureau MATE.

source: openSUSE Branding of mate-desktop
ca: openSUSE Branding de mate-desktop
fr: Marquage openSUSE de mate-desktop

source: This package provides the openSUSE definition for MATE Desktop GSchemas.
ca: Aquest paquet proporciona la definició openSUSE per a GSchemas d'escriptori MATE.
fr: Ce paquetage fournit la configuration openSUSE pour les GSchemas du bureau MATE.

source: MATE Desktop GSchemas -- Upstream default settings
ca: MATE Desktop GSchemas -- Configuració predeterminada de Upstream
fr: MATE Desktop GSchemas -- Paramètres par défaut en amont

source: This package contains the upstream default settings for MATE Desktop GSchemas.
ca: Aquest paquet conté la configuració predeterminada de l'escriptori MATE GSchemas.
fr: Ce paquet contient les paramètres par défaut en amont pour les GSchemas du bureau MATE.

source: Translations for package mate-desktop
ca: Traduccions per al paquet mate-desktop
fr: Traductions pour le paquet mate-desktop

source: Provides translations for the "mate-desktop" package.
ca: Proporciona traduccions per al paquet «mate-desktop».
fr: Fournit les traductions pour le paquet "mate-desktop".

source: MATE dictionary
ca: Diccionari MATE
fr: Dictionnaire MATE

source: This is the MATE dictionary as shipped with the MATE utilities. mate-dictionary is a program which can look up the definition of words
ca: Aquest és el diccionari MATE que s'ha enviat amb les utilitats MATE. mate-dictionary és un programa que pot buscar la definició de paraules
fr: Il s'agit du dictionnaire MATE tel qu'il est livré avec les utilitaires MATE. mate-dictionary est un programme qui permet de rechercher la définition des mots

source: MATE disk image mounter
ca: Muntador d'imatges de disc MATE
fr: Monteur d'image disque MATE

source: This is the MATE Disk Image Mounter as shipped with the MATE utilities. mate-disk-image-mounter shows up in Caja for .ISO files to be conviniently mounted.
ca: Aquest és el muntador d'imatges de disc MATE que s'envia amb les utilitats MATE. mate-disk-image-mounter es mostra a Caja per a que els fitxers .ISO es muntin de manera convinent.
fr: Il s'agit du monteur d'images disque MATE tel qu'il est fourni avec les utilitaires MATE. mate-disk-image-mounter apparaît dans Caja pour les fichiers .ISO à monter de manière appropriée.

source: MATE disk usage analyser
ca: Analitzador d'ús de disc MATE
fr: Analyseur d'utilisation du disque MATE

source: This is the MATE Disk Usage Analyzer as shipped with the MATE utilities. mate-disk-usage-analyzer is able to scan either specific directories or the wholefilesystem, in order to give the user a graphical tree representation including each directory size or percentage in the branch. It also auto-detects in real-time any change made to your home directory as far as any mounted/unmounted device.
ca: Aquest és l'Analitzador d'ús de discs MATE que s'envia amb les utilitats MATE. mate-disk-usage-analyzer és capaç d'escanejar directoris específics o el sistema de fitxers sencers, per tal de donar a l'usuari una representació gràfica en arbre incloent cada mida de directori o percentatge a la branca. També detecta automàticament en temps real qualsevol canvi fet al vostre directori personal fins a qualsevol dispositiu muntat/desmuntat.
fr: Il s'agit de l'analyseur d'utilisation du disque MATE tel qu'il est livré avec les utilitaires MATE. mate-disk-usage-analyzer est capable d'analyser des répertoires spécifiques ou l'ensemble du système de fichiers, afin de donner à l'utilisateur une représentation graphique de leur arborescence, y compris la taille de chaque répertoire ou le pourcentage dans la branche. Il détecte également automatiquement et en temps réel toute modification apportée à votre répertoire personnel ainsi qu'à tout périphérique monté/démonté.

source: ACL viewer and editor for MATE
ca: Visor i editor ACL per a MATE
fr: Visualisateur et éditeur ACL pour MATE
