Repository: openSUSE/packages-i18n
Catalog: */po/mate.*.po
Languages: ca, fr

source: MATE eiciel is a Graphical editor for access control lists (ACLs) and extended attributes (xattr), either as an extension within Caja, or as a standalone utility.
ca: MATE eiciel és un editor gràfic per a llistes de control d'accés (ACLs) i atributs estesos (xattr), ja sigui com una extensió dins de Caja, o com una utilitat independent.
fr: MATE eiciel est un éditeur graphique pour les listes de contrôle d'accès (ACL) et les attributs étendus (xattr), soit en tant qu'extension de Caja, soit en tant qu'utilitaire autonome.

source: Translations for package mate-eiciel
ca: Traduccions per al paquet mate-eiciel
fr: Traductions pour paquet mate-eiciel

source: Provides translations for the "mate-eiciel" package.
ca: Proporciona traduccions per al paquet «mate-eiciel».
fr: Fournit des traductions pour le paquet "mate-eiciel".

source: MATE icon theme
ca: Tema d'icones de MATE
fr: Thème d'icône MATE

source: This package contains the default icon theme used by the MATE desktop. The icons are used in the panel menu, and in nautilus and other applications, to represent the different applications, files, directories, and devices.
ca: Aquest paquet conté el tema d'icones predeterminat utilitzat per l'escriptori MATE. Les icones s'utilitzen en el menú del plafó, i en el nautilus i altres aplicacions, per a representar les diferents aplicacions, fitxers, directoris i dispositius.
fr: Ce paquet contient le thème d'icônes par défaut utilisé par le bureau MATE. Les icônes sont utilisées dans le menu du panneau, dans nautilus et dans d'autres applications, pour représenter les différentes applications, les fichiers, les répertoires et les périphériques.

source: MATE Desktop Faenza compilation theme
ca: Tema de compilació de MATE Desktop Faenza
fr: Thème de compilation Faenza du bureau MATE

source: This icon theme uses Faenza and Faience icon themes by ~Tiheum and some icons customised for MATE by Rowen Stipe. Also, there are some icons from Mint-X-F and Faenza-Fresh icon packs.
ca: Aquest tema d'icones utilitza temes d'icones Faenza i Faience de Tiheum i algunes icones personalitzades per a MATE de Rowen Stipe. A més, hi ha algunes icones dels paquets d'icones Mint-X-F i Faenza-Fresh.
fr: Ce thème d'icônes utilise les thèmes d'icônes Faenza et Faience de ~Tiheum et quelques icônes personnalisées pour MATE par Rowen Stipe. Il y a aussi quelques icônes des packs d'icônes Mint-X-F et Faenza-Fresh.

source: MATE Desktop faenza compilation theme, dark variant
ca: Tema de compilació de la faenza de l'escriptori MATE, variant fosca
fr: Thème de compilation MATE Desktop faenza, variante sombre

source: MATE Desktop faenza compilation theme, grey variant
ca: Tema de compilació de la faenza de l'escriptori MATE, variant grisa
fr: Thème de compilation MATE Desktop faenza, variante grise

source: MATE Desktop multimedia stack
ca: pila multimèdia de l'escriptori MATE
fr: Pile multimédia du bureau MATE

source: This package provides the Multimedia stack used by the MATE Desktop.
ca: Aquest paquet proporciona la pila multimèdia utilitzada per l'escriptori MATE.
fr: Ce paquet fournit la pile multimédia utilisée par le bureau MATE.

source: Translations for package mate-media
ca: Traduccions per al paquet mate-media
fr: Traductions pour le paquet mate-media

source: Provides translations for the "mate-media" package.
ca: Proporciona traduccions per al paquet «mate-media».
fr: Fournit les traductions pour le paquet "mate-media".

source: Advanced MATE menu
ca: Menú avançat de MATE
fr: Menu avancé MATE

source: An advanced menu for MATE. Supports filtering, favourites, autosession, and many other features. This menu originated in the Linux Mint distribution and has been ported to other distributions that ship the MATE Desktop Environment.
ca: Un menú avançat per a MATE. Suporta filtres, favorits, autosessió i moltes altres característiques. Aquest menú es va originar a la distribució Linux Mint i s'ha portat a altres distribucions que distribueixen l'entorn d'escriptori MATE.
fr: Un menu avancé pour MATE. Il prend en charge le filtrage, les favoris, l'autosession et de nombreuses autres fonctionnalités. Ce menu est issu de la distribution Linux Mint et a été porté sur d'autres distributions qui intègrent l'environnement de bureau MATE.

source: Translations for package mate-menu
ca: Traduccions per al menú mat del paquet
fr: Traductions pour le paquet mate-menu

source: Provides translations for the "mate-menu" package.
ca: Proporciona traduccions per al paquet «mate-menu».
fr: Fournit des traductions pour le paquet "mate-menu".

source: mate-menus contains the libmate-menu library, the layout configuration files for the MATE menu, as well as a simple menu editor. The libmate-menu library implements the "Desktop Menu Specification" from freedesktop.org.
ca: mate-menus conté la biblioteca libmate-menu, els fitxers de configuració de la disposició per al menú MATE, així com un editor de menú senzill. La biblioteca libmate-menu implementa l'«Especificació del menú de l'escriptori» des de freedesktop.org.
fr: mate-menus contient la bibliothèque libmate-menu, les fichiers de configuration de la présentation du menu MATE, ainsi qu'un simple éditeur de menu. La bibliothèque libmate-menu implémente la spécification "Desktop Menu Specification" de freedesktop.org.

source: openSUSE Branding of mate-menus
ca: openSUSE Branding de menús mat
fr: Marquage openSUSE de mate-menus

source: This package provides the openSUSE definitions for menus.
ca: Aquest paquet proporciona les definicions d'openSUSE per als menús.
fr: Ce paquet fournit les configurations openSUSE pour les menus.

source: Upstream menus definition for the MATE desktop menu
ca: Definició dels menús de la font per al menú d'escriptori MATE
fr: Déclinaison des menus ascendants pour le menu du bureau de MATE

source: The package contains an implementation of the draft "Desktop Menu Specification" from freedesktop.org: https://freedesktop.org/Standards/menu-spec This package provides the upstream definitions for menus.
ca: El paquet conté una implementació de l'esborrany «Desktop Menu Specification» de freedesktop.org: https://freedesktop.org/Standards/menu-spec Aquest paquet proporciona les definicions de la font per als menús.
fr: Le paquet contient une implémentation du projet "Desktop Menu Specification" de freedesktop.org : https://freedesktop.org/Standards/menu-spec Ce paquet fournit les définitions en amont des menus.

source: Header files for the MATE Desktop Menu
ca: Fitxers de capçalera per al menú d'escriptori MATE
fr: Fichiers d'en-tête pour le menu du bureau de MATE

source: Translations for package mate-menus
ca: Traduccions per als menús mat del paquet
fr: Traductions pour le paquet mate-menus

source: Provides translations for the "mate-menus" package.
ca: Proporciona traduccions per al paquet «mate-menus».
fr: Fournit les traductions pour le paquet "mate-menus".

source: MATE Desktop window management tool
ca: Eina per a la gestió de finestres de l'escriptori MATE
fr: Outil de gestion des fenêtres du bureau MATE

source: This package provides a simple window management tool which provides the following functionality: * Allow to set basic rules for window types; * Allow exceptions to the rules based on string matching for window name and window class; * Allows reversing of rules when the user manually changes something; * Re-decorates windows on un-maximise
ca: Aquest paquet proporciona una eina senzilla de gestió de finestres que proporciona la funcionalitat següent: * Permet establir regles bàsiques per als tipus de finestres; * Permet excepcions a les regles basades en la coincidència de cadenes per al nom de la finestra i la classe de la finestra; * Permet invertir les regles quan l'usuari canvia manualment alguna cosa; * Torna a decorar les finestres en desmaximitzar
fr: Ce paquet fournit un outil simple de gestion des fenêtres qui offre les fonctionnalités suivantes : * Permet de définir des règles de base pour les types de fenêtres ; * Permet des exceptions aux règles basées sur la correspondance de chaînes pour le nom et la classe de la fenêtre ; * Permet d'inverser les règles lorsque l'utilisateur modifie manuellement quelque chose ; * Redécore les fenêtres en cas de non-maximisation ; * Permet d'afficher les fenêtres en cas de non-maximisation ; * Permet d'afficher les fenêtres en cas de non-maximisation

source: Translations for package mate-netbook
ca: Traduccions per al paquet mate-netbook
fr: Traductions pour le paquet mate-netbook

source: Provides translations for the "mate-netbook" package.
ca: Proporciona traduccions per al paquet «mate-netbook».
fr: Fournit les traductions pour le paquet "mate-netbook".

source: Notification daemon for MATE
ca: Dimoni de notificació per al MATE
fr: Démon de notification pour MATE

source: D-Bus notification daemon for MATE.
ca: Dimoni de notificació de D-Bus per a MATE.
fr: Démon de notification D-Bus pour MATE.

source: Translations for package mate-notification-daemon
ca: Traduccions per al paquet mate-notification-daemon
fr: Traductions pour le paquet mate-notification-daemon

source: Provides translations for the "mate-notification-daemon" package.
ca: Proporciona traduccions per al paquet «mate-notification-daemon».
fr: Fournit les traductions pour le paquet "mate-notification-daemon".

source: MATE Desktop Panel
ca: Plafó d'escriptori MATE
fr: Panneau de bureau MATE

source: openSUSE Branding of mate-panel
ca: openSUSE Branding de panell de mat
fr: Marquage openSUSE de mate-panel

source: This package provides the openSUSE look and feel for the MATE Panel.
ca: Aquest paquet proporciona l'aspecte i comportament d'openSUSE per al plafó MATE.
fr: Ce paquet fournit l'aspect d'openSUSE pour le panneau MATE.

source: Upstream default layout for the MATE desktop panel
ca: Disposició predeterminada de la part superior per al plafó d'escriptori MATE
fr: Configuration par défaut en amont pour le panneau de bureau MATE

source: This package contains the MATE Desktop Panel. The panel is an interface to manage the desktop, launch applications, and organise access to data. This package contains the upstream default layout for MATE Panel.
ca: Aquest paquet conté el plafó d'escriptori MATE. El plafó és una interfície per gestionar l'escriptori, llançar aplicacions i organitzar l'accés a les dades. Aquest paquet conté la disposició predeterminada de la font per al plafó MATE.
fr: Ce paquet contient le panneau de bureau MATE. Le panneau est une interface permettant de gérer le bureau, de lancer des applications et d'organiser l'accès aux données. Ce paquet contient la disposition par défaut en amont du panneau MATE.

source: Development files for the MATE panel applet library
ca: Fitxers de desenvolupament per a la biblioteca de miniaplicacions del plafó MATE
fr: Fichiers de développement pour la bibliothèque d'applets du panneau MATE

source: Translations for package mate-panel
ca: Traduccions per al paquet «mate-panel»
fr: Traductions pour le paquet mate-panel

source: Provides translations for the "mate-panel" package.
ca: Proporciona traduccions per al paquet «mate-panel».
fr: Fournit des traductions pour le paquet "mate-panel".

source: MATE authentification agent for polkit
ca: Autentificació MATE per al polkit
fr: Agent d'authentification MATE pour polkit

source: mate-polkit provides a D-Bus session bus service that is used to bring up authentication dialogues used for obtaining privileges.
ca: mate-polkit proporciona un servei d'autobús de sessió de D-Bus que s'utilitza per a obrir diàlegs d'autenticació utilitzats per a l'obtenció de privilegis.
fr: mate-polkit fournit un service de bus de session D-Bus qui est utilisé pour faire apparaître les dialogues d'authentification utilisés pour obtenir des privilèges.

source: Translations for package mate-polkit
ca: Traduccions per al paquet mate-polkit
fr: Traductions pour le paquet mate-polkit

source: Provides translations for the "mate-polkit" package.
ca: Proporciona traduccions per al paquet «mate-polkit».
fr: Fournit des traductions pour le paquet "mate-polkit".

source: MATE Desktop UPower policy management
ca: Gestió de les polítiques d'elevació de l'escriptori MATE
fr: Gestion de la gouvernance du bureau MATE UPower

source: MATE Power Manager is a MATE session daemon that acts as a policy agent on top of UPower, which requires fairly new versions of the kernel and udev. MATE Power Manager listens for system events and responds with user-configurable actions.
ca: MATE Power Manager és un dimoni de sessió de MATE que actua com a agent de política a la part superior d'UPower, el qual requereix versions bastant noves del nucli i udev. MATE Power Manager escolta esdeveniments del sistema i respon amb accions configurables per l'usuari.
fr: MATE Power Manager est un démon de session MATE qui agit comme un gestionnaire de politiques au-dessus de UPower, ce qui nécessite des versions relativement nouvelles du noyau et de udev. MATE Power Manager est à l'écoute des événements du système et répond par des actions configurables par l'utilisateur.

source: Translations for package mate-power-manager
ca: Traduccions per al paquet mate-power-manager
fr: Traductions pour le paquet mate-power-manager

source: Provides translations for the "mate-power-manager" package.
ca: Proporciona traduccions per al paquet «mate-power-manager».
fr: Fournit des traductions pour le paquet "mate-power-manager".

source: MATE Desktop screensaver
ca: Estalvi de pantalla de l'escriptori MATE
fr: Économiseur d'écran du bureau MATE

source: mate-screensaver is a screen saver and locker that integrates with the MATE desktop.
ca: mate-screensaver és un estalvi de pantalla i taquilla que s'integra amb l'escriptori MATE.
fr: mate-screensaver est un économiseur d'écran et un casier qui s'intègre au bureau MATE.

source: Development files for mate-screensaver
ca: Fitxers de desenvolupament per a l'estalvi de pantalles mat
fr: Fichiers de développement pour mate-screensaver

source: mate-screensaver is a screen saver and locker that integrates with the MATE desktop. This subpackage contains the pkgconfig file.
ca: mate-screensaver és un estalvi de pantalla i taquilla que s'integra amb l'escriptori MATE. Aquest subpaquet conté el fitxer pkgconfig.
fr: mate-screensaver est un économiseur d'écran et un vérou d'écran qui s'intègre au bureau MATE. Ce sous-paquet contient le fichier pkgconfig.

source: Translations for package mate-screensaver
ca: Traduccions per a l'estalvi de pantalla mat de paquets
fr: Traductions pour le paquet mate-screensaver

source: Provides translations for the "mate-screensaver" package.
ca: Proporciona traduccions per al paquet «mate-screensaver».
fr: Fournit les traductions pour le paquet "mate-screensaver".

source: MATE screenshot maker
ca: Creador de captures de pantalla MATE
fr: Capture d'écran MATE

source: This is the MATE screenshot maker as shipped with the MATE utilities. mate-screenshot is a program which cantake desktop screenshots and save them.
ca: Aquest és el fabricant de captures de pantalla de MATE que s'ha enviat amb les utilitats de MATE. mate-screenshot és un programa que pot prendre captures de pantalla de l'escriptori i desar-les.
fr: Il s'agit du programme de capture d'écran de MATE tel qu'il est fourni avec les utilitaires MATE. mate-screenshot est un programme qui permet de faire des captures d'écran du bureau et de les sauvegarder.

source: MATE Search Tool
ca: Eina de cerca de MATE
fr: Outil de recherche MATE

source: This is the MATE Seach Tool as shipped with the MATE utilities. It uses command-line tools such as find and locate to get results.
ca: Aquesta és l'eina MATE Seach que s'ha enviat amb les utilitats MATE. Utilitza eines de línia d'ordres com ara «buscar» i «localitzar» per obtenir resultats.
fr: Il s'agit de l'outil de recherche MATE tel qu'il est fourni avec les utilitaires MATE. Il utilise des outils de ligne de commande tels que find et locate pour obtenir des résultats.

source: MATE Session Manager
ca: Gestor de sessions MATE
fr: Gestionnaire de session MATE

source: This package contains a session that can be started from a display manager such as LightDM. It will load all necessary applications for a full-featured user session.
ca: Aquest paquet conté una sessió que es pot iniciar des d'un gestor de pantalla com el LightDM. Es carregaran totes les aplicacions necessàries per a una sessió d'usuari completa.
fr: Ce paquet contient une session qui peut être démarrée à partir d'un gestionnaire d'affichage tel que LightDM. Il chargera toutes les applications nécessaires pour une session utilisateur complète.

source: openSUSE Branding of mate-session-manager
ca: openSUSE Branding de mate-session-manager
fr: Marquage openSUSE de mate-session-manager

source: This package provides the openSUSE look and feel for the MATE Session Manager.
ca: Aquest paquet proporciona l'aspecte i comportament d'openSUSE per al gestor de sessions de MATE.
fr: Ce paquetage fournit l'aspect d'openSUSE pour le gestionnaire de session MATE.

source: MATE Session Manager GSchemas
ca: GSchemas, gestor de sessions de MATE
fr: Gestionnaire de session GSchemas de MATE

source: This package provides the GSettings schemas for MATE Session Manager.
ca: Aquest paquet proporciona els esquemes GSettings per al gestor de sessions MATE.
fr: Ce paquet fournit les schémas GSettings pour le gestionnaire de session MATE.

source: Translations for package mate-session-manager
ca: Traduccions per al paquet mate-session-manager
fr: Traductions pour le paquet mate-session-manager

source: Provides translations for the "mate-session-manager" package.
ca: Proporciona traduccions per al paquet «mate-session-manager».
fr: Fournit les traductions pour le paquet "mate-session-manager".

source: MATE session settings daemon
ca: Dimoni de configuració de la sessió MATE
fr: Démon de paramétrage de la session MATE

source: This package contains the daemon which is responsible for setting the various parameters of a MATE session and the applications that run under it.
ca: Aquest paquet conté el dimoni que s'encarrega d'establir els diversos paràmetres d'una sessió MATE i les aplicacions que s'executen sota d'ella.
fr: Ce paquet contient le démon chargé de définir les différents paramètres d'une session MATE et des applications qui s'y exécutent.

source: MATE session settings daemon development files
ca: Fitxers de desenvolupament del dimoni de configuració de la sessió MATE
fr: Fichiers de développement du démon des paramètres de session MATE

source: Translations for package mate-settings-daemon
ca: Traduccions per al paquet mate-settings-daemon
fr: Traductions pour le paquet mate-settings-daemon

source: Provides translations for the "mate-settings-daemon" package.
ca: Proporciona traduccions per al paquet «mate-settings-daemon».
fr: Fournit des traductions pour le paquet "mate-settings-daemon".

source: MATE system log viewer
ca: Visor de registre del sistema MATE
fr: Visualisation du journal du système MATE

source: This is the MATE system log viewer as shipped with the MATE utilities. mate-system-log is a program which can view logs generated by the operating system.
ca: Aquest és el visualitzador de registres del sistema MATE que s'envia amb les utilitats MATE. mate-system-log és un programa que pot veure els registres generats pel sistema operatiu.
fr: Il s'agit de la visionneuse de journaux du système MATE telle qu'elle est livrée avec les utilitaires MATE. mate-system-log est un programme qui permet de visualiser les journaux générés par le système d'exploitation.

source: MATE Desktop system monitor
ca: Monitor del sistema d'escriptori MATE
fr: Moniteur système du bureau MATE

source: Process viewer and system resource monitor for the MATE. This package allows you to graphically view and manipulate the running processes on your system. It also provides an overview of available resources such as CPU and memory.
ca: Visor de processos i monitor de recursos del sistema per al MATE. Aquest paquet us permet visualitzar i manipular gràficament els processos en execució al vostre sistema. També proporciona una visió general dels recursos disponibles com CPU i memòria.
fr: Afficheur de processus et moniteur de ressources système pour MATE. Ce paquetage vous permet de visualiser et de manipuler graphiquement les processus en cours sur votre système. Il fournit également une vue d'ensemble des ressources disponibles telles que le processeur et la mémoire.

source: Translations for package mate-system-monitor
ca: Traduccions per al monitor del sistema-mate del paquet
fr: Traductions pour le paquet mate-system-monitor

source: Provides translations for the "mate-system-monitor" package.
ca: Proporciona traduccions per al paquet «mate-system-monitor».
fr: Fournit des traductions pour le paquet "mate-system-monitor".

source: MATE Desktop terminal emulator
ca: Emulador de terminal d'escriptori MATE
fr: Émulateur de terminal du bureau MATE

source: MATE Terminal is a terminal emulation application that you can use to perform the following actions: * Access a UNIX shell in the MATE environment. * Run any application that is designed to run on VT102, VT220, and xterm terminals.
ca: MATE Terminal és una aplicació d'emulació de terminal que podeu utilitzar per realitzar les següents accions: * Accedir a un shell d'UNIX en l'entorn MATE. * Executa qualsevol aplicació que estigui dissenyada per funcionar en terminals VT102, VT220 i xterm.
fr: MATE Terminal est une application d'émulation de terminal que vous pouvez utiliser pour effectuer les actions suivantes : * Accéder à un shell UNIX dans l'environnement MATE. * Exécuter toute application conçue pour fonctionner sur les terminaux VT102, VT220 et xterm.

source: Translations for package mate-terminal
ca: Traduccions per al paquet mate-terminal
fr: Traductions pour le paquet mate-terminal

source: Provides translations for the "mate-terminal" package.
ca: Proporciona traduccions per al paquet «mate-terminal».
fr: Fournit les traductions pour le paquet "mate-terminal".

source: Themes for the MATE desktop
ca: Temes per a l'escriptori MATE
fr: Thèmes pour le bureau MATE

source: Official themes for the MATE desktop This package contains the official desktop themes of the MATE desktop environment.
ca: Temes oficials per a l'escriptori MATE Aquest paquet conté els temes d'escriptori oficials de l'entorn d'escriptori MATE.
fr: Thèmes officiels pour le bureau MATE Ce paquet contient les thèmes de bureau officiels de l'environnement de bureau MATE.

source: MATE desktop tweak tool
ca: Eina per a ajustar l'escriptori MATE
fr: Outil de configuration du bureau MATE

source: Configures some aspects of the MATE desktop not exposed via the MATE Control Centre applets. Settings that can be handled via MATE Tweak: * Show/hide standard desktop icons. * Panel fine-tuning (icon visibility, in menus and on buttons, icon size, button labelling, contex menus, etc.). * Window manager fine-tuning.
ca: Configura alguns aspectes de l'escriptori MATE que no s'exposen a través de les miniaplicacions del Centre de Control MATE. Configuració que es pot gestionar a través de MATE Tweak: * Mostra/oculta les icones estàndard de l'escriptori. * Afinació del panell (visibilitat d'icones, en menús i botons, mida d'icones, etiquetatge de botons, menús contex, etc.). * Afinació del gestor de finestres.
fr: Configure certains aspects du bureau MATE qui ne sont pas exposés via les applets du Centre de contrôle MATE. Ces paramètres peuvent être gérés par MATE Tweak : * Afficher/masquer les icônes standard du bureau. * Réglage fin du panneau (visibilité des icônes, dans les menus et sur les boutons, taille des icônes, étiquetage des boutons, menus contextuels, etc.) ). * Ajustement du gestionnaire de fenêtres.
