Repository: openSUSE/packages-i18n
Catalog: */po/myspell.*.po
Languages: ca, de, it

source: Latvian spelling dictionary, and hyphenation rules.
ca: Letó: corrector ortogràfic i partició de mots.
de: Lettisches Rechtschreibwörterbuch und Silbentrennungsregeln.
it: Dizionario ortografico e regole di sillabazione per il lettone.

source: MySpell nb_NO Dictionary
ca: Diccionari nbNO del MySpell
de: MySpell nb_NO Wörterbuch
it: Dizionario MySpell nb_NO

source: Norwegian (Nynorsk and Bokmål) spelling dictionary, hyphenation rules, and thesaurus.
ca: Noruec (Nynorsk i Bokm.l) corrector ortogràfic, partició de mots i tesaurus.
de: Norwegisches (Nynorsk und Bokmål) Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per il norvegese (Nynorsk e Bokmål).

source: MySpell ne_NP Dictionary
ca: Diccionari de neNP del MySpell
de: MySpell ne_NP Wörterbuch
it: Dizionario MySpell ne_NP

source: Nepali spelling dictionary, and thesaurus.
ca: Nepali: corrector ortogràfic i tesaurus.
de: Nepalesisches Rechtschreibwörterbuch und Thesaurus.
it: Dizionario ortografico e dizionario dei sinonimi per il nepalese.

source: MySpell nl_BE Dictionary
ca: Diccionari nlBE del MySpell
de: MySpell nl_BE Wörterbuch
it: Dizionario MySpell nl_BE

source: Dutch spelling dictionary, and hyphenation rules.
ca: Neerlandès: corrector ortogràfic i partició de mots.
de: Niederländisches Rechtschreibwörterbuch und Silbentrennungsregeln.
it: Dizionario ortografico e regole di sillabazione per l'olandese.

source: MySpell nl_NL Dictionary
ca: Diccionari nlNL del MySpell
de: MySpell nl_NL Wörterbuch
it: Dizionario MySpell nl_NL

source: MySpell nn_NO Dictionary
ca: Diccionari MySpell nnNO
de: MySpell nn_NO Wörterbuch
it: Dizionario MySpell nn_NO

source: MySpell no Dictionary
ca: MySpell sense diccionari
de: MySpell no Wörterbuch
it: Dizionario MySpell no

source: MySpell oc_FR Dictionary
ca: Diccionari MySpell ocFR
de: MySpell oc_FR Wörterbuch
it: Dizionario MySpell oc_FR

source: Occitan spelling dictionary.
ca: Occità: corrector ortogràfic.
de: Okzitanisches Rechtschreibwörterbuch.
it: Dizionario ortografico per l'occitano.

source: MySpell pl_PL Dictionary
ca: Diccionari plPL del MySpell
de: MySpell pl_PL Wörterbuch
it: Dizionario MySpell pl_PL

source: Polish spelling dictionary, hyphenation rules, and thesaurus.
ca: Polonès: corrector ortogràfic, partició de mots i tesaurus.
de: Polnisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per il polacco.

source: MySpell pt_AO Dictionary
ca: Diccionari MySpell ptAO
de: MySpell pt_AO Wörterbuch
it: Dizionario MySpell pt_AO

source: European Portuguese spelling dictionary, hyphenation rules, and thesaurus.
ca: Portuguès europeu: corrector ortogràfic, partició de mots i tesaurus.
de: Europäisch-Portugiesisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per il portoghese.

source: MySpell pt_BR Dictionary
ca: Diccionari MySpell ptBR
de: MySpell pt_BR Wörterbuch
it: Dizionario MySpell pt_BR

source: Spelling, hyphenation and grammar checking tools for Brazilian Portuguese.
ca: Eines d'ortografia, partició de mots i correcció gramatical per al portuguès brasiler.
de: Werkzeuge zur Rechtschreib-, Silbentrennungs- und Grammatikprüfung für brasilianisches Portugiesisch.
it: Strumenti per il controllo dell'ortografia, della sillabazione e della grammatica per il portoghese brasiliano.

source: MySpell pt_PT Dictionary
ca: Diccionari MySpell ptPT
de: MySpell pt_PT Wörterbuch
it: Dizionario MySpell pt_PT

source: MySpell ro Dictionary
ca: Diccionari MySpell ro
de: MySpell ro Wörterbuch
it: Dizionario MySpell ro

source: rospell Romanian spelling dictionary, hyphenation rules, and thesaurus.
ca: rospell Romanès: corrector ortogràfic, partició de mots i tesaurus.
de: rospell Rumänisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi rospell per il rumeno.

source: MySpell ro_RO Dictionary
ca: Diccionari MySpell roRO
de: MySpell ro_RO Wörterbuch
it: Dizionario MySpell ro_RO

source: MySpell ru_RU Dictionary
ca: Diccionari MySpell ruRU
de: MySpell ru_RU Wörterbuch
it: Dizionario MySpell ru_RU

source: Russian spelling dictionary, hyphenation rules, thesaurus, and grammar checker.
ca: Rus: corrector ortogràfic, partició de mots, tesaurus i corrector gramatical.
de: Russisches Rechtschreibwörterbuch, Silbentrennungsregeln, Thesaurus und Grammatikprüfprogramm.
it: Dizionario ortografico, regole di sillabazione, dizionario dei sinonimi e correttore grammaticale per il russo.

source: MySpell si_LK Dictionary
ca: Diccionari MySpell siLK
de: MySpell si_LK Wörterbuch
it: Dizionario MySpell si_LK

source: Sinhala spelling dictionary.
ca: Sinhala: corrector ortogràfic.
de: Singhalesisches Rechtschreibwörterbuch.
it: Dizionario ortografico per il singalese.

source: MySpell sk_SK Dictionary
ca: Diccionari MySpell skSK
de: MySpell sk_SK Wörterbuch
it: Dizionario MySpell sk_SK

source: Slovak spelling dictionary, hyphenation rules, and thesaurus.
ca: Eslovac: corrector ortogràfic, partició de mots i tesaurus.
de: Slowakisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per lo slovacco.

source: MySpell sl_SI Dictionary
ca: Diccionari MySpell slSI
de: MySpell sl_SI Wörterbuch
it: Dizionario MySpell sl_SI

source: Slovenian spelling dictionary, hyphenation rules, and thesaurus.
ca: Eslovè: corrector ortogràfic, partició de mots i tesaurus.
de: Slowenisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per lo sloveno.

source: MySpell sq_AL Dictionary
ca: Diccionari MySpell sqAL
de: MySpell sq_AL-Wörterbuch
it: Dizionario MySpell sq_AL

source: Albanian spelling dictionary.
ca: Albanès: corrector ortogràfic.
de: Albanisches Rechtschreibwörterbuch.
it: Dizionario ortografico per l'albanese.

source: MySpell sr Dictionary
ca: Diccionari MySpell sr
de: MySpell sr Wörterbuch
it: Dizionario MySpell sr

source: Serbian (Cyrillic and Latin) spelling dictionary, and hyphenation rules.
ca: Serbi (ciríl·lic i llatí) corrector ortogràfic i partició de mots.
de: Serbisches (kyrillisches und lateinisches) Rechtschreibwörterbuch und Silbentrennungsregeln.
it: Dizionario ortografico e regole di sillabazione per il serbo (cirillico e latino).

source: MySpell sr_CS Dictionary
ca: Diccionari srCS del MySpell
de: MySpell sr_CS Wörterbuch
it: Dizionario MySpell sr_CS

source: MySpell sr_Latn_CS Dictionary
ca: Diccionari MySpell srLatnCS
de: MySpell sr_Latn_CS Wörterbuch
it: Dizionario MySpell sr_Latn_CS

source: MySpell sr_Latn_RS Dictionary
ca: Diccionari MySpell srLatnRS
de: MySpell sr_Latn_RS Wörterbuch
it: Dizionario MySpell sr_Latn_RS

source: MySpell sr_RS Dictionary
ca: Diccionari MySpell srRS
de: MySpell sr_RS Wörterbuch
it: Dizionario MySpell sr_RS

source: MySpell sv_FI Dictionary
ca: Diccionari SvFI del MySpell
de: MySpell sv_FI Wörterbuch
it: Dizionario MySpell sv_FI

source: Swedish Dictionary.
ca: Diccionari suec.
de: Schwedisches Wörterbuch.
it: Dizionario ortografico per lo svedese.

source: MySpell sv_SE Dictionary
ca: Diccionari SvSE del MySpell
de: MySpell sv_SE Wörterbuch
it: Dizionario MySpell sv_SE

source: MySpell sw_TZ Dictionary
ca: Diccionari MySpell swTZ
de: MySpell sw_TZ Wörterbuch
it: Dizionario MySpell sw_TZ

source: Swahili spelling dictionary.
ca: Suahili: corrector ortogràfic.
de: Swahili-Rechtschreibwörterbuch.
it: Dizionario ortografico per lo swahili.

source: MySpell te Dictionary
ca: El diccionari MySpell te
de: MySpell te Wörterbuch
it: Dizionario MySpell te

source: Telugu spelling dictionary, and hyphenation rules.
ca: Telugu: corrector ortogràfic i partició de mots.
de: Telugu-Rechtschreibwörterbuch und Silbentrennungsregeln.
it: Dizionario ortografico e regole di sillabazione per il telugu.

source: MySpell te_IN Dictionary
ca: Diccionari teIN del MySpell
de: MySpell te_IN Wörterbuch
it: Dizionario MySpell te_IN

source: MySpell th_TH Dictionary
ca: Diccionari th-TH de MySpell
de: MySpell th_TH Wörterbuch
it: Dizionario MySpell th_TH

source: Thai spelling dictionary.
ca: Diccionari ortogràfic tailandès.
de: Thailändisches Rechtschreibwörterbuch.
it: Dizionario ortografico per il tailandese.

source: MySpell tr Dictionary
ca: Diccionari MySpell tr
de: MySpell tr-Wörterbuch
it: Dizionario MySpell tr

source: Turkish Spellcheck Dictionary.
ca: Diccionari turc de correcció ortogràfica.
it: Dizionario turco per il controllo ortografico.

source: MySpell tr_TR Dictionary
ca: Diccionari trTR MySpell
de: MySpell tr_TR-Wörterbuch
it: Dizionario MySpell tr_TR

source: MySpell uk_UA Dictionary
ca: Diccionari MySpell ukUA
de: MySpell uk_UA Wörterbuch
it: Dizionario MySpell uk_UA

source: Ukrainian spelling dictionary, hyphenation rules, and thesaurus.
ca: Ucraïnès: corrector ortogràfic, partició de mots i tesaurus.
de: Ukrainisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per l'ucraino.

source: MySpell vi Dictionary
ca: Diccionari MySpell vi
de: MySpell vi Wörterbuch
it: Dizionario MySpell vi

source: Vietnamese spelling dictionary.
ca: Vietnamita: corrector ortogràfic.
de: Vietnamesisches Rechtschreibwörterbuch.
it: Dizionario ortografico per il vietnamita.

source: MySpell vi_VN Dictionary
ca: Diccionari MySpell viVN
de: MySpell vi_VN Wörterbuch
it: Dizionario MySpell vi_VN

source: MySpell zu_ZA Dictionary
ca: Diccionari MySpell zuZA
de: MySpell zu_ZA Wörterbuch
it: Dizionario MySpell zu_ZA

source: Zulu hyphenation rules.
ca: Regles de partició de mots en zulu.
de: Zulu-Silbentrennungsregeln.
it: Regole di sillabazione della lingua zulu.

source: Belarusian spelling dictionary and hyphenation: official orthography 2008.
ca: Bielorús: corrector ortogràfic i partició de mots: ortografia oficial 2008.
de: Belarussisches Rechtschreibwörterbuch und Silbentrennung: offizielle Rechtschreibung 2008.

source: MySpell eo Dictionary
ca: Diccionari MySpell eo
de: MySpell eo-Wörterbuch
it: Dizionario MySpell eo

source: Spelling dictionary, thesaurus, and hyphenator for Esperanto.
ca: Diccionari ortogràfic, tesaurus i partició de mots per a esperanto.
de: Rechtschreibwörterbuch, Thesaurus und Silbentrenner für Esperanto.
it: Dizionario ortografico e regole di sillabazione per l'esperanto.

source: MySpell eo_EO Dictionary
ca: Diccionari MySpell eoEO
de: MySpell eo_EO-Wörterbuch
it: Dizionario MySpell eo_EO

source: Spanish spelling dictionary, hyphenation rules, and thesaurus for all variants of Spanish.
ca: Espanyol: corrector ortogràfic, partició de mots i tesaurus per a totes les variants de l'espanyol.
de: Spanisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus für alle Varianten des Spanischen.

source: MySpell es_GQ Dictionary
ca: Diccionari MySpell esGQ
de: MySpell es_GQ-Wörterbuch
it: Dizionario MySpell es_GQ

source: MySpell es_PH Dictionary
ca: Diccionari MySpell esPH
de: MySpell es_PH-Wörterbuch
it: Dizionario MySpell es_PH

source: MySpell es_US Dictionary
ca: Diccionari MySpell esUS
de: MySpell es_US-Wörterbuch
it: Dizionario MySpell es_US

source: Old German Dictionary for MySpell
ca: Diccionari alemany antic per al MySpell
de: Altdeutsches Wörterbuch für MySpell
it: Dizionario tedesco antico per MySpell

source: This dictionary supports spell checking according to the old German spelling rules. MySpell dictionaries are compatible with MySpell and Hunspell spell-checker. They are used by various desktop applications, for example, LibreOffice, Mozilla Thunderbird, and Mozilla Firefox.
ca: Aquest diccionari admet la verificació ortogràfica d'acord amb les regles ortogràfiques alemanyes antigues. Els diccionaris MySpell són compatibles amb el corrector ortogràfic MySpell i Hunspell. Són utilitzats per diverses aplicacions d'escriptori, per exemple, el LibreOffice, el Mozilla Thunderbird i el Mozilla Firefox.
de: Dieses Wörterbuch unterstützt die Rechtschreibprüfung nach den alten deutschen Rechtschreibregeln. MySpell-Wörterbücher sind mit den Rechtschreibprüfungen MySpell und Hunspell kompatibel. Sie werden von verschiedenen Desktop-Anwendungen verwendet, zum Beispiel von LibreOffice, Mozilla Thunderbird und Mozilla Firefox.
it: Questo dizionario supporta la correzione ortografica rispetto alle vecchie regole ortografiche tedesche. I dizionari MySpell sono compatibili con il correttore ortografico MySpell e Hunspell. Sono usati da varie applicazioni desktop, ad esempio LibreOffice, Mozilla Thunderbird e Mozilla Firefox.

source: MySpell ko_KR Dictionary
ca: Diccionari MySpell koKR
de: MySpell ko_KR-Wörterbuch
it: Dizionario MySpell ko_KR

source: Korean spellcheck dictionary.
ca: Diccionari coreà de verificació ortogràfica.
it: Dizionario ortografico per il coreano.

source: MySpell mn_Cyrl_MN Dictionary
ca: Diccionari mnCyrlMN del MySpell
de: MySpell mn_Cyrl_MN-Wörterbuch
it: Dizionario MySpell mn_Cyrl_MN

source: Mongolian spelling and hyphenation dictionaries.
ca: Diccionaris d'ortografia i partició de mots mongols.
de: Mongolische Wörterbücher für Rechtschreibung und Silbentrennung.
it: Dizionario ortografico e regole di sillabazione per il mongolo.

source: MySpell mn_MN Dictionary
ca: Diccionari mnMN del MySpell
de: MySpell mn_MN-Wörterbuch
it: Dizionario MySpell mn_MN

source: Spelling, thesaurus, hyphenation and grammar checking tools for Brazilian Portuguese.
ca: Eines d'ortografia, tesaurus, partició de mots i correcció gramatical per al portuguès brasiler.
de: Werkzeuge für Rechtschreibung, Thesaurus, Silbentrennung und Grammatikprüfung für brasilianisches Portugiesisch.

source: Portuguese, Portugal spelling and hyphenation dictionaries and thesaurus.
ca: Portuguès, Portugal: corrector ortogràfic i partició de mots i tesaurus.
de: Wörterbücher und Thesaurus zur Rechtschreibung und Silbentrennung in Portugiesisch, Portugal.

source: Albanian spelling dictionary, and hyphenation rules.
ca: Albanès: corrector ortogràfic i partició de mots.
de: Albanisches Rechtschreibwörterbuch und Silbentrennungsregeln.
it: Dizionario ortografico e regole di sillabazione per l'albanese.

source: Breton spelling dictionary.
de: Bretonisches Rechtschreibwörterbuch.
it: Dizionario ortografico per il bretone.
