Repository: openSUSE/packages-i18n
Catalog: */po/myspell.*.po
Languages: ca, de, it

source: MySpell af_NA Dictionary
ca: Diccionari MySpell afNA
de: MySpell af_NA Wörterbuch
it: Dizionario MySpell af_NA

source: Afrikaans spelling dictionary, and hyphenation rules.
ca: Afrikaans: corrector ortogràfic i partició de mots.
de: Afrikaans Rechtschreibwörterbuch und Silbentrennungsregeln.
it: Dizionario ortografico e regole di sillabazione per l'afrikaans.

source: MySpell af_ZA Dictionary
ca: Diccionari MySpell afZA
de: MySpell af_ZA Wörterbuch
it: Dizionario MySpell af_ZA

source: MySpell an Dictionary
ca: MySpell un diccionari
de: MySpell an Wörterbuch
it: Dizionario MySpell an

source: Aragonese spelling dictionary.
ca: Diccionari ortogràfic aragonès.
de: Aragonisches Rechtschreibwörterbuch.
it: Dizionario ortografico per l'aragonese.

source: MySpell an_ES Dictionary
ca: Diccionari MySpell anES
de: MySpell an_ES Wörterbuch
it: Dizionario MySpell an_ES

source: MySpell ar Dictionary
ca: Diccionari MySpell ar
de: MySpell ar Wörterbuch
it: Dizionario MySpell ar

source: Arabic spelling dictionary, and thesaurus Ayaspell.
ca: Àrab: corrector ortogràfic i tesaurus Ayaspell.
de: Arabisches Rechtschreibwörterbuch und Thesaurus Ayaspell.
it: Dizionario ortografico e dizionario dei sinonimi Ayaspell per l'arabo.

source: MySpell ar_AE Dictionary
ca: Diccionari MySpell arAE
de: MySpell ar_AE Wörterbuch
it: Dizionario MySpell ar_AE

source: MySpell ar_BH Dictionary
ca: Diccionari MySpell arBH
de: MySpell ar_BH Wörterbuch
it: Dizionario MySpell ar_BH

source: MySpell ar_DZ Dictionary
ca: Diccionari MySpell arDZ
de: MySpell ar_DZ Wörterbuch
it: Dizionario MySpell ar_DZ

source: MySpell ar_EG Dictionary
ca: Diccionari arEG MySpell
de: MySpell ar_EG Wörterbuch
it: Dizionario MySpell ar_EG

source: MySpell ar_IQ Dictionary
ca: Diccionari arIQ MySpell
de: MySpell ar_IQ Wörterbuch
it: Dizionario MySpell ar_IQ

source: MySpell ar_JO Dictionary
ca: Diccionari MySpell arJO
de: MySpell ar_JO Wörterbuch
it: Dizionario MySpell ar_JO

source: MySpell ar_KW Dictionary
ca: Diccionari MySpell arKW
de: MySpell ar_KW Wörterbuch
it: Dizionario MySpell ar_KW

source: MySpell ar_LB Dictionary
ca: Diccionari MySpell arLB
de: MySpell ar_LB Wörterbuch
it: Dizionario MySpell ar_LB

source: MySpell ar_LY Dictionary
ca: Diccionari d'arLY MySpell
de: MySpell ar_LY Wörterbuch
it: Dizionario MySpell ar_LY

source: MySpell ar_MA Dictionary
ca: Diccionari d'arMA del MySpell
de: MySpell ar_MA Wörterbuch
it: Dizionario MySpell ar_MA

source: MySpell ar_OM Dictionary
ca: Diccionari d'arOM del MySpell
de: MySpell ar_OM Wörterbuch
it: Dizionario MySpell ar_OM

source: MySpell ar_QA Dictionary
ca: Diccionari MySpell arQA
de: MySpell ar_QA Wörterbuch
it: Dizionario MySpell ar_QA

source: MySpell ar_SA Dictionary
ca: Diccionari MySpell arSA
de: MySpell ar_SA Wörterbuch
it: Dizionario MySpell ar_SA

source: MySpell ar_SD Dictionary
ca: Diccionari arSD MySpell
de: MySpell ar_SD Wörterbuch
it: Dizionario MySpell ar_SD

source: MySpell ar_SY Dictionary
ca: Diccionari arSY del MySpell
de: MySpell ar_SY Wörterbuch
it: Dizionario MySpell ar_SY

source: MySpell ar_TN Dictionary
ca: Diccionari MySpell arTN
de: MySpell ar_TN Wörterbuch
it: Dizionario MySpell ar_TN

source: MySpell ar_YE Dictionary
ca: Diccionari MySpell arYE
de: MySpell ar_YE Wörterbuch
it: Dizionario MySpell ar_YE

source: MySpell be_BY Dictionary
ca: Diccionari MySpell beBY
de: MySpell be_BY Wörterbuch
it: Dizionario MySpell be_BY

source: Belarusian spelling dictionary.
ca: Bielorús: corrector ortogràfic.
de: Belarussisches Rechtschreibwörterbuch.
it: Dizionario ortografico per il bielorusso.

source: MySpell bg_BG Dictionary
ca: Diccionari MySpell bgBG
de: MySpell bg_BG Wörterbuch
it: Dizionario MySpell bg_BG

source: Bulgarian spelling dictionary, hyphenation rules, and thesaurus.
ca: Búlgar: corrector ortogràfic, partició de mots i tesaurus.
de: Bulgarisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per il bulgaro.

source: MySpell bn_BD Dictionary
ca: Diccionari MySpell bnBD
de: MySpell bn_BD Wörterbuch
it: Dizionario MySpell bn_BD

source: Bengali spelling dictionary.
ca: Bengalí: corrector ortogràfic.
de: Bengalisches Rechtschreibwörterbuch.
it: Dizionario ortografico per il bengalese.

source: MySpell bn_IN Dictionary
ca: Diccionari MySpell bnIN
de: MySpell bn_IN Wörterbuch
it: Dizionario MySpell bn_IN

source: MySpell bo Dictionary
ca: Diccionari MySpell bo
de: MySpell bo Wörterbuch
it: Dizionario MySpell bo

source: Classical Tibetan syllable spellchecker for Hunspell.
ca: Corrector ortogràfic clàssic de síl·labes tibetanes per a Hunspell.
de: Klassische tibetische Silben-Rechtschreibprüfung für Hunspell.
it: Classico correttore ortografico e sillabatore di Hunspell per il tibetano.

source: MySpell bo_CN Dictionary
ca: Diccionari boCN del MySpell
de: MySpell bo_CN Wörterbuch
it: Dizionario MySpell bo_CN

source: MySpell bo_IN Dictionary
ca: Diccionari boIN MySpell
de: MySpell bo_IN Wörterbuch
it: Dizionario MySpell bo_IN

source: MySpell br_FR Dictionary
ca: Diccionari MySpell brFR
de: MySpell br_FR Wörterbuch
it: Dizionario MySpell br_FR

source: MySpell bs Dictionary
ca: Diccionari MySpell bs
de: MySpell bs Wörterbuch
it: Dizionario MySpell bs

source: Bosnian spelling dictionary.
ca: Bosnià: corrector ortogràfic.
de: Bosnisches Rechtschreibwörterbuch.
it: Dizionario ortografico per il bosniaco.

source: MySpell bs_BA Dictionary
ca: Diccionari MySpell bsBA
de: MySpell bs_BA Wörterbuch
it: Dizionario MySpell bs_BA

source: MySpell ca Dictionary
ca: Diccionari MySpell ca
de: MySpell ca Wörterbuch
it: Dizionario MySpell ca

source: Catalan spelling dictionary, hyphenation rules, and thesaurus.
ca: Català: corrector ortogràfic, partició de mots i tesaurus.
de: Katalanisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per il catalano.

source: MySpell ca_AD Dictionary
ca: Diccionari caAD MySpell
de: MySpell ca_AD Wörterbuch
it: Dizionario MySpell ca_AD

source: MySpell ca_ES Dictionary
ca: Diccionari de caes del MySpell
de: MySpell ca_ES Wörterbuch
it: Dizionario MySpell ca_ES

source: MySpell ca_ES_valencia Dictionary
ca: Diccionari de caesvalencia MySpell
de: MySpell ca_ES_valencia Wörterbuch
it: Dizionario MySpell ca_ES_valencia

source: MySpell ca_FR Dictionary
ca: Diccionari caFR del MySpell
de: MySpell ca_FR Wörterbuch
it: Dizionario MySpell ca_FR

source: MySpell ca_IT Dictionary
ca: Diccionari MySpell caIT
de: MySpell ca_IT Wörterbuch
it: Dizionario MySpell ca_IT

source: MySpell cs_CZ Dictionary
ca: Diccionari csCZ del MySpell
de: MySpell cs_CZ Wörterbuch
it: Dizionario MySpell cs_CZ

source: Czech spell check dictionary, hyphenation rules and thesaurus.
ca: Txec: corrector ortogràfic, partició de mots i tesaurus.
de: Tschechisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per il ceco.

source: MySpell da_DK Dictionary
ca: Diccionari MySpell daDK
de: MySpell da_DK Wörterbuch
it: Dizionario MySpell da_DK

source: Danish spelling dictionary, hyphenation rules, and thesaurus.
ca: danès: corrector ortogràfic, partició de mots i tesaurus.
de: Dänisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per il danese.

source: MySpell de Dictionary
ca: Diccionari MySpell
de: MySpell de Wörterbuch
it: Dizionario MySpell de

source: German (Austria, Germany, Switzerland) spelling dictionaries, hyphenation rules, and thesaurus.
ca: Alemany (Àustria, Alemanya, Suïssa) corrector ortogràfic, partició de mots i tesaurus.
de: Deutsches (Deutschland, Österreich, Schweiz) Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per il tedesco (Austria, Germania, Svizzera).

source: MySpell de_AT Dictionary
ca: Diccionari MySpell deAT
de: MySpell de_AT Wörterbuch
it: Dizionario MySpell de_AT

source: MySpell de_CH Dictionary
ca: Diccionari MySpell deCH
de: MySpell de_CH Wörterbuch
it: Dizionario MySpell de_CH

source: MySpell de_DE Dictionary
ca: Diccionari MySpell deDE
de: MySpell de_DE Wörterbuch
it: Dizionario MySpell de_DE

source: A Source Package for Dictionaries Used by MySpell
ca: Un paquet d'origen per als diccionaris usat pel MySpell
de: Ein Quellpaket für von MySpell verwendete Wörterbücher
it: Un pacchetto sorgente per i dizionari usati da MySpell

source: This source package contains dictionaries for MySpell. The MySpell spell-checker is used by the Libreoffice office suite, the Mozilla Composer, and the Mozilla Mail message composition window.
ca: Aquest paquet d'origen conté diccionaris per al MySpell. El corrector ortogràfic MySpell és utilitzat per la suite d'oficina del Libreoffice, el Mozilla Composer i la finestra de composició de missatges del Mozilla Mail.
de: Dieses Quellpaket enthält Wörterbücher für MySpell. Die MySpell-Rechtschreibprüfung wird von der Office-Suite Libreoffice, dem Mozilla Composer und dem Nachrichtenverfassungsfenster von Mozilla Mail verwendet.
it: Questo pacchetto sorgente contiene i dizionari per MySpell. Il correttore ortografico di MySpell è usato dalla suite per ufficio Libreoffice, il compositore di Mozilla e la finestra di composizione dei messaggi email di Mozilla.

source: MySpell el_GR Dictionary
ca: Diccionari MySpell elGR
de: MySpell el_GR Wörterbuch
it: Dizionario MySpell de_GR

source: Greek spelling dictionary, and hyphenation rules.
ca: Grec: corrector ortogràfic i partició de mots.
de: Griechisches Rechtschreibwörterbuch und Silbentrennungsregeln.
it: Dizionario ortografico e regole di sillabazione per il greco.

source: MySpell en Dictionary
ca: MySpell en Diccionari
de: MySpell en Wörterbuch
it: Dizionario MySpell en

source: English spelling dictionaries, hyphenation rules, thesaurus, and grammar checker.
ca: Diccionaris ortogràfics anglesos, regles de partició de mots, tesaurus i corrector gramatical.
de: Englisches Rechtschreibwörterbuch, Silbentrennungsregeln, Thesaurus und Grammatikprüfprogramm.
it: Dizionario ortografico, regole di sillabazione, dizionario dei sinonimi e correttore grammaticale per l'inglese.

source: MySpell en_AU Dictionary
ca: Diccionari MySpell enAU
de: MySpell en_AU Wörterbuch
it: Dizionario MySpell en_AU

source: MySpell en_BS Dictionary
ca: Diccionari MySpell enBS
de: MySpell en_BS Wörterbuch
it: Dizionario MySpell en_BS

source: MySpell en_BZ Dictionary
ca: Diccionari MySpell enBZ
de: MySpell en_BZ Wörterbuch
it: Dizionario MySpell en_BZ

source: MySpell en_CA Dictionary
ca: Diccionari MySpell enCA
de: MySpell en_CA Wörterbuch
it: Dizionario MySpell en_CA

source: MySpell en_GB Dictionary
ca: Diccionari MySpell enGB
de: MySpell en_GB Wörterbuch
it: Dizionario MySpell en_GB

source: MySpell en_GH Dictionary
ca: Diccionari MySpell enGH
de: MySpell en_GH Wörterbuch
it: Dizionario MySpell en_GH

source: MySpell en_IE Dictionary
ca: Diccionari MySpell enIE
de: MySpell en_IE Wörterbuch
it: Dizionario MySpell en_IE

source: MySpell en_IN Dictionary
ca: Diccionari MySpell enIN
de: MySpell en_IN Wörterbuch
it: Dizionario MySpell en_IN

source: MySpell en_JM Dictionary
ca: Diccionari MySpell enJM
de: MySpell en_JM Wörterbuch
it: Dizionario MySpell en_IM

source: MySpell en_MW Dictionary
ca: Diccionari MySpell enMW
de: MySpell en_MW Wörterbuch
it: Dizionario MySpell en_MW

source: MySpell en_NA Dictionary
ca: Diccionari MySpell enNA
de: MySpell en_NA Wörterbuch
it: Dizionario MySpell en_NA

source: MySpell en_NZ Dictionary
ca: Diccionari MySpell enNZ
de: MySpell en_NZ Wörterbuch
it: Dizionario MySpell en_NZ

source: MySpell en_PH Dictionary
ca: Diccionari MySpell enPH
de: MySpell en_PH Wörterbuch
it: Dizionario MySpell en_PH

source: MySpell en_TT Dictionary
ca: Diccionari MySpell enTT
de: MySpell en_TT Wörterbuch
it: Dizionario MySpell en_TT

source: MySpell en_US Dictionary
ca: Diccionari MySpell enUS
de: MySpell en_US Wörterbuch
it: Dizionario MySpell en_US

source: MySpell en_ZA Dictionary
ca: Diccionari MySpell enZA
de: MySpell en_ZA Wörterbuch
it: Dizionario MySpell en_ZA

source: MySpell en_ZW Dictionary
ca: Diccionari MySpell enZW
de: MySpell en_ZW Wörterbuch
it: Dizionario MySpell en_ZW

source: MySpell es Dictionary
ca: MySpell es Diccionari
de: MySpell es Wörterbuch
it: Dizionario MySpell es

source: Spanish spelling dictionary, hyphenation rules, and thesaurus for Spain and Latin America.
ca: Espanyol: corrector ortogràfic, partició de mots i tesaurus per a Espanya i Amèrica Llatina.
de: Spanisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus für Spanien und Lateinamerika.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per lo spagnolo di Spagna e America Latina.

source: MySpell es_AR Dictionary
ca: Diccionari MySpell esAR
de: MySpell es_AR Wörterbuch
it: Dizionario MySpell es_AR

source: MySpell es_BO Dictionary
ca: Diccionari MySpell esBO
de: MySpell es_BO Wörterbuch
it: Dizionario MySpell es_BO

source: MySpell es_CL Dictionary
ca: Diccionari MySpell esCL
de: MySpell es_CL Wörterbuch
it: Dizionario MySpell es_CL

source: MySpell es_CO Dictionary
ca: Diccionari MySpell esCO
de: MySpell es_CO Wörterbuch
it: Dizionario MySpell es_CO

source: MySpell es_CR Dictionary
ca: Diccionari esCR del MySpell
de: MySpell es_CR Wörterbuch
it: Dizionario MySpell es_CR

source: MySpell es_CU Dictionary
ca: Diccionari MySpell esCU
de: MySpell es_CU Wörterbuch
it: Dizionario MySpell es_CU

source: MySpell es_DO Dictionary
ca: Diccionari MySpell esDO
de: MySpell es_DO Wörterbuch
it: Dizionario MySpell es_DO

source: MySpell es_EC Dictionary
ca: Diccionari MySpell esEC
de: MySpell es_EC Wörterbuch
it: Dizionario MySpell es_EC

source: MySpell es_ES Dictionary
ca: Diccionari MySpell esES
de: MySpell es_ES Wörterbuch
it: Dizionario MySpell es_ES

source: MySpell es_GT Dictionary
ca: Diccionari MySpell esGT
de: MySpell es_GT Wörterbuch
it: Dizionario MySpell es_GT

source: MySpell es_HN Dictionary
ca: Diccionari MySpell esHN
de: MySpell es_HN Wörterbuch
it: Dizionario MySpell es_HN

source: MySpell es_MX Dictionary
ca: Diccionari MySpell esMX
de: MySpell es_MX Wörterbuch
it: Dizionario MySpell es_MX

source: MySpell es_NI Dictionary
ca: Diccionari MySpell esNI
de: MySpell es_NI Wörterbuch
it: Dizionario MySpell es_NI

source: MySpell es_PA Dictionary
ca: Diccionari MySpell esPA
de: MySpell es_PA Wörterbuch
it: Dizionario MySpell es_PA

source: MySpell es_PE Dictionary
ca: Diccionari MySpell esPE
de: MySpell es_PE Wörterbuch
it: Dizionario MySpell es_PE

source: MySpell es_PR Dictionary
ca: Diccionari MySpell esPR
de: MySpell es_PR Wörterbuch
it: Dizionario MySpell es_PR

source: MySpell es_PY Dictionary
ca: Diccionari esPY del MySpell
de: MySpell es_PY Wörterbuch
it: Dizionario MySpell es_PY

source: MySpell es_SV Dictionary
ca: Diccionari MySpell esSV
de: MySpell es_SV Wörterbuch
it: Dizionario MySpell es_SV

source: MySpell es_UY Dictionary
ca: Diccionari MySpell esUY
de: MySpell es_UY Wörterbuch
it: Dizionario MySpell es_UY

source: MySpell es_VE Dictionary
ca: Diccionari MySpell esVE
de: MySpell es_VE Wörterbuch
it: Dizionario MySpell es_VE

source: MySpell et_EE Dictionary
ca: Diccionari MySpell etEE
de: MySpell et_EE Wörterbuch
it: Dizionario MySpell et_EE

source: Estonian spelling dictionary, and hyphenation rules.
ca: Estonià: corrector ortogràfic i partició de mots.
de: Estnisches Rechtschreibwörterbuch und Silbentrennungsregeln.
it: Dizionario ortografico e regole di sillabazione per l'estone.

source: MySpell fr_BE Dictionary
ca: Diccionari MySpell frBE
de: MySpell fr_BE Wörterbuch
it: Dizionario MySpell fr_BE

source: French spelling dictionary, hyphenation rules, and thesaurus.
ca: Francès: corrector ortogràfic, partició de mots i tesaurus.
de: Französisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per il francese.

source: MySpell fr_CA Dictionary
ca: Diccionari MySpell frCA
de: MySpell fr_CA Wörterbuch
it: Dizionario MySpell fr_CA

source: MySpell fr_CH Dictionary
ca: Diccionari MySpell frCH
de: MySpell fr_CH Wörterbuch
it: Dizionario MySpell fr_CH

source: MySpell fr_FR Dictionary
ca: Diccionari MySpell frFR
de: MySpell fr_FR Wörterbuch
it: Dizionario MySpell fr_FR

source: MySpell fr_LU Dictionary
ca: Diccionari MySpell frLU
de: MySpell fr_LU Wörterbuch
it: Dizionario MySpell fr_LU

source: MySpell fr_MC Dictionary
ca: Diccionari frMC del MySpell
de: MySpell fr_MC Wörterbuch
it: Dizionario MySpell fr_MC

source: MySpell gd_GB Dictionary
ca: Diccionari GdGB del MySpell
de: MySpell gd_GB Wörterbuch
it: Dizionario MySpell gd_GB

source: Scottish Gaelic spell checker.
ca: Corrector ortogràfic en gaèlic escocès.
de: Schottisch-Gälische Rechtschreibprüfung.
it: Correttore ortografico per il gaelico scozzese.

source: MySpell gl Dictionary
ca: Diccionari MySpell gl
de: MySpell gl Wörterbuch
it: Dizionario MySpell gl

source: Galician spelling dictionary, hyphenation rules, and thesaurus.
ca: Gallec: corrector ortogràfic, partició de mots i tesaurus.
de: Galicisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per il galiziano.

source: MySpell gl_ES Dictionary
ca: Diccionari MySpell glES
de: MySpell gl_ES Wörterbuch
it: Dizionario MySpell gl_ES

source: MySpell gu_IN Dictionary
ca: Diccionari de guin del MySpell
de: MySpell gu_IN Wörterbuch
it: Dizionario MySpell gu_IN

source: Gujarati spelling dictionary.
ca: Gujarati: corrector ortogràfic.
de: Gujarati Rechtschreibwörterbuch.
it: Dizionario ortografico per il gujarati.

source: MySpell gug Dictionary
ca: Diccionari de gags del MySpell
de: MySpell gug Wörterbuch
it: Dizionario MySpell gug

source: Guarani thesaurus and spell checker.
ca: Tesaurus guaraní i corrector ortogràfic.
de: Guarani Thesaurus und Rechtschreibprüfung.
it: Dizionario dei sinonimi e correttore ortografico per il guaranì.

source: MySpell gug_PY Dictionary
ca: Diccionari de gugPY del MySpell
de: MySpell gug_PY Wörterbuch
it: Dizionario MySpell gug_PY

source: MySpell he_IL Dictionary
ca: Diccionari MySpell heIL
de: MySpell he_IL Wörterbuch
it: Dizionario MySpell he_IL

source: Hebrew spelling dictionary.
ca: Hebreu: corrector ortogràfic.
de: Hebräisches Rechtschreibwörterbuch.
it: Dizionario ortografico per l'ebraico.

source: MySpell hi_IN Dictionary
ca: Diccionari hiIN del MySpell
de: MySpell hi_IN Wörterbuch
it: Dizionario MySpell hi_IN

source: Hindi spelling dictionary.
ca: Hindi: corrector ortogràfic.
de: Hindi-Rechtschreibwörterbuch.
it: Dizionario ortografico per l'hindi.

source: MySpell hr_HR Dictionary
ca: Diccionari MySpell hrHR
de: MySpell hr_HR Wörterbuch
it: Dizionario MySpell hr_HR

source: Croatian spelling dictionary, and hyphenation rules.
ca: Croat: corrector ortogràfic i partició de mots.
de: Kroatisches Rechtschreibwörterbuch und Silbentrennungsregeln.
it: Dizionario ortografico e regole di sillabazione per il croato.

source: MySpell hu_HU Dictionary
ca: Diccionari MySpell huHU
de: MySpell hu_HU Wörterbuch
it: Dizionario MySpell hu_HU

source: Hungarian spelling dictionary, hyphenation rules, thesaurus, and grammar checker FSF.hu Foundation.
ca: Hongarès: corrector ortogràfic, partició de mots, tesaurus i corrector gramatical FSF.hu Foundation.
de: Ungarisches Rechtschreibwörterbuch, Silbentrennungsregeln, Thesaurus und Grammatikprüfung der Stiftung FSF.hu.
it: Dizionario ortografico, regole di sillabazione, dizionario dei sinonimi e correttore grammaticale della fondazione FSF.hu per l'ungherese.

source: MySpell id Dictionary
ca: Diccionari de l'identificador del MySpell
de: MySpell id Wörterbuch
it: Dizionario MySpell id

source: Indonesian spelling dictionary, hyphenation rules, and thesaurus.
ca: Indonesi: corrector ortogràfic, partició de mots i tesaurus.
de: Indonesisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per l'indonesiano.

source: MySpell id_ID Dictionary
ca: Diccionari idID del MySpell
de: MySpell id_ID Wörterbuch
it: Dizionario MySpell id_ID

source: MySpell is Dictionary
ca: El MySpell és un diccionari
de: MySpell is Wörterbuch
it: Dizionario MySpell is

source: Icelandic spelling dictionary, hyphenation rules and thesaurus.
ca: Islandès: corrector ortogràfic, partició de mots i tesaurus.
de: Isländisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per l'islandese.

source: MySpell is_IS Dictionary
ca: Diccionari MySpell ISIS
de: MySpell is_IS Wörterbuch
it: Dizionario MySpell is_IS

source: MySpell it_IT Dictionary
ca: Diccionari MySpell itIT
de: MySpell it_IT Wörterbuch
it: Dizionario MySpell it_IT

source: Italian spelling dictionary, hyphenation rules, and thesaurus.
ca: Italià: corrector ortogràfic, partició de mots i tesaurus.
de: Italienisches Rechtschreibwörterbuch, Silbentrennungsregeln und Thesaurus.
it: Dizionario ortografico, regole di sillabazione e dizionario dei sinonimi per l'italiano.

source: MySpell kmr_Latn Dictionary
ca: Diccionari kmrLatn de MySpell
de: MySpell kmr_Latn Wörterbuch
it: Dizionario MySpell kmr_Latn

source: Kurdish (Turkey) spelling dictionary.
ca: Kurd (Turquia) corrector ortogràfic.
de: Kurdisches (Türkei) Rechtschreibwörterbuch.
it: Dizionario ortografico per il curdo (Turchia).

source: MySpell kmr_Latn_SY Dictionary
ca: Diccionari kmrLatnSY de MySpell
de: MySpell kmr_Latn_SY Wörterbuch
it: Dizionario MySpell kmr_Latn_SY

source: MySpell kmr_Latn_TR Dictionary
ca: Diccionari kmrLatnTR de MySpell
de: MySpell kmr_Latn_TR Wörterbuch
it: Dizionario MySpell kmr_LatnTR

source: Lightproof for en
ca: Impermeable per a en
de: Lightproof für en
it: Lightproof per en

source: Lightproof grammar checker information for en.
ca: Informació de corrector gramatical a prova de llum per a en.
it: Dati del correttore grammaticale Lightproof per en.

source: Lightproof for hu_HU
ca: Impermeable per a huHU
de: Lightproof für hu_HU
it: Lightproof per hu_HU

source: Lightproof grammar checker information for hu_HU.
ca: Informació de corrector gramatical a prova de llum per al huHU.
it: Dati del correttore grammaticale Lightproof per hu_HU.

source: Lightproof for pt_BR
ca: Il·luminació per a ptBR
de: Lightproof für pt_BR
it: Lightproof per pt_BR

source: Lightproof grammar checker information for pt_BR.
ca: Informació de corrector gramatical a prova de llum per al ptBR.
it: Dati del correttore grammaticale Lightproof per pt_BR.

source: Lightproof for ru_RU
ca: Il·luminació per a ruRU
de: Lightproof für ru_RU
it: Lightproof per ru_RU

source: Lightproof grammar checker information for ru_RU.
ca: Informació de corrector gramatical a prova de llum per a la ruRU.
it: Dati del correttore grammaticale Lightproof per ru_RU.

source: MySpell lo_LA Dictionary
ca: Diccionari loLA MySpell
de: MySpell lo_LA Wörterbuch
it: Dizionario MySpell lo_LA

source: Lao spelling dictionary.
ca: Lao: corrector ortogràfic.
de: Laotisches Rechtschreibwörterbuch.
it: Dizionario ortografico per il laotiano.

source: MySpell lt_LT Dictionary
ca: Diccionari ltLT del MySpell
de: MySpell lt_LT Wörterbuch
it: Dizionario MySpell lt_LT

source: Lithuanian spelling dictionary, and hyphenation rules.
ca: Lituà: corrector ortogràfic i partició de mots.
de: Litauisches Rechtschreibwörterbuch und Silbentrennungsregeln.
it: Dizionario ortografico e regole di sillabazione per il lituano.

source: MySpell lv_LV Dictionary
ca: Diccionari lvLV de MySpell
de: MySpell lv_LV Wörterbuch
it: Dizionario MySpell lv_LV
