Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: LXDE Tools designed specifically for use with laptop computers.
ar: أدوات LXDE المصممة خصيصا للاستخدام مع أجهزة الكمبيوتر المحمولة.
ca: Eines de l'LXDE dissenyades especialment per usar en ordinadors portàtils.
cs: Nástroje prostředí LXDE navržené pro práci s notebooky.
da: LXDE-værktøjer designet specielt til brug med bærbare computere.
de: Speziell für die Benutzung mit Laptops entwickelte LXDE-Werkzeuge.
es: Herramientas de LXDE para usar principalmente con sistemas portátiles.
fi: LXDE-työkalut, jotka on suunniteltu erityisesti kannettaville tietokoneille.
id: Perkakas LXDE dirancang khusus untuk digunakan dengan komputer laptop.
it: Strumenti di LXDE progettati specificatamente per essere usati con i computer portatili.
pl: Narzędzia LXDE zaprojektowane specjalnie do użytku z komputerami przenośnymi.
pt_br: Ferramentas LXDE projetadas especificamente para serem usadas em notebooks.
ru: Инструменты LXDE, специально созданные для использования с переносными компьютерами.
sl: Orodja LXDE, ki so zasnovana za uporabo s prenosnimi računalniki.
sv: LXDE Verktyg designade specifikt för att användas med bärbara datorer.
uk: Засоби LXDE, спеціально створені для використання з ноутбуками.

source: LXDE Desktop
ca: Escriptori LXDE
cs: Pracovní plocha LXDE
da: LXDE-skrivebord
es: Escritorio LXDE
fi: LXDE-työpöytä
id: Destop LXDE
it: Desktop LXDE
pl: Środowisko LXDE
pt_br: Área de trabalho LXDE
ru: Рабочий стол LXDE
sl: Namizje LXDE
sv: LXDE Skrivbord
uk: Стільниця LXDE

source: LXDE Office
ar: مكتب LXDE
ca: Oficina de l'LXDE
cs: LXDE kancelář
da: LXDE-kontor
es: Software de ofimática para LXDE
fi: LXDE-toimisto
id: Perkantoran LXDE
it: LXDE per ufficio
pl: Biuro LXDE
pt_br: Suíte de escritório LXDE
ru: Офис LXDE
sl: Pisarna LXDE
uk: Офіс для LXDE

source: LXQt Desktop Environment
ca: Entorn d'escriptori LXQt
cs: Prostředí plochy LXQt
da: LXQt-skrivebordsmiljø
de: LXQt Desktop-Umgebung
es: Entorno de escritorio LXQt
fi: LXQt-työpöytäympäristö
id: Lingkungan Destop LXQt
it: Ambiente Desktop LXQt
pl: Środowisko graficzne LXQt
pt_br: Ambiente de trabalho LXQt
ru: Среда рабочего стола LXQT
sl: Namizno okolje LXQt
sv: LXQt Skrivbordsmiljö
uk: Стільничне середовище LXQt

source: LXQt is a lightweight desktop environment based on Qt.
ca: L'LXQt és entorn d'escriptori lleuger basat en Qt.
cs: LXQt je zjednodušené prostředí plochy založené na Qt.
da: LXQt er et letvægtsskrivebordsmiljø baseret på Qt.
de: LXQt ist eine leichtgewichtige Desktop-Umgebung basierend auf Qt.
es: LXQt es un entorno de escritorio ligero basado en Qt.
fi: LXQt on kevyt Qt-pohjainen työpöytäympäristö.
id: LXQt adalah lingkungan destop yang ringan berdasarkan Qt.
it: LXQt è un ambiente desktop leggero basato su Qt.
pl: LXQt jest lekkim środowiskiem graficznym opartym na Qt.
pt_br: O LXQt é um ambiente de trabalho leve baseado em Qt.
ru: LXQt — легковесное окружение рабочего стола на базе Qt.
sl: LXQt je lahko namizno okolje, ki temelji na grafičnem ogrodju Qt.
sv: LXQt är en lätt skrivbordsmiljö baserad på Qt.
uk: LXQt - легке стільничне середовище, базоване на Qt.

source: MATE Desktop Environment
ca: Entorn d'escriptori MATE
cs: Prostředí plochy MATE
da: MATE-skrivebordsmiljø
de: MATE Desktop-Umgebung
es: Entorno de escritorio MATE
fi: MATE-työpöytäympäristö
id: Lingkungan Destop MATE
it: Ambiente desktop MATE
pl: Środowisko pulpitu MATE
pt_br: Ambiente de trabalho MATE
ru: Среда рабочего стола MATE
sl: Namizno okolje MATE
sv: MATE Skrivbordsmiljö
uk: Стільничне середовище MATE

source: The MATE desktop environment is a desktop environment using traditional metaphors.
ca: L'entorn d'escriptori MATE és un entorn d'escriptori que utilitza metàfores tradicionals.
cs: Prostředí plochy MATE je pracovní plocha používající tradiční metafory.
da: MATE-skrivebordsmiljøet er et skrivebordsmiljø som bruger traditionelle metaforer.
de: Die MATE Desktop-Umgebung ist eine Desktop-Umgebung, die traditionelle Metaphern verwendet.
es: El entorno de escritorio MATE es un entorno de escritorio que utiliza metáforas tradicionales.
fi: MATE on perinteiseen työpöytäkäsitykseen perustuva työpöytäympäristö.
id: Lingkungan destop MATE adalah lingkungan destop yang menggunakan metafora tradisional.
it: L'ambiente desktop MATE è un ambiente desktop che si rifà alle metafore tradizionali.
pl: Środowisko graficzne MATE to środowisko graficzne wykorzystujące tradycyjne metafory.
pt_br: O MATE é um ambiente de trabalho usando metáforas tradicionais.
ru: MATE — среда рабочего стола, использующая традиционные метафоры.
sl: MATE je namizno okolje, ki uporablja tradicionalne metafore.
sv: MATE-skrivbordsmiljön är en skrivbordsmiljö som använder traditionella metaforer.
uk: MATE - стільничне середовище, що використовує традиційні метафори.

source: MATE Administration Tools
ca: Eines d'administració del MATE
cs: Nástroje správy MATE
da: MATE-administrationsværktøjer
de: MATE Administrationstools
es: Herramientas de administración de MATE
fi: MATE-ylläpitotyökalut
id: Perkakas Administrasi MATE
it: Strumenti di amministrazione MATE
pl: Narzędzia administracyjne MATE
pt_br: Ferramentas de administração do MATE
ru: Инструменты администрирования MATE
sl: Skrbniška orodja MATE
sv: MATE Administrationsverktyg
uk: Засоби адміністрування MATE

source: Administration Tools e.g. for desktop lockdown.
ca: Eines d'administració, per exemple, per al bloqueig d'escriptori.
cs: Nástroje správy, např. pro uzamčení plochy.
da: Administrative værktøjer f.eks. til låsning af skrivebordet.
de: Administrationstools z.B. zur Desktop-Sperre.
es: Herramientas de administración por ejemplo el bloqueador de escritorio.
fi: Ylläpitotyökalut, esim. työpöydän lukitus.
id: Perkakas Administrasi misalnya untuk penguncian destop.
it: Strumenti di amministrazione, ad esempio per il blocco del desktop.
pl: Narzędzia administracyjne m.in. do blokowania pulpitu.
pt_br: Ferramentas de administração, por ex.: bloqueio da área de trabalho.
ru: Инструменты администрирования, например, для блокирования рабочего стола.
sl: Orodja za skrbnike, na primer za zaklep nastavitev namizja.
sv: Administrationsverktyg t.ex. för skrivbordslåsning.
uk: Засоби адміністрування, наприклад, для блокування стільниці.

source: MATE Desktop
ca: Escriptori MATE
cs: Pracovní plocha MATE
da: MATE-skrivebord
es: Escritorio MATE
fi: MATE-työpöytä
id: Destop MATE
it: Desktop MATE
pl: Środowisko MATE
pt_br: Área de trabalho MATE
ru: Рабочий стол MATE
sl: Namizje MATE
sv: MATE Skrivbord
uk: Стільниця MATE

source: MATE Base System
ca: Sistema de base MATE
cs: Základní systém MATE
da: MATE grundlæggende system
de: MATE Basissystem
es: Sistema básico MATE
fi: MATE-perusjärjestelmä
id: Sistem Dasar MATE
it: Sistema di base MATE
pl: System bazowy MATE
pt_br: Sistema base do MATE
ru: Базовая система MATE
sl: Osnovni sistem za MATE
sv: MATE Bas-system
uk: Базова система MATE

source: Base packages for the MATE desktop environment.
ca: Paquets de base per a l'entorn d'escriptori MATE.
cs: Základní balíčky pro prostředí plochy MATE.
da: Grundlæggende pakker til MATE-skrivebordsmiljøet.
de: Basis-Pakete für die MATE Desktop-Umgebung.
es: Paquetes básicos para el entorno de escritorio MATE.
fi: Peruspaketit MATE-työpöytäympäristölle.
id: Paket dasar untuk lingkungan destop MATE.
it: Pacchetti di base per l'ambiente desktop MATE.
pl: Podstawowe pakiety dla środowiska graficznego MATE.
pt_br: Pacotes base para o ambiente de trabalho MATE.
ru: Основные пакеты для среды рабочего стола MATE.
sl: Osnovni paketi za namizno okolje MATE.
sv: Bas paket för MATE skrivbordsmiljön.
uk: Основні пакунки для стільничного середовища MATE.

source: MATE Internet
ca: Internet del MATE
cs: Internet MATE
id: Internet MATE
it: Internet MATE
pl: Internet MATE
pt_br: Internet do MATE
ru: Интернет MATE
sl: Internet MATE
uk: Інтернет для MATE

source: MATE Internet Applications.
ca: Aplicacions d'Internet del MATE.
cs: Aplikace Internetu MATE.
da: MATE-internetprogrammer.
de: MATE-Internet-Anwendungen.
es: Aplicaciones de internet de MATE.
fi: MATE-internetsovellukset.
id: Aplikasi Internet MATE.
it: Applicazioni internet per MATE.
pl: Aplikacje internetowe MATE.
pt_br: Aplicativos de Internet do MATE.
ru: Интернет-приложения для MATE.
sl: Programi MATE za internet.
sv: MATE Internet Applikationer.
uk: Програми інтернету для MATE.

source: MATE Laptop
ca: Portàtil MATE
da: MATE-bærbar
es: MATE portátil
fi: MATE-kannettava
id: Laptop MATE
it: MATE per computer portatili
pl: Laptop MATE
pt_br: Notebook do MATE
ru: Ноутбук MATE
sl: Prenosnik MATE
uk: MATE для ноутбуків

source: MATE Tools designed specifically for use with laptop computers.
ca: Eines del MATE dissenyades específicament per usar en ordinadors portàtils.
cs: Nástroje MATE speciálně navržené pro použití na laptopech/ntb.
da: MATE-værktøjer designet specielt til brug med bærbare computere.
de: MATE-Tools, die speziell für die Verwendung mit Laptops designed wurden.
es: Herramientas de MATE diseñadas específicamente para utilizarlas en equipos portátiles.
fi: MATE-työkalut erityisesti kannettaviin tietokoneisiin.
id: Perkakas MATE dirancang khusus untuk digunakan dengan komputer laptop.
it: Strumenti MATE progettati specificamente per l'uso con i computer portatili.
pl: Narzędzia MATE zaprojektowane specjalnie do użytku z laptopami.
pt_br: Ferramentas do MATE desenhadas especificamente para o uso em notebooks.
ru: Инструменты MATE, специально созданные для использования с переносными компьютерами.
sl: Orodja MATE, ki so zasnovana za uporabo s prenosnimi računalniki.
sv: MATE Verktyg designade specifikt för att användas med bärbara datorer.
uk: Засоби MATE, спеціально створені для використання з ноутбуками.

source: MATE Office
ca: Oficina del MATE
da: MATE-kontor
es: MATE oficina
fi: MATE-toimisto
id: Perkantoran MATE
it: MATE per l'ufficio
pl: Biuro MATE
pt_br: Suíte de escritório do MATE
ru: Офис MATE
sl: Pisarna MATE
uk: Офіс для MATE

source: MATE Utilities
ca: Utilitats del MATE
cs: Utility MATE
da: MATE-redskaber
de: MATE-Hilfsprogramme
es: MATE utilidades
fi: MATE-apuohjelmat
id: Utilitas MATE
it: Utilità MATE
pl: Narzędzia MATE
pt_br: Utilitários do MATE
ru: Утилиты MATE
sl: Orodja MATE
sv: MATE Verktyg
uk: Утиліти MATE

source: Network Administration
ar: إدارة الشبكة
ca: Administració de xarxa
cs: Správa sítě
da: Netværksadministration
de: Netzwerkverwaltung
es: Administración de red
fi: Verkonhallinta
id: Administrasi Jaringan
it: Amministrazione di rete
pl: Administracja siecią
pt_br: Administração de rede
ru: Администрирование сети
sl: Administracija omrežja
sv: Nätverksadministration
uk: Адміністрування мережі

source: Tools for administering and debugging networks.
ar: أدوات لإدارة وتصحيح أخطاء الشبكات.
ca: Eines per administrar i depurar xarxes.
cs: Nástroje pro správu sítě k ladění sítě.
da: Værktøjer til administrering og fejlsøgning af netværker.
de: Werkzeuge für Netzwerkadministratoren zum Untersuchen des Netzwerks.
es: Herramientas para la administración y depuración de redes.
fi: Verkonhallinta- ja vianetsintätyökalut.
id: Perkakas untuk mengelola dan mengawakutu jaringan.
it: Strumenti per amministrare reti ed effettuarne il debug.
pl: Narzędzia dla administratorów sieciowych.
pt_br: Ferramentas para administrar e depurar redes.
ru: Инструменты для администрирования и отладки сетей.
sl: Orodja za skrbnike omrežij in razhroščevanje omrežij.
sv: Verktyg för att administrera och felsöka nätverk.
uk: Засоби для адміністрування та зневадження мереж.

source: XFCE Desktop Environment
ar: بيئة سطح المكتب اكسفيس
ca: Entorn d'escriptori XFCE
cs: Prostředí XFCE
da: Xfce-skrivebordsmiljø
de: XFCE-Desktop-Umgebung
es: Entorno de escritorio XFCE
fi: XFCE-työpöytäympäristö
id: Lingkungan Destop XFCE
it: Ambiente desktop XFCE
pl: Środowisko graficzne XFCE
pt_br: Ambiente de trabalho do Xfce
ru: Среда рабочего стола XFCE
sl: Namizno okolje Xfce
sv: Skrivbordsmiljön XFCE
uk: Стільничне середовище XFCE

source: Xfce is a lightweight desktop environment for various *NIX systems.
ar: اكسفيس هي بيئة سطح مكتب خفيفة لمختلف نظم *NIX.
ca: L'Xfce és un entorn d'escriptori lleuger per a diversos sistemes ...NIX.
cs: Xfce je jednoduché pracovní prostředí pro různé *NIXové systémy.
da: Xfce er et letvægtsskrivebordsmiljø til diverse *NIX-systemer.
de: Xfce ist ein schneller Desktopmanager für verschiedene *NIX Systeme.
es: Xfce es un entorno de escritorio ligero para varios sistemas *NIX.
fi: Xfce on kevyt käyttöympäristö erilaisille *NIX-järjestelmille.
id: Xfce adalah lingkungan destop yang ringan untuk berbagai sistem * NIX.
it: Xfce è un ambiente desktop leggero per vari sistemi *NIX.
pl: Xfce to środowisko graficzne o niewielkich wymaganiach przeznaczone dla systemów *NIX.
pt_br: O Xfce é um ambiente de trabalho leve para vários sistemas *NIX.
ru: Xfce — легковесное окружение рабочего стола для различных систем *NIX.
sl: Xfce je lahko namizno okolje za sisteme GNU/Linux in *NIX.
sv: Xfce är en lätt skrivbordsmiljö för olika *NIX-system.
uk: Xfce - легке стільничне середовище для різних систем *NIX.

source: XFCE Base System
ar: نظام إكسفس الأساسي
ca: Sistema de base XFCE
cs: Základní systém XFCE
da: Xfce grundlæggende system
de: Xfce-Basissystem
es: Sistema base de XFCE
fi: XFCE-perusjärjestelmä
id: Sistem Dasar XFCE
it: Sistema di base XFCE
pl: Podstawowy system XFCE
pt_br: Sistema base do Xfce
ru: Базовая система XFCE
sl: Osnovni sistem za Xfce
sv: XFCE Bas System
uk: Базова система XFCE

source: Base packages for the XFCE Desktop Environment
ar: الحزم الأساسية لبيئة سطح مكتب إكسفس
ca: Paquets de base per a l'entorn d'escriptori XFCE
cs: Základní balíčky prostředí pracovní plochy XFCE
da: Grundlæggende pakker til Xfce-skrivebordsmiljøet
de: Grundlegende Pakete für die XFCE-Desktop-Umgebung
es: Paquetes básicos para el entorno del escritorio XFCE
fi: Peruspaketit XFCE-työpöytäympäristölle
id: Paket dasar untuk Lingkungan Destop XFCE
it: Pacchetti di base per l'ambiente desktop XFCE
pl: Podstawowe oprogramowanie dla środowiska XFCE
pt_br: Pacotes base para o ambiente de trabalho do Xfce
ru: Основные пакеты для среды рабочего стола XFCE
sl: Osnovni paketi za namizno okolje Xfce
sv: Bas paket för XFCE Skrivbordsmiljön
uk: Основні пакунки для стільничного середовища XFCE

source: XFCE Laptop
ar: كمبيوتر محمول إكسفس
ca: Portàtil XFCE
da: Xfce bærbar
es: Portátil XFCE
fi: XFCE-kannettava tietokone
id: Laptop XFCE
it: XFCE per computer portatili
pl: Komputer przenośny XFCE
pt_br: Notebook XFCE
ru: Ноутбук XFCE
sl: Prenosnik Xfce
uk: XFCE для ноутбуків

source: XFCE Desktop
ca: Escriptori XFCE
cs: Pracovní plocha XFCE
da: Xfce-skrivebord
es: Escritorio XFCE
fi: XFCE-työpöytä
id: Destop XFCE
it: Desktop XFCE
pl: Środowisko XFCE
pt_br: Área de trabalho Xfce
ru: Рабочий стол XFCE
sl: Namizje Xfce
sv: XFCE Skrivbord
uk: Стільниця XFCE

source: XFCE Office
ar: مكتب إكسفس
ca: Oficina d'XFCE
cs: XFCE kancelář
da: Xfce kontor
de: XFCE Büroprogramme
es: Oficina de XFCE
fi: XFCE-toimisto
id: Perkantoran XFCE
it: XFCE per l'ufficio
pl: Programy biurowe XFCE
pt_br: Suíte de escritório do XFCE
ru: Офис XFCE
sl: Pisarna Xfce
uk: Офіс для XFCE

source: openSUSE MicroOS
ca: MicroSO d'openSUSE
ru: openSUSE MicrоOS

source: Deepin Desktop
ca: Escriptori Deepin
cs: Prostředí plochy Deepin
es: Escritorio Deepin
fi: Deepin-työpöytä
id: Destop Deepin
it: Desktop Deepin
pl: Środowisko Deepin
pt_br: Área de trabalho Deepin
ru: Рабочий стол Deepin
sl: Namizje deepin
sv: Skrivbordsmiljön Deepin
uk: Стільниця Deepin

source: Base System
ca: Sistema de base
cs: Základní systém
de: Basissystem
es: Sistema base
fi: Perusjärjestelmä
id: Sistem Dasar
it: Sistema di base
pl: Podstawowy system
pt_br: Sistema base
ru: Базовая система
sl: Osnovni sistem
sv: Bas-system

source: This is the base runtime system. It contains only a basic multiuser booting system. For running on real hardware, you need to add additional packages and pattern to make this pattern useful on its own.
ca: Això és el sistema d'execució de base. Conté només un sistema bàsic d'arrencada i multiusuari. Per executar-lo en maquinari real, cal que afegiu paquets i patrons addicionals per fer que aquest patró sigui útil per si mateix.
cs: Toto je základní běhový systém. Obsahuje pouze základní víceuživatelský spustitelný systém. Aby spuštění na skutečném hardwaru dávalo smysl, musíte ještě doinstalovat další balíčky a profily.
id: Ini adalah sistem runtime dasar. Ini hanya berisi sistem boot multiuser dasar. Untuk menjalankan pada perangkat keras nyata, Anda perlu menambahkan paket dan pola tambahan untuk membuat pola ini berguna sendiri.
it: Questo è il sistema runtime base. Contiene solo un sistema multiutente d'avvio minimo. Per eseguirlo su dell'hardware reale, è necessario aggiungere ulteriori pacchetti e modelli per rendere questo modello utilizzabile.
pl: To jest podstawowy system wykonawczy. Zawiera tylko podstawowy system uruchamiania dla wielu użytkowników. Aby uruchomić na prawdziwym sprzęcie, musisz dodać dodatkowe pakiety i wzorzec, aby ten wzorzec był sam w sobie użyteczny.
pt_br: Este é o sistema base de execução. Ele contém apenas um sistema de inicialização multiusuário básico. Para executá-lo num hardware real, será necessário adicionar pacotes e padrões adicionais para tornar este padrão útil.
ru: Это базовая система. Здесь содержится только простейшая многопользовательская загружаемая система. Для запуска на реальном оборудовании, вам нужны дополнительные пакеты и шаблоны, чтобы данный шаблон был полезен сам по себе.
sl: To je osnovni izvajalni sistem. Vsebuje le osnovni več-uporabniški sistem. Za poganjanje na pravi strojni opremi, morate dodati druge pakete in vzorce, da bo ta vzorec uporaben.
sv: Det här är det grundläggande körtidssystemet. Det innehåller endast ett grundläggande startsystem för flera användare. Om det ska köras på riktig maskinvara måste du lägga till ytterligare paket och mönster så att det här mönstret blir användbart när det används fristående.

source: Security-Enhanced Linux (SELinux) provides a mechanism for supporting access control security policies, including mandatory access controls (MAC). Its architecture strives to separate enforcement of security decisions from the security policy, and streamlines the amount of software involved with security policy enforcement.
ca: El Security-Enhanced Linux (SELinux) proporciona un mecanisme per donar suport a les polítiques de seguretat del control d’accés, inclosos els controls d’accés obligatoris (MAC). La seva arquitectura s’esforça per separar l’aplicació de les decisions de seguretat de la política de seguretat i simplifica la quantitat de programari implicat en l’aplicació de la política de seguretat.
cs: Security-Enhanced Linux (SELinux) poskytuje mechanismus pro podporu zásad zabezpečení řízení přístupu, včetně povinných ovládacích prvků přístupu (MAC). Jeho architektura se snaží oddělit prosazování bezpečnostních rozhodnutí od bezpečnostních zásad a snižuje množství softwaru zapojeného do vynucování bezpečnostních zásad.
de: Security-Enhanced Linux (SELinux) bietet einen Mechanismus zur Unterstützung von Sicherheitsrichtlinien für die Zugriffskontrolle, einschließlich obligatorischer Zugriffskontrollen (MAC). Durch die Architektur soll die Durchsetzung von Sicherheitsentscheidungen von der Sicherheitsrichtlinie getrennt werden, um die Anzahl der Softwarelösungen, die an der Durchsetzung von Sicherheitsrichtlinien beteiligt sind, zu optimieren.
es: Security-Enhanced Linux (SELinux) proporciona un mecanismo para admitir directivas de seguridad de control de acceso, incluidos los controles de acceso obligatorios (MAC). Su arquitectura se esfuerza por separar la aplicación de las decisiones de seguridad de la directiva de seguridad, y optimiza la cantidad de software implicado en la aplicación de la directiva de seguridad.
id: Security-Enhanced Linux (SELinux) menyediakan mekanisme untuk mendukung kebijakan keamanan kontrol akses, termasuk kontrol akses wajib/mandatory access controls (MAC). Arsitekturnya berusaha untuk memisahkan penegakan keputusan keamanan dari kebijakan keamanan, dan merampingkan jumlah perangkat lunak yang terlibat dengan penegakan kebijakan keamanan.
it: Security-Enhanced Linux (SELinux) fornisce un meccanismo per supportare le policy di sicurezza del controllo dell'accesso, inclusi i controlli dell'accesso obbligatori (MAC). La sua architettura mira a separare l'applicazione delle decisioni di sicurezza dalla policy di sicurezza e ottimizza la quantità di software coinvolta nell'applicazione delle policy di sicurezza.
pl: Security-Enhanced Linux (SELinux) zapewnia mechanizm wspierania polityk bezpieczeństwa kontroli dostępu, w tym obowiązkowych kontroli dostępu (MAC). Jego architektura dąży do oddzielenia egzekwowania decyzji bezpieczeństwa od polityki bezpieczeństwa i usprawnia ilość oprogramowania zaangażowanego w egzekwowanie polityki bezpieczeństwa.
pt_br: Security-Enhanced Linux (SELinux) fornece um mecanismo para suportar políticas de segurança de controle de acesso, incluindo controles de acesso obrigatórios (MAC). Sua arquitetura se esforça para separar a aplicação das decisões de segurança da política de segurança e simplifica a quantidade de software envolvida na aplicação da política de segurança.
ru: Linux с повышенной безопасностью (SELinux) предоставляет механизм для поддержки политик безопасности контроля доступа, включая обязательный контроль доступа (MAC). Его архитектура стремится отделить выполнение решений по безопасности от политики безопасности и оптимизирует количество программного обеспечения, связанного с применением политики безопасности.
sl: Security-Enhanced Linux (SELinux) ponuja podporni mehanizem za varnostna pravila za nadzor dostopa, vključno z obveznimi nadzorovalniki dostopa (mandatory access controls, MAC). Njegova arhitektura stremi k ločitvi izvajanja varnostnih odločitev od varnostnih pravil, ter čimbolj zmanjša količino programske opreme, ki se uporablja pri izvajanju varnostnih pravil.
sv: Säkerhetsförbättrad Linux (SELinux) tillhandahåller en mekanism för att stödja säkerhetspolicyer för åtkomstkontroll, inklusive obligatoriska åtkomstkontroller (MAC). Dess arkitektur strävar efter att separera verkställandet av säkerhetsbeslut från säkerhetspolicyn och effektiviserar mängden programvara som är involverad i upprätthållandet av säkerhetspolicyn.
uk: Посилена безпека Linux (SELinux - Security-Enhanced Linux ) забезпечує механізм підтримки політики безпеки контролю доступу, включаючи обов'язковий контроль доступу (MAC). Його архітектура прагне відокремити виконання рішень щодо безпеки від політики безпеки, а також спрощує кількість програмного забезпечення, залученого до виконання політики безпеки.

source: Container Runtime for non-clustered systems
ca: Entorn d'execució de contenidor per a sistemes sense clúster
cs: Kontejner spustitelných programů pro systémy neběžící v clusteru
da: Container-runtime for systemer ikke i cluster
de: Container Laufzeit für nicht-geclusterte Systeme
es: Entorno de ejecución del contenedor para sistemas no agrupados en clústeres
fi: Kontin ajo ei-klusteroituja järjestelmiä varten
id: Runtime Kontainer untuk sistem non-cluster
it: Runtime del container per sistemi non in cluster
pl: Container Runtime dla systemów nieklastrowych
pt_br: Tempo de execução do contêiner para sistemas não cluster
ru: Среда выполнения контейнеров для бескластерных систем
sl: Izvajalno okolje za vsebnike za samostojne sisteme
sv: Behållar körtid för icke-klustrade system
uk: Контейнерне середовище для безкластерних систем
