Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: YaST Desktop Utilities
ar: أدوات سطح المكتب لياست YaST
ca: Utilitats del YaST per a l'escriptori
cs: Utility plochy YaST
de: YaST Desktop-Dienstprogramme
es: Utilidades de escritorio de YaST
fi: YaST – Työpöytätyökalut
id: Utilitas Destop YaST
it: Utilità desktop di YaST
pl: Narzędzia pulpitu YaST
pt_br: Utilitários de área de trabalho do YaST
ru: Утилиты YaST для рабочего стола
sl: Namizna orodja YaST
sv: YaST skrivbordsverktyg
uk: YaST утиліти для стільниці

source: YaST tools for desktop system administration.
ar: أدوات ياست لإدارة نظام سطح المكتب.
ca: Eines del YaST per a l'administració del sistema d'escriptori.
cs: Nástroje programu YaST pro správu systému z plochy.
de: YaST-Tools für die Desktop-Systemadministration.
es: Herramientas de YaST para la administración del sistema de escritorio.
fi: YaST-työkalut työpöydän järjestelmänhallintaan.
id: Perkakas YaST untuk administrasi sistem destop.
it: Strumenti di YaST per l'amministrazione desktop del sistema.
pl: Narzędzia YaST do administracji systemem.
pt_br: Ferramentas do YaST para administração de sistema de desktop.
ru: Инструменты YaST для администрирования настольных систем.
sl: Orodja YaST za upravljanje sistema z namiznim okoljem.
sv: YaST-verktyg för skrivbords systemadministration.
uk: Стільничні засоби YaST для адміністрування системи.

source: YaST Server Utilities
ar: أدوات الخادم في ياست
ca: Utilitats del YaST per al servidor
cs: Serverové utility YaST
de: YaSt Server-Hilfsprogramme
es: Utilidades de servidor de YaST
fi: YaST – Palvelintyökalut
id: Utilitas Peladen YaST
it: Utilità server di YaST
pl: Narzędzia serwerowe YaST
pt_br: Utilitários de servidor YaST
ru: Серверные утилиты YaST
sl: Strežniška orodja YaST
sv: YaST Server verktyg
uk: Серверні утиліти YaST

source: YaST tools for server system administration.
ar: أدوات ياست لإدارة نظام الخادم.
ca: Eines del YaST per a l'administració del sistema de servidor.
cs: Nástroje programu YaST pro správu serverových systémů.
de: YaST-Tools für die Server-Systemadministration.
es: Herramientas de YaST para la administración del sistema de servidor.
fi: YaST-työkalut palvelimen järjestelmänhallintaan.
id: Perkakas YaST untuk administrasi sistem peladen.
it: Strumenti di YaST per l'amministrazione server del sistema.
pl: Narzędzia YaST do administracji systemem.
pt_br: Ferramentas do YaST para administração de sistema de servidor.
ru: Инструменты YaST для администрирования серверной системы.
sl: Orodja YaST za upravljanje strežniškega sistema.
sv: YaST-verktyg för server systemadministration.
uk: Засоби YaST для адміністрування серверної системи.

source: GNOME Desktop Environment (Basic)
ar: بيئة سطح المكتب GNOME (أساسي)
ca: Entorn d'escriptori GNOME (Bàsic)
cs: Prostředí plochy GNOME (Basic)
da: GNOME-skrivebordsmiljø (grundlæggende)
de: GNOME-Desktopumgebung (Basic)
es: Entorno de escritorio GNOME (Básico)
fi: GNOME-työpöytäympäristö (perus)
id: Lingkungan Destop GNOME (Dasar)
it: Ambiente desktop GNOME (di base)
pl: Środowisko graficzne GNOME (podstawowe)
pt_br: Ambiente de trabalho GNOME (básico)
ru: Среда рабочего стола GNOME (базовая)
sl: Namizno okolje GNOME (osnovno)
sv: GNOME-skrivbordsmiljö (Grundläggande)
uk: Стільничне середовище GNOME (базове)

source: The GNOME desktop environment is an intuitive and attractive desktop for users. This pattern installs GNOME desktop environment with only essential graphical applications installed (File Manager, Web Browser).
ar: إن بيئة سطح المكتب GNOME هي سطح مكتب سهل وجذاب للمستخدمين. يعمل هذا النمط على تثبيت بيئة سطح المكتب GNOME مع تثبيت التطبيقات الرسومية الضرورية فقط ("مدير الملفات","متصفح الويب").
ca: L'entorn d'escriptori GNOME és un escriptori intuïtiu i atractiu per als usuaris. Aquest patró instal·la l'entorn d'escriptori GNOME amb només les aplicacions gràfiques essencials (administrador de fitxers, navegador web).
cs: Prostředí plochy GNOME je intuitivní a atraktivní pracovní plocha pro uživatele. Tento vzor nainstaluje prostředí plochy GNOME pouze se základními grafickými aplikacemi (správce souborů, webový prohlížeč).
da: GNOME-skrivebordsmiljøet er et intuitivt og attraktivt skrivebord til brugere. Mønsteret installerer GNOME-skrivebordsmiljø med kun essentielle grafiske programmer installeret (filhåndtering, webbrowser).
de: Die GNOME-Desktopumgebung ist eine intuitive und attraktive Arbeitsoberfläche für Benutzer. Dieses Schema installiert eine GNOME-Desktopumgebung, die nur die wichtigsten grafischen Anwendungen enthält (Dateiverwaltung, Webbrowser).
es: El entorno de escritorio GNOME es un escritorio intuitivo y atractivo para los usuarios. Este patrón instala el entorno de escritorio GNOME solo con las aplicaciones gráficas esenciales (administrador de archivos, navegador web).
fi: GNOME on intuitiivinen ja vetovoimainen työpöytäympäristö. Tämä kuvio asentaa GNOME-työpöytäympäristön vain olennaisimmin graafisin sovelluksin (tiedostonhallinta, selain).
id: Lingkungan destop GNOME adalah destop yang intuitif dan menarik bagi pengguna. Pola ini memasang lingkungan destop GNOME dengan hanya aplikasi grafis penting yang dipasang (Manajer Berkas, Peramban Web).
it: L'ambiente desktop GNOME è un desktop per utenti intuitivo e interessante. Questo modello consente di installare l'ambiente desktop GNOME esclusivamente con applicazioni grafiche essenziali installate (Gestore di file, Browser Web).
pl: Środowisko graficzne GNOME to łatwe w obsłudze i atrakcyjne dla użytkowników środowisko pracy. Ten wzorzec służy do instalowania środowiska graficznego GNOME z zainstalowanymi tylko podstawowymi aplikacjami graficznymi (menedżer plików, przeglądarka internetowa).
pt_br: O ambiente de trabalho GNOME é um desktop intuitivo e atraente para os usuários. Esse padrão instala o ambiente de área de trabalho do GNOME apenas com os aplicativos gráficos essenciais (gerenciador de arquivos, navegador da Web).
ru: Среда рабочего стола GNOME интуитивно понятна и удобна для пользователей. Этот шаблон устанавливает данную среду лишь с основными графическими приложениями (менеджер файлов, веб-браузер).
sl: Namizno okolje GNOME je intuitivno in privlačno uporabniško namizje. Ta vzorec namesti namizno okolje GNOME samo z osnovnimi grafičnimi programi (upravljalnik datotek, spletni brskalnik).
sv: GNOME-skrivbordsmiljön är en intuitiv och attraktiv skrivbordsmiljö för användare. Detta mönster installerar GNOME-skrivbordsmiljön med endast de mest nödvändiga grafiska applikationerna (filhanterare, webbläsare).
uk: Стільничне середовище GNOME — це інтуїтивно зрозуміла та приваблива стільниця для користувачів. Цей шаблон встановлює стільничне середовище GNOME лише з основними графічними застосунками (диспетчер файлів, WEB-переглядач).

source: GNOME Base System
ar: نظام GNOME الأساسي
ca: Sistema de base GNOME
cs: Základní systém GNOME
da: GNOME grundlæggende system
de: GNOME-Basissystem
es: Sistema base de GNOME
fi: GNOME-perusjärjestelmä
id: Sistem Dasar GNOME
it: Sistema di base GNOME
pl: Podstawowy system GNOME
pt_br: Sistema base GNOME
ru: Базовая система GNOME
sl: Osnovni sistem GNOME
sv: GNOME grundläggande system
uk: Базова система GNOME

source: Base packages for the GNOME desktop environment.
ar: الحزم الأساسية لبيئة سطح المكتب GNOME.
ca: Paquets de base per a l'entorn d'escriptori GNOME.
cs: Základní balíčky prostředí GNOME.
da: Grundlæggende pakker til GNOME-skrivebordsmiljøet.
de: Grundlegende Pakete für die GNOME-Desktopumgebung.
es: Paquetes base para el entorno del escritorio GNOME.
fi: Peruspaketit GNOME-työpöytäympäristölle.
id: Paket dasar untuk lingkungan destop GNOME.
it: Pacchetti di base per l'ambiente desktop GNOME.
pl: Podstawowe pakiety dla środowiska graficznego GNOME.
pt_br: Pacotes base para o ambiente de trabalho GNOME.
ru: Основные пакеты для среды рабочего стола GNOME.
sl: Osnovni paketi za namizno okolje GNOME.
sv: Grundläggande paket för GNOME-skrivbordsmiljön.
uk: Основні пакунки для стільничного середовища GNOME.

source: Laptop
ar: كمبيوتر محمول
ca: Portàtil
cs: Notebook
da: Bærbar
es: Portátil
fi: Kannettava tietokone
it: Computer portatile
pl: Komputer przenośny
pt_br: Notebook
ru: Ноутбук
sl: Prenosnik
sv: Bärbar dator
uk: Ноутбук

source: Tools designed specifically for laptop computers.
ar: أدوات مصممة خصيصًا لأجهزة الكمبيوتر المحمول.
ca: Eines dissenyades específicament per a ordinadors portàtils.
cs: Nástroje navržené pro práci s notebooky.
da: Værktøjer designet specielt til brug med bærbare computere.
de: Werkzeuge, die speziell für die Verwendung mit Laptop-Computern entwickelt wurden.
es: Herramientas diseñadas específicamente para su uso con equipos portátiles.
fi: Kannettavia tietokoneita varten suunnitellut työkalut.
id: Perkakas yang dirancang khusus untuk komputer laptop.
it: Strumenti progettati specificamente per i computer portatili.
pl: Narzędzia zaprojektowane do użytku z komputerami przenośnymi.
pt_br: Ferramentas projetadas especificamente para notebooks.
ru: Инструменты, специально созданные для переносных компьютеров.
sl: Orodja, ki so zasnovana posebej za prenosne računalnike.
sv: Verktyg som har utvecklats speciellt för att användas med bärbara datorer.
uk: Засоби, спеціально створені для використання з ноутбуками.

source: Patterns for SLE HA
ar: أنماط SLE HA
ca: Patrons per a l'SLE HA
cs: Vzory pro SLE HA
da: Mønstre til SLE HA
de: Schemata für SLE HA
es: Patrones para HA de SLE
fi: Kuviot SLE HA:lle
id: Pola untuk SLE HA
it: Modelli per SLE HA
pl: Wzorce dla rozszerzenia SLE HA
pt_br: Padrões para SLE HA
ru: Шаблоны для SLE HA
sl: Vzorci za SLE HA
sv: Mönster för SLE HA
uk: Шаблони для SLE HA

source: This is an internal package that is used to create the patterns as part of the installation source setup. Installation of this package does not make sense.
ar: هذه حزمة داخلية يتم استخدامها لإنشاء الأنماط كجزء من إعداد مصدر التثبيت. لن يكون تثبيت هذه الحزمة ذا أهمية.
ca: Es tracta d’un paquet intern que s’usa per crear els patrons com a part de la configuració de la font d’instal·lació. La instal·lació d’aquest paquet no té cap sentit.
cs: Toto je interní balíček, který se používá k vytváření vzorů v rámci nastavení zdroje instalace. Instalace tohoto balíčku nedává smysl.
da: Dette er en intern pakke som bruges til at oprette mønstrene som del af opsætningen af installationenskilden. Det giver ikke mening at installere pakken.
de: Dies ist ein internes Paket, mit dem die Schemata bei der Einrichtung der Installationsquelle erstellt werden können. Die Installation dieses Pakets ist nicht wirklich sinnvoll.
es: Este es un paquete interno que se usa para crear los patrones como parte de la configuración del origen de instalación. La instalación de este paquete no tiene sentido.
fi: Tämä on sisäinen paketti, jota käytetään luomaan asennuksen lähdeasetuksen kuvioiden luomiseksi. Paketin asentamisessa ei ole mieltä.
id: Ini adalah paket internal yang digunakan untuk membuat pola sebagai bagian dari pengaturan sumber instalasi. Pemasangan paket ini tidak masuk akal.
it: Questo è un pacchetto interno che viene utilizzato per creare modelli che rientrano nella configurazione di origine dell'installazione. L'installazione di questo pacchetto è irrilevante.
pl: Jest to wewnętrzny pakiet, który służy do tworzenia wzorców w ramach konfigurowania źródła instalacji. Instalowanie tego pakietu nie ma sensu.
pt_br: Este é um pacote interno usado para criar os padrões como parte da configuração da fonte de instalação. A instalação desse pacote não faz sentido.
ru: Это внутренний пакет, который используется для создания шаблонов при начальной установке. Устанавливать его нет смысла.
sl: To je notranji paket, ki se uporablja za ustvarjanje vzorcev kot del nastavitve vira namestitve. Namestitev tega paketa ni smiselno.
sv: Detta är ett internt paket som används för att skapa mönstren som en del av installationskällkonfigurationen. Installationen av detta paket är inte logiskt.
uk: Це внутрішній пакунок, який використовується для створення шаблонів як частина налаштування джерела встановлення. Встановлювати цей пакунок не має сенсу.

source: Patterns for SLE HA GEO
ar: أنماط SLE HA GEO
ca: Patrons per a l'SLE HA GEO
cs: Vzory pro SLE HA GEO
da: Mønstre til SLE HA GEO
de: Schemata für SLE HA GEO
es: Patrones para HA GEO de SLE
fi: Kuviot SLE HA GEO:lle
id: Pola untuk SLE HA GEO
it: Modelli per SLE HA GEO
pl: Wzorce dla klastrów GEO rozszerzenia SLE HA
pt_br: Padrões para SLE HA GEO
ru: Шаблоны для SLE HA GEO
sl: Vzorci za SLE HA GEO
sv: Mönster för SLE HA GEO
uk: Шаблони для SLE HA GEO

source: Patterns for SLE Live Patching
ar: أنماط SLE Live Patching
ca: Patrons per a l'SLE d'apedaçament autònom
cs: Šablony pro SLE - opravy za chodu
da: Mønstre til SLE-liverettelse
de: Schemata für SLE Live Patching
es: Patrones para SLE Live Patching
fi: Kuviot SLE:n ajonaikaispaikkaukselle
id: Pola untuk Penambalan Langaung SLE (Live Patching)
it: Modelli per SLE Live Patching
pl: Wzorce dla mechanizmu Live Patching rozszerzenia SLE
pt_br: Padrões para SLE Live Patching
ru: Шаблоны для SLE Live Patching
sl: Vzorci za popravljanje v živo (SLE)
sv: Mönstren för SLE-livekorrigering
uk: Шаблони для SLE Live Patching

source: Patterns for SLE Real Time Module
ar: أنماط وحدة SLE Real Time النمطية
ca: Patrons per al mòdul d'SLE en temps real
cs: Šablony pro modul SLE - reálný čas
da: Mønstre til SLE-realtidsmodul
de: Schemata für SLE-Echtzeitmodul
es: Patrones para módulo SLE Real Time
fi: Kuviot SLE:n tosiaikamoduulille
id: Pola untuk Modul Real Time SLE
it: Modelli per modulo SLE Real Time
pl: Wzorce dla modułu Real Time rozszerzenia SLE
pt_br: Padrões para SLE Real Time Module
ru: Шаблоны для модуля реального времени SLE
sl: Vzorci za realno-časovni modul (SLE)
sv: Mönster för SLE-realtidsmodul
uk: Шаблони для модуля реального часу SLE

source: SLE Real Time Module
ar: وحدة SLE Real Time النمطية
ca: Mòdul d'SLE en temps real
cs: Modul SLE pro reálný čas
da: SLE-realtidsmodul
de: SLE-Echtzeitmodul
es: Módulo SLE Real Time
fi: SLE:n tosiaikamoduuli
id: Modul Real Time SLE
it: Modulo SLE Real Time
pl: Moduł Real Time rozszerzenia SLE
ru: Модуль реального времени SLE
sl: Realno-časovni modul (SLE)
sv: SLE-realtidsmodul
uk: Модуль реального часу SLE

source: Provide tools and patches to fix kernel at runtime.
ar: توفير أدوات ودفعات لإصلاح kernel في وقت التشغيل.
ca: Proporciona eines i pedaços per corregir el nucli en temps d'execució.
cs: Obsahuje nástroje a opravy na opravu jádra za běhu.
da: Giver værktøjer og rettelser til at rette kernen under afvikling.
de: Enthält Tools und Patches, um Fehler im Kernel zur Laufzeit zu beheben.
es: Proporciona herramientas y parches para solucionar el núcleo en el tiempo de ejecución.
fi: Tarjoaa työkalut ja paikkaukset ytimen ajonaikaiseen paikkaamiseen.
id: Sediakan perkakas dan tambalan untuk memperbaiki kernel pada waktu proses.
it: Fornisce gli strumenti e le patch per la correzione del kernel in fase di runtime.
pl: Zawiera narzędzia i poprawki pozwalające naprawić jądro w czasie wykonywania.
pt_br: Fornece ferramentas e patches para consertar o kernel em tempo de execução.
ru: Содержит инструменты и исправления для установки исправлений ядра в режиме выполнения.
sl: Ponuja orodja in popravke za popravljanje jedra med izvajanjem.
sv: Innehåller verktyg och korrigeringar för att korrigera kärnan under körning.
uk: Надає інструменти та латки для виправлення ядра під час виконання.

source: Oracle Server Base
ar: قاعدة خادم Oracle
ca: Base de servidor d'Oracle
cs: Základ pro Oracle
da: Oracle-server grundlæggende
de: Oracle-Server-Basis
es: Base del servidor Oracle
fi: Oracle-palvelinalusta
id: Dasar Peladen Oracle
it: Database server Oracle
pl: Baza serwera Oracle
pt_br: Servidor base Oracle
ru: Базовый сервер Oracle
sl: Osnova strežnika Oracle
sv: Grundläggande serversystem för Oracle
uk: Основа сервера Oracle

source: Set up the server for installing Oracle databases.
ar: إعداد الخادم لتثبيت قواعد بيانات Oracle.
ca: Configura el servidor per instal·lar bases de dades d'Oracle.
cs: Připravuje server na instalaci databází Oracle.
da: Opsæt serveren til installation af Oracle-databaser.
de: Richten Sie den Server für die Installation von Oracle-Datenbanken ein.
es: Configura el servidor para la instalación de bases de datos Oracle.
fi: Pystytä palvelin Oracle-tietokantojen asentamista varten.
id: Siapkan server untuk memasang basis data Oracle.
it: Impostare il server per l'installazione dei database Oracle.
pl: Konfiguracja serwera dla baz danych Oracle.
pt_br: Configurar o servidor para instalar o bancos de dados Oracle.
ru: Настройка сервера для установки баз данных Oracle.
sl: Nastavitve strežnika za nameščanje podatkovnih zbirk Oracle.
sv: Konfigurera servern för installation av Oracle-databaser.
uk: Налаштування серверу для встановлення баз даних Oracle.

source: Web-Based Enterprise Management
ar: إدارة المؤسسات المستندة إلى الويب
ca: Gestió d'empresa basada en xarxa
cs: Webová enterprise správa
da: Webbaseret virksomhedshåndtering
es: Gestión empresarial basada en la web
fi: Verkkopohjainen yrityshallinta
id: Manajemen Perusahaan Berbasis Web
it: Gestione aziendale basata sul Web
pl: Zarządzanie przedsiębiorstwem oparte o sieć Web
pt_br: Gerenciamento de empresa baseado na Internet
ru: Веб-средства управления корпоративными ресурсами
sl: Spletno upravljanje podjetja
sv: WBEM (Web-Based Enterprise Management)
uk: Корпоративне керування через Тенета

source: Web-based enterprise management.
ar: إدارة المشاريع على شبكة الإنترنت.
ca: Gestió d'empresa basada en xarxa.
cs: Enterprise správa s webovým rozhraním.
da: Webbaseret virksomhedsstyring.
de: Webbasierte Unternehmensverwaltung.
es: Gestión empresarial basada en la web.
fi: Verkkopohjainen yrityshallinta.
id: Manajemen perusahaan berbasis web.
it: Gestione aziendale basata sul Web.
pl: Zarządzanie przedsiębiorstwem oparte o sieć Web.
pt_br: Gerenciamento de empresa baseado na Internet.
ru: Управление предприятием на базе Web.
sl: Spletno upravljanje podjetja.
sv: Webbaserad företagshantering.
uk: Корпоративне керування через Тенета.

source: Base WSL packages
ar: الحزم الأساسية لنظام ويندوز الفرعي لحزم لينكس WSL
ca: Paquets de WSL bàsics
cs: Základní WSL balíčky
fi: WSL-peruspaketit
id: Paket WSL dasar
it: Pacchetti WSL di base
pl: Podstawowe pakiety WSL
pt_br: Pacotes WSL base
ru: Базовые пакеты WSL
sl: Osnovni paketi WSL
sv: Bas WSL paket

source: This package contains the wsl_base pattern: recommended tools,libraries for using WSL.
ar: تحتوي هذه الحزمة على نمط wsl_base: الأدوات الموصى بها والمكتبات لاستخدام نظام ويندوز الفرعي لنظام التشغيل لينكس WSL.
ca: Aquest paquet conté el patró wsl_base: eines recomanades, biblioteques per usar WSL.
cs: Tento balíček obsahuje vzor wsl_base: doporučené nástroje a knihovny pro používání WSL.
fi: Tämä paketti sisältää wsl_base-kuvion: suositellut työkalut ja kirjastot WSL:n käyttämiseksi.
id: Paket ini berisi pola wsl_base: perkakas yang direkomendasikan, pustaka untuk menggunakan WSL.
it: Questo pacchetto contiene il modello wsl_base: strumenti e librerie consigliati per l'uso di WSL.
pl: Ten pakiet zawiera wzorzec wsl_base: zalecane narzędzia, biblioteki do korzystania z WSL.
pt_br: Este pacote contém o padrão wsl_base: ferramentas e bibliotecas recomendadas para usar no WSL.
ru: Этот пакет содержит шаблон wsl_base: рекомендуемые инструменты и библиотеки для использования WSL.
sl: Ta paket vsebuje vzorec wsl_base: priporočena orodja in knjižnice za uporabo WSL.
sv: Detta paket innehåller wsl_base-mönstret: rekommenderade verktyg, bibliotek för att använda WSL.

source: Development
ar: تطوير
ca: Desenvolupament
cs: Vývoj
da: Udvikling
de: Entwicklung
es: Desarrollo
fi: Kehitys
id: Pengembangan
it: Sviluppo
pl: Programowanie
pt_br: Desenvolvimento
ru: Разработка
sl: Razvoj
sv: Utveckling
uk: Розробка

source: WSL GUI packages
ca: Paquets d'IGU de WSL
cs: WSL balíčky pro grafické prostředí
fi: WSL:n graafiset paketit
id: Paket WSL GUI
it: Pacchetti GUI WSL
pl: Pakiety GUI WSL
pt_br: Pacotes de interface WSL
ru: Графические пакеты WSL
sl: Grafični programi za WSL
sv: WSL GUI paket

source: This package contains the wsl_gui pattern: recommended tools,libraries for using WSLg.
ca: Aquest paquet conté el patró wsl_gui: eines recomanades, biblioteques per usar WSLg.
cs: Tento balíček obsahuje vzor wsl_gui: doporučené nástroje a knihovny pro používání WSLg.
fi: Tämä paketti sisältää wsl_gui-kuvion: suositellut työkalut ja kirjastot WSLg:n käyttämiseksi.
id: Paket ini berisi pola wsl_gui: perkakas yang direkomendasikan, pustaka untuk menggunakan WSLg.
it: Questo pacchetto contiene il modello wsl_gui: strumenti e librerie consigliate per l'uso di WSLg.
pl: Ten pakiet zawiera wzorzec wsl_gui: zalecane narzędzia,biblioteki do korzystania z WSLg.
pt_br: Este pacote contém o padrão wsl_gui: ferramentas e bibliotecas recomendadas para usar no WSLg.
ru: Этот пакет содержит шаблон wsl_gui: рекомендуемые инструменты и библиотеки для использования WSLg.
sl: Ta paket vsebuje vzorec wsl_gui: priporočena orodja in knjižnice za uporabo WSLg.
sv: Detta paket innehåller wsl_gui-mönstret: rekommenderade verktyg, bibliotek för att använda WSLg.

source: Patterns for SLES for SAP Applications
ar: أنماط SLES لتطبيقات SAP
ca: Patrons de l'SLES per a aplicacions de SAP
cs: Šablony pro SLES pro architekturu SAP
da: Mønstre til SLES til SAP-programmer
de: Schemata für SLES für SAP-Anwendungen
es: Patrones para SLES for SAP Applications
fi: SLES:n kuviot SAP-sovelluksille
id: Pola untuk SLES untuk Aplikasi SAP
it: Modelli per applicazioni SLES per SAP
pl: Wzorce dla SLES do aplikacji SAP
pt_br: Padrões para SLES for SAP Applications
ru: Шаблоны SLES для приложений SAP
sl: Vzorci za SLES za programe SAP
sv: Mönster för SLES för SAP-program
uk: Шаблони SLES для застосунків SAP

source: Base Development
ar: تطوير النظام الأساسي
ca: Desenvolupament de base
cs: Základní vývoj
da: Grundlæggende udvikling
de: Grundlegende Entwicklungsumgebung
es: Desarrollo base
fi: Peruskehitys
id: Pengembangan Dasar
it: Sviluppo di base
pl: Podstawowe narzędzia programistyczne
pt_br: Base de desenvolvimento
ru: Основа разработки
sl: Osnovni razvoj
sv: Grundläggande utveckling
uk: Основа розробки

source: Minimal set of tools for compiling and linking applications.
ar: الحد الأدنى من مجموعة الأدوات اللازمة للتحويل البرمجي للتطبيقات وربطها.
ca: Conjunt d'eines mínim per compilar i enllaçar aplicacions.
cs: Minimální sada nástrojů potřebná pro kompilováni a linkování aplikací.
da: Minimalt sæt af værktøjer til at kompilere og linke programmer.
de: Mindestsatz an Werkzeugen für das Kompilieren und Linken von Anwendungen.
es: Conjunto mínimo de herramientas para compilar y enlazar aplicaciones.
fi: Mahdollisimman pieni työkalupaketti ohjelmien kääntämistä ja linkittämistä varten.
id: Seperangkat perkakas minimal untuk mengkompail dan menautkan aplikasi.
it: Insieme di strumenti di base per la compilazione e il collegamento delle applicazioni.
pl: Minimalny zestaw narzędzi do kompilowania i konsolidacji programów.
pt_br: Conjunto mínimo de ferramentas para compilar e associar aplicativos.
ru: Минимальный набор инструментов для компилирования и линковки приложений.
sl: Minimalen nabor orodij za prevajanje in povezovanje.
sv: Grundläggande samling verktyg för kompilering och länkning av program.
uk: Найменший набір засобів для компілювання і зв'язування програм.
