Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: Software to set up a server for configuring, managing, and monitoring virtual machines on a single physical machine.
ar: برنامج لإعداد الخادم لتكوين الأجهزة الظاهرية وإدارتها ومراقبتها على جهاز فعلي واحد.
ca: Programari per configurar un servidor per configurar, gestionar i monitorar màquines virtuals en una única màquina física.
cs: Nastavení serveru pro správu a monitorování virtuálního stroje.
da: Software til at opsætte en server til konfigurering, håndtering og overvågning af virtuelle maskiner på en enkelt fysisk maskine.
de: Richtet einen Server für das Hosting von virtuellen Maschinen mithilfe des Virtual Machine-Monitors XEN ein.
es: Software para montar un servidor para configurar, gestionar y monitorizar máquinas virtuales en un único sistema físico.
fi: Virtuaalikonepalvelin, joka mahdollistaa useiden virtuaalikoneiden asentamisen, hallinnan ja valvonnan yhdelle fyysiselle tietokoneelle.
id: Perangkat lunak untuk mengatur peladen untuk mengkonfigurasi, mengelola, dan memantau mesin virtual pada satu mesin fisik.
it: Programma per configurare un server per la gestione, la configurazione e il monitoraggio di macchine virtuali su di una singola macchina fisica.
pl: Oprogramowanie do instalowania serwera służącego do konfigurowania i monitorowania maszyn wirtualnych oraz zarządzania nimi na jednej fizycznej maszynie.
pt_br: Programa para configurar um servidor para configuração, gerenciamento e monitoramento de máquinas virtuais em uma única máquina física.
ru: Программное обеспечения установки сервера для настройки, администрирования и отслеживания работы виртуальных машин на одной физической машине.
sl: Programska oprema za postavitev strežnika za nastavljanje, upravljanje in nadzorovanje navideznih računalnikov na enem fizičnem računalniku.
sv: Programvara som ställer in en server för konfiguration, hantering och övervakning av virtuella enheter på en enskild fysisk enhet.
uk: Програмне забезпечення установки сервера для налаштування, управління та відстеження роботи віртуальних машин на одній фізичній машині.

source: KVM Virtualization Host and tools
ar: استضافة الأجهزة الظاهرية KVM والأدوات
ca: Amfitrió de virtualització KVM i eines
cs: Virtualizační hostitel KVM a nástroje
da: Vært og værktøjer til KVM-virtualisering
de: KVM-Virtualisierungs-Host und Tools
es: Host de virtualización KVM y herramientas
fi: KVM-virtualisointipalvelin ja -työkalut
id: Host dan perkakas Virtualisasi KVM
it: Strumenti e host di virtualizzazione di KVM
pl: Host wirtualizacji KVM oraz narzędzia
pt_br: Host de virtualização e ferramentas para o KVM
ru: Хост и инструменты виртуализации KVM
sl: Gostitelj in orodja za navidezne računalnike KVM
sv: Virtualiseringsvärd och verktyg för KVM
uk: Вузол та інструменти віртуалізації KVM

source: This will provide all minimal system to get a running KVM Hypervisor and be able to configure, manage, and monitor virtual machines on a single physical machine.
ar: سيوفر ذلك الحد الأدنى من متطلبات النظام لتشغيل بيئة الأجهزة الظاهرية KVM والقدرة على تكوين الأجهزة الظاهرية وإدارتها ومراقبتها على جهاز فعلي واحد.
ca: Això proporcionarà tot el sistema mínim per poder executar un hipervisor KVM i poder configurar, gestionar i monitorar màquines virtuals en una única màquina física.
cs: Poskytuje kompletní minimální systém pro spuštění KVM hypervizoru a možnosti jeho nastavení, správy a monitorování virtuálních strojů na jednom fyzickém stroji.
da: Det leverer et minimalt system til at få et kørende KVM-hypervisor og være i stand til at konfigurere, håndtere og overvåge virtuelle maskiner på en enkelt fysisk maskine.
de: Dies stellt einen funktionsfähigen KVM Hypervisor für alle minimalen Systeme bereit und ermöglicht die Konfiguration, Verwaltung und Überwachung von mehreren virtuellen Maschinen über eine einzige physische Maschine.
es: Esto proporciona un sistema mínimo para tener un Hipervisor KVM en funcionamiento y poder configurar, gestionar y supervisar máquinas virtuales en un único sistema físico.
fi: Tämä tarjoaa KVM-hypervisiirin toteuttavan vähimmäisjärjestelmän, jolla voi asettaa, hallita ja valvoa useita virtuaalikoneita yksittäisellä fyysisellä koneella.
id: Ini akan memberikan semua sistem minimal untuk menjalankan Hypervisor KVM dan dapat mengonfigurasi, mengelola, dan memantau mesin virtual pada satu mesin fisik.
it: Viene fornito tutto il sistema minimo per eseguire un Hypervisor KVM e poter configurare, gestire e monitorare le macchine virtuali su un unico computer fisico.
pl: Zapewnia kompletny minimalny system pozwalający uruchomić hyperwizora KVM, co z kolei umożliwi konfigurowanie i monitorowanie maszyn wirtualnych oraz zarządzanie nimi na jednej fizycznej maszynie.
pt_br: Isso fornece um sistema mínimo para ter um hipervisor de KVM em funcionamento e para configurar, gerenciar e monitorar máquinas virtuais em um único sistema físico.
ru: Пакет для создания минимальной ситсемы для запуска гипервизора KVM для настройки, администрирования и отслеживания работы виртуальных машин на одном физическом компьютере.
sl: To ponuja minimalni sistem za poganjanje hipervizorja KVM in nastavljanje, upravljanje in nadzorovanje navideznih računalnikov na enem fizičnem računalniku.
sv: Detta gör att alla minimala system får en körbar KVM-hypervisor och kan konfigurera, hantera och övervaka virtuella enheter på en enskild fysisk enhet.
uk: Пакунок для створення мінімальної системи для запуску гіпервізора KVM із можливостями налаштовувати, керувати та відстежувати віртуальні машини на одній фізичній машині.

source: Web and LAMP Server
ar: خادم الويب وLAMP
ca: Servidor LAMP i de xarxa
cs: Webový a LAMP server
da: Web- og LAMP-server
de: Web- und LAMP-Server
es: Servidor web y LAMP
fi: Web- ja LAMP-palvelin
id: Peladen Web dan LAMP
it: Server Web e LAMP
pl: Serwer sieci Web i LAMP
pt_br: Servidor Web e LAMP
ru: Сервер Web и LAMP
sl: Spletni in LAMP strežnik
sv: Webb- och LAMP-server
uk: Сервер Web і LAMP

source: Software to set up a Web server that is able to serve static, dynamic, and interactive content (like a Web shop). This includes Apache HTTP Server, the database management system MySQL, and scripting languages such as PHP, Python, Ruby on Rails, or Perl.
ar: برنامج لإعداد خادم ويب يمكنه معالجة المحتوى الثابت الديناميكي والتفاعلي (مثل متجر ويب). ويتضمن ذلك Apache HTTP Server ونظام إدارة قواعد البيانات MySQL ولغات البرمجة النصية مثل PHP أو Python أو Ruby on Rails أو Perl.
ca: Programari per configurar un servidor web capaç de servir contingut estàtic, dinàmic i interactiu (com ara una botiga web). Això inclou el servidor HTTP Apache, el sistema de gestió de bases de dades MySQL i llenguatges de script com ara PHP, Python, Ruby on Rails o Perl.
cs: Nastavení webového serveru pro statický, dynamické i interaktivní obsah (např. webový obchod). Základem je webový server Apache, databázový systém MySQL a skriptovací jazyky jako např. PHP, Python, Ruby on Rails nebo Perl.
da: Software til at opsætte en webserver som er i stand til at levere statisk, dynamisk og interaktivt indhold (såsom en webbutik). Dette inkluderer Apache HTTP-server, databasehåndteringssystemet MySQL og scriptsprog såsom PHP, Python, Ruby on Rails eller Perl.
de: Sie können einen Webserver einrichten, der für statische, dynamische und interaktive Inhalte geeignet ist (wie zum Beispiel ein Web-Shop). Er beruht auf dem Apache-HTTP-Server, dem Datenbankverwaltungssystem MySQL und einer Skriptsprache wie PHP, Python, Ruby on Rails oder Perl.
es: Software para configurar un servidor web capaz de suministrar contenido estático, dinámico e interactivo (como una tienda web). Incluye el servidor HTTP Apache, el sistema de gestión de bases de datos MySQL y un lenguaje de guiones como PHP, Python, Ruby on Rails o Perl.
fi: Web-palvelinohjelmisto, joka pystyy jakamaan pysyvää, muuttuvaa ja vuorovaikutteista sisältöä (kuten Web-kauppa). Ohjelmisto sisältää Apache HTTP -palvelimen, MySQL-tietokannan ja komentojonokieliä kuten PHP, Python, Ruby on Rails ja Perl.
id: Perangkat lunak untuk mengatur peladen Web yang dapat menyajikan konten statis, dinamis, dan interaktif (seperti toko Web). Ini termasuk Apache HTTP Server, sistem manajemen basis data MySQL, dan bahasa scripting seperti PHP, Python, Ruby on Rails, atau Perl.
it: Programmi per impostare un server Web in grado di servire contenuto statico, dinamico e interattivo (come un negozio in linea). Sono inclusi il server HTTP Apache, il sistema di gestione dei database MySQL e linguaggi di script quali PHP, Python, Ruby on Rails o Perl.
pl: Oprogramowanie serwera sieci Web, który może udostępniać treść statyczną, dynamiczną i interaktywną (np. sklep internetowy). Zawiera serwer HTTP Apache, system zarządzania bazą danych MySQL oraz języki skryptowe takie jak PHP, Python, Ruby on Rails, czy Perl.
pt_br: Programa para configurar um servidor de Internet que possa lidar com conteúdo estático, dinâmico e interativo (como uma loja da Web). Isso inclui o servidor HTTP Apache, o sistema de gerenciamento de banco de dados MySQL e linguagens de script como PHP, Python, Ruby on Rails ou Perl.
ru: Программное обеспечение для установки веб-сервера, обслуживающего статический, динамический и интерактивный контент (например, интернет-магазин). В состав входят сервер HTTP Apache, система управления базами данных MySQL и языки сценариев, типа PHP, Python, Ruby on Rails или Perl.
sl: Programska oprema za postavitev spletnega strežnika, ki lahko streže statično, dinamično in interaktivno vsebino (npr. spletno trgovino). To vključuje strežnik Apache HTTP, sistem za upravljanje podatkovne zbirke MariaDB in skriptne jezike kot so Perl, Python, PHP ter Ruby on Rails.
sv: Programvara som ställer in en webbserver som kan tillhandahålla statiskt, dynamiskt och interaktivt innehåll (som en webbutik). Detta inkluderar Apache HTTP Server, databashanteringssystemet MySQL samt skriptspråk som PHP, Python, Ruby on Rails eller Perl.
uk: Програмне забезпечення для установки веб-сервера, який обслуговує статичний, динамічний та інтерактивний вміст (наприклад, інтернет-магазин). До складу входять сервер протоколу http Apache, система управління базами даних в MySQL і мови сценаріїв, типу РНР, Python, Ruby on Rails або Perl.

source: The 32bit pattern complementing lamp_server.
ar: نمط 32bit المكمّل ل lamp_server.
ca: El patró de 32 bits que completa el servidor LAMP.
cs: 32bitový vzor doplňující lamp_server.
da: 32-bit-mønsteret som komplimenterer lamp_server.
de: Das 32-Bit-Schema zur Ergänzung von lamp_server.
es: El patrón de 32 bits que complementa a lamp_server.
fi: lamp_serveriä täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi lamp_server.
it: Modello a 32 bit complementare a lamp_server.
pl: 32-bitowy wzorzec uzupełniający serwer LAMP.
pt_br: O padrão de 32 bits que complementa o servidor Web e LAMP.
ru: Этот 32-разрядный шаблон дополняет lamp_server.
sl: 32-bitni vzorec, ki dopolnjuje lamp_server.
sv: 32-bitarsmönster som kompletterar lamp_server.
uk: 32-бітовий шаблон, який доповнює lamp_server.

source: Mail and News Server
ar: خادم البريد والأخبار
ca: Correu i servidor de notícies
cs: Poštovní a news server
da: Mail- og nyhedsserver
de: Mail- und News-Server
es: Servidor de correo y noticias
fi: Posti- ja uutispalvelimet
id: Peladen Surel dan Berita
it: Server di posta e delle news
pl: Serwer poczty i grup dyskusyjnych
pt_br: Servidor de e-mail e notícias
ru: Сервер почты и новостей
sl: Poštni in novičarski strežnik
sv: E-post- och diskussionsserver
uk: Сервер пошти і новин

source: Software to set up electronic mail and message services to handle email, mailing, and news lists, including a virus scanner to scan messages at the server level.
ar: برنامج لإعداد خدمات البريد الإلكتروني والرسائل لمعالجة قوائم البريد الإلكتروني والرسائل والأخبار، بما في ذلك ميزة فحص الفيروسات لفحص الرسائل على مستوى الخادم.
ca: Programari per configurar serveis de correu electrònic i de missatges per gestionar el correu electrònic, el correu i les llistes de notícies, incloent-hi un escàner de virus per escanejar missatges a l'àmbit del servidor.
cs: Software pro tvorbu elektronické pošty a služby zpráv e-mailu, okamžitých zpráv a seznamů odebíraného zpravodajství (kanálů), včetně virového skeneru k prohledání zpráv na úrovni serveru.
da: Software til at opsætte elektronisk post og meddelelsestjenester til at håndtere e-mail, mailing- og nyhedsgruppelister, inklusiv en virusskanner til at skanne meddelelser på serverniveauet.
de: Sie können elektronische Mail- und Nachrichtendienste für den Umgang mit E-Mail-, Mailing- und News-Listen einrichten. Außerdem kann ein Virenscanner eingerichtet werden, der Nachrichten auf der Serverebene überprüft.
es: Software para configurar el correo electrónico y servicios de mensajería para gestionar correo electrónico, listas y servicios de noticias, incluyendo un escáner de virus para analizar los mensajes a nivel de servidor.
fi: Ohjelma sähköposti- ja viestipalvelujen asettamiseksi sähköpostin ja keskusteluryhmien käsittelemiseksi. Sisältää viestien palvelintason virustarkistuksen.
id: Perangkat lunak untuk mengatur layanan surat dan elektronik untuk menangani surel, pesan, dan daftar berita, termasuk pemindai virus untuk memindai pesan di tingkat peladen.
it: Programmi per impostare i servizi di messaggistica e di posta elettronica per la gestione di e-mail, mailing list e news list. Include un programma di scansione antivirus per controllare i messaggi a livello server.
pl: Oprogramowanie do konfiguracji serwera usług pocztowych do obsługi poczty elektronicznej, list pocztowych i grup dyskusyjnych wraz ze skanerem antywirusowym do sprawdzania treści wiadomości na poziomie serwera.
pt_br: Programa para configurar serviços de e-mail e mensagens para lidar com e-mail, listas de discussão e listas de notícias, incluindo um scanner de vírus para verificar os e-mails no nível do servidor.
ru: Программное обеспечение для настройки служб электронной почты и сообщений, обеспечивающих обработку почты и списков новостей, в том числе сканер вирусов для сканирования сообщений на уровне сервера.
sl: Programska oprema za postavitev storitev elektronske pošte in sporočil, dopisnih seznamov ter novičarskih skupin, vključno s proti-virusnim pregledovalnikom za pregledovanje sporočil na strežniku.
sv: Programvara som ställer in e-post- och meddelandetjänster att hantera e-post, meddelanden och nyhetslistor, inklusive ett antivirusprogram som genomsöker meddelanden på servernivå.
uk: Програмне забезпечення для налаштування служб електронної пошти та повідомлень, які забезпечують обробку пошти і списків новин, у тому числі сканер вірусів для сканування повідомлень на рівні сервера.

source: The 32bit pattern complementing mail_server.
ar: نمط 32bit المكمّل ل mail_server.
ca: El patró de 32 bits que completa el servidor de correu.
cs: 32bitový vzor doplňující mail_server.
da: 32-bit-mønsteret som komplimenterer mail_server.
de: Das 32-Bit-Schema zur Ergänzung von mail_server.
es: El patrón de 32 bits que complementa a mail_server.
fi: mail_serveriä täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi mail_server.
it: Modello a 32 bit complementare a mail_server.
pl: 32-bitowy wzorzec uzupełniający serwer poczty.
pt_br: O padrão de 32 bits que complementa o servidor de e-mail e notícias.
ru: Этот 32-разрядный шаблон дополняет mail_server.
sl: 32-bitni vzorec, ki dopolnjuje mail_server.
sv: 32-bitarsmönster som kompletterar mail_server.
uk: 32-бітовий шаблон, який доповнює mail_server.

source: Print Server
ar: خادم الطباعة
ca: Servidor d'impressió
cs: Tiskový server
da: Udskrivningsserver
de: Druckserver
es: Servidor de impresión
fi: Tulostuspalvelin
id: Peladen Pencetak
it: Server di stampa
pl: Serwer wydruku
pt_br: Servidor de impressão
ru: Сервер печати
sl: Tiskalni strežnik
sv: Utskriftsserver
uk: Сервер друку

source: This pattern provides all packages necessary for printing. It provides all needed packages for printing to a locally connected printer, printing using a remote print server and for setting up a print server.
ar: يوفر هذا النمط جميع الحزم اللازمة للطباعة. وهو يوفر جميع الحزم اللازمة للطباعة على طابعة متصلة محليًا والطباعة باستخدام خادم طباعة عن بُعد ولإعداد خادم طباعة.
ca: Aquest patró proporciona tots els paquets necessaris per imprimir. Proporciona tots els paquets necessaris per imprimir per una impressora connectada localment, imprimir mitjançant un servidor d'impressió remot i per configurar un servidor d'impressió.
cs: Tento vzor dodává všechny balíčky potřebné pro tisk jak na lokálně připojenou tiskárnu, tak přes vzdálený tiskový server; umožňují také tiskový server vytvořit.
da: Dette mønster giver alle pakker som er nødvendige til udskrivning. Den leverer alle nødvendige pakker til udskrivning til en printer som er tilsluttet lokalt, udskrivning med en fjernudskrivningsserver og til opsætning af en printerserver.
de: Dieses Schema enthält alle Pakete, die zum Drucken auf einem lokal verbundenen Drucker, einem entfernten Druckserver und zum Einrichten eines Druckservers benötigt werden.
es: Este patrón proporciona todos los paquetes necesarios para imprimir. Proporciona todos los paquetes necesarios para imprimir en una impresora conectada localmente, para imprimir con un servidor de impresión remoto o para configurar un servidor de impresión.
fi: Tämä kuvio tarjoaa tulostuksen vaatimat paketit. Se tarjoaa kaikki paketit, joita tarvitaan paikallisesti kytkettyyn tulostimeen tai etätulostuspalveluun tulostamiseksi tai tulostuspalvelimen asettamiseksi.
id: Pola ini menyediakan semua paket yang diperlukan untuk pencetakan. Ini menyediakan semua paket yang diperlukan untuk mencetak ke pencetak yang terhubung secara lokal, mencetak menggunakan peladen cetak jarak jauh dan untuk menyiapkan peladen cetak.
it: Questo modello fornisce tutti i pacchetti necessari per la stampa. Fornisce tutti i pacchetti necessari per stampare in una stampante connessa localmente, tramite una stampante remota e per configurare un server di stampa.
pl: Ten wzorzec zawiera wszystkie pakiety niezbędne do drukowania. Umożliwiają one drukowanie na lokalnie podłączonych drukarkach i przez zdalne serwery drukowania oraz konfigurowanie serwerów drukowania.
pt_br: Esse padrão fornece todos os pacotes necessários para imprimir. Ele oferece todos os pacotes para imprimir em uma impressora com conexão local, para imprimir usando um servidor de impressão remoto e para configurar um servidor de impressão.
ru: Этот шаблон содержит все пакеты, необходимые для печати. Эти пакеты используются для отправки документов на печать на локальный принтер или удаленный сервер печати, а также для настройки сервера печати.
sl: Ta vzorec ponuja vse pakete, ki so potrebni za tiskanje na krajevno povezanem tiskalniku, tiskanje z uporabo oddaljenega tiskalnega strežnika in za postavitev tiskalnega strežnika.
sv: Detta mönster tillhandahåller alla paket som krävs för utskrift. Det tillhandahåller alla nödvändiga paket för utskrift till en lokalt ansluten skrivare, utskrift med en fjärrutskriftsserver och för att konfigurera en utskriftsserver.
uk: Цей шаблон надає всі пакунки, необхідні для друку. Він надає всі необхідні пакунки для друку на локально підключеному принтері, друку за допомогою віддаленого сервера друку та для налаштування сервера друку.

source: The 32bit pattern complementing printing.
ar: نمط 32bit المكمّل لميزة الطباعة.
ca: El patró de 32 bits que completa la impressió.
cs: 32bitový vzor doplňující printing.
da: 32-bit-mønsteret som komplimenterer printing.
de: Das 32-Bit-Schema zur Ergänzung der Druckfunktion.
es: El patrón de 32 bits que complementa a printing.
fi: printingiä täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi printing.
it: Modello a 32 bit complementare a printing.
pl: 32-bitowy wzorzec uzupełniający funkcje drukowania.
pt_br: O padrão de 32 bits que complementa a servidor de impressão.
ru: Этот 32-разрядный шаблон дополняет printing.
sl: 32-bitni vzorec, ki dopolnjuje printing.
sv: 32-bitarsmönster som kompletterar utskrift.
uk: 32-бітовий шаблон, який доповнює printing.

source: The 32bit pattern complementing WBEM.
ar: نمط 32bit المكمّل ل WBEM.
ca: El patró de 32 bits que completa WBEM.
cs: 32bitový vzor doplňující WBEM.
da: 32-bit-mønsteret som komplimenterer WBEM.
de: Das 32-Bit-Schema zur Ergänzung von WBEM.
es: El patrón de 32 bits que complementa a WBEM.
fi: WBEM-kuviota täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi WBEM.
it: Modello a 32 bit complementare a WBEM.
pl: 32-bitowy wzorzec uzupełniający funkcje zarządzania przedsiębiorstwem opartego o sieć Web.
pt_br: O padrão de 32 bits que complementa o WBEM.
ru: Этот 32-разрядный шаблон дополняет WBEM.
sl: 32-bitni vzorec, ki dopolnjuje WBEM.
sv: 32-bitarsmönster som kompletterar WBEM.
uk: 32-бітовий шаблон, який доповнює WBEM.

source: YaST Installation Packages
ar: حزم تثبيت YaST
ca: Paquets d'instal·lació del YaST
cs: Instalační balíčky programu YaST2
da: YaST-installationspakker
de: YaST2 - Installationspakete
es: Paquetes de instalación YaST
fi: YaST-asennuspaketit
id: Paket Pemasangan YaST
it: Pacchetti per l'installazione di YaST
pl: Pakiety instalacyjne YaST
pt_br: Instalação de pacotes do YaST
ru: Пакеты установки YaST
sl: Paketi namestilnika YaST
sv: YaST-installationspaket
uk: Пакунки встановлення YaST

source: YaST tools for installing your system.
ar: أدوات YaST لتثبيت النظام.
ca: Eines del YaST per instal·lar el sistema.
cs: Nástroje YaSTu pro instalaci systému.
da: YaST-værktøjer til at installere dit system.
de: YaST-Tools zur Installation des Systems.
es: Herramientas YaST para instalar su sistema.
fi: YaST-työkalut järjestelmän asentamista varten.
id: Perkakas YaST untuk memasang sistem Anda.
it: Strumenti di YaST per l'installazione del sistema.
pl: Narzędzia YaST do instalacji systemu.
pt_br: Ferramentas YaST para instalar seu sistema.
ru: Инструменты YaST для установки системы.
sl: Orodja YaST za nameščanje sistema.
sv: YaST-verktyg för installation av systemet.
uk: Засоби YaST для встановлення вашої системи.

source: System z HW crypto support
ar: دعم تشفير الأجهزة لأنظمة z
ca: Suport per a System z HW crypto
cs: Podpora šifrování Systému z HW
da: Understøttelse af System z HW-crypto
de: Kryptounterstützung für System z
es: Compatibilidad con cifrado de hardware de System z
fi: System Z HW kryptografinen tuki
id: Dukungan kripto System z HW
it: Supporto per System z HW crypto
pl: Obsługa sprzętowego szyfrowania na serwerach System z
pt_br: Suporte à criptografia HW do System z
ru: Поддержка шифрования HW для System z
sl: Podpora šifrirni strojni opremi za System z
sv: Stöd för System z HW-krypto
uk: Підтримка шифрування System z HW
