Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: Package Management - Graphical Tools
ar: إدارة التطبيقات - الأدوات الرسومية
ca: Gestor de paquets - Eines gràfiques
cs: Správa balíčků - grafické nástroje
da: Pakkehåndtering - Grafiske værktøjer
de: Paketverwaltung - Grafikwerkzeuge
es: Gestión de paquetes - Herramientas gráficas
fi: Pakettihallinta - Graafiset työkalut
id: Manajemen Paket - Perkakas Grafis
it: Gestione pacchetti - Strumenti grafici
pl: Zarządzanie pakietami - narzędzia graficzne
pt_br: Gerenciamento de pacotes - ferramentas gráficas
ru: Управление пакетами — Графические инструменты
sl: Upravljanje paketov – grafična orodja
sv: Pakethantering - Grafiska verktyg
uk: Управління пакунками — графічні засоби

source: KDE Frameworks and Plasma Development
ar: مطور إطار KDE والبلازما
ca: Desenvolupament del Plasma i de KDE Frameworks
cs: Vývoj KDE Frameworks a Plasmy
da: KDE-frameworks og Plasma-udvikling
de: KDE-Frameworks und Plasma-Entwicklung
es: Desarrollo de KDE Frameworks y Plasma
fi: KDE Frameworks- ja Plasma-kehitys
id: Kerangka Kerja KDE dan Pengembangan Plasma
it: Sviluppo di KDE Frameworks e Plasma
pl: Pakiety dla programistów KDE
pt_br: Desenvolvimento do KDE Frameworks e Plasma
ru: Разработка для KDE Frameworks и Plasma
sl: KDE Frameworks in razvoj KDE Plasma
sv: KDE Frameworks och Plasma utveckling
uk: Фреймворки KDE та Розробка Plasma

source: KDE Frameworks development packages.
ar: حزم تطوير اطار KDE.
ca: Paquets de desenvolupament de KDE Frameworks.
cs: Vývojové balíčky KDE Frameworks.
da: KDE-frameworks-udviklingspakker.
de: KDE-Framework-Entwicklungspakete.
es: Paquetes de desarrollo de KDE Frameworks.
fi: KDE Frameworks -kehityspaketit.
id: Paket pengembangan Kerangka KDE.
it: Pacchetti per lo sviluppo di KDE Frameworks.
pl: Pakiety dla programistów KDE.
pt_br: Pacotes de desenvolvimento do KDE Frameworks.
ru: Пакеты разработки для KDE Frameworks.
sl: Razvojni paketi ogrodja KDE Frameworks.
sv: KDE Frameworks utvecklings paket.
uk: Пакунки розробки для KDE Frameworks.

source: Qt 5 Development
ca: Desenvolupament de Qt 5
cs: Vývoj Qt 5
da: Qt 5-udvikling
de: Qt 5-Entwicklung
es: Desarrollo de Qt 5
fi: Qt 5 -kehitys
id: Pengembangan Qt 5
it: Sviluppo in Qt 5
pl: Programowanie Qt 5
pt_br: Desenvolvimento em Qt 5
ru: Разработка на Qt 5
sl: Razvoj Qt 5
sv: Qt 5 utveckling
uk: Розробка на Qt 5

source: Tools and libraries for software development using Qt 5.
ar: أدوات ومكتبات لتطوير البرمجيات باستخدام Qt 5.
ca: Eines i biblioteques per al desenvolupament de programari usant Qt 5.
cs: Nástroje a knihovny pro vývoj softwaru s použitím Qt 5.
da: Værktøjer og biblioteker til softwareudvikling ved brug af Qt 5.
de: Werkzeuge und Bibliotheken für die Softwareentwicklung unter Qt 5.
es: Herramientas y bibliotecas para el desarrollo de software usando Qt 5.
fi: Työkalut ja kirjastot Qt5-ohjelmakehitykseen.
id: Perkakas dan pustaka untuk pengembangan perangkat lunak menggunakan Qt 5.
it: Strumenti e librerie per sviluppo di programmi che fanno uso di Qt 5.
pl: Narzędzia i biblioteki do tworzenia oprogramowania przy użyciu Qt 5.
pt_br: Ferramentas e bibliotecas para desenvolvimento de software usando o Qt 5.
ru: Инструменты и библиотеки для разработки ПО с использованием Qt 5.
sl: Orodja in knjižnice za razvoj programske opreme z ogrodjem Qt 5.
sv: Verktyg och bibliotek för programvaru programvaruutveckling med Qt 5.
uk: Засоби та бібліотеки для розробки програмного забезпечення за допомогою Qt 5.

source: Qt 6 Development
ca: Desenvolupament de Qt 6
cs: Vývoj Qt 6
fi: Qt 6 -kehitys
id: Pengembangan Qt 6
it: Sviluppo in Qt 6
pl: Programowanie Qt 6
pt_br: Desenvolvimento em Qt 6
ru: Разработка на Qt 6
sl: Razvoj Qt 6
sv: Qt 6 utveckling

source: Tools and libraries for software development using Qt 6.
ca: Eines i biblioteques per al desenvolupament de programari usant Qt 6.
cs: Nástroje a knihovny pro vývoj softwaru s použitím Qt 6.
fi: Työkalut ja kirjastot Qt6-ohjelmakehitykseen.
id: Perkakas dan pustaka untuk pengembangan perangkat lunak menggunakan Qt 6.
it: Strumenti e librerie per sviluppo di software che fanno uso di Qt 6.
pl: Narzędzia i biblioteki do tworzenia oprogramowania przy użyciu Qt 6.
pt_br: Ferramentas e bibliotecas para desenvolvimento de software usando o Qt 6.
ru: Инструменты и библиотеки для разработки ПО с использованием Qt 6.
sl: Orodja in knjižnice za razvoj programske opreme z ogrodjem Qt 6.
sv: Verktyg och bibliotek för programvaru programvaruutveckling med Qt 6.

source: KDE Applications and Plasma 5 Desktop
ar: تطبيقات سطح مكتب KDE و البلازما 5
ca: Escriptori Plasma i aplicacions de KDE
cs: Aplikace KDE a plocha Plasma 5
da: KDE-programmer og Plasma 5-skrivebord
de: KDE-Anwendungen und Plasma 5 Desktop
es: Aplicaciones de KDE y escritorio Plasma 5
fi: KDE-sovellukset ja Plasma 5 -työpöytä
id: Aplikasi KDE dan Destop Plasma 5
it: Applicazioni KDE e desktop Plasma 5
pl: Aplikacje KDE i pulpit Plasmy 5
pt_br: KDE Applications e área de trabalho Plasma 5
ru: Приложения KDE и рабочий стол Plasma
sl: KDE-jevi programi in namizje Plasma 5
sv: KDE applikationer och Plasma 5 Skrivbord
uk: Застосунки KDE та стільниця Plasma 5

source: Packages providing the Plasma desktop environment and applications from KDE.
ar: الحزم التي توفر بيئة سطح المكتب البلازما والتطبيقات من KDE.
ca: Paquets que proporcionen l'entorn d'escriptori Plasma i aplicacions de KDE.
cs: Balíčky prostředí plochy Plasma a aplikací z KDE.
da: Pakker som leverer Plasma-skrivebordsmiljøet og programmer fra KDE.
de: Pakete, die die Plasma Desktopumgebung und Anwendungen von KDE bereitstellen.
es: Paquetes que proporcionan el entorno de escritorio Plasma y las aplicaciones de KDE.
fi: Plasma-työpöytäympäristön ja KDE:n sovellukset tarjoavat paketit.
id: Paket yang menyediakan lingkungan destop Plasma dan aplikasi dari KDE.
it: Pacchetti che forniscono l'ambiente desktop Plasma e le applicazioni di KDE.
pl: Pakiety dostarczające środowisko graficzne Plasmy i aplikacje z KDE.
pt_br: Pacotes provendo o ambiente de trabalho Plasma e os KDE Applications.
ru: Пакеты, предоставляющие среду рабочего стола Plasma и приложения KDE.
sl: Paketi, ki ponujajo KDE-jevo namizno okolje Plasma in KDE-jeve programe.
sv: Paket som tillhandahåller Plasma-skrivbordsmiljön och program från KDE.
uk: Пакунки, що надають стільничне середовище Plasma та застосунки KDE.

source: KDE Education
ca: Educació del KDE
cs: Vzdělávání v KDE
da: KDE-uddannelse
es: KDE Educación
fi: KDE-opetus
id: Pendidikan KDE
it: Istruzione KDE
pl: Edukacja KDE
pt_br: KDE Educacional
ru: Образование KDE
sl: KDE-jevi izobraževalni programi
uk: Освіта KDE

source: KDE Applications - Tools to teach kids with computers
ca: Aplicacions del KDE - Eines per aprendre amb l'ordinador
cs: Aplikace KDE - nástroje k výuce dětí s počítači
da: KDE-programmer - Værktøjer til at lære børn med computere
de: KDE-Anwendungen - Tools um Kinder mit Computern zu unterrichten
es: KDE Aplicaciones - Herramientas para enseñar a los más pequeños usar computadoras
fi: KDE-sovellukset – työkalut lasten opetukseen tietokoneella
id: Aplikasi KDE - Perkakas untuk mengajar anak-anak dengan komputer
it: Applicazioni KDE - Strumenti per l'insegnamento ai ragazzi tramite computer
pl: Aplikacje KDE — narzędzia do nauczania dzieci z komputerami
pt_br: KDE Applications - Ferramentas para ensinar crianças com computadores
ru: Приложения KDE — Инструменты для обучения детей с помощью компьютеров
sl: KDE-jevi programi, ki so uporabni za učenje otrok in odraslih
sv: KDE-program - Verktyg för att lära barn med datorer
uk: Програми KDE — засоби для навчання дітей за допомогою комп'ютерів

source: KDE Desktop
ar: سطح المكتب كدي
ca: Escriptori KDE
cs: Prostředí KDE
da: KDE-skrivebord
es: Escritorio KDE
fi: KDE-työpöytä
id: Destop KDE
it: Desktop KDE
pl: Środowisko KDE
pt_br: Área de trabalho KDE
ru: Рабочий стол KDE
sl: Namizje KDE Plasma
sv: Skrivbordsmiljön KDE
uk: Стільниця KDE

source: KDE Games
ar: ألعاب كدي
ca: Jocs del KDE
cs: KDE hry
da: KDE-spil
de: KDE-Spiele
es: Juegos de KDE
fi: KDE-pelit
id: Permainan KDE
it: Giochi KDE
pl: Gry KDE
pt_br: Jogos do KDE
ru: Игры KDE
sl: KDE-jeve igre
sv: KDE-spel
uk: Ігри для KDE

source: KDE Applications - Games
ca: Aplicacions del KDE - Jocs
cs: Aplikace KDE - hry
da: KDE-programmer - Spil
de: KDE-Anwendungen - Spiele
es: KDE Aplicaciones - Juegos
fi: KDE-sovellukset – Pelit
id: Aplikasi KDE - Permainan
it: Applicazioni KDE - Giochi
pl: Aplikacje KDE - Gry
pt_br: KDE Applications - Jogos
ru: Приложения KDE — Игры
sl: Zbirka KDE-jevih iger
sv: KDE Applikationer - Spel
uk: Програми KDE - Ігри

source: KDE Integrated Development Environment
ar: بيئة تطوير كدي المتكاملة
ca: Entorn de desenvolupament integrat del KDE
cs: Integrované vývojové prostředí pro KDE
da: KDE integererede udviklingsmiljø
de: KDE Integrierte Entwicklungsumgebung
es: Entorno de desarrollo integrado (IDE) de KDE
fi: KDE integroitu kehitysympäristö
id: Lingkungan Pengembangan Terpadu KDE
it: Ambiente di sviluppo integrato KDE
pl: Zintegrowane środowisko programistyczne KDE
pt_br: Ambiente de desenvolvimento integrado do KDE
ru: Интегрированная среда разработки KDE
sl: KDE-jevo enovito razvojno okolje
sv: Integrerad utvecklingsmiljö för KDE
uk: Інтегроване середовище розробки KDE

source: KDE software for development (editors, integrated development environments, and associated tools).
ca: Programari de KDE per al desenvolupament (editors, entorns de desenvolupament integrat i eines associades).
cs: Software pro vývoj KDE (editory, integrovaná vývojová prostředí, přidružené nástroje).
da: KDE-software til udvikling (editorer, integrerede udviklingsmiljøer og tilknyttede værktøjer).
de: KDE Software zur Entwicklung (Editoren, IDEs und zugehörige Werkzeuge).
es: Software de KDE para desarrollo (editores, entornos integrados de desarrollo y herramientas asociadas).
fi: KDE-kehitysohjelmat (muokkaimet, integroidut kehitysympäristöt ja tarvittavat työkalut).
id: Perangkat lunak KDE untuk pengembangan (penyunting, lingkungan pengembangan terintegrasi, dan perkakas terkait).
it: Programmi KDE per lo sviluppo (editor, ambienti di sviluppo integrati e strumenti associati).
pl: Oprogramowanie KDE do rozwoju (edytory, zintegrowane środowiska programistyczne i powiązane narzędzia).
pt_br: KDE software para desenvolvimento (editores, ambientes de desenvolvimento integrado, e ferramentas associadas).
ru: Программное обеспечение KDE для разработки (редакторы, интегрированные среды разработки и соответствующие инструменты).
sl: KDE-jevi programi za razvoj programske opreme (urejevalniki. enovita razvojna okolja in povezana orodja).
sv: KDE-programvara för utveckling (redigerare, integrerade utvecklingsmiljöer och tillhörande verktyg).
uk: Програмне забезпечення KDE для розробки (редактори, інтегровані середовища розробки та пов’язані інструменти).

source: KDE Graphics
ar: رسومات كدي
ca: Gràfics del KDE
cs: KDE grafika
da: KDE-grafik
de: KDE Grafik
es: Gráficos de KDE
fi: KDE-grafiikka
id: Grafis KDE
it: Grafica KDE
pl: Grafika KDE
pt_br: Gráficos do KDE
ru: Графика KDE
sl: KDE-jeva grafika
sv: KDE-grafik
uk: Графіка для KDE

source: KDE Applicatons - Handling of digital photos and graphics
ca: Aplicacions del KDE - Gestió de fotografies i gràfics digitals
cs: Aplikace KDE - manipulace s fotografiemi a grafikou
da: KDE-programmer - Håndtering af digitale fotos og grafik
de: KDE-Anwendungen - Handhabung von digitalen Fotos und Grafiken
es: KDE Aplicaciones - Manejo de fotografías y gráficos digitales
fi: KDE-sovellukset – Digitaalinen kuvan- ja grafiikankäsittely
id: Aplikasi KDE - Penanganan foto dan grafis digital
it: Applicazioni KDE - Manipolazione di foto e grafica digitali
pl: Aplikacje KDE - Obsługa cyfrowych zdjęć i grafiki
pt_br: KDE Applicatons - Tratamento de fotos digitais e gráficos
ru: Приложения KDE — обработка цифровых фотографий и рисунков
sl: KDE-jevi programi za obdelovanje digitalnih fotografij in grafike
sv: KDE Program - Hantering av digitala foton och grafik
uk: Програми KDE — обробка цифрових фотографій і малюнків

source: KDE Internet
ar: إنترنت كدي
ca: Internet del KDE
es: Internet de KDE
id: Internet KDE
it: Internet KDE
pl: Internet KDE
pt_br: Internet do KDE
ru: Интернет KDE
sl: KDE-jevi programi za medmrežje
uk: Інтернет для KDE

source: KDE Internet Applications
ar: تطبيقات الإنترنت لكدي
ca: Aplicacions d'Internet del KDE
cs: KDE internetové aplikace
da: KDE-internetprogrammer
de: KDE Internetanwendungen
es: Aplicaciones para Internet de KDE
fi: KDE-internetsovellukset
id: Aplikasi Internet KDE
it: Applicazioni per internet di KDE
pl: Programy internetowe KDE
pt_br: Aplicativos de Internet do KDE
ru: Интернет-приложения для KDE
sl: KDE-jevi programi za dostop do storitev in vsebin na medmrežju
sv: KDE-internetprogram
uk: Програми інтернету для KDE

source: KDE Multimedia
ar: وسائط كدي المتعددة
ca: Multimèdia del KDE
cs: KDE multimédia
da: KDE-multimedie
es: Multimedia de KDE
id: Multimedia KDE
it: Multimedia KDE
pl: Multimedia KDE
pt_br: Multimídia do KDE
ru: Мультимедиа KDE
sl: KDE-jeva predstavnost
uk: Мультимедія для KDE

source: KDE Applications - Multimedia
ca: Aplicacions del KDE - Multimèdia
cs: Aplikace KDE - multimédia
da: KDE-programmer - Multimedie
de: KDE-Anwendungen - Multimedia
es: KDE Aplicaciones - Multimedia
fi: KDE-sovellukset – Multimedia
id: Aplikasi KDE - Multimedia
it: Applicazioni KDE - Multimedia
pl: Aplikacje KDE - Multimedia
pt_br: KDE Applications - Multimídia
ru: Приложения KDE — Мультимедиа
sl: KDE-jevi programi za predvajanje, upravljanje in urejanje predstavnostnih vsebin
sv: KDE applikationer - Multimedia
uk: Програми KDE — Мультимедія

source: KDE Office
ar: مكتب كدي
ca: Oficina del KDE
cs: KDE kancelář
da: KDE-kontor
es: Oficina de KDE
fi: KDE-toimisto
id: Perkantoran KDE
it: KDE per l'ufficio
pl: Biuro KDE
pt_br: Suíte de escritório do KDE
ru: Офис KDE
sl: KDE-jeva pisarna
uk: Офіс для KDE

source: KDE PIM Suite
ca: Conjunt de KDE PIM
cs: Sada KDE PIM
es: Suite de gestión de información personal de KDE
fi: KDE:n henkilökohtaisen ajankäytön hallinta
it: Suite PIM di KDE
pl: Pakiet KDE PIM
pt_br: Suite PIM do KDE
ru: Комплект KDE PIM
sl: KDE-jevo upravljanje osebnih podatkov
sv: KDE PIM-svit
uk: Комплект ПЗ KDE PIM

source: The KDE PIM Suite (Kontact, KMail, KOrganizer, ...).
ca: El conjunt de KDE PIM (Kontact, KMail, KOrganizer...).
cs: Sada KDE PIM (Kontact, KMail, KOrganizer, ...).
da: KDE PIM-suiten (Kontact, KMail, KOrganizer...).
de: Die KDE PIM-Suite (Kontact, KMail, KOrganizer,…).
es: La suite para la gestión de información personal de KDE (Kontact, KMail, KOrganizer, ...).
fi: KDE:n henkilökohtaisen ajankäytön hallinta (Kontact, KMail, KOrganizer jne.).
id: KDE PIM Suite (Kontact, KMail, KOrganizer, ...).
it: La suite PIM di KDE (Kontact, KMail, KOrganizer, ...).
pl: Pakiet KDE PIM (Kontact, KMail, KOrganizer, ...).
pt_br: A suíte PIM do KDE (Kontact, KMail, KOrganizer, ...).
ru: Комплект KDE PIM (Kontact, KMail, KOrganizer, …).
sl: KDE-jeva zbirka za upravljanje osebnih podatkov (Kontact, e-poštni odjemalec KMail, organizator KOrganizer, …).
sv: KDE PIM-sviten (Kontakt,Kmail,KOrganizer, ...).
uk: Комплект ПЗ KDE PIM (Kontact, KMail, KOrganizer, та ін.).

source: KDE Plasma 5 Desktop Base
ca: Base de l'escriptori Plasma 5 de KDE
cs: Základ plochy KDE Plasma 5
da: KDE Plasma 5-skrivebord grundlæggende
de: KDE Plasma 5 Desktop Basis
es: Base del escritorio Plasma 5 de KDE
fi: KDE Plasma 5 -työpöydän perusta
id: Dasar Destop KDE Plasma 5
it: Desktop base Plasma 5 di KDE
pl: Podstawy pulpit KDE Plasma 5
pt_br: Área de trabalho KDE Plasma 5 base
ru: Базовый рабочий стол KDE Plasma 5
sl: Osnova namizja KDE Plasma 5
sv: KDE Plasma 5 Skrivbords bas
uk: Базова стільниця KDE Plasma 5

source: Base packages for the KDE Plasma 5 desktop environment.
ca: Paquets de base per a l'entorn d'escriptori KDE Plasma 5.
cs: Základní balíčky pro prostředí plochy KDE Plasma 5.
da: Grundlæggende pakker til KDE Plasma 5-skrivebordsmiljøet.
de: Basis-Pakete für die KDE Plasma 5 Desktopumgebung.
es: Paquetes básicos para el entorno de escritorio Plasma 5 de KDE.
fi: Peruspaketit KDE Plasma 5 -työpöytäympäristölle.
id: Paket dasar untuk lingkungan destop KDE Plasma 5.
it: Pacchetti di base per l'ambiente desktop Plasma 5 di KDE.
pl: Podstawowe pakiety dla środowiska graficznego KDE Plasma 5.
pt_br: Pacotes base para o ambiente de trabalho KDE Plasma 5.
ru: Основные пакеты для среды рабочего стола KDE Plasma 5.
sl: Osnovni paketi za namizno okolje KDE Plasma 5.
sv: Baspaket för KDE Plasma 5-skrivbordsmiljön.
uk: Основні пакунки для стільничного середовища KDE Plasma 5.

source: KDE Telepathy
ca: Telepatia del KDE
cs: Telepatie KDE
fi: KDE Viestintä
it: Telepathy KDE
pl: Telepatia KDE
ru: Стек KDE Telepathy

source: KDE Applications - Telepathy
ca: Aplicacions del KDE - Telepatia
cs: Aplikace KDE - telepatie
da: KDE-programmer - Telepathy
de: KDE-Anwendungen - Telepathy
es: KDE Aplicaciones - Telepathy
fi: KDE-sovellukset – Viestintä
id: Aplikasi KDE - Telepathy
it: Applicazioni KDE - Telepathy
pl: Aplikacje KDE - Telepatia
pt_br: Aplicações KDE - Telepathy
ru: Приложения KDE - Telepathy
sl: KDE-jevi programi na osnovi ogrodja Telepathy za komunikacijo
sv: KDE Program - Telepathy
uk: Програми KDE - Telepathy

source: KDE Utilities
ar: أدوت كدي
ca: Utilitats del KDE
cs: KDE nástroje
da: KDE-redskaber
de: KDE-Dienstprogramme
es: Utilidades de KDE
fi: KDE-apuohjelmat
id: Utilitas KDE
it: Utilità KDE
pl: Narzędzia KDE
pt_br: Utilitários do KDE
ru: Утилиты KDE
sl: KDE-jevi pripomočki
sv: KDE-verktyg
uk: Утиліти KDE

source: KDE Applications - Utilities
ca: Aplicacions del KDE - Utilitats
cs: Aplikace KDE - utility
da: KDE-programmer - Redskaber
de: KDE-Anwendungen - Dienstprogramme
es: KDE Aplicaciones - Utilidades
fi: KDE-sovellukset – Apuohjelmat
id: Aplikasi KDE - Utilitas
it: Applicazioni KDE - Utilità
pl: Aplikacje KDE - Narzędzia
pt_br: KDE Applications - Utilitários
ru: Приложения KDE — Утилиты
sl: Razni KDE-jevi uporabni programi
sv: KDE Applikationer - Verktyg
uk: Програми KDE - Утиліти

source: KDE Application - Additional Utilities
ca: Aplicació del KDE - Utilitats addicionals
cs: Aplikace KDE - přídavné utility
da: KDE-programmer - Yderligere redskaber
de: KDE-Anwendung - Zusätzliche Dienstprogramme
es: KDE Aplicaciones - Utilidades adicionales
fi: KDE-sovellukset – Lisätyökalut
id: Aplikasi KDE - Utilitas Tambahan
it: Applicazioni KDE - Utilità aggiuntive
pl: Aplikacje KDE - Dodatkowe narzędzia
pt_br: KDE Application - Utilitários adicionais
ru: Приложения KDE — Дополнительные утилиты
sl: KDE-jevi dodatni programi in orodja
sv: KDE Program - Ytterligare verktyg
uk: Програми KDE - Додаткові утиліти

source: YaST KDE User Interfaces
ar: YaST واجه مستخدم كدي
ca: Interfícies d'usuari del YaST per al KDE
cs: YaST KDE uživatelského rozhraní
da: YaST KDE-brugergrænseflader
de: KDE-Benutzer-Interface für YaST
es: Interfaces de usuario de KDE para YaST
fi: YaST KDE -käyttöliittymä
id: Antarmuka Pengguna KDE YaST
it: Interfacce utente KDE di YaST
pl: Interfejsy KDE dla YaST
pt_br: Interface YaST do KDE
ru: Пользовательский интерфейс YaST для KDE
sl: YaST-ov uporabniški vmesnik KDE
sv: YaST KDE användargränssnitt
uk: Користувацький інтерфейс YaST для KDE

source: Graphical YaST user interfaces for the KDE desktop.
ar: واجه YaST الرسومية لسطح المكتب كدي.
ca: Interfícies gràfiques d'usuari del YaST per a l'escriptori KDE.
cs: Grafické rozhraní programu YaST pro KDE.
da: Grafiske YaST-brugergrænseflader til KDE-skrivebordet.
de: Grafische YaST-Benutzeroberflächen für den KDE-Desktop.
es: Interfaces gráficas de YaST para el escritorio KDE.
fi: YaST-ohjelman graafinen käyttöliittymä KDE-työpöytäympäristöön.
id: Antarmuka pengguna YaST grafis untuk destop KDE.
it: Interfacce utente grafiche di YaST per il desktop KDE.
pl: Graficzny interfejs programu YaST dla środowiska KDE.
pt_br: Interface gráfica YaST para a área de trabalho KDE.
ru: Графический пользовательский интерфейс YaST для рабочего стола KDE.
sl: YaST-ov grafični uporabniški vmesnik za namizje KDE Plasma.
sv: Grafiska YaST-användargränssnitt för KDE-skrivbordet.
uk: Графічна оболонка користувача YaST для стільниці KDE.

source: leechcraft_browser
ca: navegador leechcraft
cs: leechcraft_browser (prohlížeč)
es: navegador_leechcraft
fi: LeechCraft-selain
it: Navigazione web LeechCraft
pl: przeglądarka leechcraft
pt_br: Navegador Leechcraft
ru: Браузер leechcraft
sl: Brskalnik LeechCraft

source: leechcraft_media
ca: mitjans leechcraft
it: Multimedia LeechCraft
pl: Media leenchcraft
pt_br: Mídia Leechcraft
ru: Медиа leechcraft
sl: Predstavnost LeechCraft

source: leechcraft_messenger
ca: missatger leechcraft
cs: leechcraft_messenger (přenos zpráv)
fi: LeechCraft-viestin
it: Messaggistica LeechCraft
pl: Messenger leenchcraft
pt_br: Mensageiro Leechcraft
ru: Сообщения leechcraft
sl: Sporočilnik LeechCraft

source: leechcraft_netutils
ca: utilitats de xarxa leechcraft
cs: leechcraft_netutils (síťové utility)
fi: LeechCraft-verkkotyökalut
it: Utilità di rete LeechCraft
pl: Netutils leenchcraft
pt_br: Utilitários de rede Leechcraft
ru: Сеть leechcraft
sl: Omrežna orodja LeechCraft

source: leechcraft_office
ca: oficina de leechcraft
cs: leechcraft_office (kancelář)
fi: LeechCraft-toimisto
it: LeechCraft per l'ufficio
pl: Biuro leenchcraft
pt_br: Escritório Leechcraft
ru: Офис leechcraft
sl: Pisarna LeechCraft

source: leechcraft_utilities
ca: utilitats de leechcraft
fi: LeechCraft-apuohjelmat
it: Utilità LeechCraft
pl: Narzędzia leenchcraft
pt_br: Utilitários Leechcraft
ru: Утилиты leechcraft
sl: Orodja LeechCraft

source: LXDE Desktop Environment
ar: بيئة سطح المكتب LXDE
ca: Entorn d'escriptori LXDE
cs: Pracovní prostředí LXDE
da: LXDE-skrivebordsmiljø
de: LXDE Desktop-Umgebung
es: Entorno de escritorio LXDE
fi: LXDE-työpöytäympäristö
id: Lingkungan Destop LXDE
it: Ambiente desktop LXDE
pl: Środowisko graficzne LXDE
pt_br: Ambiente de trabalho LXDE
ru: Среда рабочего стола LXDE
sl: Namizno okolje LXDE
sv: LXDE Skrivbordsmiljö
uk: Стільничне середовище LXDE

source: LXDE is a lightweight X11 desktop environment similiar to XFCE in its nature.
ar: LXDE بيئة سطح مكتب X11 خفيفة مشابهة لاكسفيس في طبيعتها.
ca: L'LXDE és un entorn d'escriptori X11 lleuger semblant a l'XFCE en la seva naturalesa.
cs: LXDE je odlehčené desktopové prostředí X11 v podstatě podobné XFCE.
da: LXDE er et letvægts-X11-skrivebordsmiljø som minder om Xfce i sin natur.
de: LXDE ist eine leichtgewichtige X11-Desktop-Umgebung und ähnelt XFCE.
es: LXDE es un entorno de escritorio X11 liviano, similar a XFCE.
fi: LXDE on kevyt X11 työpöytäympäristö. Verrattavissa XFCE-työpöytäympäristöön.
id: LXDE adalah lingkungan destop X11 yang ringan mirip dengan XFCE.
it: LXDE è un ambiente desktop X11 leggero simile ad XFCE nella sua natura.
pl: LXDE to niewymagające środowisko graficzne X11 podobne w swojej naturze do XFCE.
pt_br: O LXDE é um ambiente de trabalho leve semelhante ao XFCE.
ru: LXDE - легковесное окружение рабочего стола X11, похожее на XFCE.
sl: LXDE je lahko namizno okolje za grafični sistem X11, ki je podobno namizju Xfce.
sv: LXDE är en lätt X11-skrivbordsmiljö som liknar XFCE till sin natur.
uk: LXDE - легке стільничне середовище X11, подібне до XFCE.

source: LXDE Laptop
ar: كمبيوتر محمول LXDE
ca: Portàtil LXDE
cs: LXDE notebook
da: LXDE-bærbar
es: LXDE para ordenador portátil
fi: LXDE-kannettava tietokone
id: Laptop LXDE
it: LXDE per computer portatili
pl: Komputer przenośny LXDE
pt_br: Notebook LXDE
ru: Ноутбук LXDE
sl: Prenosnik LXDE
uk: LXDE для ноутбуків
