Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: Packages only for the DVD of openSUSE MicroOS
ca: Paquets només per al DVD del MicroSO d'openSUSE
cs: Balíčky pouze pro DVD s openSUSE MicroOS
da: Pakker kun til openSUSE MicroOS-dvd'en
de: Pakete rein für die DVD von openSUSE MicroOS
es: Paquetes solo para el DVD de openSUSE MicroOS
fi: Paketit vain DVD openSUSE MicroOS
id: Paket hanya untuk DVD openSUSE MicroOS
it: Pacchetti dedicati al DVD di openSUSE MicroOS
pl: Pakiety tylko na DVD z openSUSE MicroOS
pt_br: Pacotes apenas para o DVD do openSUSE MicroOS
ru: Пакеты только для DVD openSUSE MicroOS
sl: Paketi samo za DVD od openSUSE MicroOS
sv: Paket endast för DVD:n för openSUSE MicroOS
uk: Пакунки лише для DVD з openSUSE MicroOS

source: Additional packages on a openSUSE MicroOS DVD.
ca: Paquets addicionals en un DVD del MicroSO d'openSUSE.
cs: Přídavné balíčky na DVD openSUSE MicroOS.
da: Yderligere pakker på en openSUSE MicroOS-dvd.
de: Zusätzliche Pakete auf einer openSUSE MicroOS DVD.
es: Paquetes adicionales en un DVD de openSUSE MicroOS.
fi: OpenSUSE MicroOS DVD lisäpaketteja.
id: Paket tambahan pada DVD openSUSE MicroOS.
it: Pacchetti aggiuntivi su un DVD di openSUSE MicroOS.
pl: Dodatkowe pakiety na dysku DVD openSUSE MicroOS.
pt_br: Pacotes adicionais para o DVD do openSUSE MicroOS.
ru: Дополнительные пакеты для DVD openSUSE MicroOS.
sl: Dodatni paketi na DVD-ju od openSUSE MicroOS.
sv: Ytterligare paket på en openSUSE MicroOS DVD.
uk: Додаткові пакунки на openSUSE MicroOS DVD.

source: Remote Attestation (Agent) Support
ca: Suport per a l'atestació remota (agent)
cs: Podpora vzdálené atestace (agent)
id: Dukungan Pengesahan Jarak Jauh (Agen)
it: Supporto attestazione remota (agente)
pl: Obsługa zdalnej atestacji (agenta)
pt_br: Suporte a atestado remoto (agente)
ru: Поддержка удалённой аттестации (Агент)
sl: Podpora za oddaljeno potrjevanje (posrednik)
sv: Fjärrbekräftelse (Agent) stöd

source: Packages required to enable remote attestation via Keylime agent on openSUSE MicroOS.
ca: Paquets necessaris per habilitar l'atestació remota mitjançant l'agent Keylime al MicroSO d'openSUSE.
cs: Nezbytné balíčky umožňující vzdálenou atestaci přes Keylime agenta na openSUSE MicroOS.
id: Paket yang diperlukan untuk mengaktifkan pengesahan jarak jauh melalui agen Keylime di openSUSE MicroOS.
it: Pacchetti richiesti per abilitare l'attestazione remota tramite agente Keylime su openSUSE MicroOS.
pl: Pakiety wymagane do umożliwienia zdalnej atestacji za pośrednictwem agenta Keylime w openSUSE MicroOS.
pt_br: Pacotes necessários para habilitar o atestado remoto via agente Keylime no openSUSE MicroOS.
ru: Пакеты, необходимые для включения удалённой аттестации через Keylime на openSUSE MicroOS.
sl: Paketi, ki so potrebni za omogočiti oddaljeno potrjevanje prek posrednika Keylime na openSUSE MicroOS.
sv: Paket som krävs för att aktivera fjärrbekräftelse via Keylime agent på openSUSE MicroOS.

source: Remote Attestation (Verifier) Support
ca: Suport per a l'atestació remota (verificador)
cs: Podpora vzdálené atestace (ověřovač)
id: Dukungan Pengesahan Jarak Jauh (Pemverifikasi)
it: Supporto attestazione remota (verifier)
pl: Obsługa zdalnej atestacji (weryfikatora)
pt_br: Suporte a atestado remoto (verificador)
ru: Поддержка удалённой аттестации (верификатор)
sl: Podpora za oddaljeno potrjevanje (potrjevalnik)
sv: Fjärrbekräftelse (Bekräftare) stöd

source: Packages required to enable remote attestation via Keylime verifier on openSUSE MicroOS.
ca: Paquets necessaris per habilitar l'atestació remota mitjançant el verificador Keylime al MicroSO d'openSUSE.
cs: Nezbytné balíčky umožňující vzdálenou atestaci přes ověřovač Keylime na openSUSE MicroOS.
id: Paket yang diperlukan untuk mengaktifkan pengesahan jarak jauh melalui pemverifikasi Keylime di openSUSE MicroOS.
it: Pacchetti richiesti per abilitare l'attestazione remota tramite il verifier Keylime su openSUSE MicroOS.
pl: Pakiety wymagane do umożliwienia zdalnej atestacji za pośrednictwem weryfikatora Keylime w openSUSE MicroOS.
pt_br: Pacotes necessários para habilitar o atestado remoto via verificador Keylime no openSUSE MicroOS.
ru: Пакеты, необходимые для включения удалённой аттестации через верификатор Keylime на openSUSE MicroOS.
sl: Paketi, ki so potrebni za omogočiti oddaljeno potrjevanje prek potrjevalnika Keylime na openSUSE MicroOS.
sv: Paket som krävs för att aktivera fjärrbekräftelse via Keylime verifierare på openSUSE MicroOS.

source: SELinux Support
ca: Suport per a SELinux
cs: Podpora SELinux
da: SELinux-understøttelse
de: SELinux-Unterstützung
es: Soporte para SELinux
fi: SELinux tuki
id: Dukungan SELinux
it: Supporto SELinux
pl: Wsparcie SELinux
pt_br: Suporte SELinux
ru: Поддержка SELinux
sl: Podpora za SELinux
sv: SELinux Stöd
uk: Підтримка SELinux

source: This are packages which are required to enable SELinux on openSUSE MicroOS
ca: Aquests paquets són necessaris per habilitar SELinux al MicroSO d'openSUSE.
cs: Balíčky nutné k zapnutí SELinux na platformě openSUSE MicroOS
da: Dette er pakker som skal kræves for at aktivere SELinux på openSUSE MicroOS
de: Das sind Pakete, die auf openSUSE MicroOS zur Aktivierung von SELinux benötigt werden
es: Paquetes obligatorios para habilitar SELinux en openSUSE MicroOS
fi: Paketteja, jotka tarvitaan SELinuxin käyttöönottoon openSUSE MicroOS järjestelmässä
id: Ini adalah paket yang diperlukan untuk mengaktifkan SELinux di openSUSE MicroOS
it: Questi sono i pacchetti richiesti per abilitare SELinux su openSUSE MicroOS
pl: Są to pakiety wymagane do włączenia SELinux w openSUSE MicroOS
pt_br: Estes são pacotes necessários para habilitar o SELinux no openSUSE MicroOS
ru: Это пакеты, необходимые для включения SELinux в openSUSE MicroOS
sl: To so paketi, ki so potrebni za omogočiti SELinux na openSUSE MicroOS
sv: Detta är paket som krävs för att aktivera SELinux på openSUSE MicroOS
uk: Це пакунки, необхідні для ввімкнення SELinux на openSUSE MicroOS

source: LDAP client
ca: Client d'LDAP
cs: Klient LDAP
da: LDAP-klient
es: Cliente de LDAP
fi: LDAP asiakas
id: Klien LDAP
it: Client LDAP
pl: Klient LDAP
pt_br: Cliente LDAP
ru: Клиент LDAP
sl: Odjemalec LDAP
sv: LDAP klient
uk: Клієнт LDAP

source: Packages required to enable LDAP client support via sssd on openSUSE MicroOS.
ca: Paquets necessaris per habilitar el suport de client d'LDAP a través d'sssd al MicroSO d'openSUSE.
cs: Balíčky nezbytné k zapnutí klientské podpory LDAP (přes sssd) v openSUSE MicroOS.
da: Pakker som kræves for at aktivere understøttelse af LDAP-klient via sssd på openSUSE MicroOS.
de: Pakete, die auf openSUSE MicroOS zur Aktivierung der LDAP Client Unterstützung über sssd benötigt werden.
es: Paquetes obligatorios para habilitar el soporte de cliente LDAP vía sssd en openSUSE MicroOS.
fi: Paketit tarvitaan LDAP-asiakaspalvelun käyttöönottoon sssd:n kautta openSUSE MicroOS järjestelmässä.
id: Paket yang diperlukan untuk mengaktifkan dukungan klien LDAP melalui sssd di openSUSE MicroOS.
it: Pacchetti richiesti per abilitare il supporto a un client LDAP via sssd su openSUSE MicroOS.
pl: Pakiety wymagane do włączenia obsługi klienta LDAP przez sssd w openSUSE MicroOS.
pt_br: Pacotes necessários para habilitar o suporte ao cliente LDAP via sssd no openSUSE MicroOS.
ru: Пакеты, необходимые для включения поддержки клиентов LDAP черз sssd в openSUSE MicroOS.
sl: Paketi, ki so potrebni za omogočiti podporo za odjemalca LDAP prek sssd na openSUSE MicroOS.
sv: Paket som krävs för att aktivera LDAP-klientsupport via sssd på openSUSE MicroOS.
uk: Пакунки, необхідні для ввімкнення підтримки клієнта LDAP через sssd на openSUSE MicroOS.

source: Sway Tiling Wayland Compositor and related tools
ca: Compositor Wayland Sway Tiling i eines relacionades
cs: Sway Tiling Wayland Compositor a související nástroje
de: Kachelbasierter Wayland-Compositor Sway und verwandte Tools
es: Creador de tiling para Wayland Sway y herramientas relacionadas
id: Kompositor Sway Tiling Wayland dan perkakas terkait
it: Sway Tiling Wayland Compositor e strumenti correlati
pl: Kompozytor Sway Tiling Wayland i powiązane narzędzia
pt_br: Sway Tiling Wayland Compositor e ferramentas relacionadas
ru: Sway — тайлинговый композитор Wayland и сопутствующие инструменты
sl: Upravljalnik skladnje in tlakovanja Sway
sv: Sway kaklad Wayland Kompositör och relaterade verktyg
uk: Sway - мозаїчний композитор Wayland та супутні інструменти

source: Sway Tiling Wayland Compositor and related tools.
ca: Compositor Wayland Sway Tiling i eines relacionades.
cs: Sway Tiling Wayland Compositor a související nástroje.
de: Kachelbasierter Wayland-Compositor Sway und verwandte Tools.
es: Creador de tiling para Wayland Sway y herramientas relacionadas.
id: Kompositor Sway Tiling Wayland dan perkakas terkait.
it: Sway Tiling Wayland Compositor e strumenti correlati.
pl: Kompozytor Sway Tiling Wayland i powiązane narzędzia.
pt_br: Sway Tiling Wayland Compositor e ferramentas relacionadas.
ru: Sway — тайлинговый композитор Wayland и сопутствующие инструменты.
sl: Sway, upravljalnik skladnje in tlakovanja za grafični sistem Wayland, in povezana orodja.
sv: Sway kaklad Wayland Kompositör och relaterade verktyg.
uk: Sway - мозаїчний композитор Wayland та супутні інструменти.

source: leechcraft
pl: pijawka

source: This is the minimal SLE runtime system. It is really a minimal system, you can login and a shell will be started, that's all. It is intended as base for Appliances.
es: Este es el sistema de entorno de ejecución mínimo de SLE. Es un sistema realmente mínimo; puede iniciar sesión y se ejecutará un intérprete de órdenes, pero eso es todo. Está enfocado a servir como base para sistemas dedicados.
