Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: This pattern installs the Google Cloud Platform instance initialization packages which support the provisioning and running of instances in the cloud framework (e.g. google-daemon).
ar: يعمل هذا النمط على تثبيت حزم تهيئة مثيل Google Cloud Platform التي تدعم توفير المثيلات وتشغيلها في إطار عمل السحابة (على سبيل المثال، google-daemon).
ca: Aquest patró instal·la els paquets d’inicialització d’instàncies de Google Cloud Platform que admeten el subministrament i l’execució d’instàncies al marc del núvol (per exemple, google-daemon).
cs: Tento vzor nainstaluje všechny balíčky pro inicializaci instancí Google Cloud Platform, které podporují zřizování a spouštění instancí v cloudové architektuře (např. google-daemon).
da: Mønsteret installerer initieringspakker for Google Cloud Platform-instansen som understøtter klargøring og kørslen af instanser i sky-frameworket (f.eks. google-daemon).
de: Dieses Schema installiert die Pakete zur Instanzinitialisierung für die Google Cloud-Plattform, die die Bereitstellung und Ausführung von Instanzen im Cloud-Framework unterstützen (z. B. google-daemon).
es: Este patrón instala los paquetes de inicialización de la instancia de Google Cloud Platform con compatibilidad para el aprovisionamiento y la ejecución de instancias en la estructura de nube (por ejemplo google-daemon).
id: Pola ini memasang paket inisialisasi instance Google Cloud Platform yang mendukung penyediaan dan menjalankan instance dalam kerangka kerja cloud (mis. google-daemon).
it: Questo modello consente di installare i pacchetti di inizializzazione delle istanze di Google Cloud Platform che supportano il provisioning e l'esecuzione delle istanze nell'infrastruttura cloud (ad esempio google-daemon).
pl: Ten wzorzec służy do instalowania pakietów inicjalizacji instancji Google Cloud Platform, które obsługują zaopatrywanie i uruchamianie instancji w środowisku chmury (np. google-daemon).
pt_br: Este padrão instala os pacotes de inicialização de instância do Google Cloud Platform, que suportam o aprovisionamento e a execução de instâncias na estrutura de nuvem (ex. google-daemon).
ru: Этот шаблон устанавливает пакеты для инициализации экземпляров облачной платформы Google для подготовки и запуска экземпляров на облачной платформе (например, google-daemon).
sl: Ta vzorec namesti pakete za pripravljanje primerkov Google Cloud Platform, ki podpirajo oskrbovanje in poganjanje primerkov v ogrodju oblaka (npr. google-daemon).
sv: Detta mönster installerar initieringspaket för Google Cloud Platform som stöder tilldelning och körning av instanser i molnramverket (t.ex. google-daemon).
uk: Цей шаблон встановлює пакунки ініціалізації примірника Google Cloud Platform, які підтримують надання та запуск примірника у хмарному фреймворку (наприклад, google-daemon).

source: Google Cloud Platform - Instance Tools
ar: Google Cloud Platform - أدوات المثيل
ca: Plataforma de Google Cloud - Eines d'instància
cs: Google Cloud Platform – nástroje instancí
da: Google-skyplatform - Instansværktøjer
de: Google Cloud-Plattform – Instanztools
es: Google Cloud Platform - Herramientas de la instancia
id: Google Cloud Platform - Perkakas Instance
it: Google Cloud Platform - Strumenti per istanze
pl: Google Cloud Platform - narzędzia do obsługi instancji
pt_br: Google Cloud Platform - Ferramentas de Instância
ru: Google Cloud Platform — инструменты для работы с экземплярами
sl: Google Cloud Platform – orodja za primerke
sv: Google Cloud Platform - Instansverktyg
uk: Google Cloud Platform - Інструменти примірника

source: This pattern install the Google Cloud Platform instance specific tools which are used to collect instance metadata (e.g. python-gcemetadata).
ar: يعمل هذا النمط على تثبيت الأدوات الخاصة بمثيل Google Cloud Platform والتي يتم استخدامها لجمع بيانات تعريف المثيل (على سبيل المثال python-gcemetadata).
ca: Aquest patró instal·la les eines específiques de la instància de Google Cloud Platform que s’utilitzen per recopilar metadades d’instàncies (per exemple, python-gcemetadata).
cs: Tento vzor nainstaluje nástroje specifické pro instanci Google Cloud Platform, které se používají ke sběru metadat instance (např. python-gcemetadata).
da: Mønsteret installerer specifikke værktøjer til Google Cloud Platform-instansen som bruges til at indsamle instans-metadata (f.eks. python-gcemetadata).
de: Dieses Schema installiert instanzspezifische Tools für die Google Cloud-Plattform, die zur Erfassung von Instanzmetadaten dienen (z. B. python-gcemetadata).
es: Este patrón instala las herramientas específicas de la instancia de Google Cloud Platform que se usan para recopilar metadatos de instancia (por ejemplo, python-gcemetadata).
id: Pola ini memasang perkakas khusus instance Google Cloud Platform yang digunakan untuk mengumpulkan metadata instance (mis. python-gcemetadata).
it: Questo modello consente di installare gli strumenti specifici per le istanze di Google Cloud Platform che vengono utilizzati per raccogliere metadati delle istanze (ad esempio python-gcemetadata).
pl: Ten wzorzec służy do instalowania specyficznych dla instancji Google Cloud Platform narzędzi, które są używane do gromadzenia metadanych instancji (np. python-gcemetadata).
pt_br: Este padrão instala as ferramentas específicas de instância do Google Cloud Platform, que são usadas para coletar metadados de instância (ex. python-gcemetadata).
ru: Этот шаблон устанавливает специальные инструменты экземпляра Google Cloud Platform, которые используются для сбора метаданных экземпляра (например, python-gcemetadata).
sl: Ta vzorec namesti orodja specifična za primerke Google Cloud Platform, ki se uporabljajo za zbiranje metapodatkov primerkov (npr. python-gcemetadata).
sv: Detta mönster installerar instansspecifika verktyg för Google Cloud Platform som används för att samla in instansmetadata (t.ex. python-gcemetadata).
uk: Цей шаблон встановлює спеціальні інструменти Google Cloud Platform, які використовуються для збору метаданих примірника (наприклад, python-gcemetadata).

source: Google Cloud Platform - Tools
ar: Google Cloud Platform - الأدوات
ca: Plataforma de Google Cloud - Eines
cs: Google Cloud Platform – nástroje
da: Google-skyplatform - Værktøjer
de: Google Cloud-Plattform – Tools
es: Google Cloud Platform - Herramientas
fi: Google Cloud Platform - Työkalut
id: Google Cloud Platform - Perkakas
it: Google Cloud Platform - Strumenti
pl: Google Cloud Platform - narzędzia
pt_br: Google Cloud Platform - Ferramentas
ru: Google Cloud Platform — инструменты
sl: Google Cloud Platform – orodja
sv: Google Cloud Platform - Verktyg
uk: Google Cloud Platform - Інструменти

source: This pattern installs the Google Cloud Platform command line interface tools to communicate with the cloud framework (e.g. google-cloud-sdk).
ar: يعمل هذا النمط على تثبيت أدوات واجهة سطر أوامر Google Cloud Platform للاتصال بإطار عمل السحابة (على سبيل المثال google-cloud-sdk).
ca: Aquest patró instal·la les eines d’interfície de línia d’ordres de Google Cloud Platform per comunicar-se amb el marc del núvol (per exemple, google-cloud-sdk).
cs: Tento vzor nainstaluje nástroje rozhraní příkazového řádku Google Cloud Platform na komunikaci s cloudovou architekturou (např. google-cloud-sdk).
da: Mønsteret installerer kommandolinjegrænsflade-værktøjer for Google Cloud Platform til at kommunikere med sky-frameworket (f.eks. google-cloud-sdk).
de: Dieses Schema installiert die Kommandozeilentools für die Google Cloud-Plattform zur Kommunikation mit dem Cloud-Framework (z. B. google-cloud-sdk).
es: Este patrón instala las herramientas de interfaz de línea de comandos de Google Cloud Platform para comunicarse con la estructura de nube (por ejemplo, google-cloud-sdk).
id: Pola ini memasang perkakas antarmuka baris perintah Google Cloud Platform untuk berkomunikasi dengan kerangka kerja cloud (mis. google-cloud-sdk).
it: Questo modello consente di installare gli strumenti dell'interfaccia della riga di comando di Google Cloud Platform per comunicare con l'infrastruttura cloud (e.g. google-cloud-sdk).
pl: Ten wzorzec służy do instalowania narzędzi interfejsu wiersza poleceń usług Google Cloud Platform używanych do komunikacji ze środowiskiem chmury (np. google-cloud-sdk).
pt_br: Este padrão instala as ferramentas de interface de linha de comando do Google Cloud Platform para comunicação com a estrutura de nuvem (ex. google-cloud-sdk).
ru: Этот шаблон устанавливает инструменты интерфейса командной строки облачной платформы Google для обмена данными с облачной платформой (например, google-cloud-sdk).
sl: Ta vzorec namesti orodja Google Cloud Platform za ukazno vrstico, ki omogočajo komunikacijo z oblačnim ogrodjem (npr. google-cloud-sdk).
sv: Detta mönster installerar kommandoradsverktyg för Google Cloud Platform för att kommunicera med molnramverket (t.ex. google-cloud-sdk).
uk: Цей шаблон встановлює інструменти інтерфейсу командного рядка Google Cloud Platform для зв’язку з хмарним фреймворком (наприклад, google-cloud-sdk).

source: Microsoft Azure - All
ar: Microsoft Azure - الكل
ca: Microsoft Azure - Tot
cs: Microsoft Azure – vše
da: Microsoft Azure - Alle
de: Microsoft Azure – Alle
es: Microsoft Azure - Todo
fi: Microsoft Azure - Kaikki
id: Microsoft Azure - Semua
it: Microsoft Azure - Tutti
pl: Microsoft Azure - wszystkie
pt_br: Microsoft Azure - Tudo
ru: Microsoft Azure — все
sl: Microsoft Azure – vse
sv: Microsoft Azure - Alla
uk: Microsoft Azure - Всі

source: This pattern installs all Microsoft Azure command line interface tools, instance initialization packages and tools to communicate with the cloud framework from within a running instance. It is not recommended to install this pattern, but instead install one of the use-case specific patterns (e.g. Microsoft Azure - Tools).
ar: يعمل هذا النمط على تثبيت كل أدوات واجهة سطر أوامر Microsoft Azure وحزم تهيئة المثيل وأدوات الاتصال بإطار عمل السحابة من داخل مثيل قيد التشغيل. لا يوصى بتثبيت هذا النمط، ولكن يوصى بدلاً من ذلك بتثبيت أحد الأنماط المخصصة وفقًا لحالة الاستخدام (على سبيل المثال، Microsoft Azure - الأدوات).
ca: Aquest patró instal·la totes les eines d’interfície de línia d’ordres de Microsoft Azure, paquets d’inicialització d’instàncies i eines per comunicar-se amb el marc del núvol des d’una instància en execució. No es recomana instal·lar aquest patró, sinó que instal·leu un dels patrons específics del cas d’ús (per exemple, Microsoft Azure - Eines).
cs: Tento vzor nainstaluje z Microsoft Azure všechny nástroje rozhraní příkazového řádku, všechny balíčky pro incializaci instancí a všechny nástroje pro komunikaci s cloudovou architekturou z běžící instance. Nedoporučujeme instalovat přímo tento vzor, nýbrž jeden ze vzorů pro konkrétní požadovaný případ použití (např. Microsoft Azure – nástroje).
da: Mønsteret installerer alle kommandolinjegrænseflade-værktøjer for Microsoft Azure, instans-initieringspakker og værktøjer til at kommunikere med sky-frameworket indefra en kørende instans. Det anbefales ikke at installere mønsteret, men i stedet installere en af de specifikke mønstre til bestemte formål (f.eks. Microsoft Azure - Værktøjer).
de: Dieses Schema installiert alle Microsoft Azure-Kommandozeilentools, Pakete zur Instanzinitialisierung und Tools zur Kommunikation mit dem Cloud-Framework innerhalb einer ausgeführten Instanz. Es wird empfohlen, statt dieses Schemas eines der Schemata für spezifische Anwendungsfälle (z. B. Amazon Web Services – Tools) zu installieren.
es: Este patrón instala todas las herramientas de interfaz de línea de comandos de Microsoft Azure, los paquetes de inicialización de la instancia y las herramientas para comunicarse con la estructura de nube en una instancia en ejecución. No se recomienda instalar este patrón, pero sí uno de los patrones específicos de caso de uso (por ejemplo, Microsoft Azure - Herramientas).
id: Pola ini memasang semua perkakas antarmuka baris perintah Microsoft Azure, paket inisialisasi instance, dan perkakas untuk berkomunikasi dengan kerangka kerja cloud dari dalam instance yang sedang berjalan. Tidak disarankan untuk memasang pola ini, tetapi memasang salah satu pola spesifik kasus penggunaan (mis. Microsoft Azure - Tools).
it: Questo modello consente di installare tutti gli strumenti dell'interfaccia della riga di comando di Microsoft Azure, i pacchetti di inizializzazione delle istanze e gli strumenti per comunicare con l'infrastruttura cloud in un'istanza in esecuzione. Si sconsiglia di installare questo modello, optare invece per l'installazione di uno dei modelli specifici per i casi di utilizzo (ad esempio Microsoft Azure - Strumenti).
pl: Ten wzorzec służy do instalowania wszystkich narzędzi interfejsu wiersza poleceń usług Microsoft Azure, pakietów inicjalizacji instancji, a także narzędzi służących do komunikacji ze środowiskiem chmury z poziomu uruchomionej instancji. Instalowanie tego pakietu nie jest zalecane. Zamiast tego zaleca się instalację jednego ze wzorców specyficznych dla konkretnego przypadku użycia (np. Microsoft Azure - narzędzia).
pt_br: Este padrão instala todas as ferramentas de interface de linha de comando do Microsoft Azure, os pacotes de inicialização de instância e as ferramentas para comunicação com a estrutura de nuvem de uma instância em execução. Não é recomendado instalar esse padrão. Em vez dele, instale um dos padrões específicos do caso de uso (ex. Microsoft Azure - Ferramentas).
ru: Этот шаблон устанавливает все инструменты интерфейса командной строки Microsoft Azure, пакеты инициалиации экземпляров и инструменты для обмена данными с облачной средой в запущенном экземпляре. Вместо установки этого шаблона рекомендуется установить шаблон, соответствующий конкретной области применения (например, «Microsoft Azure — инструменты».
sl: Ta vzorec namesti vsa orodja Microsoft Azure za ukazno vrstico, pakete za pripravljanje primerkov in orodja za komunikacijo z oblačnim ogrodjem iz zagnanega primerka. Tega vzorca ni priporočljivo namestiti. Raje namestite enega od vzorcev za specifičen primer uporabe (npr. Microsoft Azure – orodja).
sv: Detta mönster installerar alla kommandoradsverktyg för Microsoft Azure, paket för instansinitiering och verktyg för att kommunicera med molnramverket från en instans som körs. Det rekommenderas inte att du installerar detta mönster. Installera istället ett av de användarfallspecifika mönstren (t.ex. Microsoft Azure - Verktyg).
uk: Цей шаблон встановлює всі інструменти інтерфейсу командного рядка Microsoft Azure, пакунки ініціалізації примірників та інструменти для зв’язку із хмарним фреймворком всередині запущеного примірника. Не рекомендовано встановлювати цей шаблон, натомість встановіть один із конкретних шаблонів використання (наприклад, Microsoft Azure – Інструменти).

source: Microsoft Azure - Instance Initialization
ar: Microsoft Azure - تهيئة المثيل
ca: Microsoft Azure - Inicialització de la instància
cs: Microsoft Azure – inicializace instancí
da: Microsoft Azure - Instansinitialisering
de: Microsoft Azure – Instanzinitialisierung
es: Microsoft Azure - Inicialización de la instancia
id: Microsoft Azure - Inisialisasi Instance
it: Microsoft Azure - Inizializzazione delle istanze
pl: Microsoft Azure - inicjalizacja instancji
pt_br: Microsoft Azure - Inicialização de Instância
ru: Microsoft Azure — инициализация экземпляров
sl: Microsoft Azure – pripravljanje primerkov
sv: Microsoft Azure - Instansinitiering
uk: Microsoft Azure - Ініціалізація примірника

source: This pattern installs the Microsoft Azure instance initialization packages which support the provisioning and running of instances in the cloud framework (e.g. python-azure-agent).
ar: يعمل هذا النمط على تثبيت حزم تهيئة مثيل Microsoft Azure التي تدعم توفير المثيلات وتشغيلها في إطار عمل السحابة (على سبيل المثال، python-azure-agent).
ca: Aquest patró instal·la els paquets d’inicialització d’instàncies de Microsoft Azure que admeten el subministrament i l’execució d’instàncies al marc del núvol (per exemple, python-azure-agent).
cs: Tento vzor nainstaluje všechny balíčky pro inicializaci instancí Microsoft Azure, které podporují zřizování a spouštění instancí v cloudové architektuře (např. python-azure-agent).
da: Mønsteret installerer initieringspakker for Microsoft Azure-instansen som understøtter klargøring og kørslen af instanser i sky-frameworket (f.eks. python-azure-agent).
de: Dieses Schema installiert die Pakete zur Microsoft Azure-Instanzinitialisierung, die die Bereitstellung und Ausführung von Instanzen im Cloud-Framework unterstützen (z. B. python-azure-agent).
es: Este patrón instala los paquetes de inicialización de la instancia de Microsoft Azure con compatibilidad para el aprovisionamiento y la ejecución de instancias en la estructura de nube (por ejemplo, python-azure-agent).
id: Pola ini memasang paket inisialisasi instance Microsoft Azure yang mendukung penyediaan dan menjalankan instance dalam kerangka kerja cloud (mis. python-azure-agent).
it: Questo modello consente di installare i pacchetti di inizializzazione delle istanze di Microsoft Azure che supportano il provisioning e l'esecuzione delle istanze nell'infrastruttura cloud (ad esempio python-azure-agent).
pl: Ten wzorzec służy do instalowania pakietów inicjalizacji instancji Microsoft Azure, które obsługują zaopatrywanie i uruchamianie instancji w środowisku chmury (np. python-azure-agent).
pt_br: Este padrão instala os pacotes de inicialização de instância do Microsoft Azure, que suportam o aprovisionamento e a execução de instâncias na estrutura de nuvem (ex. python-azure-agent).
ru: Этот шаблон устанавливает пакеты для инициализации экземпляров Microsoft Azure для подготовки и запуска экземпляров на облачной платформе (например, python-azure-agent).
sl: Ta vzorec namesti pakete za pripravljanje primerkov Microsoft Azure, ki podpirajo oskrbovanje in poganjanje primerkov v ogrodju oblaka (npr. python-azure-agent).
sv: Detta mönster installerar paket för instansinitiering för Microsoft Azure som stöder tilldelning och körning av instanser i molnramverket (t.ex. python-azure-agent).
uk: Цей шаблон встановлює пакунки ініціалізації примірника Microsoft Azure, які підтримують надання та запуск примірника у хмарному фреймворку (наприклад, python-azure-agent).

source: Microsoft Azure - Instance Tools
ar: Microsoft Azure - أدوات المثيل
ca: Microsoft Azure - Eines d'instància
cs: Microsoft Azure – nástroje instancí
da: Microsoft Azure - Instansværktøjer
de: Microsoft Azure – Instanztools
es: Microsoft Azure - Herramientas de la instancia
id: Microsoft Azure - Perkakas Instance
it: Microsoft Azure - Strumenti per istanze
pl: Microsoft Azure - narzędzia do obsługi instancji
pt_br: Microsoft Azure - Ferramentas de Instância
ru: Microsoft Azure — инструменты экземпляров
sl: Microsoft Azure – orodja za primerke
sv: Microsoft Azure - Instansverktyg
uk: Microsoft Azure - Інструменти примірника

source: This pattern install the Microsoft Azure instance specific tools which are used to collect instance metadata (e.g. azuremetadata).
ar: يعمل هذا النمط على تثبيت الأدوات الخاصة بمثيل Microsoft Azure والتي يتم استخدامها لحمع بيانات تعريف المثيل (على سبيل المثال، azuremetadata).
ca: Aquest patró instal·la les eines específiques de la instància de Microsoft Azure que s’utilitzen per recopilar metadades de la instància (per exemple, azuremetadata).
cs: Tento vzor nainstaluje nástroje specifické pro instanci Microsoft Azure, které se používají ke sběru metadat instance (např. azuremetadata).
da: Mønsteret installerer specifikke værktøjer til Microsoft Azure-instansen som bruges til at indsamle instans-metadata (f.eks. azuremetadata).
de: Dieses Schema installiert die instanzspezifischen Microsoft Azure-Tools, die zur Erfassung von Instanzmetadaten dienen (z. B. azuremetadata).
es: Este patrón instala las herramientas específicas de la instancia de Microsoft Azure que se usan para recopilar metadatos de instancia (por ejemplo, azuremetadata).
id: Pola ini memasang perkakas khusus instance Microsoft Azure yang digunakan untuk mengumpulkan metadata instance (mis. azuremetadata).
it: Questo modello consente di installare gli strumenti specifici per le istanze di Microsoft Azure che vengono utilizzati per raccogliere metadati delle istanze (ad esempio azuremetadata).
pl: Ten wzorzec służy do instalowania specyficznych dla instancji Microsoft Azure narzędzi, które są używane do gromadzenia metadanych instancji (np. azuremetadata).
pt_br: Este padrão instala as ferramentas específicas de instância do Microsoft Azure, que são usadas para coletar metadados de instância (ex. azuremetadata).
ru: Этот шаблон устанавливает инструменты для работы с экземплярами Microsoft Azure, используемые для сбора метаданных экземпляров (например, azuremetadata).
sl: Ta vzorec namesti orodja specifična za primerke Microsoft Azure, ki se uporabljajo za zbiranje metapodatkov primerkov (npr. azuremetadata).
sv: Detta mönster installerar instansspecifika verktyg för Microsoft Azure som används för att samla in instansmetadata (t.ex. azuremetadata).
uk: Цей шаблон встановлює спеціальні інструменти Microsoft Azure, які використовуються для збору метаданих примірника (наприклад, azuremetadata).

source: Microsoft Azure - Tools
ar: Microsoft Azure - الأدوات
ca: Microsoft Azure - Eines
cs: Microsoft Azure – nástroje
da: Microsoft Azure - Værktøjer
es: Microsoft Azure - Herramientas
fi: Microsoft Azure - Työkalut
id: Microsoft Azure - Perkakas
it: Microsoft Azure - Strumenti
pl: Microsoft Azure - narzędzia
pt_br: Microsoft Azure - Ferramentas
ru: Microsoft Azure — инструменты
sl: Microsoft Azure – orodja
sv: Microsoft Azure - Verktyg
uk: Microsoft Azure - Інструменти

source: This pattern installs the Microsoft Azure command line interface tools to communicate with the cloud framework (e.g. azure-cli).
ar: يعمل هذا النمط على تثبيت أدوات واجهة سطر أوامر Microsoft Azure للاتصال بإطار عمل السحابة (على سبيل المثال، azure-cli).
ca: Aquest patró instal·la les eines d’interfície de línia d’ordres de Microsoft Azure per comunicar-se amb el marc del núvol (per exemple, azure-cli).
cs: Tato šablona instaluje nástroje rozhraní příkazového řádku Microsoft Azure ke komunikaci s cloudovou architekturou (např. azure-cli).
da: Mønsteret installerer kommandolinjegrænsflade-værktøjer for Microsoft Azure til at kommunikere med sky-frameworket (f.eks. azure-cli).
de: Dieses Schema installiert Microsoft Azure-Kommandozeilentools zur Kommunikation mit dem Cloud-Framework (z. B. azure-cli).
es: Este patrón instala las herramientas de interfaz de línea de comandos de Microsoft Azure para comunicarse con la estructura de nube (por ejemplo, azure-cli).
id: Pola ini memasang perkakas antarmuka baris perintah Microsoft Azure untuk berkomunikasi dengan kerangka kerja awan (mis. azure-cli).
it: Questo modello consente di installare gli strumenti dell'interfaccia della riga di comando di Microsoft Azure per comunicare con l'infrastruttura cloud (ad esempio azure-cli).
pl: Ten wzorzec służy do instalowania narzędzi interfejsu wiersza poleceń usług Microsoft Azure używanych do komunikacji ze środowiskiem chmury (np. azure-cli).
pt_br: Este padrão instala as ferramentas de interface de linha de comando do Microsoft Azure para comunicação com a estrutura de nuvem (ex. azure-cli).
ru: Этот шаблон устанавливает инструменты интерфейса командной строки Microsoft Azure для обмена данными с облачной платформой (например, azure-cli).
sl: Ta vzorec namesti orodja Microsoft Azure za ukazno vrstico, ki omogočajo komunikacijo z oblačnim ogrodjem (npr. azure-cli).
sv: Detta mönster installerar kommandoradsverktyg för Microsoft Azure för att kommunicera med molnramverket (t.ex. azure-cli).
uk: Цей шаблон встановлює інструменти інтерфейсу командного рядка Microsoft Azure для зв’язку із хмарним фреймворком (наприклад, azure-cli).
