Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: RPM macros for building of patterns modules
ar: وحدات ماكرو RPM لإنشاء الوحدات النمطية للأنماط
ca: Macros RPM per a la construcció de mòduls de patrons
cs: RPM makra pro budování modulů šablon
da: RPM-makroer til at bygge mønstre-moduler
de: RPM-Makros zum Bau von Pattern-Modulen
es: Macros RPM para crear módulos de patrones
fi: RPM-makrot kuviomoduulien koostamiseen
id: Makro RPM untuk membangun modul pola
it: Macro RPM per la compilazione dei moduli dei modelli
pl: Makra RPM do tworzenia modułów z wzorcami
pt_br: Macros RPM para construir os módulos dos padrões
ru: Макросы RPM для сборки модулей шаблонов
sl: Makroji RPM za grajenje modulov vzorcev
sv: RPM-makron för att bygga mönstermoduler
uk: Макроси RPM для збирання різних модулів шаблонів

source: This package contains SUSE RPM macros to aid creating patterns.
ar: تحتوي هذه الحزمة على وحدات الماكرو الخاصة بحزم سوزي RPM لدعم إنشاء الأنماط.
ca: Aquest paquet conté macros RPM de SUSE per ajudar a crear patrons.
cs: Tento balíček obsahuje makra SUSE RPM - pomoc při tvorbě šablon.
da: Denne pakke indeholder SUSE RPM-makroer til at hjælpe med oprettelse af mønstre.
de: Dieses Paket enthält SUSE-RPM-Makros zur Untersützung bei der Erstellung von Patterns.
es: Este paquete contiene macros de SUSE para RPM para ayudar a crear patrones.
fi: Tämä paketti sisältää SUSEn RPM-makrot kuvioiden luomiseksi.
id: Paket ini berisi makro SUSE RPM untuk membantu membuat pola.
it: Questo pacchetto contiene le macro per RPM di SUSE per agevolare la creazione dei modelli.
pl: Ten pakiet zawiera makra SUSE RPM ułatwiające tworzenie wzorców.
pt_br: Este pacote contém as macros RPM do SUSE, para ajudar na criação de padrões.
ru: Этот пакет содержит макросы SUSE RPM для создания шаблонов.
sl: Ta paket vsebuje SUSE-jeve makroje RPM za pomoč pri ustvarjanju vzorcev.
sv: Detta paket innehåller SUSE RPM-makron som hjälper till att skapa mönster.
uk: Цей пакунок містить макроси SUSE RPM, які допомагають створювати шаблони.

source: DHCP and DNS Server
ar: خادم DHCP وDNS
ca: Servidor DHCP i DNS
cs: DHCP a DNS server
da: DHCP- og DNS-server
de: DHCP- und DNS-Server
es: Servidor DHCP y DNS
fi: DHCP- ja DNS-palvelin
id: Peladen DHCP dan DNS
it: Server DHCP e DNS
pl: Serwer DHCP i DNS
pt_br: Servidor DHCP e DNS
ru: Сервер DHCP и DNS
sl: Strežnik DHCP in DNS
sv: DHCP- och DNS-server
uk: Сервер DHCP і DNS

source: Software to set up a server for the Dynamic Host Configuration Protocol (DHCP) and the Domain Name System (DNS) services. DHCP provides configuration parameters to client computers to integrate them into a network, whereas DNS delivers information associated with domain names, in particular, the IP address.
ar: برنامج لإعداد الخادم من أجل خدمات بروتوكول التكوين الديناميكي للمضيف (DHCP) ونظام أسماء المجالات (DNS). يوفر DHCP معلمات التكوين لأجهزة العملاء لدمجها في الشبكة، بينما يرسل DNS المعلومات المقترنة بأسماء المجالات، وخاصًة عنوان بروتوكول الإنترنت (IP).
ca: Programari per configurar un servidor per al Protocol de configuració d'amfitrió dinàmic (DHCP) i els serveis del Sistema de noms de domini (DNS). DHCP proporciona paràmetres de configuració als ordinadors clients per integrar-los en una xarxa, mentre que DNS proporciona informació associada als noms de domini, en particular, l'adreça IP.
cs: Nastavení DHCP serveru, který se postará o automatické síťové nastavení pracovních stanic ve vaší síti. Součásti je také DNS server, který se postará o správné rozpoznávání jmen staniv síti.
da: Software til at opsætte en server til tjenesterne Dynamic Host Configuration Protocol (DHCP) og Domain Name System (DNS). DHCP leverer konfigurationsparametre så klient-computere kan integrere dem i et netværk, mens DNS leverer information tilknyttet med domænenavne, i særdeleshed IP-adressen.
de: Hiermit können Sie den Server für das Dynamic Host Configuration Protocol (DHCP) einrichten, das Konfigurationsparameter für Client-Computer bereitstellt, um sie in ein Netzwerk zu integrieren. Außerdem können Domain Name System-(DNS-)Dienste bereitgestellt werden, mit denen Informationen zu Domänennamen, insbesondere die IP-Adresse, zugestellt werden können.
es: Software para configurar un servidor para el Protocolo de Control Dinámico de Host (DHCP) y servicios de Sistema de Nombres de Dominio (DNS). DHCP proporciona los parámetros de configuración a los equipos cliente para integrarlos en una red, mientras que DNS proporciona información asociada con nombres de dominio, en particular, la dirección IP.
fi: Ohjelmisto DHCP-palvelimen (Dynamic Host Configuration Protocol) ja DNS-palvelun (Domain Name System) asentamiseen. DHCP tarjoaa määritysasetukset verkkoon liitettäville asiakaskoneille. DNS-palvelu puolestaan tuottaa toimialuenimiä koskevaa tietoa, kuten IP-osoitteen.
id: Perangkat lunak untuk mengatur peladen untuk layanan Dynamic Host Configuration Protocol (DHCP) dan Domain Name System (DNS). DHCP memberikan parameter konfigurasi ke komputer klien untuk mengintegrasikannya ke dalam jaringan, sedangkan DNS memberikan informasi yang terkait dengan nama domain, khususnya, alamat IP.
it: Programmi per impostare un server per i servizi DHCP (protocollo di configurazione dinamica degli host) e DNS (sistema dei nomi di dominio). DHCP fornisce i parametri di configurazione ai computer client per integrarli in una rete, mentre DNS rilascia le informazioni associate ai nomi di dominio, in particolare l'indirizzo IP.
pl: Narzędzia serwera DHCP (Dynamic Host Configuration Protocol), który udostępnia komputerom klienckim parametry konfiguracyjne, dzięki którym mogą one połączyć się w sieć. Serwer DNS (Domain Name System) dostarcza informacje związane z nazwami domenowymi, w szczególności adresy IP.
pt_br: Programa para configurar um servidor para os serviços DHCP (Dynamic Host Configuration Protocol) e DNS (Domain Name System). O DHCP fornece parâmetros de configuração para computadores clientes para integrá-los numa rede, enquanto o DNS fornece informações associadas aos nomes de domínio, em particular, o endereço IP.
ru: Программы для установки сервера служб DHCP (Dynamic Host Configuration Protocol) и DNS (Domain Name System). DHCP предоставляет параметры настройки клиентским компьютерам для объединения их в сеть, тогда как DNS предоставляет информацию, связанную с доменными именами, например IP-адреса.
sl: Programska oprema za postavljanje strežnika Dynamic Host Configuration Protocol (DHCP, protokol za dinamično nastavitev gostiteljev) in storitev Domain Name System (DNS, sistem domenskih imen). DHCP računalnikom odjemalcem ponuja nastavitvene parametre za vključevanje v omrežje, DNS pa ponuja podatke o domenskih imenih, na primer naslove IP.
sv: Programvara för installation av en server för DHCP-tjänster (Dynamic Host Configuration Protocol) och DNS-tjänster (Domain Name System). Med DHCP får klientdatorer konfigureringsparametrar så att de kan integreras i ett nätverk. En DNS-tjänst används till att tillhandahålla information som är associerad med domännamn, framför allt IP-adressen.
uk: Програми для установки сервера DHCP (Dynamic Host Configuration Protocol) і DNS (Domain Name System). DHCP надає параметри клієнтським комп'ютерам для об'єднання їх у мережу, тоді як DNS надає інформацію, пов'язану з доменними назвами, зокрема, IP-адресами.

source: The 32bit pattern complementing dhcp_dns_server.
ar: نمط 32bit المكمّل ل dhcp_dns_server.
ca: El patró de 32 bits que completa el servidor DNS DHCP.
cs: 32bitový vzor doplňující dhcp_dns_server.
da: 32-bit-mønsteret som komplimenterer dhcp_dns_server.
de: Das 32-Bit-Schema zur Ergänzung von dhcp_dns_server.
es: El patrón de 32 bits que complementa a dhcp_dns_server.
fi: dhcp_dns_serveriä täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi dhcp_dns_server.
it: Modello a 32 bit complementare a dhcp_dns_server.
pl: 32-bitowy wzorzec uzupełniający serwery usług DHCP i DNS.
pt_br: O padrão de 32 bits que complementa o servidor DHCP e DNS.
ru: Этот 32-разрядный шаблон дополняет dhcp_dns_server.
sl: 32-bitni vzorec, ki dopolnjuje dhcp_dns_server.
sv: 32-bitarsmönster som kompletterar dhcp_dns_server.
uk: 32-бітовий шаблон, який доповнює dhcp_dns_server.

source: Directory Server (LDAP)
ar: خادم الدليل (LDAP)
ca: Servidor de directoris (LDAP)
cs: Adresářový server (LDAP)
de: Verzeichnisserver (LDAP)
es: Servidor de directorios (LDAP)
fi: Hakemistopalvelin (LDAP)
id: Peladen Direktori (LDAP)
it: Server di directory (LDAP)
pl: Serwer usług katalogowych (LDAP)
pt_br: Servidor de diretórios (LDAP)
ru: Сервер каталогов (LDAP)
sl: Imeniški strežnik (LDAP)
sv: Katalogserver (LDAP)
uk: Сервер каталогів (LDAP)

source: Software to set up a directory server with OpenLDAP. The Lightweight Directory Access Protocol (LDAP) is used to access online directory services.
ar: برنامج لإعداد خادم الدليل باستخدام OpenLDAP. يتم استخدام البروتوكول الخفيف لتغيير بيانات الدليل (LDAP) للوصول إلى خدمات الدليل عبر الإنترنت.
ca: Programari per configurar un servidor de directoris amb OpenLDAP. El protocol d'accés de directori lleuger (LDAP) s'usa per accedir als serveis de directori en línia.
cs: Software k vytvoření adresářových serverů OpenLDAP. Pro přístup k on-line adresářovým službám se používá protokol Lightweight Directory Access Protocol (LDAP).
da: Software til at opsætte en directory-server med OpenLDAP. Lightweight Directory Access Protocol (LDAP) bruges til at tilgå online directory-tjenester.
de: Software zum Aufsetzen eines Directory-Servers mit OpenLDAP. Das Lightweight Directory Access Protocol (LDAP) wird für Zugriffe mit Online-Directory-Diensten verwendet.
es: Software para configurar un servidor de directorio con OpenLDAP. El Protocolo Ligero de Acceso a Directorio (LDAP por sus siglas en inglés) es utilizado para acceder a servicios de directorios en línea.
fi: Ohjelma OpenLDAPia käyttävän hakemistopalvelimen asettamiseen. LDAPilla (Lightweight Directory Access Protocol) käytetään verkon hakemistopalveluja.
id: Perangkat lunak untuk mengatur peladen direktori dengan OpenLDAP. Lightweight Directory Access Protocol (LDAP) digunakan untuk mengakses layanan direktori daring.
it: Programmi per configurare un server di directory con OpenLDAP. Viene utilizzato il Lightweight Directory Access Protocol (LDAP) per accedere ai servizi di directory in linea.
pl: Oprogramowanie do instalowania serwera usług katalogowych OpenLDAP. Protokół LDAP (Lightweight Directory Access Protocol) służy do uzyskiwania dostępu online do usług katalogowych.
pt_br: Software para configurar um servidor de diretórios com OpenLDAP. O LDAP (Lightweight Directory Access Protocol) é usado para acessar serviços de diretórios online.
ru: Программное обеспечение для установки сервера каталогов с помощью OpenLDAP. Протокол LDAP (Lightweight Directory Access Protocol) используется для доступа к онлайн-службам каталогов.
sl: Programska oprema za postavljanje imeniškega strežnika z OpenLDAP. Za dostop do omrežnih imeniških storitev se uporablja protokol Lightweight Directory Access Protocol (LDAP, lahek protokol za imeniški dostop).
sv: Programvara för installation av en katalogserver med OpenLDAP. LDAP (Lightweight Directory Access Protocol) används för åtkomst till katalogtjänster på Internet.
uk: Програмне забезпечення для установки сервера каталогів за допомогою OpenLDAP. Протокол LDAP (Lightweight Directory Access Protocol) використовується для доступу до онлайн-служб каталогів.

source: The 32bit pattern complementing directory_server.
ar: نمط 32bit المكمّل ل directory_server.
ca: El patró de 32 bits que completa el servidor de directoris.
cs: 32-bitový vzor doplňující adresářový server (directory_server).
da: 32-bit-mønsteret som komplimenterer directory_server.
de: Das 32-Bit-Schema zur Ergänzung von directory_server.
es: El patrón de 32 bits que complementa a directory_server.
fi: directory_serveriä täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi directory_server.
it: Modello a 32 bit complementare a directory_server.
pl: 32-bitowy wzorzec uzupełniający serwer usług katalogowych.
pt_br: O padrão de 32 bits que complementa o servidor de diretórios.
ru: Этот 32-разрядный шаблон дополняет directory_server.
sl: 32-bitni vzorec, ki dopolnjuje directory_server.
sv: 32-bitarsmönster som kompletterar directory_server.
uk: 32-бітовий шаблон, який доповнює directory_server.

source: The 32bit pattern complementing fips.
ar: نمط 32bit المكمّل ل fips.
ca: El patró de 32 bits que completa fips.
cs: 32bitový vzor doplňující fips.
da: 32-bit-mønsteret som komplimenterer fips.
de: Das 32-Bit-Schema zur Ergänzung von fips.
es: El patrón de 32 bits que complementa a fips.
id: Pola 32bit melengkapi fips.
it: Modello a 32 bit complementare a fips.
pl: 32-bitowy wzorzec uzupełniający normy FIPS.
pt_br: O padrão de 32 bits que complementa fips.
ru: Этот 32-разрядный шаблон дополняет fips.
sl: 32-bitni vzorec, ki dopolnjuje fips.
sv: 32-bitarsmönster som kompletterar fips.
uk: 32-бітовий шаблон, який доповнює fips.

source: The 32bit pattern complementing oracle_server.
ar: نمط 32bit المكمّل ل oracle_server.
ca: El patró de 32 bits que completa el servidor d'Oracle.
cs: 32bitový vzor doplňující oracle_server.
da: 32-bit-mønsteret som komplimenterer oracle_server.
de: Das 32-Bit-Schema zur Ergänzung von oracle_server.
es: El patrón de 32 bits que complementa a oracle_server.
fi: Oracle_serveriä täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi oracle_server.
it: Modello a 32 bit complementare a oracle_server.
pl: 32-bitowy wzorzec uzupełniający serwer Oracle.
pt_br: O padrão de 32 bits que complementa o oracle_server.
ru: Этот 32-разрядный шаблон дополняет oracle_server.
sl: 32-bitni vzorec, ki dopolnjuje oracle_server.
sv: 32-bitarsmönster som kompletterar oracle_server.
uk: 32-бітовий шаблон, який доповнює oracle_server.

source: SAP Application Server Base
ar: قاعدة خادم تطبيقات SAP
ca: Base de servidor d'aplicacions SAP
cs: Základ pro aplikační server SAP
da: SAP-programserver grundlæggende
de: SAP-Anwendungsserver-Basis
es: Base del servidor de aplicaciones SAP
fi: SAP-sovelluspalvelinalusta
id: Dasar Peladen Aplikasi SAP
it: Base del server per applicazioni SAP
pl: Baza serwera programów SAP
pt_br: Servidor base de aplicativos SAP
ru: Базовый сервер приложений SAP
sl: Osnova strežnika SAP Application
sv: Grundläggande serversystem för SAP-program
uk: Базовий сервер застосунків SAP

source: Set up the server for installing SAP systems.
ar: إعداد الخادم لتثبيت أنظمة SAP.
ca: Configura el servidor per instal·lar sistemes SAP.
cs: Připravit server pro instalaci systémů SAP.
da: Opsæt serveren til installation af SAP-systemer.
de: Richten Sie den Server für die Installation von SAP-Systemen ein.
es: Configurar el servidor para instalar sistemas SAP.
fi: Pystytä palvelin SAP-järjestelmien asentamista varten.
id: Siapkan peladen untuk memasang sistem SAP.
it: Per impostare il server per l'installazione dei sistemi SAP.
pl: Konfiguracja serwera do instalowania systemów SAP.
pt_br: Configurar o servidor para instalar sistemas SAP.
ru: Настройка сервера для установки систем SAP.
sl: Nastavitve strežnika za nameščanje sistemov SAP.
sv: Konfigurera servern för installation av SAP-system.
uk: Налаштування серверу для встановлення систем SAP.

source: The 32bit pattern complementing sap_server.
ar: نمط 32bit المكمّل ل sap_server.
ca: El patró de 32 bits per completar el servidor SAP.
cs: 32bitový vzor doplňující sap_server.
da: 32-bit-mønsteret som komplimenterer sap_server.
de: Das 32-Bit-Schema zur Ergänzung von sap_server.
es: El patrón de 32 bits que complementa a sap_server.
fi: sap_serveriä täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi sap_server.
it: Modello a 32 bit complementare a sap_server.
pl: 32-bitowy wzorzec uzupełniający serwer SAP.
pt_br: O padrão de 32 bits que complementa o servidor SAP.
ru: Этот 32-разрядный шаблон дополняет sap_server.
sl: 32-bitni vzorec, ki dopolnjuje sap_server.
sv: 32-bitarsmönster som kompletterar sap_server.
uk: 32-бітовий шаблон, який доповнює sap_server.

source: File Server
ar: خادم الملفات
ca: Servidor de fitxers
cs: Souborový server
da: Filserver
de: Dateiserver
es: Servidor de archivos
fi: Tiedostopalvelin
id: Peladen Berkas
it: Server dei file
pl: Serwer plików
pt_br: Servidor de arquivos
ru: Файловый сервер
sl: Datotečni strežnik
sv: Filserver
uk: Файловий сервер

source: File services to host files so that they may be accessed or retrieved by other computers on the same network. This includes the FTP, SMB, and NFS protocols.
ar: خدمات الملفات الخاصة باستضافة الملفات بحيث يمكن الوصول إليها أو استردادها من قبل أجهزةالكمبيوتر الأخرى على نفس الشبكة. ويتضمن ذلك بروتوكولات FTP وSMB وNFS.
ca: Serveis de fitxers per allotjar fitxers perquè hi puguin accedir o els puguin recuperar altres ordinadors de la mateixa xarxa. Això inclou els protocols FTP, SMB i NFS.
cs: Souborové služby umožňující přístup k souborům z ostatních počítačů v síti. Obsahuje FTP, SMB a NFS protokoly.
da: Filtjenester til at hoste filer så de kan tilgås eller hentes af andre computere på det samme netværk. Det inkluderer FTP-, SMB- og NFS-protokollerne.
de: Richten Sie mit Samba, FTP und NFS Dateiserver ein, um anderen Computern in Ihrem Netzwerk den Zugriff auf Ihre Dateien und Verzeichnisse zu gestatten.
es: Servicios de archivo para gestionar archivos para que puedan acceder a ellos otros equipos de la misma red. Esto incluye los protocolos FTP, SMB y NFS.
fi: Tiedostopalvelut tiedostojen jakamiseen muiden samassa verkossa olevien tietokoneiden kesken. Sisältää FTP-, SMB-, ja NFS-yhteyskäytännöt.
id: Layanan berkas untuk meng-host berkas sehingga dapat diakses atau diambil oleh komputer lain di jaringan yang sama. Ini termasuk protokol FTP, SMB, dan NFS.
it: Servizio file per ospitare file in modo che si possa accedervi o recuperarli da altri computer della stessa rete. Include i protocolli FTP, SMB E NFS.
pl: Usługi plikowe do przechowywania i udostępniania plików innym komputerom w sieci za pomocą protokołów FTP, SMB i NFS.
pt_br: Serviços de arquivo para hospedar arquivos, de tal modo que eles possam ser acessados ou obtidos por outros computadores na mesma rede. Isto inclui os protocolos FTP, SMB e NFS.
ru: Файловые службы для обеспечения доступа к файлам с других компьютеров в той же сети, в том числе по протоколам FTP, SMB и NFS.
sl: Datotečne storitve za hranjenje datotek, do katerih je moč dostopati in jih pridobivati z drugih računalnikov v istem omrežju. Vključeni so protokoli FTP, SMB in NFS.
sv: Filtjänster som gör det möjligt att dela ut filer så att det går att komma åt och hämta dem via andra datorer på samma nätverk. Bland tjänsterna ingår protokollen FTP, SMB och NFS.
uk: Файлові служби для забезпечення доступу до файлів з інших комп'ютерів в тій мережі, в тому числі по протоколах FTP, SMB і NFS.

source: The 32bit pattern complementing file_server.
ar: نمط 32bit المكمّل ل file_server.
ca: El patró de 32 bits que completa el servidor de fitxers.
cs: 32bitový vzor doplňující file_server.
da: 32-bit-mønsteret som komplimenterer file_server.
de: Das 32-Bit-Schema zur Ergänzung von file_server.
es: El patrón de 32 bits que complementa a file_server.
fi: file_serveriä täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi file_server.
it: Modello a 32 bit complementare a file_server.
pl: 32-bitowy wzorzec uzupełniający serwer plików.
pt_br: O padrão de 32 bits que complementa o servidor de arquivos.
ru: Этот 32-разрядный шаблон дополняет file_server.
sl: 32-bitni vzorec, ki dopolnjuje file_server.
sv: 32-bitarsmönster som kompletterar file_server.
uk: 32-бітовий шаблон, який доповнює file_server.

source: Internet Gateway
ar: مدخل الإنترنت
ca: Passarel·la d'Internet
cs: Internetová brána
es: Pasarela de Internet
fi: Internet-yhdyskäytävä
id: Gateway Internet
it: Gateway Internet
pl: Bramka internetowa
pt_br: Gateway de Internet
ru: Интернет-шлюз
sl: Medmrežni prehod
uk: Інтернет-шлюз

source: Software to set up a proxy, firewall, and gateway server, including a virtual private network (VPN) gateway.
ar: برنامج لإعداد خادم وكيل وجدار حماية ومدخل، بما في ذلك مدخل الشبكة الظاهرية الخاصة (VPN).
ca: Programari per configurar un servidor intermediari, un tallafoc i un servidor de passarel·la, incloent-hi una passarel·la de xarxa privada virtual (XPV).
cs: Nastavení proxy, firewallu a brány pro připojení k Internetu. Součástí je také VPN (virtual private network).
da: Software til at opsætte en proxy-, firewall- og gateway-server, inklusiv en virtuel privat netværk-gateway (VPN).
de: Hiermit können Sie einen Proxy-, Firewall- und Gateway-Server einrichten. Außerdem kann ein VPN-Gateway (Virtual Private Network) bereitgestellt werden.
es: Software para configurar un proxy, cortafuegos y un servidor de puerta de enlace incluyendo una pasarela para red privada virtual (VPN).
fi: Ohjelmisto välityspalvelin-, palomuuri- ja yhdyskäytäväpalvelinkäyttöön. Tarjoaa myös virtuaalisen yksityisen verkon (VPN) yhdyskäytävän.
id: Perangkat lunak untuk mengatur proxy, firewall, dan server gateway, termasuk gateway virtual private network (VPN).
it: Programmi per impostare un server proxy, un firewall, un gateway e un gateway per reti private virtuali (VPN).
pl: Oprogramowanie do konfiguracji serwera proxy, zapory sieciowej, serwera bramki i bramki wirtualnej sieci prywatnej (VPN).
pt_br: Programa para configurar um proxy, firewall e servidor gateway, incluindo um gateway de VPN (rede privada virtual).
ru: Программное обеспечение для установки прокси, брандмауэра и сервера-шлюза, в том числе шлюза виртуальной частной сети (VPN).
sl: Programska oprema za nastavljanje posredniškega strežnika, požarnega zidu in prehoda, vključno s prehodom navideznega zasebnega omrežja (VPN).
sv: Programvara för inställning av en proxy-, brandväggs- och gatewayserver, inklusive en VPN-gateway (virtuellt privat nätverk).
uk: Програмне забезпечення для установки проксі, мережного екрана сервера-шлюзу, тому числі шлюзу віртуальної приватної мережі (VPN).

source: The 32bit pattern complementing gateway_server.
ar: نمط 32bit المكمّل ل gateway_server.
ca: El patró de 32 bits que completa el servidor de passarel·les.
cs: 32bitový vzor doplňující gateway_server.
da: 32-bit-mønsteret som komplimenterer gateway_server.
de: Das 32-Bit-Schema zur Ergänzung von gateway_server.
es: El patrón de 32 bits que complementa a gateway_server.
fi: gateway_serveriä täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi gateway_server.
it: Modello a 32 bit complementare a gateway_server.
pl: 32-bitowy wzorzec uzupełniający serwer bramki internetowej.
pt_br: O padrão de 32 bits que complementa o gateway de Internet.
ru: Этот 32-разрядный шаблон дополняет gateway_server.
sl: 32-bitni vzorec, ki dopolnjuje gateway_server.
sv: 32-bitarsmönster som kompletterar gateway_server.
uk: 32-бітовий шаблон, який доповнює gateway_server.

source: KVM Host Server
ar: خادم استضافة KVM
ca: Servidor amfitrió de KVM
cs: Hostitelský server KVM
da: KVM-værtsserver
es: Servidor anfitrión para la máquina virtual KVM
fi: KVM isäntäpalvelin
id: Peladen Host KVM
it: Host server KVM
pl: Serwer hostów KVM
pt_br: Servidor de hospedagem KVM
ru: Хост-сервер KVM
sl: Strežnik gostitelja KVM
uk: Хост-сервер KVM
