Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: This is the openSUSE MicroOS runtime system. It contains only a minimal multiuser booting system.
ca: Aquest és el sistema d'entorn d'execució del MicroSO d'openSUSE. Conté només un sistema d'arrencada de multiusuari mínim.
cs: Toto je provozní systém openSUSE MicroOS. Obsahuje pouze minimální víceuživatelský zaváděcí systém.
da: Dette er openSUSE MicroOS runtime-systemet. Det indeholder kun et minimalt flerbruger-bootsystem.
de: Dies ist das openSUSE MicroOS Laufzeitsystem. Es enthält nur ein minimales Multiuser-Bootsystem.
es: Este es el entorno de ejecución de openSUSE MicroOS. Solo contiene un sistema de arranque multiusuario mínimo.
fi: Tämä on openSUSE MicroOS -käyttöjärjestelmä. Se sisältää vain minimaalisen monen käyttäjän käynnistysjärjestelmän.
id: Ini adalah sistem runtime openSUSE MicroOS. Ini hanya berisi sistem boot multiuser minimal.
it: Questo è il sistema di esecuzione di openSUSE MicroOS. Contiene solo un sistema di avvio multiutente minimale.
pl: To jest system uruchomieniowy openSUSE MicroOS. Zawiera tylko minimalny system uruchamiania dla wielu użytkowników.
pt_br: Este é o sistema de execução openSUSE MicroOS. Ele contém somente um sistema de inicialização multiusuário mínimo.
ru: Исполняемая система openSUSE MicroOS. Содержит только минимальную многопользовательскую загружаемую систему.
sl: To je izvajalni sistem openSUSE MicroOS. Vsebuje samo minimalen več-uporabniški sistem.
sv: Detta är körtids systemet openSUSE MicroOS. Den innehåller bara ett minimalt uppstartssystem för flera användare.
uk: Це система виконання openSUSE MicroOS. Вона містить лише мінімальну багатокористувацьку завантажувальну систему.

source: openSUSE MicroOS using Micro DNF
ca: MicroSO d'openSUSE que usa Micro DNF
cs: OpenSUSE MicroOS, používá Micro DNF
de: openSUSE MicroOS mit Micro DNF
es: openSUSE MicroOS con Micro DNF
fi: openSUSE MicroOS Micro DNF:ää käyttäen
id: openSUSE MicroOS menggunakan Micro DNF
it: openSUSE MicroOS con Micro DNF
pl: openSUSE MicroOS przy użyciu Micro DNF
pt_br: openSUSE MicroOS com Micro DNF
ru: openSUSE MicroOS с использованием Micro DNF
sl: openSUSE MicroOS z uporabo Micro DNF
sv: openSUSE MicroOS använda Micro DNF
uk: openSUSE MicroOS із застосуванням Micro DNF

source: This is the openSUSE MicroOS runtime system using the Micro DNF package manager. It contains only a minimal multiuser booting system.
ca: Aquest és el sistema d'entorn d'execució del MicroSO d'openSUSE que usa el gestor de paquets Micro DNF. Conté només un sistema d'arrencada de multiusuari mínim.
cs: Toto je provozní systém openSUSE MicroOS používající správce balíčků Micro DNF. Obsahuje pouze minimální víceuživatelský zaváděcí systém.
de: Dies ist das openSUSE MicroOS Laufzeitsystem mit dem Micro DNF-Paketmanager. Es enthält nur ein minimales Multiuser-Bootsystem.
es: Este es el entorno de ejecución de openSUSE MicroOS que usa el gestor de paquetes Micro DNF. Solo contiene un sistema de arranque multiusuario mínimo.
fi: Tämä on openSUSE MicroOS -käyttöjärjestelmä joka käyttää Micro DNF paketinhallintaa. Se sisältää vain minimaalisen monen käyttäjän käynnistysjärjestelmän.
id: Ini adalah sistem runtime openSUSE MicroOS yang menggunakan manajer paket Micro DNF. Ini hanya berisi sistem boot multiuser minimal.
it: Questo è il sistema di esecuzione di openSUSE MicroOS che utilizza il gestore di pacchetti Micro DNF. Contiene solo un sistema di avvio multiutente minimale.
pl: To jest system uruchomieniowy openSUSE MicroOS korzystający z menedżera pakietów Micro DNF. Zawiera tylko minimalny system uruchamiania dla wielu użytkowników.
pt_br: Este é o sistema de runtime openSUSE MicroOS que usa o gerenciador de pacote Micro DNF. Ele contém somente um sistema de inicialização multiusuário mínimo.
ru: Исполняемая система openSUSE MicroOS, использующая пакетный менеджер Micro DNF. Содержит только минимальную многопользовательскую загружаемую систему.
sl: To je izvajalni sistem openSUSE MicroOS, ki za upravljanje paketov uporablja Micro DNF. Vsebuje samo minimalen več-uporabniški sistem.
sv: Detta är körtids systemet openSUSE MicroOS som använder Micro DNF-pakethanteraren. Det innehåller bara ett minimalt uppstartssystem för flera användare.
uk: Це система виконання openSUSE MicroOS з використанням менеджера пакунків Micro DNF. Вона містить лише мінімальну багатокористувацьку завантажувальну систему.

source: openSUSE MicroOS using PackageKit
ca: MicroSO d'openSUSE que usa PackageKit
cs: openSUSE MicroOS používající PackageKit
de: openSUSE MicroOS mit PackageKit
es: openSUSE MicroOS con PackageKit
fi: openSUSE MicroOS PackageKit:iä käyttäen
id: openSUSE MicroOS menggunakan PackageKit
it: openSUSE MicroOS con PackageKit
pl: openSUSE MicroOS przy użyciu PackageKit
pt_br: openSUSE MicroOS com PackageKit
ru: openSUSE MicroOS с использованием PackageKit
sl: openSUSE MicroOS z uporabo PackageKit
sv: openSUSE MicroOS använda PackageKit
uk: openSUSE MicroOS із застосуванням PackageKit

source: This is the openSUSE MicroOS runtime system using the PackageKit service. It contains only a minimal multiuser booting system.
ca: Aquest és el sistema d'entorn d'execució del MicroSO d'openSUSE que usa el servei de PackageKit. Conté només un sistema d'arrencada de multiusuari mínim.
cs: Toto je provozní systém openSUSE MicroOS používající službu PackageKit. Obsahuje pouze minimální víceuživatelský zaváděcí systém.
de: Dies ist das openSUSE MicroOS Laufzeitsystem mit dem PackageKit-Dienst. Es enthält nur ein minimales Multiuser-Bootsystem.
es: Este es el entorno de ejecución de openSUSE MicroOS que usa el servicio PackageKit. Solo contiene un sistema de arranque multiusuario mínimo.
fi: Tämä on openSUSE MicroOS -käyttöjärjestelmä joka käyttää PackageKit-palvelua. Se sisältää vain minimaalisen monen käyttäjän käynnistysjärjestelmän.
id: Ini adalah sistem runtime openSUSE MicroOS yang menggunakan layanan PackageKit. Ini hanya berisi sistem boot multiuser minimal.
it: Questo è il sistema di esecuzione di openSUSE MicroOS che utilizza il servizio PackageKit. Contiene solo un sistema di avvio multiutente minimale.
pl: To jest system uruchomieniowy openSUSE MicroOS korzystający z usługi PackageKit. Zawiera tylko minimalny system uruchamiania dla wielu użytkowników.
pt_br: Este é o sistema de runtime openSUSE MicroOS que usa o serviço PackageKit. Ele contém somente um sistema de inicialização multiusuário mínimo.
ru: Исполняемая система openSUSE MicroOS, использующая службу PackageKit. Содержит только минимальную многопользовательскую загружаемую систему.
sl: To je izvajalni sistem openSUSE MicroOS, ki za upravljanje paketov uporablja storitev PackageKit. Vsebuje samo minimalen več-uporabniški sistem.
sv: Detta är körtids systemet för openSUSE MicroOS som använder PackageKit tjänsten. Det innehåller bara ett minimalt uppstartssystem för flera användare.
uk: Це система виконання openSUSE MicroOS з використанням служби PackageKit. Вона містить лише мінімальну багатокористувацьку завантажувальну систему.

source: openSUSE MicroOS using Zypper
ca: MicroSO d'openSUSE que usa Zypper
cs: openSUSE MicroOS používající Zypper
de: openSUSE MicroOS mit Zypper
es: openSUSE MicroOS con Zypper
fi: openSUSE MicroOS Zypper:iä käyttäen
id: openSUSE MicroOS menggunakan Zypper
it: openSUSE MicroOS con Zypper
pl: openSUSE MicroOS przy użyciu Zypper
pt_br: openSUSE MicroOS com Zypper
ru: openSUSE MicroOS с использованием Zypper
sl: openSUSE MicroOS z uporabo Zypper
sv: openSUSE MicroOS använda Zypper
uk: openSUSE MicroOS із застосуванням Zypper

source: This is the openSUSE MicroOS runtime system using the Zypper package manager. It contains only a minimal multiuser booting system.
ca: Aquest és el sistema d'entorn d'execució del MicroSO d'openSUSE que usa el gestor de paquets Zypper. Conté només un sistema d'arrencada de multiusuari mínim.
cs: Toto je provozní systém openSUSE MicroOS používající správu balíčků Zypper. Obsahuje pouze minimální víceuživatelský zaváděcí systém.
de: Dies ist das openSUSE MicroOS Laufzeitsystem mit dem Zypper-Paketmanager. Es enthält nur ein minimales Multiuser-Bootsystem.
es: Este es el entorno de ejecución de openSUSE MicroOS que usa el gestor de paquetes Zypper. Solo contiene un sistema de arranque multiusuario mínimo.
fi: Tämä on openSUSE MicroOS -käyttöjärjestelmä joka käyttää Zypper pakettihallintaa. Se sisältää vain minimaalisen monen käyttäjän käynnistysjärjestelmän.
id: Ini adalah sistem runtime openSUSE MicroOS yang menggunakan manajer paket Zypper. Ini hanya berisi sistem boot multiuser minimal.
it: Questo è il sistema di esecuzione di openSUSE MicroOS che utilizza il gestore di pacchetti Zypper. Contiene solo un sistema di avvio multiutente minimale.
pl: Jest to system uruchomieniowy openSUSE MicroOS korzystający z menedżera pakietów Zypper. Zawiera tylko minimalny system uruchamiania dla wielu użytkowników.
pt_br: Este é o sistema de runtime openSUSE MicroOS que usa o gerenciador de pacote Zypper. Ele contém somente um sistema de inicialização multiusuário mínimo.
ru: Исполняемая система openSUSE MicroOS, использующая пакетный менеджер Zypper. Содержит только минимальную многопользовательскую загружаемую систему.
sl: To je izvajalni sistem openSUSE MicroOS, ki za upravljanje paketov uporablja Zypper. Vsebuje samo minimalen več-uporabniški sistem.
sv: Detta är körtids systemet openSUSE MicroOS som använder Zypper-pakethanteraren. Det innehåller bara ett minimalt uppstartssystem för flera användare.
uk: Це система виконання openSUSE MicroOS з використанням менеджера пакунків Zypper. Вона містить лише мінімальну багатокористувацьку завантажувальну систему.

source: openSUSE MicroOS Base System (alias pattern for microos_base)
ca: Sistema de base del MicroSO d'openSUSE (patró d'àlies per a microos_base)
cs: Základní systém openSUSE MicroOS (alias předloha pro microos_base)
da: openSUSE MicroOS basissystem (aliasmønster til microos_base)
de: openSUSE MicroOS Basissystem (Alias-Schema für microos_base)
es: Sistema base de openSUSE MicroOS (alias del patrón microos_base)
fi: openSUSE MicroOS kantajärjestelmä (eli microos_base)
id: Sistem Dasar openSUSE MicroOS (pola alias untuk microos_base)
it: Sistema di base openSUSE MicroOS (modello alias per microos_base)
pl: openSUSE MicroOS Base System (wzorzec aliasu dla microos_base)
pt_br: Sistema base do openSUSE MicroOS (padrão base)
ru: Базовая система openSUSE MicroOS (шаблон-псевдоним microos_base)
sl: Osnovni sistem openSUSE MicroOS (drugo ime za microos_base)
sv: openSUSE MicroOS Bas-System (aliasmönster för microos_base)
uk: Базова система openSUSE MicroOS (псевдонім шаблону microos_base)

source: Support for Cloud
ca: Suport per al núvol
cs: Podpora Cloudu
da: Understøttelse af cloud
de: Unterstützung für die Cloud
es: Soporte para la nube
fi: Tuki pilvipalvelulle
id: Dukungan untuk Cloud
it: Supporto per cloud
pl: Wsparcie dla chmury
pt_br: Suporte à nuvem
ru: Поддержка облака
sl: Podpora za oblak
sv: Stöd för Moln
uk: Підтримка хмари

source: Packages required to enable openSUSE MicroOS in the Cloud.
ca: Paquets necessaris per habilitar el MicroSO d'openSUSE al núvol.
cs: Balíčky nezbytné k zapnutí openSUSE MicroOS v Cloudu.
da: Pakker som kræves for at aktivere openSUSE MicroOS i skyen.
de: Pakete, die für die Aktivierung von openSUSE MicroOS in der Cloud erforderlich sind.
es: Paquetes obligatorios para habilitar openSUSE MicroOS en la nube.
fi: Paketit, jotka tarvitaan openSUSE MicroOS käyttöönottamiseen pilvipalvelussa.
id: Paket yang diperlukan untuk mengaktifkan openSUSE MicroOS di Cloud.
it: Pacchetti richiesti per abilitare openSUSE MicroOS in cloud.
pl: Pakiety wymagane do włączenia openSUSE MicroOS w chmurze.
pt_br: Pacotes necessários para habilitar o openSUSE MicroOS na nuvem.
ru: Пакеты, необходимые для включения openSUSE MicroOS в облако.
sl: Paketi, ki so potrebni za omogočanje openSUSE MicroOS v oblaku.
sv: Paket som krävs för att aktivera openSUSE MicroOS i molnet.
uk: Пакунки, необхідні для ввімкнення openSUSE MicroOS у хмарі.

source: Web based remote system managemet
ca: Administració de sistemes remots basats en web
cs: Webová vzdálená správa systémů
de: Webbasierte Remote-Systemverwaltung
es: Gestión de sistemas remotos basada en Web
fi: Verkkopohjainen etähallinta
id: Manajemen sistem jarak jauh berbasis web
it: Gestione remota del sistema basata su Web
pl: Zarządzanie systemem przez interfejs www
pt_br: Gerenciamento de sistema remoto baseado na web
ru: Удалённое управление системой на основе Web
sl: Oddaljeno upravljanje sistema prek spleta
sv: Webbaserad fjärrsystemhantering
uk: Віддалене керування системою на основі WEB

source: Packages required to run the Cockpit system management service. For the web service the cockpit-ws container is required.
ca: Paquets necessaris per executar el servei de gestió del sistema Cockpit. Per al servei web es requereix el contenidor cockpit-ws.
cs: Balíčky potřebné ke spuštění služby správy systému Cockpit. Pro webovou službu je nutný kontejner cockpit-ws.
de: Pakete, die zum Ausführen des Systemverwaltungsdiensts Cockpit erforderlich sind. Für den Webdienst wird der Container cockpit-ws benötigt.
es: Paquetes necesarios para ejecutar el servicio de gestión del sistema Cockpit. Para el servicio Web, se necesita el contenedor cockpit-ws.
id: Paket yang diperlukan untuk menjalankan layanan manajemen sistem Cockpit. Untuk layanan web, diperlukan kontainer cockpit-ws.
it: Pacchetti richiesti per eseguire il servizio di gestione del sistema Cockpit. Per il servizio Web è richiesto il container cockpit-ws.
pl: Pakiety wymagane do uruchomienia usługi zarządzania systemem Cockpit. Dla usługi internetowej wymagany jest kontener kokpit-ws.
pt_br: Pacotes necessários para executar o serviço de gerenciamento do sistema Cockpit. Para o serviço web, é necessário o contêiner cockpit-ws.
ru: Пакеты, необходимые для запуска службы управления системой Cockpit. Для веб-сервиса требуется контейнер cockpit-ws.
sl: Paketi, ki so potrebni za poganjanje storitve Cockpit za upravljanje sistema. Za spletno storitev je zahtevan vsebnik cockpit-ws.
sv: Paket som krävs för att köra Cockpit-systemhanteringstjänsten. För webbtjänsten krävs cockpit-ws behållare.
uk: Пакунки, необхідні для запуску служби керування системою Cockpit. Для WEB-служби потрібен контейнер cockpit-ws.

source: openSUSE MicroOS defaults
ca: Valors per defecte del MicroSO d'openSUSE
cs: Výchozí předlohy openSUSE MicroOS
da: openSUSE MicroOS standard
de: openSUSE MicroOS Standards
es: Configuración por defecto de openSUSE MicroOS
fi: openSUSE MicroOS oletukset
id: openSUSE MicroOS bawaan
it: Default openSUSE MicroOS
pl: Domyślne ustawienia openSUSE MicroOS
pt_br: Padrões do openSUSE MicroOS
ru: openSUSE MicroOS по умолчанию
sl: Privzeto za openSUSE MicroOS
sv: openSUSE MicroOS standard
uk: Типові шаблони openSUSE MicroOS

source: This provides default packages for openSUSE MicroOS which can be optionally replaced by alternatives.
ca: Això proporciona els paquets per defecte per al MicroSO d'openSUSE que poden reemplaçar-se opcionalment per alternatives.
cs: Poskytuje výchozí balíčky pro openSUSE MicroOS, které lze nahradit alternativami.
da: Dette leverer standardpakkerne til openSUSE MicroOS, som valgfrit kan erstattes med alternativer.
de: Das bietet Standard-Pakete für openSUSE MicroOS, was optional durch Alternativen ersetzt werden kann.
es: Proporciona los paquetes por defecto para openSUSE MicroOS que opcionalmente pueden sustituirse por alternativas.
fi: Tämä tarjoaa openSUSE MicroOS oletuspaketteja, jotka voidaan vaihtoehtoisesti korvata vaihtoehdoilla.
id: Ini menyediakan paket bawaan untuk openSUSE MicroOS yang dapat diganti secara opsional oleh alternatif.
it: Fornisce i pacchetti di default per openSUSE MicroOS, facoltativamente sostituibili con pacchetti alternativi.
pl: Zapewnia to domyślne pakiety dla openSUSE MicroOS, które można opcjonalnie zastąpić alternatywami.
pt_br: Isto fornece pacotes padrão para o openSUSE MicroOS que podem ser opcionalmente substituídos por alternativas.
ru: Пакеты по умолчанию для openSUSE MicroOS, которые могут быть заменены альтернативными.
sl: To ponuja privzete pakete za openSUSE MicroOS, ki jih je mogoče nadomestiti z alternativami.
sv: Detta tillhandahåller standardpaket för openSUSE MicroOS som valfritt kan ersättas med alternativ.
uk: Забезпечує типові пакунки для openSUSE MicroOS, які можна замінити альтернативними.

source: Common packages for Desktops on MicroOS
ca: Paquets comuns per a escriptoris a MicroSO
cs: Základní balíčky prostředí pracovní plochy MicroOS
de: Gängige Pakete für Desktops mit MicroOS
es: Paquetes comunes para escritorios en MicroOS
id: Paket umum untuk Destop di MicroOS
it: Pacchetti comuni per ambienti desktop su MicroOS
pl: Podstawowe oprogramowanie dla pulpitów na MicroOS
pt_br: Pacotes comuns para desktops no MicroOS
ru: Общие пакеты для рабочих столов на MicroOS
sl: Skupni paketi za namizja na MicroOS
sv: Vanliga paket för stationära datorer på MicroOS
uk: Спільні пакунки для стільниць на MicroOS

source: Packages required for openSUSE MicroOS Desktops.
ca: Paquets necessaris per a escriptoris de MicroSO d'openSUSE.
cs: Balíčky nezbytné pro pracovní plochy v openSUSE MicroOS.
de: Pakete, die für openSUSE MicroOS-Desktops erforderlich sind.
es: Paquetes necesarios para escritorios openSUSE MicroOS.
id: Paket yang diperlukan untuk openSUSE MicroOS Destop.
it: Pacchetti richiesti per i desktop di openSUSE MicroOS.
pl: Pakiety wymagane dla komputerów stacjonarnych openSUSE MicroOS.
pt_br: Pacotes necessários para desktop openSUSE MicroOS.
ru: Пакеты, необходимые для рабочих столов openSUSE MicroOS.
sl: Paketi, ki so potrebni za namizna okolja na openSUSE MicroOS.
sv: Paket som krävs för openSUSE MicroOS på stationära datorer.
uk: Пакунки, необхідні для стільниць openSUSE MicroOS.

source: MicroOS GNOME Desktop
ca: MicroSO amb escriptori GNOME
cs: Pracovní plocha GNOME v MicroOS
es: Escritorio GNOME para MicroOS
fi: MicroOS GNOME-työpöytä
id: Destop GNOME MicroOS
it: Desktop GNOME MicroOS
pl: Środowisko MicroOS GNOME
pt_br: Área de trabalho GNOME MicroOS
ru: Рабочий стол GNOME для MicroOS
sl: Namizje GNOME za MicroOS
sv: MicroOS GNOME-skrivbordsmiljö
uk: Стільниця GNOME для MicroOS

source: Packages required for the openSUSE MicroOS Desktop with GNOME.
ca: Paquets necessaris per al MicroSO d'openSUSE amb escriptori GNOME.
cs: Balíčky nezbytné pro pracovní plochu openSUSE MicroOS s GNOME.
de: Pakete, die für openSUSE MicroOS-Desktops mit GNOME erforderlich sind.
es: Paquetes necesarios para openSUSE MicroOS con el escritorio GNOME.
id: Paket yang diperlukan untuk openSUSE MicroOS Desktop dengan GNOME.
it: Pacchetti richiesti per il desktop openSUSE MicroOS con GNOME.
pl: Pakiety wymagane dla pulpitu openSUSE MicroOS z GNOME.
pt_br: Pacotes necessários para openSUSE MicroOS com GNOME.
ru: Пакеты, необходимые для рабочего стола openSUSE MicroOS с GNOME.
sl: Paketi, ki so potrebni za openSUSE MicroOS z namiznim okoljem GNOME.
sv: Paket som krävs för openSUSE MicroOS Desktop med GNOME.
uk: Пакунки, необхідні для стільниці openSUSE MicroOS із GNOME.

source: MicroOS KDE Plasma Desktop
ca: MicroSO amb escriptori KDE Plasma
cs: Plocha MicroOS KDE Plasma
es: Escritorio KDE Plasma para MicroOS
fi: MicroOS KDE Plasma-työpöytä
id: Destop KDE Plasma 5 MicroOS
it: Desktop KDE Plasma di MicroOS
pl: Środowisko MicroOS KDE Plasma
pt_br: Área de trabalho KDE Plasma MicroOS
ru: Рабочий стол KDE Plasma для MicroOS
sl: MicroOS z namizjem KDE Plasma
sv: MicroOS KDE Plasma-skrivbord
uk: Стільниця KDE Plasma для MicroOS

source: Packages required for the openSUSE MicroOS with KDE Plasma
ca: Paquets necessaris per al MicroSO d'openSUSE amb escriptori KDE Plasma
cs: Balíčky nezbytné pro openSUSE MicroOS s KDE Plasma
de: Pakete, die für die Aktivierung von openSUSE MicroOS mit KDE Plasma erforderlich sind
es: Paquetes necesarios para openSUSE MicroOS con el escritorio KDE Plasma
fi: Paketit, jotka vaaditaan openSUSE MicroOS KDE Plasmaan
id: Paket yang diperlukan untuk openSUSE MicroOS Desktop dengan KDE Plasma
it: Pacchetti richiesti per openSUSE MicroOS con KDE Plasma
pl: Pakiety wymagane dla openSUSE MicroOS z KDE Plasma
pt_br: Pacotes necessários para o openSUSE MicroOS com KDE Plasma
ru: Пакеты, необходимые для рабочего стола openSUSE MicroOS с KDE Plasma
sl: Paketi, ki so potrebni za openSUSE MicroOS z namiznim okoljem KDE Plasma
sv: Paket som krävs för openSUSE MicroOS med KDE Plasma
uk: Пакунки, необхідні для openSUSE MicroOS з KDE Plasma

source: Hardware Support
ca: Suport de maquinari
cs: Podpora hardwaru
de: Hardwareunterstützung
es: Soporte de hardware
fi: Laitteiston tuki
id: Dukungan Perangkat Keras
it: Supporto hardware
pl: Wsparcie sprzętowe
pt_br: Suporte de hardware
ru: Поддержка оборудования
sl: Podpora za strojno opremo
sv: Hårdvaru stöd
uk: Підтримка обладнання

source: Packages required to install openSUSE MicroOS on real hardware.
ca: Paquets necessaris per instal·lar el MicroSO d'openSUSE en maquinari real.
cs: Balíčky potřebné k instalaci openSUSE MicroOS na fyzickém (ne virtuálním) hardwaru.
da: Pakker som kræves for at installere openSUSE MicroOS på rigtig hardware.
de: Pakete, die für die Installation von openSUSE MicroOS auf echter Hardware erforderlich sind.
es: Paquetes obligatorios para instalar openSUSE MicroOS en hardware real.
fi: OpenSUSE MicroOS asentaminen todelliseen laitteistoon edellyttää paketteja.
id: Paket yang diperlukan untuk memasang openSUSE MicroOS pada perangkat keras nyata.
it: Pacchetti richiesti per installare openSUSE MicroOS su hardware reale.
pl: Pakiety wymagane do zainstalowania openSUSE MicroOS na prawdziwym sprzęcie.
pt_br: Pacotes necessários para instalar o openSUSE MicroOS em hardware real.
ru: Пакеты, необходимые для установки openSUSE MicroOS на реальном оборудовании.
sl: Paketi, ki so potrebni za namestiti openSUSE MicroOS na pravi strojni opremi.
sv: Paket som krävs för att installera openSUSE MicroOS på riktig hårdvara.
uk: Пакунки, необхідні для встановлення openSUSE MicroOS на справжньому обладнанні.

source: IMA/EVM Support
ca: Suport per a IMA / EVM
cs: Podpora IMA/EVM
de: IMA/EVM-Unterstützung
es: Soporte de IMA/EVM
fi: IMA/EVM tuki
id: Dukungan IMA/EVM
it: Supporto IMA/EVM
pl: Obsługa IMA/EVM
pt_br: Suporte IMA/EVM
ru: Поддержка IMA/EVM
sl: Podpora za IMA/EVM
sv: IMA/EVM Stöd
uk: Підтримка IMA/EVM

source: Packages required to enable IMA/EVM on openSUSE MicroOS.
ca: Paquets necessaris per habilitar IMA / EVM al MicroSO d'openSUSE.
cs: Balíčky nezbytné k funkci IMA/EVM na openSUSE MicroOS.
da: Pakker som kræves for at aktivere IMA/EVM på openSUSE MicroOS.
de: Pakete, die für die Aktivierung von IMA/EVM unter openSUSE MicroOS erforderlich sind.
es: Paquetes obligatorios para habilitar IMA/EVM en openSUSE MicroOS.
fi: Paketit tarvitaan, IMA/EVM:n aktivoimiseksi openSUSE MicroOS järjestelmään.
id: Paket yang diperlukan untuk mengaktifkan IMA/EVM pada openSUSE MicroOS.
it: Pacchetti richiesti per abilitare IMA/EVM su openSUSE MicroOS.
pl: Pakiety wymagane do włączenia IMA/EVM w openSUSE MicroOS.
pt_br: Pacotes necessários para habilitar o IMA/EVM no openSUSE MicroOS.
ru: Пакеты, необходимые для включения IMA/EVM на openSUSE MicroOS.
sl: Paketi, ki so potrebni za omogočiti IMA/EVM na openSUSE MicroOS.
sv: Paket som krävs för att aktivera IMA/EVM på openSUSE MicroOS.
uk: Пакунки, необхідні для ввімкнення IMA/EVM на openSUSE MicroOS.
