Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: This pattern installs all Amazon Web Services command line interface tools, instance initialization packages and tools to communicate with the cloud framework from within a running instance. It is not recommended to install this pattern, but instead install one of the use-case specific patterns (e.g. Amazon Web Services - Tools).
ar: يعمل هذا النمط على تثبيت جميع أدوات واجهة سطر الأوامر لخدمات Amazon على الويب وحزم تهيئة المثيل وأدوات للاتصال بإطار عمل السحابة التي يعمل عليها المثيل. لا يوصى بتثبيت هذا النمط، ويوصى بدلاً من ذلك بتثبيت أنماط خاصة لكل حالة (على سبيل المثال، خدمات Amazon على الويب - أدوات).
ca: Aquest patró instal·la totes les eines d’interfície de línia d’ordres d’Amazon Web Services, paquets d’inicialització d’instàncies i eines per comunicar-se amb el marc de treball en núvol des d’una instància en execució. No es recomana instal·lar aquest patró, sinó que instal·leu un dels patrons específics del cas d’ús (per exemple, Serveis web d'Amazon - Eines).
cs: Tento vzor nainstaluje z Amazon Web Services všechny nástroje rozhraní příkazového řádku, všechny balíčky pro incializaci instancí a všechny nástroje pro komunikaci s cloudovou architekturou z běžící instance. Nedoporučujeme instalovat přímo tento vzor, nýbrž jeden ze vzorů pro konkrétní požadovaný případ použití (např. Amazon Web Services – nástroje).
da: Mønsteret installerer alle kommandolinjegrænseflade-værktøjer for Amazon Web Services, instans-initieringspakker og værktøjer til at kommunikere med sky-frameworket indefra en kørende instans. Det anbefales ikke at installere mønsteret, men i stedet installere en af de specifikke mønstre til bestemte formål (f.eks. Amazon Web Services - Værktøjer).
de: Dieses Schema installiert alle Amazon Web Services-Kommandozeilentools, Pakete zur Instanzinitialisierung und Tools zur Kommunikation mit dem Cloud-Framework innerhalb einer ausgeführten Instanz. Es wird empfohlen, statt dieses Schemas eines der Schemata für spezifische Anwendungsfälle (z. B. Amazon Web Services – Tools) zu installieren.
es: Este patrón instala todas las herramientas de interfaz de línea de comandos de Amazon Web Services, los paquetes de inicialización de la instancia y las herramientas para comunicarse con la estructura de nube en una instancia en ejecución. No se recomienda instalar este patrón, pero sí uno de los patrones específicos de caso de uso (por ejemplo, Amazon Web Services - Herramientas).
id: Pola ini memasang semua perkakas antarmuka baris perintah Amazon Web Services, paket inisialisasi instance, dan perkakas untuk berkomunikasi dengan kerangka kerja cloud dari dalam instance yang sedang berjalan. Tidak disarankan untuk memasang pola ini, tetapi sebaliknya memasang salah satu pola spesifik kasus penggunaan (mis. Amazon Web Services - Tools).
it: Questo modello consente di installare tutti gli strumenti dell'interfaccia della riga di comando di Amazon Web Services, i pacchetti di inizializzazione delle istanze e gli strumenti per comunicare con l'infrastruttura cloud in un'istanza in esecuzione. Si sconsiglia di installare questo modello, optare invece per l'installazione di uno dei modelli specifici per i casi di utilizzo (ad esempio Amazon Web Services - Strumenti).
pl: Ten wzorzec służy do instalowania wszystkich narzędzi interfejsu wiersza poleceń usług Amazon Web Services, pakietów inicjalizacji instancji, a także narzędzi służących do komunikacji ze środowiskiem chmury z poziomu uruchomionej instancji. Instalowanie tego pakietu nie jest zalecane. Zamiast tego zaleca się instalację jednego ze wzorców specyficznych dla konkretnego przypadku użycia (np. Amazon Web Services - narzędzia).
pt_br: Este padrão instala todas as ferramentas de interface de linha de comando do Amazon Web Services, pacotes de inicialização de instância e ferramentas para se comunicar com a estrutura de nuvem de dentro de uma instância em execução. Não é recomendado instalar este padrão, mas sim instalar um dos padrões específicos de caso de uso (por exemplo, Amazon Web Services - Ferramentas).
ru: Этот шаблон устанавливает все инструменты интерфейса командной строки веб-служб Amazon Web Services, пакеты инициалиации экземпляров и инструменты для обмена данными с облачной средой в запущенном экземпляре. Вместо установки этого шаблона рекомендуется установить шаблон, соответствующий конкретной области применения (например, «Веб-службы Amazon Web Services — инструменты».
sl: Ta vzorec namesti vsa orodja Amazon Web Services za ukazno vrstico, pakete za pripravljanje primerkov in orodja za komunikacijo z oblačnim ogrodjem iz zagnanega primerka. Tega vzorca ni priporočljivo namestiti. Raje namestite enega od vzorcev za specifičen primer uporabe (npr. Amazon Web Services – Orodja).
sv: Detta mönster installerar alla kommanodradsverktyg för Amazon-webbtjänster, paket för instansinitiering och verktyg för att kommunicera med molnramverket från en instans som körs. Det är inte rekommenderat att installera detta mönster. Installera istället ett av de användarfallspecifika mönstren (t.ex. Amazon-webbtjänster - Verktyg).
uk: Цей шаблон встановлює всі інструменти інтерфейсу командного рядка Amazon Web Services, пакунки ініціалізації примірників та інструменти для зв’язку із хмарним фреймворком всередині запущеного примірника. Не рекомендовано встановлювати цей шаблон, натомість встановіть один із конкретних шаблонів використання (наприклад, Amazon Web Services – Інструменти).

source: Amazon Web Services - Instance Initialization
ar: خدمات Amazon على الويب - تهيئة المثيل
ca: Serveis web d'Amazon - Inicialització d'instància
cs: Amazon Web Services – inicializace instancí
da: Amazon Web Services - Instansinitialisering
de: Amazon Web Services – Instanzinitialisierung
es: Amazon Web Services - Inicialización de la instancia
id: Amazon Web Services - Inisialisasi Instance
it: Amazon Web Services - Inizializzazione delle istanze
pl: Amazon Web Services - inicjalizacja instancji
pt_br: Amazon Web Services - Inicialização de Instância
ru: Amazon Web Services — Инициализация экземпляра
sl: Amazon Web Services – pripravljanje primerkov
sv: Amazon-webbtjänster - Instansinitiering
uk: Amazon Web Services - Ініціалізація примірника

source: This pattern installs the Amazon Web Services instance initialization packages which support the provisioning and running of instances in the cloud framework (e.g. cloud-init).
ar: يعمل هذا النمط على تثبيت حزم تهية المثيل لخدمات Amazon على الويب والتي تدعم توفر المثيلات وتشغيلها في إطار عمل السحابة (على سبيل المثال cloud-init).
ca: Aquest patró instal·la els paquets d’inicialització d’instàncies d’Amazon Web Services que admeten el subministrament i l’execució d’instàncies al marc del núvol (per exemple, cloud-init).
cs: Tento vzor nainstaluje všechny balíčky pro inicializaci instancí Amazon Web Services, které podporují zřizování a spouštění instancí v cloudové architektuře (např. cloud-init).
da: Mønsteret installerer initieringspakker for Amazon Web Services-instansen som understøtter klargøring og kørslen af instanser i sky-frameworket (f.eks. cloud-init).
de: Dieses Schema installiert die Pakete zur Amazon Web Services-Instanzinitialisierung, die die Bereitstellung und Ausführung von Instanzen im Cloud-Framework unterstützen (z. B. cloud-init).
es: Este patrón instala los paquetes de inicialización de la instancia de Amazon Web Services con compatibilidad para el aprovisionamiento y la ejecución de instancias en la estructura de nube (por ejemplo cloud-init).
id: Pola ini memasang paket inisialisasi instance Amazon Web Services yang mendukung penyediaan dan menjalankan instance dalam kerangka kerja cloud (mis. cloud-init).
it: Questo modello consente di installare i pacchetti di inizializzazione delle istanze di Amazon Web Services che supportano il provisioning e l'esecuzione delle istanze nell'infrastruttura cloud (ad esempio cloud-init).
pl: Ten wzorzec służy do instalowania pakietów inicjalizacji instancji Amazon Web Services, które obsługują zaopatrywanie i uruchamianie instancji w środowisku chmury (np. cloud-init).
pt_br: Este padrão instala os pacotes de inicialização de instância do Amazon Web Services que oferecem suporte ao provisionamento e à execução de instâncias na estrutura da nuvem (por exemplo, cloud-init).
ru: Этот шаблон устанавливает пакеты инициализации экземпляров Amazon Web Services, которые поддерживают подготовку и запуск экземпляров в облачной среде (например, cloud-init).
sl: Ta vzorec namesti pakete za pripravljanje primerkov Amazon Web Services, ki podpirajo oskrbovanje in poganjanje primerkov v ogrodju oblaka (npr. cloud-init).
sv: Detta mönster installerar paket för instansinitiering för Amazon-webbtjänster som stöder tilldelning och körning av instanser i molnramverket (t.ex. cloud-init).
uk: Цей шаблон встановлює пакунки ініціалізації примірника Amazon Web Services, які підтримують надання та запуск примірника у хмарному фреймворку (наприклад, cloud-init).

source: Amazon Web Services - Instance Tools
ar: خدمات Amazon على الويب - أدوات المثيل
ca: Serveis web d'Amazon - Eines d'instància
cs: Amazon Web Services – nástroje instancí
da: Amazon Web Services - Instansværktøjer
de: Amazon Web Services – Instanztools
es: Amazon Web Services - Herramientas de instancia
id: Amazon Web Services - Perkakas Instance
it: Amazon Web Services - Strumenti per istanze
pl: Amazon Web Services - narzędzia do obsługi instancji
pt_br: Amazon Web Services - Ferramentas de Instância
ru: Amazon Web Services — Инструменты для работы с экземплярами
sl: Amazon Web Services – orodja za primerke
sv: Amazon-webbtjänster - Instansverktyg
uk: Amazon Web Services - Інструменти примірника

source: This pattern install the Amazon Web Services instance specific tools which are used to collect instance metadata (e.g. python-ec2metadata).
ar: يعمل هذا النمط على تثبيت الأدوات الخاصة بالمثيل لخدمات Amazon على الويب والتي يتم استخدامها لجمع بيانات تعريف المثيل (على سبيل المثال، python-ec2metadata).
ca: Aquest patró instal·la les eines específiques de la instància d’Amazon Web Services que s’utilitzen per recopilar metadades d’una instància (per exemple, python-ec2metadata).
cs: Tento vzor nainstaluje nástroje specifické pro instanci Amazon Web Services, které se používají ke sběru metadat instance (např. python-ec2metadata).
da: Mønsteret installerer specifikke værktøjer til Amazon Web Services-instansen som bruges til at indsamle instans-metadata (f.eks. python-ec2metadata).
de: Dieses Schema installiert die instanzspezifischen Amazon Web Services-Tools, die zur Erfassung von Instanzmetadaten dienen (z. B. python-ec2metadata).
es: Este patrón instala las herramientas específicas de la instancia de Amazon Web Services que se usan para recopilar metadatos de instancia (por ejemplo, python-ec2metadata).
id: Pola ini memasang perkakas khusus instance Amazon Web Services yang digunakan untuk mengumpulkan metadata instance (mis. python-ec2metadata).
it: Questo modello consente di installare gli strumenti specifici per le istanze di Amazon Web Services che vengono utilizzati per raccogliere metadati delle istanze (ad esempio python-ec2metadata).
pl: Ten wzorzec służy do instalowania specyficznych dla instancji Amazon Web Services narzędzi, które są używane do gromadzenia metadanych instancji (np. python-ec2metadata).
pt_br: Este padrão instala as ferramentas específicas de instância da Amazon Web Services, que são usadas para coletar metadados de instância (ex. python-ec2metadata).
ru: Этот шаблон устанавливает инструменты для работы с экземплярами Amazon Web Services, используемые для сбора метаданных экземпляров (например, python-ec2metadata).
sl: Ta vzorec namesti orodja specifična za primerke Amazon Web Services, ki se uporabljajo za zbiranje metapodatkov primerkov (npr. python-ec2metadata).
sv: Detta mönster installerar instansspecifika verktyg för Amazon-webbtjänster som används för att samla in instansmetadata (t.ex. python-ec2metadata).
uk: Цей шаблон встановлює спеціальні інструменти Amazon Web Services, які використовуються для збору метаданих примірника (наприклад, python-ec2metadata).

source: Amazon Web Services - Tools
ar: خدمات Amazon على الويب - الأدوات
ca: Serveis web d'Amazon - Eines
cs: Amazon Web Services – nástroje
da: Amazon Web Services - Værktøjer
es: Amazon Web Services - Herramientas
fi: Amazon Web Services - Työkalut
id: Amazon Web Services - Perkakas
it: Amazon Web Services - Strumenti
pl: Amazon Web Services - narzędzia
pt_br: Amazon Web Services - Ferramentas
ru: Amazon Web Services — Инструменты
sl: Amazon Web Services – orodja
sv: Amazon-webbtjänster - Verktyg
uk: Amazon Web Services - Інструменти

source: This pattern installs the Amazon Web Services command line interface tools to communicate with the cloud framework (e.g. aws-cli).
ar: يعمل هذا النمط على تثبيت أدوات واجهة سطر أوامر خدمات Amazon على الويب للاتصال بإطار عمل السحابة (على سبيل المثال، aws-cli).
ca: Aquest patró instal·la les eines d’interfície de la línia d’ordres d’Amazon Web Services per comunicar-se amb el marc del núvol (per exemple, aws-cli).
cs: Tento vzor nainstaluje nástroje rozhraní příkazového řádku Amazon Web Services na komunikaci s cloudovou architekturou (např. aws-cli).
da: Mønsteret installerer kommandolinjegrænsflade-værktøjer for Amazon Web Services til at kommunikere med sky-frameworket (f.eks. aws-cli).
de: Dieses Schema installiert Amazon Web Services-Kommandozeilentools zur Kommunikation mit dem Cloud-Framework (z. B. aws-cli).
es: Este patrón instala las herramientas de interfaz de línea de comandos de Amazon Web Services para comunicarse con la estructura de nube (por ejemplo, aws-cli).
id: Pola ini memasang perkakas antarmuka baris perintah Amazon Web Services untuk berkomunikasi dengan kerangka kerja cloud (mis. aws-cli).
it: Questo modello consente di installare gli strumenti dell'interfaccia della riga di comando di Amazon Web Services per comunicare con l'infrastruttura cloud (ad esempio aws-cli).
pl: Ten wzorzec służy do instalowania narzędzi interfejsu wiersza poleceń Amazon Web Services używanych do komunikacji ze środowiskiem chmury (np. aws-cli).
pt_br: Este padrão instala as ferramentas de interface de linha de comando da Amazon Web Services para comunicação com a estrutura de nuvem (ex. aws-cli).
ru: Этот шаблон устанавливает инструменты интерфейса командной строки Amazon Web Services для обмена данными с облачной платформой (например, aws-cli).
sl: Ta vzorec namesti orodja Amazon Web Services za ukazno vrstico, ki omogočajo komunikacijo z oblačnim ogrodjem (npr. aws-cli).
sv: Detta mönster installerar kommandoradsverktyg för Amazon-webbtjänster för att kommunicera med molnramverket (t.ex. aws-cli).
uk: Цей шаблон встановлює інструменти інтерфейсу командного рядка Amazon Web Services для зв’язку з хмарним фреймворком (наприклад, aws-cli).

source: Google Cloud Platform - All
ar: Google Cloud Platform - الكل
ca: Plataforma de Google Cloud - Tot
cs: Google Cloud Platform – vše
da: Google-skyplatform - Alle
de: Google Cloud-Plattform – Alle
es: Google Cloud Platform - Todo
fi: Google Cloud Platform - Kaikki
id: Google Cloud Platform - Semua
it: Google Cloud Platform - Tutti
pl: Google Cloud Platform - wszystkie
pt_br: Google Cloud Platform - Tudo
ru: Google Cloud Platform — все
sl: Google Cloud Platform – vse
sv: Google Cloud Platform - Alla
uk: Google Cloud Platform - Всі

source: This pattern installs all Google Cloud Platform command line interface tools, instance initialization packages and tools to communicate with the cloud framework from within a running instance. It is not recommended to install this pattern, but instead install one of the use-case specific patterns (e.g. Google Cloud Platform - Tools).
ar: يعمل هذا النمط على تثبيت أدوات واجهة سطر أوامر Google Cloud Platform وحزم تهيئة المثيل وأدوات للاتصال بإطار عمل السحابة من خلال مثيل قيد التشغيل. لا يوصى بتثبيت هذا النمط، ويوصى بدلاً من ذلك بتثبيت أحد أنماط الاستخدام حسب الحالة (على سبيل المثال، Google Cloud Platform - الأدوات).
ca: Aquest patró instal·la totes les eines d’interfície de línia d’ordres de Google Cloud Platform, paquets d’inicialització d’instàncies i eines per comunicar-se amb el marc del núvol des d’una instància en execució. No es recomana instal·lar aquest patró, sinó que instal·leu un dels patrons específics del cas d’ús (per exemple, Google Cloud Platform - Eines).
cs: Tento vzor nainstaluje z Google Cloud Platform všechny nástroje rozhraní příkazového řádku, všechny balíčky pro incializaci instancí a všechny nástroje pro komunikaci s cloudovou architekturou z běžící instance. Nedoporučujeme instalovat přímo tento vzor, nýbrž jeden ze vzorů pro konkrétní požadovaný případ použití (např. Google Cloud Platform – nástroje).
da: Mønsteret installerer alle kommandolinjegrænseflade-værktøjer for Google Cloud Platform, instans-initieringspakker og værktøjer til at kommunikere med sky-frameworket indefra en kørende instans. Det anbefales ikke at installere mønsteret, men i stedet installere en af de specifikke mønstre til bestemte formål (f.eks. Google Cloud Platform - Værktøjer).
de: Dieses Schema installiert alle Kommandozeilentools für die Google Cloud-Plattform, Pakete zur Instanzinitialisierung und Tools zur Kommunikation mit dem Cloud-Framework innerhalb einer ausgeführten Instanz. Es wird empfohlen, statt dieses Schemas eines der Schemata für spezifische Anwendungsfälle (z. B. Google Cloud-Plattform – Tools) zu installieren.
es: Este patrón instala todas las herramientas de interfaz de línea de comandos de Google Cloud Platform, los paquetes de inicialización de la instancia y las herramientas para comunicarse con la estructura de nube en una instancia en ejecución. No se recomienda instalar este patrón, pero sí uno de los patrones específicos de caso de uso (por ejemplo, Google Cloud Platform - Herramientas).
id: Pola ini memasang semua perkakas antarmuka baris perintah Google Cloud Platform, paket inisialisasi instance, dan perkakas untuk berkomunikasi dengan kerangka kerja cloud dari dalam instance yang sedang berjalan. Tidak disarankan untuk memasang pola ini, tetapi sebaliknya memasang salah satu pola spesifik kasus penggunaan (mis. Google Cloud Platform - Tools).
it: Questo modello consente di installare tutti gli strumenti dell'interfaccia della riga di comando di Google Cloud Platform, i pacchetti di inizializzazione delle istanze e gli strumenti per comunicare con l'infrastruttura cloud in un'istanza in esecuzione. Si sconsiglia di installare questo modello, optare invece per l'installazione di uno dei modelli specifici per i casi di utilizzo (ad esempio Google Cloud Platform - Strumenti).
pl: Ten wzorzec służy do instalowania wszystkich narzędzi interfejsu wiersza poleceń usług Google Cloud Platform, pakietów inicjalizacji instancji, a także narzędzi służących do komunikacji ze środowiskiem chmury z poziomu uruchomionej instancji. Instalowanie tego pakietu nie jest zalecane. Zamiast tego zaleca się instalację jednego ze wzorców specyficznych dla konkretnego przypadku użycia (np. Google Cloud Platform - narzędzia).
pt_br: Este padrão instala todas as ferramentas de interface de linha de comando do Google Cloud Platform, os pacotes de inicialização de instância e as ferramentas para comunicação com a estrutura de nuvem de uma instância em execução. Não é recomendado instalar esse padrão. Em vez dele, instale um dos padrões específicos do caso de uso (ex. Google Cloud Platform - Ferramentas).
ru: Этот шаблон устанавливает все инструменты интерфейса командной строки облачной платформы Google, пакеты инициалиации экземпляров и инструменты для обмена данными с облачной средой в запущенном экземпляре. Вместо установки этого шаблона рекомендуется установить шаблон, соответствующий конкретной области применения (например, «Облачная платформа Google — инструменты».
sl: Ta vzorec namesti vsa orodja Google Cloud Platform za ukazno vrstico, pakete za pripravljanje primerkov in orodja za komunikacijo z oblačnim ogrodjem iz zagnanega primerka. Tega vzorca ni priporočljivo namestiti. Raje namestite enega od vzorcev za specifičen primer uporabe (npr. Google Cloud Platform – orodja).
sv: Detta mönster installerar alla kommandoradsverktyg för Google Cloud Platform, paket för instansinitiering och verktyg för att kommunicera med molnramverket från en instans som körs. Det rekommenderas inte att installera detta mönster. Installera istället ett av de användarfallspecifika mönstren (t.ex. Google Cloud Platform - Verktyg).
uk: Цей шаблон встановлює всі інструменти інтерфейсу командного рядка Google Cloud Platform, пакунки ініціалізації примірників та інструменти для зв’язку із хмарним фреймворком всередині запущеного примірника. Не рекомендовано встановлювати цей шаблон, натомість встановіть один із конкретних шаблонів використання (наприклад, Google Cloud Platform - Інструменти).

source: Google Cloud Platform - Instance Initialization
ar: Google Cloud Platform - تهيئة المثيل
ca: Plataforma de Google Cloud - Inicialització de la instància
cs: Google Cloud Platform – inicializace instancí
da: Google-skyplatform - Instansinitialisering
de: Google Cloud-Plattform – Instanzinitialisierung
es: Google Cloud Platform - Inicialización de la instancia
id: Google Cloud Platform - Inisialisasi Instance
it: Google Cloud Platform - Inizializzazione delle istanze
pl: Google Cloud Platform - inicjalizacja instancji
pt_br: Google Cloud Platform - Inicialização de Instância
ru: Google Cloud Platform — инициализация экземпляров
sl: Google Cloud Platform – pripravljanje primerkov
sv: Google Cloud Platform - Instansinitiering
uk: Google Cloud Platform - Ініціалізація примірника
