Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: The 32bit pattern complementing devel_basis.
ar: نمط 32 بت المكمل ل devel_basis.
ca: El patró de 32 bits que completa devel_basis.
cs: 32bitová šablona doplňující devel_basis.
da: 32-bit-mønsteret som komplimenterer devel_basis.
de: Das 32-Bit-Schema zur Ergänzung von devel_basis.
es: El patrón de 32 bits que complementa a devel_basis.
fi: devel_basis-kuviota täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi devel_basis.
it: Modello a 32 bit complementare a devel_basis.
pl: 32-bitowy wzorzec uzupełniający podstawowe narzędzia programistyczne.
pt_br: O padrão de 32 bits que complementa a base de desenvolvimento.
ru: 32-разрядный шаблон, который дополняет devel_basis.
sl: 32-bitni vzorec, ki dopolnjuje devel_basis.
sv: 32-bitarsmönstret som kompletterar devel_basis.
uk: 32-бітовий шаблон, який доповнює devel_basis.

source: Linux Kernel Development
ar: تطوير Linux Kernel
ca: Desenvolupament del nucli de Linux
cs: Vývoj linuxového jádra
da: Linux-kerne-udvikling
de: Linux-Kernel-Entwicklung
es: Desarrollo del kernel Linux
fi: Linux-ytimen kehitys
id: Pengembangan Kernel Linux
it: Sviluppo del kernel Linux
pl: Programowanie jądra systemu Linux
pt_br: Desenvolvimento do kernel Linux
ru: Разработка ядра Linux
sl: Razvoj jedra Linux
sv: Linux-kärnutveckling
uk: Розробка ядра Linux

source: Tools for Linux kernel development.
ar: أدوات تطوير Linux kernel.
ca: Eines per al desenvolupament del nucli de Linux.
cs: Nástroje pro vývoj linuxového jádra.
da: Værktøjer til udvikling af Linux-kerne.
de: Werkzeuge für die Entwicklung und Übersetzung des Linux-Kernels.
es: Herramientas para el desarrollo del kernel Linux.
fi: Linux-ytimen kehitystyökalut.
id: Perkakas untuk pengembangan kernel Linux.
it: Strumenti per lo sviluppo del kernel di Linux.
pl: Narzędzia do programowania jądra systemu Linux.
pt_br: Ferramentas para desenvolvimento do kernel Linux.
ru: Инструменты для разработки ядра Linux.
sl: Orodja za razvoj jedra Linux.
sv: Verktyg för Linux-kärnutveckling.
uk: Засоби для розробки ядра Linux.

source: The 32bit pattern complementing devel_kernel.
ar: نمط 32 بت المكمل ل devel_kernel.
ca: El patró de 32 bits que completa devel_kernel.
cs: 32-bitová šablona doplňující devel_kernel.
da: 32-bit-mønsteret som komplimenterer devel_kernel.
de: Die 32Bit-Schema-Ergänzung devel_kernel.
es: El patrón de 32bits que complementa a devel_kernel.
fi: devel_kernel-kuviota täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi devel_kernel.
it: Modello a 32 bit complementare a devel_kernel.
pl: 32-bitowy wzorzec uzupełniający funkcje programowania jądra.
pt_br: O padrão de 32 bits que complementa o desenvolvimento do kernel Linux.
ru: 32-разрядный шаблон, который дополняет devel_kernel.
sl: 32-bitni vzorec, ki dopolnjuje devel_kernel.
sv: 32-bitarsmönstret som kompletterar devel_kernel.
uk: 32-бітовий шаблон, який доповнює devel_kernel.

source: YaST Development
ar: تطوير YaST
ca: Desenvolupament del YaST
cs: Vývoj YaSTu
da: YaST-udvikling
de: YaST-Entwicklung
es: Desarrollo de YaST
fi: YaST-kehitys
id: Pengembangan YaST
it: Sviluppo di YaST
pl: Programowanie YaST
pt_br: Desenvolvimento do YaST
ru: Разработка для YaST
sl: Razvoj za YaST
sv: YaST-utveckling
uk: Розробка для YaST

source: Tools and libraries for developing YaST modules, the setup and configuration tool for openSUSE.
ar: الأدوات والمكتبات الخاصة بتطوير وحدات ياست YaST النمطية، أداة الإعداد والتكوين الخاصة بأوبن سوزي.
ca: Eines i biblioteques per al desenvolupament de mòduls del YaST, l'eina de configuració i d'establiment de l'openSUSE.
cs: Nástroje a knihovny pro vývoj modulů programu YaST, instalačního a konfiguračního nástroje openSUSE.
da: Værktøjer og biblioteker til udvikling af YaST-moduler, opsætnings- og konfigurationsværktøjet til openSUSE.
de: Werkzeuge und Bibliotheken für die Entwicklung von Modulen für YaST, dem Einrichtungs- und Konfigurationswerkzeug für openSUSE.
es: Herramientas y bibliotecas para el desarrollo de módulos de YaST, la herramienta de instalación y configuración de openSUSE.
fi: Työkalut ja kirjastot YaST-moduulien kehitykseen. YaST on openSUSEn asennus- ja määritystyökalu.
id: Perkakas dan pustaka untuk mengembangkan modul YaST, perkakas pengaturan dan konfigurasi untuk openSUSE.
it: Strumenti e librerie per lo sviluppo di moduli YaST, lo strumento di installazione e configurazione di openSUSE.
pl: Narzędzia i biblioteki do budowania modułów dla programu YaST - centrum sterowania systemem openSUSE.
pt_br: Ferramentas e bibliotecas para desenvolvimento de módulos YaST, a ferramenta de instalação e configuração do openSUSE.
ru: Инструменты и библиотеки для разработки модулей YaST, инструмента установки и настройки openSUSE.
sl: Orodja in knjižnice za razvoj modulov YaST, nastavitvenega orodja za openSUSE.
sv: Verktyg och bibliotek för att utveckla YaST-moduler, installations- och konfigurationsverktyget för openSUSE.
uk: Засоби та бібліотеки для розробки модулів YaST, інструменту установки і налаштування openSUSE.

source: HPC Basic Compute Node
ar: عقدة حساب HPC الأساسية
ca: Node de computació bàsic HPC
cs: Základní výpočetní uzel HPC
da: HPC grundlæggende computer-node
de: Grundlegender HPC-Computer-Knoten
es: Nodo de cálculo básico de HPC
fi: HPC-peruslaskentasolmu
it: Nodo di calcolo di base HPC
pl: Podstawowy węzeł obliczeniowy HPC
pt_br: Nó de computação básica HPC
ru: Базовый вычислительный узел HPC
sl: Osnovno računsko vozlišče HPC
sv: Grundläggande HPC-beräkningsnod
uk: Базовий обчислювальний вузол HPC

source: A compute node comprises of a minimal software image and mainly runs simulation programs. Services on this node should be reduced to a bare minimum and the node *must* be installed in a automatic manner. The pattern 'HPC Modularized libraries' should also be installed.
ca: Un node de computació comprèn una imatge de programari mínima i, principalment, executa programes de simulació. Els serveis d'aquest node s'haurien de reduir a un mínim i el node S'HA D'instal·lar automàticament. També s'hauria d'instal·lar el patró de les biblioteques modulades d'HPC.
cs: Výpočetní uzel obsahuje obraz minimálního software a běží na něm hlavně simulační programy. Služby tohoto uzlu lze omezit na naprosté minimum a uzel *musí* být instalován automaticky. Má též být instalována vzorová sada 'Modularizovaných knihoven HPC'.
de: Ein Computer-Knoten umfasst ein minimales Software-Abbild und lässt hauptsächlich Simulationsprogramme laufen. Dienste auf diesem Knoten sollten auf ein absolutes Minimum reduziert werden und der Knoten *muss* in automatisierter Form installiert werden. Das Schema 'HPC Modularisierte Bibliotheken' sollte auch installiert sein.
es: Un nodo de cómputo se compone de una imagen de software mínima y principalmente ejecuta programas de simulación. Los servicios de este nodo deben reducirse al mínimo y el nodo *debe* instalarse de forma automática. El patrón "Bibliotecas modulares de HPC" también debería estar instalado.
id: Compute node terdiri dari citra perangkat lunak minimal dan terutama menjalankan program simulasi. Layanan pada node ini harus dikurangi seminimal mungkin dan node *harus* dipasang secara otomatis. Pola 'HPC modularized Libraries' juga harus dipasang.
it: Un nodo di calcolo comprende un'immagine software minima ed esegue principalmente programmi di simulazione. I servizi sul nodo devono essere ridotti al minimo e il nodo *deve* essere installato automaticamente. È necessario installare anche il modello "Librerie Modularizzate di HPC".
pl: Węzeł obliczeniowy składa się z minimalnego obrazu oprogramowania i uruchamia głównie programy symulacyjne. Usługi na tym węźle powinny zostać zredukowane do absolutnego minimum, a węzeł *musi* zostać zainstalowany w sposób automatyczny. Należy również zainstalować wzorzec „HPC mModularized library”.
pt_br: Um nó de computação é composto por uma imagem de software mínima e, principalmente, executa programas de simulação. Os serviços neste nó devem ser reduzidos ao mínimo e o nó *deve* ser instalado de maneira automática. O padrão 'Bibliotecas modularizadas de HPC' também deve ser instalado.
ru: Вычислительный узел включает минимальный программный образ и в основном на нём запускаются программы симуляции. На таком узле должен быть абсолютный минимум служб и установка *должна* производиться в автоматическом режиме. Также необходимо установить шаблон «Модульные библиотеки HPC».
sl: Računsko vozlišče vsebuje minimalni odtis s programi in v glavnem poganja simulacije. Storitve na takem vozlišču so omejene na skrajni minimum in vozlišče je *potrebno* namestiti na samodejen način. Namestiti je priporočeno tudi vzorec »Knjižnice za HPC v modulih«.
sv: En beräkningsnod består av en minimal programbild och kör i huvudsak simuleringsprogram. Tjänster på denna nod bör reduceras till ett minimum och noden *måste* installeras på ett automatiskt sätt. Mönstret 'modulariserade HPC-bibliotek' bör också installeras.
uk: Обчислювальний вузол містить мінімальний програмний образ і головним чином виконує застосунки моделювання. Служби на цьому вузлі повинні бути зведені до мінімуму, а вузол *повинен* бути встановлений автоматично. Також слід встановити шаблон «Модульовані бібліотеки HPC».

source: Server Functions
ar: وظائف الخادم
ca: Funcions de servidor
cs: Server
da: Server-funktioner
de: Serverfunktionen
es: Funciones de servidor
fi: Palvelintoiminnot
id: Fungsi Peladen
it: Funzioni server
pl: Funkcje serwera
pt_br: Funções do servidor
ru: Серверные функции
sl: Strežniške funkcije
sv: Serverfunktioner
uk: Серверні функції

source: HPC Development Packages
ar: حزم تطوير HPC
ca: Paquets de desenvolupament d'HPC
cs: Balíčky pro vývoj HPC
da: HPC-udviklingspakker
de: HPC-Entwicklungspakete
es: Paquetes de desarrollo de HPC
fi: HPC-kehityspaketit
id: Paket Pengembangan HPC
it: Pacchetti di sviluppo di HPC
pl: Pakiety dla programistów HPC
pt_br: Pacotes de desenvolvimento do HPC
ru: Пакеты разработки для HPC
sl: Razvojni paketi za HPC
sv: HPC-utvecklingspaket
uk: Пакунки розробки для HPC

source: This package provides all the relevant packages for developing HPC applications. It depends on the pattern 'HPC Modularized Libraries'. In addition it includes the GNU compilers and the relevant management packages.
ca: Aquest paquet proporciona tots els paquets rellevants per desenvolupar aplicacions HPC. Depèn del patró de biblioteques modulades d'HPC. A més, inclou els compiladors de GNU i els paquets de gestió rellevants.
cs: Tento balíček poskytuje všechny relevantní balíčky pro vývoj aplikací HPC, Závisí na vzorové sadě 'Modularizovaných knihoven HPC'. Navíc obsahuje GNU kompilátory a relevantní balíčky pro správu.
de: Dieses Paket bietet alle relevanten Pakete die Entwicklung von HPC-Applikationen. Es hängt von dem Schema 'HPC Modularisierte Bibliotheken' ab. Zusätzliche beinhaltet es die GNU-Compiler hinzu und die relevanten Verwaltungs-Pakete.
es: Este paquete proporciona todos los paquetes pertinentes para el desarrollo de aplicaciones HPC. Depende del patrón "Bibliotecas modulares de HPC". Además, incluye los compiladores de GNU y los paquetes de gestión pertinentes.
id: Paket ini menyediakan semua paket yang relevan untuk mengembangkan aplikasi HPC. Itu tergantung pada pola 'HPC Modularized Libraries'. Selain itu termasuk kompiler GNU dan paket manajemen yang relevan.
it: Questo pacchetto fornisce tutti i pacchetti pertinenti per lo sviluppo di applicazioni HPC. Dipende dal modello "Librerie Modularizzate di HPC". In aggiunta, include i compilatori GNU e i relativi pacchetti di gestione.
pl: Ten pakiet zawiera wszystkie pakiety, które są niezbędne do programowania aplikacji HPC. Jego funkcjonowanie jest zależne od wzorca zmodularyzowanych bibliotek HPC. Pakiet ten dodatkowo zawiera kompilatory GNU i wszystkie potrzebne pakiety do zarządzania.
pt_br: Este pacote fornece todos os pacotes relevantes para o desenvolvimento de aplicativos HPC. Depende do padrão 'Bibliotecas Modularizadas HPC'. Além disso, inclui os compiladores GNU e os pacotes de gerenciamento relevantes.
ru: Этот пакет предоставляет всё необходимое для разработки HPC-приложений. Он зависит от шаблона «Модульные библиотеки HPC» и содержит дополнительные компиляторы GNU и соответствующие пакеты управления.
sl: Ta paket ponuja vse pakete za razvoj programov za HPC. Odvisen je od vzorca »Knjižnice za HPC v modulih«. Dodatno vsebuje prevajalnike GNU in ustrezne pakete za upravljanje.
sv: Detta paket tillhandahåller alla relevanta paket för att utveckla HPC-program. Det beror på mönstret 'modulariserade HPC-bibliotek'. Dessutom inkluderar det GNU-kompilerare och relevanta hanteringspaket.
uk: Цей пакунок містить усі необхідні пакунки для розробки програм HPC. Він залежить від шаблону «Модульовані бібліотеки HPC». Крім того, він включає компілятори GNU та відповідні пакунки керування.

source: HPC Modularized Libraries
ca: Biblioteques modulades d'HPC
cs: Modularizované knihovny HPC
de: Modularisierte HPC-Bibliotheken
es: Bibliotecas modulares de HPC
fi: Modularisoidut HPC-kirjastot
id: Perpustakaan Modularisasi HPC
it: Librerie modularizzate di HPC
pl: Bilblioteki zmodularyzowane HPC
pt_br: Bibliotecas Modularizadas HPC
ru: Модульные библиотеки HPC
sl: Knjižnice za HPC v modulih
sv: modulariserade HPC-bibliotek
uk: Модульовані бібліотеки HPC

source: This package provides all the modularized libraries so that they can be used in an HPC environment. These libraries allow to install several MPI flavors in parallel. In order to use these libraries one needs to load them via the module command first.
ca: Aquest paquet proporciona totes les biblioteques modulades perquè es puguin usar en un entorn HPC. Aquestes biblioteques us permeten instal·lar diversos sabors d'MPI en paral·lel. Per usar-les, les heu de carregar primer mitjançant l'ordre del mòdul.
cs: Tento balíček poskytuje všechny modularizované knihovny, aby je bylo možné použít v prostředí HPC. Tyto knihovny umožňují instalovat několik druhů MPI paralelně. Před použitím musíte tyto knihovny nejprve zavést příkazem module.
de: Dieses Paket bietet alle modularisierten Bibliotheken, sodass sie in einer HPC-Umgebung verwendet werden können. Diese Bibliotheken ermöglichen die parallele Installation mehrerer MPI-Typen. Um diese Bibliotheken zu nutzen, müssen sie zunächst über den Module-Befehl geladen werden.
es: Este paquete proporciona todas las bibliotecas modulares de forma que se puedan usar en entornos HPC. Estas bibliotecas permiten instalar distintas variantes de MPI en paralelo. Para usar estas bibliotecas debe hacer que se carguen primero con el comando del módulo.
fi: Tämä paketti tarjoaa HPC-ympäristössä käytettävät modularisoidut kirjastot, jotka sallivat useiden rinnakkaisten MPI-versioiden asentamisen. Kirjastojen käyttämiseksi ne on ensin ladattava moduulikomennolla.
id: Paket ini menyediakan semua pustaka termodulasi sehingga mereka dapat digunakan di lingkungan HPC. Pustaka ini memungkinkan untuk memasang beberapa macam MPI secara paralel. Untuk menggunakan pustaka ini, seseorang harus memuatnya melalui perintah modul terlebih dahulu.
it: Questo pacchetto fornisce tutte le librerie modularizzate in modo da poterle utilizzare in un ambiente HPC. Tali librerie consentono di installare diverse varianti di MPI in parallelo. Per utilizzare queste librerie, caricarle innanzitutto mediante il comando module.
pl: Ten pakiet zawiera wszystkie biblioteki zmodularyzowane i umożliwia używanie ich w środowisku HPC. Biblioteki te pozwalają na równoległe zainstalowanie wielu wersji MPI. Aby można było korzystać z tych bibliotek, należy je najpierw załadować za pośrednictwem polecenia modułu.
pt_br: Este pacote fornece todas as bibliotecas modularizadas para que possam ser usadas em um ambiente HPC. Essas bibliotecas permitem instalar vários tipos de MPI em paralelo. Para usar essas bibliotecas, é necessário carregá-las primeiro por meio do comando do módulo.
ru: Этот пакет предоставляет все модульные библиотеки для использования в HPC-окружении. Эти библиотеки позволяют установить несколько выпусков MPI параллельно. Чтобы использовать эти библиотеки, их сперва нужно загрузить с помощью команды module.
sl: Ta paket ponuja vse knjižnice v modulih, tako da jih je mogoče uporabljati v okolju HPC. Te knjižnice omogočajo vzporedno namestitev več različnih izdaj MPI. Za uporabo teh knjižnic, jih je najprej potrebno naložiti z ukazom »module«.
sv: Detta paket tillhandahåller alla modulariserade bibliotek så att de kan användas i en HPC-miljö. Dessa bibliotek gör att du kan installera flera MPI-varianter parallellt. För att använda dessa bibliotek måste de först läsas in med modulkommandot.
uk: Цей пакунок надає всі модульовані бібліотеки, щоб їх можна було використовувати у середовищі HPC. Ці бібліотеки дозволяють встановлювати кілька варіантів MPI паралельно. Щоб використовувати ці бібліотеки, спочатку їх потрібно завантажити за допомогою команди module.

source: HPC Workload Manager
ar: مدير عبء عمل HPC
ca: Gestor de càrrega de feina HPC
cs: Správce zátěže HPC
da: HPC-arbejdsbyrde-håndtering
de: HPC Workload-Verwaltung
es: Gestor de carga de trabajo de HPC
fi: HPC-kuormanhallinta
it: Gestore del carico di lavoro di HPC
pl: Menedżer obciążeń HPC
pt_br: Gerenciador de carga de trabalho HPC
ru: Диспетчер рабочей нагрузки HPC
sl: Upravljalnik delovnih obremenitev HPC
uk: Менеджер робочого навантаження HPC

source: This package provides all the relevant packages for running the central server component of the slurm workload manager.
ar: توفر هذه الحزمة جميع الحزم اللازمة لتشغيل مكون الخادم المركزي الخاص بمدير عبء العمل slurm.
ca: Aquest paquet proporciona tots els paquets rellevants per executar el component del servidor central del gestor de la càrrega de feina slurm.
cs: Tento balíček obsahuje všechny potřebné balíčky pro provoz komponenty centrálního serveru správce zátěže "slurm".
da: Pakken leverer alle relevante pakker til at køre den centrale serverkomponent af slurm-arbejdsbyrden-håndteringen.
de: Dieses Paket beinhaltet alle relevanten Pakete zum Betrieb der zentralen Serverkomponente der slurm Workload-Verwaltung.
es: Este paquete proporciona todos los paquetes relevantes para ejecutar el componente de servidor central del gestor de carga de trabajo de slurm.
fi: Tämä paketti tarjoaa tarvittavat paketit slurm-kuormanhallinnan ajamiseksi keskeisenä palvelinkomponenttina.
id: Paket ini menyediakan semua paket yang relevan untuk menjalankan komponen peladen pusat dari manajer beban kerja slurm.
it: Questo pacchetto fornisce tutti i pacchetti pertinenti per eseguire il componente server centrale del gestore del carico di lavoro slurm.
pl: Ten pakiet zawiera wszystkie pakiety, które są niezbędne do uruchomienia składnika serwera centralnego menedżera obciążeń slurm.
pt_br: Este pacote fornece todos os pacotes relevantes para executar o componente do servidor central do gerenciador de carga de trabalho slurm.
ru: Этот пакет предоставляет все соответствующие пакеты для запуска компонента центрального сервера диспетчера рабочей нагрузки slurm.
sl: Ta paket vsebuje vse pakete za poganjanje osrednje strežniške komponente upravljalnika delovnih obremenitev slurm.
sv: Detta paket tillhandahåller alla relevanta paket för att köra den centrala serverkomponenten i slurm workload manager.
uk: Цей пакунок містить усі необхідні пакунки для запуску центрального серверного компонента менеджера робочого навантаження slurm.

source: Live Patching
ar: التحديث الجزئي المباشر
ca: Apedaçament autònom
cs: Opravy za chodu
da: Liverettelse
id: Penambalan Langsung
it: Applicazione di patch live
pl: Mechanizm Live Patching
pt_br: Patching ao vivo
ru: Live Pаtching
sl: Popravljanje v živo
sv: Livekorrigering
uk: Живе виправлення

source: Amazon Web Services - All
ar: خدمات Amazon على الويب - الكل
ca: Serveis web d'Amazon - Tot
cs: Amazon Web Services – vše
da: Amazon Web Services - Alle
de: Amazon Web Services – Alle
es: Amazon Web Services - Todo
fi: Amazon Web Services - Kaikki
id: Amazon Web Services - Semua
it: Amazon Web Services - Tutti
pl: Amazon Web Services - wszystkie
pt_br: Amazon Web Services - Todos
ru: Amazon Web Services — Все
sl: Amazon Web Services – vse
sv: Amazon-webbtjänster - Alla
uk: Amazon Web Services - Всі
