Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: 32-Bit Runtime Environment
ar: بيئة التشغيل 32-Bit
ca: Entorn d'execució de 32 bits
cs: 32bitový běhový systém
da: 32-bit-afviklingsmiljø
de: 32-Bit-Laufzeitumgebung
es: Entorno de ejecución de 32 bits
fi: 32-bittinen ajonaikainen ympäristö
id: Lingkungan Runtime 32-Bit
it: Ambiente di esecuzione a 32 Bit
pl: 32-bitowe środowisko uruchomieniowe
pt_br: Ambiente de execução de 32 bits
ru: 32-битная среда выполнения
sl: 32-bitno izvajalno okolje
sv: 32-bitars körtidsmiljö
uk: 32-бітове середовище виконання

source: This will install the 32-bit variant of all selected patterns. This allows to execute 32-bit software.
ar: سيؤدي هذا إلى تثبيت نسخة 32 بت لجميع الأنماط المحددة. سيسمح تشغيل برمجيات 32.
ca: Això instal·larà la variant de 32 bits de tots els patrons instal·lats. Això permet executar programari de 32 bits.
cs: Tímto se nainstalují 32bitové verze všech zvolených profilů. Lze tak spouštět 32bitový software.
da: Dette vil installerer 32-bit-varianten af alle valgte mønstre, hvorved du kan eksekvere 32-bit-software.
de: Dies installiert die 32-Bit-Variante aller ausgewählten Schemata. Dies ermöglicht 32-Bit-Software auszuführen.
es: Esto instalará la variante de 32 bits de todos los patrones seleccionados. Permite la ejecución de software de 32 bits.
fi: Tämä asentaa 32-bittiset versiot kaikista valituista ohjelmistoryhmistä ja sallii 32-bittisen ohjelmiston suorittamisen.
id: Ini akan memasang varian 32-bit dari semua pola yang dipilih. Ini memungkinkan untuk menjalankan perangkat lunak 32-bit.
it: Verrà installata la variante a 32 bit di tutti i modelli selezionati, per consentire l'esecuzione di programmi a 32 bit.
pl: Spowoduje to zainstalowanie 32-bitowych wariantów wybranych wzorców. Pozwoli to uruchamiać programy 32-bitowe.
pt_br: Este padrão irá instalar a variante de 32 bits de todos os padrões selecionados. Permitindo a execução de programas de 32 bits.
ru: Это шаблон устанавливает 32-битные варианты всех выбранных шаблонов. Это позволит вам запускать 32-битные программы.
sl: To bo namestilo 32-bitne variante vseh izbranih vzorcev, kar omogoča izvajanje 32-bitnih programov.
sv: Detta kommer att installera 32-bitarsvarianten av alla valda mönster. Det här tillåter körning av 32-bitars programvara.
uk: Цей шаблон встановлює 32-бітові варіанти всіх вибраних шаблонів. Це дозволить вам запускати 32-бітові застосунки.

source: Base Technologies
ar: التقنيات الأساسية
ca: Tecnologies de base
cs: Základní technologie
da: Grundlæggende teknologier
de: Basistechnologien
es: Tecnologías de base
fi: Perusteknologiat
id: Teknologi Dasar
it: Tecnologie di base
pl: Technologie podstawowe
pt_br: Tecnologias de base
ru: Базовые технологии
sl: Osnovne tehnologije
sv: Grundläggande teknologier
uk: Базові технології

source: AppArmor
ar: تطبيق الدرع
pl: Tarcza aplikacji
ru: Среда AppArmor

source: AppArmor is an application security framework that provides mandatory access control for programs. It protects from exploitation of software flaws and compromised systems. It offers an advanced tool set that automates the development of per-program application security without requiring additional knowledge.
ar: تطبيق AppArmor يوفر التحكم في الوصول للبرامج. ويحمي من استغلال عيوب البرمجيات وتهديد النظام. ويقدم مجموعة أدوات متقدمة لتطوير أمن التطبيقات لكل البرامج دون الحاجة إلى معرفة إضافية.
ca: L'AppArmor és un marc de treball de seguretat d'aplicació que proporciona un control d'accés obligatori per als programes. Protegeix d'explotació d'errors de maquinari i de sistemes compromesos. Ofereix un conjunt d'eines avançat que automatitza el desenvolupament de la seguretat per a cada aplicació sense demanar un coneixement addicional.
cs: AppArmor je aplikační bezpečnostní rozhraní, které poskytuje nezbytné řízení přístupu k programům. Chrání před zneužíváním děr v softwaru a před systémy hrozeb. Nabízí pokročilou sadu nástrojů, která automatizuje výzkum bezpečnosti aplikace po jednotlivých programech bez potřeby dalších znalostí.
da: AppArmor er et programsikkerheds-framework som giver obligatorisk adgangskontrol til programmer. Det beskytter mod udnyttelse af softwaremangler og kompromitterede systemer. Det tilbyder et avanceret værktøjssæt som automatiserer udviklingen af per-program programsikkerhed uden at kræve yderligere viden.
de: AppArmor ist ein Sicherheitsframework für Anwendungen, welches eine obligatorische Zugriffssteuerung für Programme bereitstellt. Es schützt vor Ausnutzung von Softwarefehlern und kompromittierten Systemen. AppArmor bietet einen umfassenden Werkzeugsatz, mit dem die Entwicklung und Anpassung der Konfiguration bis hinunter auf Programmebene weitgehend automatisiert werden kann ohne dass dabei zusätzliches Wissen benötigt wird.
es: AppArmor es un conjunto de aplicaciones de seguridad que proporciona un control de acceso obligatorio para los programas. Protege contra la explotación de vulnerabilidades en los programas y en sistemas comprometidos. Ofrece una conjunto de herramientas avanzadas que permite automatizar el desarrollo de seguridad de aplicaciones por programa sin necesidad de conocimientos adicionales.
fi: AppArmor on tietoturvasovelluskehys, joka mahdollistaa ohjelmien pakollisen käytönvalvonnan. Se suojaa ohjelmistovioilta ja järjestelmään murtautumiselta. AppArmor suojaa (myös pääkäyttäjänä suoritettavat) ohjelmat tuhoa aiheuttavilta koodeilta ja jopa nollapäivähyökkäyksiltä. Sen monipuoliset työkalut parantavat eri ohjelmien turvallisuutta ilman, että käyttäjän tarvitsee hankkia lisätietoja.
id: AppArmor adalah kerangka kerja keamanan aplikasi yang menyediakan kontrol akses wajib untuk program. Ini melindungi dari eksploitasi kelemahan perangkat lunak dan sistem yang dikompromikan. Ini menawarkan seperangkat perkakas canggih yang mengotomatiskan pengembangan keamanan aplikasi per-program tanpa memerlukan pengetahuan tambahan.
it: AppArmor è un'infrastruttura di sicurezza per le applicazioni che fornisce un controllo dell'accesso obbligatorio per i programmi. Ciò protegge dallo sfruttamento dei difetti dei programmi e di sistemi compromessi. AppArmor fornisce un insieme di strumenti avanzati che automatizza la progettazione della sicurezza delle applicazioni per ogni singolo programma senza richiedere conoscenze aggiuntive.
pl: Program AppArmor to system zabezpieczeń programów, który umożliwia obowiązkową kontrolę dostępu dla programów. Zabezpiecza on przed wykorzystaniem błędów oprogramowania i skutkami włamań. Oferuje zestaw zaawansowanych narzędzi automatyzujących proces przygotowania zabezpieczeń dla konkretnych programów bez konieczności posiadania dodatkowej wiedzy.
pt_br: O AppArmor é um framework de segurança de aplicativos que fornece controle de acesso obrigatório a programas. Ele protege contra a exploração de falhas de programas e sistemas comprometidos. Ele oferece um conjunto de ferramentas avançadas que automatizam o desenvolvimento de segurança por aplicativos sem a necessidade de conhecimento adicional.
ru: AppArmor — это механизм обеспечения безопасности приложений, обеспечивающий принудительный контроль доступа для программ. Он защищает от использования уязвимостей в программном обеспечении и компрометирования систем. Он предлагает расширенный набор утилит для разработки индивидуальных правил безопасности для каждой программы, не требующий дополнительных знаний.
sl: AppArmor je programsko varnostno ogrodje, ki ponuja obvezen nadzor dostopa za programe. Varuje pred izkoriščanjem napak v programih in ogroženih sistemov. Ponuja napreden nabor orodij, ki avtomatizirajo razvoj varnosti vezane na program, brez potrebnega dodatnega znanja.
sv: AppArmor är ett säkerhetsramverk som tillhandahåller obligatorisk åtkomstkontroll för program. Det skyddar mot programvarufel och utnyttjande av system med dålig säkerhet. I AppArmor finns en uppsättning avancerade verktyg som automatiserar utvecklingen av säkerhet för enskilda program så att det inte behövs några specifika förkunskaper.
uk: AppArmor - фреймворк безпеки застосунків, який забезпечує обов’язковий контроль доступу для застосунків. Він захищає від використання недоліків програмного забезпечення та зламаних систем. Він пропонує розширений набір інструментів, який автоматизує розробку безпеки для кожного застосунку, не вимагаючи додаткових знань.

source: The 32bit pattern complementing apparmor.
ar: تطبيق apparmor المكمّل بالنمط 32bit.
ca: El patró de 32 bits que completa l'Apparmor.
cs: 32bitový vzor doplňující apparmor.
da: 32-bit-mønsteret som komplimenterer apparmor.
de: Das 32-Bit-Schema welches AppArmor ergänzt.
es: El patrón de 32 bits que complementa a apparmor.
fi: apparmoria täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi apparmor.
it: Modello a 32 bit complementare a apparmor.
pl: 32-bitowy wzorzec uzupełniający środowisko AppArmor.
pt_br: O padrão de 32 bits que complementa o AppArmor.
ru: 32-разрядный шаблон, который дополняет apparmor.
sl: 32-bitni vzorec, ki dopolnjuje apparmor.
sv: 32-bitarsmönster som kompletterar AppArmor.
uk: 32-бітовий шаблон, який доповнює apparmor.

source: Minimal Base System
ar: الحد الأدنى للنظام
ca: Sistema mínim de base
cs: Minimální základní systém
da: Minimalt basissystem
de: Minimales Basissystem
es: Sistema básico mínimo
fi: Minimaalinen perusjärjestelmä
id: Sistem Dasar Minimal
it: Sistema di base minimo
pl: Minimalny system podstawowy
pt_br: Sistema base mínimo
ru: Минимальная базовая система
sl: Minimalni osnovni sistem
sv: Minimalt grundläggande system
uk: Мінімальна базова система

source: This is the base runtime system. It contains only a minimal multiuser booting system. For running on real hardware, you need to add additional packages and pattern to make this pattern useful on its own.
ar: الحد الأدنى للنظام. يحتوي على الحد الأدنى لنظام قابل للإقلاع متعدد المستخدمين. للتشغيل على الأجهزة الحقيقية، تحتاج لإضافة حزم وتطبيقات ليكون قابل للاستخدام.
ca: Això és el sistema d'execució de base. Conté només un sistema d'arrencada de multiusuari mínim. Per executar-lo en maquinari real, cal que afegiu paquets i patrons addicionals per fer que aquest patró sigui útil per si mateix.
cs: Toto je základní běhový systém. Obsahuje pouze minimální víceuživatelský spustitelný systém. Pro běh skutečného hardwaru musíte doinstalovat další balíčky a profily.
da: Dette er det grundlæggende runtime-system. Det indeholder kun et minimalt flerbruger-bootsystem. For at køre på rigtigt hardware skal du bruge yderligere pakker og mønstre til at gøre dette mønster nyttigt for sig selv.
de: Dies ist das Basis-System. Es enthält nur ein minimales, bootfähiges Multiuser-System. Um es auf realer Hardware zu installieren, benötigen Sie weitere Pakete und ggf. auch Schemata, um ein wirklich benutzbares System zu erhalten.
es: Este es el sistema base en tiempo de ejecución. Contiene sólo un sistema mínimo de inicio multiusuario. Para ejecutarlo en hardware real, necesita añadir paquetes y patrones adicionales para hacer este patrón útil por sí mismo.
fi: Tämä on ajonaikainen perusjärjestelmä. Se sisältää vain minimaalisen monikäyttäjäjärjestelmän. Jotta voisit käyttää järjestelmää todellisella laitteistolla, tarvitset lisää paketteja ja ohjelmistoryhmiä.
id: Ini adalah sistem runtime dasar. Ini hanya berisi sistem boot multiuser minimal. Untuk menjalankan pada perangkat keras nyata, Anda perlu menambahkan paket dan pola tambahan untuk membuat pola ini berguna sendiri.
it: Questo è il sistema runtime base; contiene solo un sistema multiutente d'avvio minimo. Per eseguirlo su dell'hardware reale, è necessario aggiungere ulteriori pacchetti e modelli per rendere questo modello utilizzabile.
pl: Podstawowy system uruchomieniowy. Zawiera tylko minimalny rozruchowy system dla wielu użytkowników. Do pracy na rzeczywistym komputerze wymagane są dodatkowe pakiety i wzorzec czyniący ten użytecznym.
pt_br: Este é o sistema base de execução. Ele contém apenas um sistema de inicialização multiusuário. Para executá-lo num hardware real, será necessário adicionar pacotes e padrões adicionais para tornar este padrão útil.
ru: Это базовая система. Здесь содержится только минимальная многопользовательская загружаемая система. Для запуска на реальном оборудовании, вам нужны дополнительные пакеты и шаблоны, чтобы данный шаблон был полезен сам по себе.
sl: To je osnovni izvajalni sistem. Vsebuje le osnovni več-uporabniški sistem. Za poganjanje na pravi strojni opremi, morate dodati druge pakete in vzorce, da bo ta vzorec uporaben.
sv: Det här är det grundläggande körtidssystemet. Det innehåller endast ett minimalt startsystem för flera användare. Om det ska köras på riktig maskinvara måste du lägga till ytterligare paket och mönster så att det här mönstret blir användbart när det används fristående.
uk: Це базова система виконання. Вона містить тільки мінімальну багатокористувацьку систему завантаження. Для виконання на справжньому обладнанні потрібні додаткові пакунки і шаблони, щоб цей шаблон став придатним.

source: The 32bit pattern complementing base.
ar: مبني على نمط 32bit.
ca: El patró de 32 bits que completa la base.
cs: 32bitový vzor doplňující base.
da: 32-bit-mønsteret som komplimenterer base.
de: Das 32-Bit-Schema welches die Basis ergänzt.
es: El patrón de 32 bits que complementa a base.
fi: base-kuviota täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi base.
it: Modello a 32 bit complementare a base.
pl: 32-bitowy wzorzec uzupełniający system podstawowy.
pt_br: O padrão de 32 bits que complementa a base.
ru: 32-разрядный шаблон, который дополняет base.
sl: 32-bitni vzorec, ki dopolnjuje base.
sv: 32-bitarsmönster som kompletterar base.
uk: 32-бітовий шаблон, який доповнює base.

source: Minimal Base System (alias pattern for base)
ar: النظام الأساسي الادنى (نمط اسم بديل للأساس)
ca: Sistema mínim de base (patró d'àlies per a base)
cs: Minimální základní systém (alias předloha pro něj)
da: Minimalt basissystem (alias-mønster for basis)
de: Minimales Basissystem (Alias-Schema für Basis)
es: Sistema base (alias del patrón base)
fi: Minimaalinen perusjärjestelmä (alias base-kuviolle)
id: Sistem Dasar Minimal (pola alias untuk dasar)
it: Sistema di base minimo (modello alias per base)
pl: Minimalny system podstawowy (wzorzec aliasu dla systemu podstawowego)
pt_br: Sistema base mínimo (álias padrão para base)
ru: Минимальная базовая система (шаблон-псевдоним base)
sl: Minimalni osnovni sistem (drugo ime za base)
sv: Minimalt grundsystem (mönster för base)
uk: Мінімальна базова система (псевдонім шаблону base)

source: A very basic desktop (previously part of x11 pattern)
ar: سطح مكتب أساسي جدًا (كان سابقًا جزءًا من نمط x11)
ca: Un escriptori molt bàsic (anteriorment, part del patró d'X11)
cs: Nejzákladnější pracovní plocha (předtím část šablony x11)
da: Et meget simpelt skrivebord (tidligere en del af x11-mønsteret)
de: Ein sehr grundlegender Desktop (ehemals Teil des X11 Schemas)
es: Un escritorio muy básico (antes era parte del patrón x11)
fi: Hyvin yksinkertainen työpöytä (aiemmin osana x11-mallia)
id: Destop yang sangat mendasar (sebelumnya bagian dari pola x11)
it: Un desktop molto semplice (precedentemente parte del modello x11)
pl: Bardzo podstawowy pulpit (wcześniej część x11 tapety)
pt_br: Uma área de trabalho muito básica (anteriormente parte do padrão x11)
ru: Базовый рабочий стол (ранее часть шаблона x11)
sl: Zelo osnovno namizje (prej dela vzorca X11)
sv: Ett mycket grundläggande skrivbord (tidigare en del av X11 -mönstret)
uk: Дуже спрощена стільниця (раніше частина шаблону x11)

source: This pattern installs a rather basic desktop (icewm)
ar: يقوم هذا النمط بتثبيت سطح مكتب أساسي إلى حد ما (icewm)
ca: Aquest patró instal·la un escriptori bastant bàsic (icewm).
cs: Tato šablona instaluje dosti základní pracovní plochu (icewm)
da: Mønsteret installerer et ret simpelt skrivebord (icewm)
de: Dieses Schema installiert einen ziemlich grundlegenden Desktop (icewm)
es: Este patrón instala un escritorio bastante básico (icewm)
fi: Tämä malli asentaa melko yksinkertaisen työpöydän (icewm)
id: Pola ini memasang destop yang agak dasar (IceWM)
it: Questo modello installa un desktop piuttosto semplice (icewm)
pl: Ten wzór instaluje raczej podstawowy pulpit (icewm)
pt_br: Esse padrão instala uma área de trabalho bastante básica (icewm)
ru: Этот шаблон устанавливает весьма базовый рабочий стол (icewm)
sl: Ta vzorec namesti zelo osnovno namizno okolje (IceWM)
sv: Detta mönster installerar en ganska grundläggande skrivbordsmiljö (icewm)
uk: Цей шаблон встановлює спрощену стільницю (icewm)

source: Graphical Environments
ar: البيئات الرسومية
ca: Entorns gràfics
cs: Grafická rozhraní
da: Grafiske miljøer
de: Grafische Umgebungen
es: Entornos gráficos
fi: Graafinen ympäristö
id: Lingkungan Grafis
it: Ambienti grafici
pl: Środowiska graficzne
pt_br: Ambientes gráficos
ru: Графические среды
sl: Grafična okolja
sv: Grafiska miljöer
uk: Графічні середовища

source: Bootloader
ar: محمل الإقلاعBootloader
ca: Carregador d'arrencada
cs: Zavaděč systému
es: Gestor de arranque
fi: Käynnistyslatain
pl: Program rozruchowy
pt_br: Inicializador
ru: Загрузчик
sl: Zagonski nalagalnik
sv: Startladdare
uk: Завантажувач

source: This pattern holds files required for booting the system
ar: يحتفظ هذا النمط بالملفات المطلوبة لتشغيل النظام
ca: Aquest patró conté els fitxers necessaris per arrencar el sistema.
cs: Tato šablona obsahuje soubory potřebné pro start systému
de: Dieses Schema enthält Dateien, die zum Starten des Systems benötigt werden
es: Este patrón incluye los archivos necesarios para arrancar el sistema
fi: Tämä kuvio sisältää järjestelmän käynnistykseen tarvittavat tiedostot
id: Pola ini menyimpan berkas yang diperlukan untuk mem-boot sistem
it: Questo modello contiene i file richiesti per l'avvio del sistema
pl: Ta tapeta zawiera pliki wymagane do uruchomienia systemu
pt_br: Este padrão contém os arquivos necessários para inicializar o sistema
ru: Этот шаблон содержит файлы, необходимые для загрузки системы
sl: Ta vzorec vsebuje datoteke, ki so potrebne za zagon sistema
sv: Detta mönster innehåller filer som krävs för att starta upp systemet
uk: Цей шаблон містить файли, необхідні для завантаження системи

source: Help and Support Documentation
ar: وثائق التعليمات والدعم
ca: Ajuda i documentació de suport
cs: Nápověda a dokumentace
da: Hjælp og support-dokumentation
de: Hilfe- und Support-Dokumentation
es: Documentación de ayuda y asistencia
fi: Ohjeet ja tuen dokumentaatio
id: Dokumentasi Bantuan dan Dukungan
it: Guida e documentazione di supporto
pl: Dokumentacja pomocy
pt_br: Ajuda e documentação de suporte
ru: Справка и документация для поддержки
sl: Dokumentacija za pomoč in podporo
sv: Dokumentation för hjälp och support
uk: Документація довідки і техпідтримки

source: Documentation
ar: توثيق
ca: Documentació
cs: Dokumentace
da: Dokumentation
de: Dokumentation
es: Documentación
fi: Dokumentaatio
id: Dokumentasi
it: Documentazione
pl: Dokumentacja
pt_br: Documentação
ru: Документация
sl: Dokumentacija
sv: Dokumentation
uk: Документація

source: Enhanced Base System
ar: نظام تشغيل اساسي معزز
ca: Sistema de base millorat
cs: Rozšířený základní systém
da: Forbedret grundlæggende system
de: Erweitertes Basissystem
es: Sistema base mejorado
fi: Parannettu perusjärjestelmä
id: Sistem Dasar yang Disempurnakan
it: Sistema di base migliorato
pl: Rozszerzony system podstawowy
pt_br: Sistema base aprimorado
ru: Расширенная базовая система
sl: Izboljšan osnovni sitem
sv: Utökat grundläggande system
uk: Покращена базова система

source: This is the enhanced base runtime system with lots of convenience packages.
ar: هذا هو نظام التشغيل الأساسي المعزز مع الكثير من حزم المريحة.
ca: Això és el sistema d'execució de base millorat amb molts paquets de conveniència.
cs: Toto je rozšíření základního běhového systému s řadou obvyklých balíčků.
da: Dette er det forbedret grundlæggende runtime-system med masser af bekvemmelighedspakker.
de: Dies ist das umfangreichere Basis-Laufzeitsystem mit zahlreichen nützlichen Paketen.
es: Este es el sistema base en tiempo de ejecución mejorado con varios paquetes útiles.
fi: Tämä on paranneltu ajonaikainen perusjärjestelmä, joka sisältää lukuisia ylimääräisiä paketteja.
id: Ini adalah sistem runtime dasar yang disempurnakan dengan banyak paket kenyamanan.
it: Questo è il sistema di esecuzione di base migliorato, con molti pacchetti vantaggiosi.
pl: Rozszerzony system podstawowy z dużą ilością dogodnych pakietów.
pt_br: Este é o sistema base aprimorado, com vários pacotes convenientes.
ru: Это расширенная базовая система с множеством дополнительных пакетов.
sl: To je izboljšan osnovni izvajalni sistem z veliko priročnimi paketi.
sv: Detta är det utökade grundkörsystemet med massor av praktiska paket.
uk: Покращена базова система виконання з багатьма додатковими пакунками.

source: The 32bit pattern complementing enhanced_base.
ar: نمط 32bit المكمل ل enhanced_base.
ca: El patró de 32 bits que completa la base millorada.
cs: 32bitový vzor doplňující enhanced_base.
da: 32-bit-mønsteret som komplimenterer enhanced_base.
de: Das 32-Bit-Schema welches enhanced_base ergänzt.
es: El patrón de 32 bits que complementa a enhanced_base.
fi: enhanced_base-kuviota täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi enhanced_base.
it: Modello a 32 bit complementare a enhanced_base.
pl: 32-bitowy wzorzec uzupełniający rozszerzony system podstawowy.
pt_br: O padrão de 32 bits que complementa o sistema base aprimorado.
ru: 32-разрядный шаблон, который дополняет enhanced_base.
sl: 32-bitni vzorec, ki dopolnjuje enhanced_base.
sv: 32-bitarsmönstret som kompletterar enhanced_base.
uk: 32-бітовий шаблон, який доповнює enhanced_base.

source: FIPS 140-2 specific packages
ar: الحزم الخاصة بمعيار FIPS 140-2
ca: Paquets específics FIPS 140-2
cs: Balíčky specifické pro FIPS 140-2
da: FIPS 140-2-specifikke pakker
de: FIPS 140-2-spezifische Pakete
es: Paquetes específicos de FIPS 140-2
fi: FIPS 140-2 -kohtaiset paketit
id: Paket spesifik FIPS 140-2
it: Pacchetti specifici per FIPS 140-2
pl: Pakiety specyficzne dla norm FIPS 140-2
pt_br: Pacotes específicos FIPS 140-2
ru: Пакеты для FIPS 140-2
sl: Paketi posebej za FIPS 140-2
sv: FIPS 140-2-specifika paket
uk: Спеціальні пакунки для FIPS 140-2
