Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: Tools and libraries for software development using C/C++ and other derivative of the C programming language.
ar: الأدوات والمكاتب اللازمة للتطوير باستخدام الـC++/C و غيرهم من مشتقات لغة الـC.
ca: Eines i biblioteques per a desenvolupament de programari que usen C/C++ i altres derivats del llenguatge de programació C.
cs: Nástroje a knihovny pro vývoj v C/C++ a jazycích odvozených od jazyka C.
da: Værktøjer og biblioteker til softwareudvikling ved brug af C/C++ og andre afledninger af C-programmeringssproget.
de: Werkzeuge und Bibliotheken für die Softwareentwicklung mit C/C++ und anderen Formen der Programmiersprache C.
es: Herramientas y bibliotecas para el desarrollo de software que utilizan C/C++ y otros lenguajes de programación derivados de C.
fi: Työkalut ja kirjastot C/C++ (sekä johdannaiset) -pohjaiseen sovelluskehitykseen.
id: Perkakas dan pustaka untuk pengembangan perangkat lunak menggunakan C/C++ dan turunan lainnya dari bahasa pemrograman C.
it: Strumenti e librerie per lo sviluppo di applicazioni in C/C++ e altri derivati del linguaggio di programmazione C.
pl: Narzędzia i biblioteki dla programistów korzystających z C/C++ oraz innych odmian języka C.
pt_br: Ferramentas e bibliotecas para desenvolvimento de programas usando o C/C++ e outros derivados da linguagem de programação C.
ru: Инструменты и библиотеки для разработки программ на C/C++ и других производных языка программирования C.
sl: Orodja in knjižnice za razvoj programske opreme z uporabo jezika C/C++ in drugimi izvedenkami programskega jezika C.
sv: Verktyg och bibliotek för mjukvaruutveckling C/C++ och andra varianter av C-programmeringsspråket.
uk: Засоби та бібліотеки для розробки програм на C/C++ та інших похідних мови програмування C.

source: RPM Build Environment
ar: بيئة البناء RPM
ca: Entorn de construcció d'RPM
cs: Prostředí pro vytváření RPM
da: RPM-byggemiljø
de: RPM-Bauumgebung
es: Entorno de creación de RPM
fi: RPM-pakettien rakennusympäristö
id: Lingkungan Bangun RPM
it: Ambiente di creazione degli RPM
pl: Środowisko budowania pakietów RPM
pt_br: Ambiente de construção RPM
ru: Среда сборки RPM
sl: Okolje za gradnjo RPM-jev
sv: RPM-byggmiljö
uk: Середовище збирання RPM

source: Minimal set of tools and libraries for building packages using the RPM package manager.
ar: أقل مجموعة من الأدوات والمكاتب اللازمة لبناء حزمة باستخدام مدير الحزم RPM.
ca: Conjunt mínim d'eines i biblioteques per construir paquets usant el gestor de paquets RPM.
cs: Základní skupina nástrojů a knihoven pro vytváření RPM balíčků.
da: Minimalt sæt af værktøjer og biblioteker til at bygge pakker som bruger RPM-pakkehåndteringen.
de: Mindestsatz an Werkzeugen und Bibliotheken für die Erstellung von Paketen mit dem RPM-Paketmanager.
es: Conjunto mínimo de herramientas y bibliotecas para la creación de paquetes utilizando el gestor de paquetes RPM.
fi: Työkalut ja kirjastot RPM-pakettien rakentamiseen RPM-pakettihallintaa käyttäen.
id: Set perkakas dan pustaka minimal untuk membangun paket menggunakan manajer paket RPM.
it: Insieme minimale di strumenti e librerie per la creazione di pacchetti usando il gestore dei pacchetti RPM.
pl: Minimalny zestaw programów i bibliotek potrzebnych do budowania pakietów za pomocą menedżera pakietów RPM.
pt_br: Conjunto mínimo de ferramentas e bibliotecas para a construção de pacotes usando o gerenciador de pacotes RPM.
ru: Минимальный набор инструментов и утилит для сборки пакетов с помощью менеджера пакетов RPM.
sl: Minimalen nabor orodij in knjižnic za gradnjo paketov z uporabo upravljalnika paketov RPM.
sv: Grundläggande samling verktyg för att bygga paket med RPM-pakethanteraren.
uk: Найменший набір засобів та утиліт для складання пакунків за допомогою менеджера пакунків RPM.

source: Web Development
ar: تطوير المواقع
ca: Desenvolupament WEB
cs: Webový vývoj
da: Webudvikling
de: Web-Entwicklung
es: Desarrollo web
fi: Verkkokehitys
id: Pengembangan Web
it: Sviluppo Web
pl: Programowanie dla sieci Web
pt_br: Desenvolvimento Web
ru: Web-разработка
sl: Spletni razvoj
sv: Webbutveckling
uk: Веб-розробка

source: Tools and libraries for Web application development.
ar: أدوات ومكاتب ﻻزمة لبرامج برمجة و تطوير المواقع.
ca: Eines i biblioteques per desenvolupar aplicacions Web.
cs: Nástroje a knihovny pro vývoj webových aplikací.
da: Værktøjer og biblioteker til udvikling af webprogram.
de: Werkzeuge und Bibliotheken für die Entwicklung von Webanwendungen.
es: Herramientas y bibliotecas para el desarrollo de aplicaciones web.
fi: Työkalut ja kirjastot Web-sovellusten kehittämiseen.
id: Perkakas dan pustaka untuk pengembangan aplikasi web.
it: Strumenti e librerie per lo sviluppo di applicazioni Web.
pl: Narzędzia i biblioteki do tworzenia programów na potrzeby Internetu.
pt_br: Ferramentas e bibliotecas para desenvolvimento de aplicativos Web.
ru: Инструменты и библиотеки для разработки веб-приложений.
sl: Orodja in knjižnice za razvoj spletnih strani in programov.
sv: Verktyg och bibliotek för webbprogramutveckling.
uk: Засоби та бібліотеки для розробки веб-програм.

source: Java Development
ar: برمجة الجافا
ca: Desenvolupament de Java
cs: Vývoj v jazyku Java
da: Java-udvikling
de: Java-Entwicklung
es: Desarrollo en Java
fi: Java-kehitys
id: Pengembangan Java
it: Sviluppo in Java
pl: Programowanie w języku Java
pt_br: Desenvolvimento em Java
ru: Разработка на Java
sl: Razvoj Java
sv: Javautveckling
uk: Розробка на Java

source: Tools and libraries for software development using the Java programming language.
ar: أدوات ومكاتب للبرمجة باستخدام لغة البرمجة جافا.
ca: Eines i biblioteques per al desenvolupament de programari que usen el llenguatge de programació Java.
cs: Nástroje a knihovny potřebné pro vývoj v jazyku Java.
da: Værktøjer og biblioteker til softwareudvikling ved brug af Java-programmeringssproget.
de: Werkzeuge und Bibliotheken für die Softwareentwicklung mit der Programmiersprache Java.
es: Herramientas y bibliotecas para el desarrollo de software que utilizan el lenguaje de programación Java.
fi: Työkalut ja kirjastot Java-pohjaiseen sovelluskehitykseen.
id: Perkakas dan pustaka untuk pengembangan perangkat lunak menggunakan bahasa pemrograman Java.
it: Strumenti e librerie per lo sviluppo di applicazioni nel linguaggio di programmazione Java.
pl: Narzędzia i biblioteki dla programistów używających języka Java.
pt_br: Ferramentas e bibliotecas para desenvolvimento de programas usando a linguagem de programação Java.
ru: Инструменты и библиотеки для разработки программ на языке программирования Java.
sl: Orodja in knjižnice za razvijanje programov z uporabo programskega jezika Java.
sv: Verktyg och bibliotek för mjukvaruutveckling med programeringsspråket Java.
uk: Засоби та бібліотеки для розробки програм на мові програмування Java.

source: .NET Development
ar: برمجة الدوت نيت
ca: Desenvolupament de .NET
cs: .NET vývoj
da: .NET-udvikling
de: .NET-Entwicklung
es: Desarrollo en .NET
fi: .NET-kehitys
id: Pengembangam .NET
it: Sviluppo in .NET
pl: Programowanie w języku .NET
pt_br: Desenvolvimento em .NET
ru: Разработка на .NET
sl: Razvoj .NET
sv: .NET-utveckling
uk: Розробка на .NET

source: Tools and libraries for .NET development using Mono.
ar: الأدوات والمكاتب اللازمة لبرمجة الدوت نيت(NET.) باستخدام المونو(Mono).
ca: Eines i biblioteques per al desenvolupament de .NET que usen Mono.
cs: Nástroje a knihovny potřebné pro vývoj v :NET pomocí Mono.
da: Værktøjer og biblioteker til .NET-udvikling ved brug af Mono.
de: Werkzeuge und Bibliotheken für die Entwicklung von .NET-Anwendungen unter Verwendung von Mono.
es: Herramientas y bibliotecas para el desarrollo en .NET utilizando Mono.
fi: Työkalut ja kirjastot NET-kehitykseen Monoa käyttäen.
id: Perkakas dan pustaka untuk pengembangan .NET menggunakan Mono.
it: Strumenti e librerie di sviluppo in .NET usando Mono.
pl: Narzędzia i biblioteki dla programistów .NET korzystające z technologii Mono.
pt_br: Ferramentas e bibliotecas para desenvolvimento .NET usando Mono.
ru: Инструменты и библиотеки для разработки на .NET с помощью Mono.
sl: Orodja in knjižnice za razvijanje .NET z uporabo ogrodja Mono.
sv: Verktyg och bibliotek för .NET-utveckling med Mono.
uk: Засоби та бібліотеки для розробки .NET за допомогою Mono.

source: Tools for Packaging with Open Build Service
ar: أدوات للتحزيم باستخدام خدمة البناء المفتوحة (Open Build Service)
ca: Eines per a l'empaquetament amb el Servei de construcció obert
cs: Nástroje pro tvorbu balíčků s Open Build Service
da: Værktøjer til pakning med Open Build Service
de: Tools zur Paketierung mit dem Open Build Service
es: Herramientas para empaquetado con Open Build Service
fi: Open Build Service -paketoinnin työkalut
id: Perkakas untuk Memaketkan dengan Open Build Service
it: Strumenti per creare pacchetti con l'Open Build Service
pl: Narzędzia do tworzenia pakietów w Open Build Service
pt_br: Ferramentas para empacotamento com o Open Build Service
ru: Инструменты создания пакетов с Open Build Service
sl: Orodja za izdelovanje paketov z Open Build Service
sv: Verktyg för paketering med Open Build Service
uk: Засоби створення пакунків із Open Build Service

source: Tools for checkouting, patching, building and testing package via osc.
ar: أدوات للتحقق من, تصحيح, بناء ,اختبار الحزم باستخدام osc.
ca: Eines per comprovar, apedaçar, construir i provar paquets a través de l'OSC.
cs: Nástroje kontroly, záplat, výstavby a testů balíčku pomocí osc.
da: Værktøjer til checkouting, fejlretning, bygning og test af pakke via osc.
de: Tools für Checkouts, Patches, Bauen und zum Testen von Paketen via osc.
es: Herramientas para comprobación, parcheado, compilación y testeo de paquetes mediante osc.
fi: Työkalut pakettien edentämiseen, korjaamiseen, koostamiseen ja testaamiseen OSC:llä.
id: Perkakas untuk checkout, menambal, membangun dan menguji paket melalui osc.
it: Strumenti per il recupero, la correzione e la compilazione dei sorgenti, nonché per la verifica dei pacchetti, tramite osc.
pl: Narzędzia do sprawdzania, łatania, budowania i testowania pakietów za pośrednictwem osc.
pt_br: Ferramentas para baixar, corrigir, compilar e testar pacotes via osc.
ru: Инструменты получения, исправления, сборки и тестирования пакета через osc.
sl: Orodja za prevzemanje, uveljavljanje popravkov, gradnjo in preizkušanje paketov z osc.
sv: Verktyg för att checka ut, patcha, bygga och testa paket via osc.
uk: Засоби перевірки, виправлення, збирання та тестування пакунків через osc.

source: Perl Development
ar: برمجة البيرل
ca: Desenvolupament de Perl
cs: Vývoj v Perlu
da: Perl-udvikling
de: Perl-Entwicklung
es: Desarrollo en Perl
fi: Perl-kehitys
id: Pengembangan Perl
it: Sviluppo in Perl
pl: Programowanie w języku Perl
pt_br: Desenvolvimento em Perl
ru: Разработка на Perl
sl: Razvoj Perl
sv: Perl-utveckling
uk: Розробка на Perl

source: Tools and libraries for software development using the Perl programming language.
ar: الأدوات والمكاتب اللازمة برمجة التطبيقات باستخدام لغة البرمجة بيرل.
ca: Eines i biblioteques per al desenvolupament de programari que usen el llenguatge de programació Perl.
cs: Nástroje a knihovny potřebné pro vývoj v jazyku Perl.
da: Værktøjer og biblioteker til softwareudvikling ved brug af Perl-programmeringssproget.
de: Werkzeuge und Bibliotheken für die Softwareentwicklung mit der Programmiersprache Perl.
es: Herramientas y bibliotecas para el desarrollo de software utilizando el lenguaje de programación Perl.
fi: Työkalut ja kirjastot Perl-pohjaiseen ohjelmistokehitykseen.
id: Perkakas dan pustaka untuk pengembangan perangkat lunak menggunakan bahasa pemrograman Perl.
it: Strumenti e librerie per lo sviluppo di applicazioni nel linguaggio di programmazione Perl.
pl: Narzędzia i biblioteki dla programistów używających języka Perl.
pt_br: Ferramentas e bibliotecas para desenvolvimento de programas usando a linguagem de programação Perl.
ru: Инструменты и библиотеки для разработки программ на языке программирования Perl.
sl: Orodja in knjižnice za razvijanje programov z uporabo programskega jezika Perl.
sv: Verktyg och bibliotek för mjukvaruutveckling med programeringsspråket Perl.
uk: Засоби та бібліотеки для розробки програм на мові програмування Perl.

source: Python 3 Developement
ar: برمجة البايثون 3
ca: Desenvolupament de Python 3
cs: Vývoj Python 3
da: Python 3-udvikling
de: Python 3 Entwicklung
es: Desarrollo en Python 3
fi: Python 3 ohjelmistokehitys
id: Pengembangan Python 3
it: Sviluppo in Python 3
pl: Rozwój Pythona 3
pt_br: Desenvolvimento em Python 3
ru: Разработка на Python 3
sl: Razvoj s Python 3
sv: Python 3 utveckling
uk: Розробка на Python 3

source: Ruby Development
ar: برمجة الروبي
ca: Desenvolupament de Ruby
cs: Vývoj v Ruby
da: Ruby-udvikling
de: Ruby-Entwicklung
es: Desarrollo en Ruby
fi: Ruby-kehitys
id: Pengembangan Ruby
it: Sviluppo in Ruby
pl: Programowanie w języku Ruby
pt_br: Desenvolvimento em Ruby
ru: Разработка на Ruby
sl: Razvoj z Ruby
sv: Ruby-utveckling
uk: Розробка на Ruby

source: Tools and libraries for software development using the Ruby programming language.
ar: الأدوات والمكاتب اللازمة لبرمجة التطبيقات باستخدام لغة البرمجة روبي.
ca: Eines i biblioteques per al desenvolupament de programari que usen el llenguatge de programació Ruby.
cs: Nástroje a knihovny potřebné pro vývoj v jazyku Ruby.
da: Værktøjer og biblioteker til softwareudvikling ved brug af Ruby-programmeringssproget.
de: Werkzeuge und Bibliotheken für die Softwareentwicklung mit der Programmiersprache Ruby.
es: Herramientas y bibliotecas para el desarrollo de software utilizando el lenguaje de programación Ruby.
fi: Työkalut ja kirjastot Ruby-pohjaiseen ohjelmistokehitykseen.
id: Perkakas dan pustaka untuk pengembangan perangkat lunak menggunakan bahasa pemrograman Ruby.
it: Strumenti e librerie per lo sviluppo di applicazioni nel linguaggio di programmazione Ruby.
pl: Narzędzia i biblioteki dla programistów używających języka Ruby.
pt_br: Ferramentas e bibliotecas para desenvolvimento de programas usando a linguagem de programação Ruby.
ru: Инструменты и библиотеки для разработки программ на языке программирования Ruby.
sl: Orodja in knjižnice za razvijanje programov z uporabo programskega jezika Ruby.
sv: Verktyg och bibliotek för mjukvaruutveckling med programeringsspråket Ruby.
uk: Засоби та бібліотеки для розробки програм на мові програмування Ruby..

source: Tcl/Tk Development
ar: التطوير باستخدام Tcl/Tk
ca: Desenvolupament de Tcl / Tk
cs: Vývojový systém Tcl/Tk
da: Tcl/Tk-udvikling
de: Tcl-/Tk-Entwicklung
es: Desarrollo en Tcl/Tk
fi: Tcl/Tk-kehitys
id: Pengembangan Tcl/Tk
it: Sviluppo in Tcl/Tk
pl: Programowanie w Tcl/Tk
pt_br: Desenvolvimento em Tcl/Tk
ru: Разработка на Tcl/Tk
sl: Razvoj s Tcl/Tk
sv: Utveckling för Tcl/Tk
uk: Розробка на Tcl/Tk

source: Tools and libraries for development using Tcl and Tk.
ar: أدوات ومكاتب للتطوير باستخدام Tcl و Tk.
ca: Eines i biblioteques per al desenvolupament que usen Tcl i Tk.
cs: Nástroje a knihovny potřebné pro vývoj v Tcl a Tk.
da: Værktøjer og biblioteker til udvikling ved brug af Tcl og Tk.
de: Werkzeuge und Bibliotheken für die Entwicklung unter Verwendung von Tcl und Tk.
es: Herramientas y bibliotecas para el desarrollo mediante Tcl y Tk.
fi: Työkalut ja kirjastot Tcl- ja Tk-pohjaiseen ohjelmistokehitykseen.
id: Perkakas dan pustaka untuk pengembangan menggunakan Tcl dan Tk.
it: Strumenti e librerie di sviluppo in Tcl e Tk.
pl: Narzędzia i biblioteki dla programistów korzystających z języka Tcl/Tk.
pt_br: Ferramentas e bibliotecas para desenvolvimento usando Tcl e Tk.
ru: Инструменты и библиотеки для разработки с помощью Tcl и Tk.
sl: Orodja in knjižnice za razvijanje programov z uporabo programskega jezika Tcl in naborom orodij Tk za grafične uporabniške vmesnike.
sv: Verktyg och bibliotek för utveckling av Tcl och Tk.
uk: Засоби та бібліотеки для розробки за допомогою Tcl і Tk.

source: Enlightenment
ar: التنوير
cs: Osvícení (enlightenment)
fi: Valaistus
pl: Oświecenie
ru: Среда Enlightenment

source: Enlightenment Window Manager and applications
ar: تنوير مدير النوافذ والتطبيقات
ca: Gestor de finestres i aplicacions de l'Enlightenment
cs: Správce oken Osvícení (enlightenment) a aplikace
da: Enlightenment-vindueshåndtering og -programmer
de: Enlightenment-Windowmanager und -Anwendungen
es: Gestor de ventanas Enlightenment y aplicaciones
fi: Enlightenment-ikkunaohjelma sovelluksineen
id: Jendela Manajer Enlightenment dan aplikasi
it: Gestore delle finestre e applicazioni di Enlightenment
pl: Menadżer okien Enlightment oraz aplikacje
pt_br: Gerenciador de janelas Enlightenment e aplicativos
ru: Менеджер окон Enlightenment и приложения
sl: Upravljalnik oken in programi Enlightenment
sv: Enlightenment fönsterhanterare och applikationer
uk: Менеджер вікон Enlightenment і програми

source: Games
ar: الألعاب
ca: Jocs
cs: Hry
da: Spil
de: Spiele
es: Juegos
fi: Pelit
id: Permainan
it: Giochi
pl: Gry
pt_br: Jogos
ru: Игры
sl: Igre
sv: Spel
uk: Ігри

source: A collection of games.
ar: مجموعة من الألعاب.
ca: Una col·lecció de jocs.
cs: Sada her.
da: En samling af spil.
de: Eine Sammlung von Spielen.
es: Colección de juegos.
fi: Kokoelma pelejä.
id: Koleksi permainan.
it: Una collezione di giochi.
pl: Zestaw gier.
pt_br: Uma coleção de jogos.
ru: Коллекция игр.
sl: Zbirka iger.
sv: En samling spel.
uk: Збірка ігор.

source: GNOME Development
ar: تطوير GNOME
ca: Desenvolupament del GNOME
cs: Vývoj GNOME
da: GNOME-udvikling
de: GNOME-Entwicklung
es: Desarrollo de GNOME
fi: GNOME-kehitys
id: Pengembangan GNOME
it: Sviluppo GNOME
pl: Programowanie GNOME
pt_br: Desenvolvimento do GNOME
ru: Разработка для GNOME
sl: Razvoj za okolje GNOME
sv: Gnome-utveckling
uk: Розробка для GNOME

source: GNOME development packages.
ar: حزم التطوير الخاصة بـGNOME.
ca: Paquets de desenvolupament del GNOME.
cs: Balíčky pro vývoj GNOME.
da: GNOME-udviklingspakker.
de: GNOME-Entwicklungspakete.
es: Paquetes de desarrollo de GNOME.
fi: GNOME-kehityspaketit.
id: Paket pengembangan GNOME.
it: Pacchetti per lo sviluppo GNOME.
pl: Pakiety GNOME dla programistów.
pt_br: Pacotes de desenvolvimento do GNOME.
ru: Пакеты разработки для GNOME.
sl: Razvojni paketi GNOME.
sv: Gnome-utvecklingspaket.
uk: Пакунки розробки для GNOME.

source: GNOME Games
ar: ألعاب GNOME
ca: Jocs del GNOME
cs: GNOME hry
da: GNOME-spil
de: GNOME-Spiele
es: Juegos de GNOME
fi: GNOME-pelit
id: Permainan GNOME
it: Giochi GNOME
pl: Gry GNOME
pt_br: Jogos do GNOME
ru: Игры для GNOME
sl: Igre GNOME
sv: Gnome-spel
uk: Ігри для GNOME

source: GNOME Integrated Development Environment
ar: بيئة التطوير المتكاملة GNOME
ca: Entorn de desenvolupament integrat del GNOME
cs: Integrované vývojové prostředí pro GNOME
da: GNOME integererede udviklingsmiljø
de: GNOME Integrierte Entwicklungsumgebung
es: Entorno de desarrollo integrado (IDE) de GNOME
fi: GNOME-ympäristön integroitu kehitysympäristö
id: Lingkungan Pengembangan Terpadu GNOME
it: Ambiente di sviluppo integrato GNOME
pl: Zintegrowane środowisko programistyczne dla GNOME
pt_br: Ambiente de desenvolvimento integrado do GNOME
ru: Интегрированная среда разработки GNOME
sl: GNOME-ovo enovito razvojno okolje
sv: Integrerad utvecklingsmiljö för Gnome
uk: Інтегроване середовище розробки GNOME

source: Development under GNOME
ar: البرمجة تحت بيئة GNOME
ca: Desenvolupament sota GNOME
cs: Vývoj v GNOME
da: Udvikling under GNOME
de: Entwicklung unter GNOME
es: Desarrollo en GNOME
fi: Kehitys GNOME-ympäristössä
id: Pengembangan di bawah GNOME
it: Sviluppo in GNOME
pl: Programowanie w środowisku GNOME
pt_br: Desenvolvimento no GNOME
ru: Разработка в GNOME
sl: Razvoj v GNOME
sv: Utveckling under Gnome
uk: Розробка в GNOME

source: GNOME Internet
ar: إنترنت GNOME
ca: Internet del GNOME
es: Internet de GNOME
id: Internet GNOME
it: Internet GNOME
pl: Internet GNOME
pt_br: Internet do GNOME
ru: Интернет для GNOME
sl: Internet GNOME
uk: Інтернет для GNOME

source: GNOME Internet Applications
ar: تطبيقات GNOME للانترنت
ca: Aplicacions d'Internet del GNOME
cs: GNOME internetové aplikace
da: GNOME-internetprogrammer
de: GNOME-Internetanwendungen
es: Aplicaciones de Internet de GNOME
fi: GNOME-internetsovellukset
id: Aplikasi Internet GNOME
it: Applicazioni per internet di GNOME
pl: Programy internetowe dla środowiska GNOME
pt_br: Aplicativos de Internet do GNOME
ru: Интернет-приложения для GNOME
sl: Internetni programi GNOME
sv: Gnome-Internetprogram
uk: Інтернет-програми для GNOME

source: GNOME Office
ar: مكتب جنوم
ca: Oficina del GNOME
cs: GNOME kancelář
da: GNOME-kontor
de: GNOME-Büroprogramme
es: Oficina de GNOME
fi: GNOME-toimisto
id: Perkantoran GNOME
it: GNOME per l'ufficio
pl: Biuro GNOME
pt_br: Suíte de escritório do GNOME
ru: Офис GNOME
sl: Pisarna GNOME
uk: Офіс GNOME

source: GNOME Utilities
ar: خدمات GNOME
ca: Utilitats del GNOME
cs: GNOME nástroje
da: GNOME-redskaber
de: GNOME-Dienstprogramme
es: Utilidades de GNOME
fi: GNOME-apuohjelmat
id: Utilitas GNOME
it: Utilità GNOME
pl: Narzędzia GNOME
pt_br: Utilitários do GNOME
ru: Инструменты GNOME
sl: Orodja GNOME
sv: Gnome-verktyg
uk: Утиліти GNOME

source: YaST GNOME User Interfaces
ar: YaST واجه مستخدم جنوم
ca: Interfícies d'usuari del YaST per al GNOME
cs: YaST GNOME uživatelského rozhraní
da: YaST GNOME-brugergrænseflader
de: GNOME-Benutzeroberflächen für YaST
es: Interfaces de usuario para GNOME de YaST
fi: YaST GNOME -käyttöliittymä
id: Antarmuka Pengguna GNOME YaST
it: Interfacce utente GNOME per YaST
pl: Interfejs środowiska GNOME dla programu YaST
pt_br: Interfaces YaST do GNOME
ru: Интерфейс пользователя YaST для GNOME
sl: YaST-ov uporabniški vmesnik GNOME
sv: YaST Gnome-användargränssnitt
uk: Інтерфейс користувача YaST для GNOME

source: Graphical YaST user interfaces for the GNOME desktop.
ar: واجه YaST الرسومية لسطح المكتب جنوم.
ca: Interfícies gràfiques d'usuari del YaST per a l'escriptori GNOME.
cs: Grafické rozhraní programu YaST pro GNOME.
da: Grafiske YaST-brugergrænseflader til GNOME-skrivebordet.
de: Grafische YaST-Benutzeroberfläche für den GNOME-Desktop.
es: Interfaces de usuario gráficas de YaST para el escritorio GNOME.
fi: YaST-ohjelman graafinen käyttöliittymä GNOME-työpöytäympäristöön.
id: Antarmuka pengguna YaST grafis untuk destop GNOME.
it: Interfacce utente grafiche di YaST per il desktop GNOME.
pl: Interfejs graficzny programu YaST dla środowiska GNOME.
pt_br: Interface gráfica YaST para a área de trabalho GNOME.
ru: Графический интерфейс пользователя YaST для рабочего стола GNOME.
sl: YaST-ov grafični uporabniški vmesnik za namizje GNOME.
sv: Grafiskt YaST-användargränssnitt för GNOME-skrivbordet.
uk: Графічний інтерфейс користувача YaST для стільниці GNOME.

source: Package Management - Graphical Tools for GNOME
ar: إدارة التطبيقات - الأدوات الرسومية لجنوم
ca: Gestor de paquets - Eines gràfiques per al GNOME
cs: Správa balíčků - grafické nástroje pro GNOME
da: Pakkehåndtering - Grafiske værktøjer til GNOME
de: Paketverwaltung - Grafische Werkzeuge für GNOME
es: Gestión de paquetes - Herramientas gráficas para GNOME
fi: Pakettihallinta - Graafiset työkalut GNOME-työpöytäjärjestelmälle
id: Manajemen Paket - Perkakas Grafis untuk GNOME
it: Gestione pacchetti - Strumenti grafici per GNOME
pl: Zarządzanie pakietami - narzędzia graficzne dla środowiska GNOME
pt_br: Gerenciamento de pacotes - ferramentas gráficas para o GNOME
ru: Управление пакетами — графические инструменты для GNOME
sl: Upravljanje paketov – grafična orodja za GNOME
sv: Pakethantering - Grafiska verktyg för Gnome
uk: Управління пакунками — графічні засоби для GNOME
