Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: OpenStack - All
ar: OpenStack - الكل
ca: OpenStack - Tot
cs: OpenStack – vše
da: OpenStack - Alle
de: OpenStack – Alle
es: OpenStack - Todo
fi: OpenStack - Kaikki
id: OpenStack - Semua
it: OpenStack - Tutti
pl: OpenStack - wszystkie
pt_br: OpenStack - Tudo
ru: OpenStack — все
sl: OpenStack – vse
sv: OpenStack - Alla
uk: OpenStack - Всі

source: This pattern installs all OpenStack command line interface tools, instance initialization packages and tools to communicate with the cloud framework from within a running instance. It is not recommended to install this pattern, but instead install one of the use-case specific patterns (e.g. OpenStack - Tools).
ar: يعمل هذا النمط على تثبيت أدوات واجهة سطر أوامر OpenStack وحزم تهيئة المثيل وأدوات الاتصال بإطار عمل السحابة من داخل مثيل قيد التشغيل. لا يوصى بتثبيت هذا النمط، ولكن يوصى بدلاً من ذلك بتثبيت أحد الأنماط المخصصة للاستخدام حسب الحالة (على سبيل المثال، OpenStack - الأدوات).
ca: Aquest patró instal·la totes les eines d’interfície de línia d’ordres d'OpenStack, paquets d’inicialització d’instàncies i eines per comunicar-se amb el marc del núvol des d’una instància en execució. No es recomana instal·lar aquest patró, sinó instal·lar un dels patrons específics del cas d’ús (per exemple, OpenStack - Eines).
cs: Tento vzor nainstaluje z OpenStack všechny nástroje rozhraní příkazového řádku, všechny balíčky pro incializaci instancí a všechny nástroje pro komunikaci s cloudovou architekturou z běžící instance. Nedoporučujeme instalovat přímo tento vzor, nýbrž jeden ze vzorů pro konkrétní požadovaný případ použití (např. OpenStack – nástroje).
da: Mønsteret installerer alle kommandolinjegrænseflade-værktøjer for OpenStack, instans-initieringspakker og værktøjer til at kommunikere med sky-frameworket indefra en kørende instans. Det anbefales ikke at installere mønsteret, men i stedet installere en af de specifikke mønstre til bestemte formål (f.eks. OpenStack - Værktøjer).
de: Dieses Schema installiert alle OpenStack-Kommandozeilentools, Pakete zur Instanzinitialisierung und Tools zur Kommunikation mit dem Cloud-Framework innerhalb einer ausgeführten Instanz. Es wird empfohlen, statt dieses Schemas eines der Schemata für spezifische Anwendungsfälle (z. B. OpenStack – Tools) zu installieren.
es: Este patrón instala todas las herramientas de interfaz de línea de comandos de OpenStack, los paquetes de inicialización de la instancia y las herramientas para comunicarse con la estructura de nube en una instancia en ejecución. No se recomienda instalar este patrón, pero sí uno de los patrones específicos de caso de uso (por ejemplo, OpenStack - Herramientas).
id: Pola ini memasang semua perkakas antarmuka baris perintah OpenStack, paket inisialisasi instance, dan perkakas untuk berkomunikasi dengan kerangka kerja cloud dari dalam instance yang sedang berjalan. Tidak disarankan untuk memasang pola ini, tetapi sebaliknya memasang salah satu pola spesifik kasus penggunaan (mis. OpenStack - Tools).
it: Questo modello consente di installare tutti gli strumenti dell'interfaccia della riga di comando di OpenStack, i pacchetti di inizializzazione delle istanze e gli strumenti per comunicare con l'infrastruttura cloud in un'istanza in esecuzione. Si sconsiglia di installare questo modello, optare invece per l'installazione di uno dei modelli specifici per i casi di utilizzo (ad esempio OpenStack - Strumenti).
pl: Ten wzorzec służy do instalowania wszystkich narzędzi interfejsu wiersza poleceń usług OpenStack, pakietów inicjalizacji instancji, a także narzędzi służących do komunikacji ze środowiskiem chmury z poziomu uruchomionej instancji. Instalowanie tego pakietu nie jest zalecane. Zamiast tego zaleca się instalację jednego ze wzorców specyficznych dla konkretnego przypadku użycia (np. OpenStack - narzędzia).
pt_br: Este padrão instala as ferramentas de interface de linha de comando do OpenStack, os pacotes de inicialização de instância e as ferramentas para comunicação com a estrutura de nuvem de uma instância em execução. Não é recomendado instalar esse padrão. Em vez dele, instale um dos padrões específicos do caso de uso (ex. OpenStack - Ferramentas).
ru: Этот шаблон устанавливает все инструменты интерфейса командной строки OpenStack, пакеты инициалиации экземпляров и инструменты для обмена данными с облачной средой в запущенном экземпляре. Вместо установки этого шаблона рекомендуется установить шаблон, соответствующий конкретной области применения (например, «OpenStack — инструменты».
sl: Ta vzorec namesti vsa orodja OpenStack za ukazno vrstico, pakete za pripravljanje primerkov in orodja za komunikacijo z oblačnim ogrodjem iz zagnanega primerka. Tega vzorca ni priporočljivo namestiti. Raje namestite enega od vzorcev za specifičen primer uporabe (npr. OpenStack – orodja).
sv: Detta mönster installerar alla kommandoradsverktyg för OpenStack, paket för instansinitiering och verktyg för att kommunicera med molnramverket från en instans som körs. Det rekommenderas inte att du installerar detta mönster. Installera istället ett av de användarfallspecifika mönstren (t.ex. OpenStack - Verktyg).
uk: Цей шаблон встановлює всі інструменти інтерфейсу командного рядка OpenStack, пакунки ініціалізації примірників та інструменти для зв’язку із хмарним фреймворком всередині запущеного примірника. Не рекомендовано встановлювати цей шаблон, натомість встановіть один із конкретних шаблонів використання (наприклад, OpenStack – Інструменти).

source: OpenStack - Instance Initialization
ar: OpenStack - تهيئة المثيل
ca: OpenStack - Inicialització de la instància
cs: OpenStack – inicializace instancí
da: OpenStack - Instansinitialisering
de: OpenStack – Instanzinitialisierung
es: OpenStack - Inicialización de la instancia
id: OpenStack - Inisialisasi Instance
it: OpenStack - Inizializzazione delle istanze
pl: OpenStack - inicjalizacja instancji
pt_br: OpenStack - Inicialização de Instância
ru: OpenStack — инициализация экземпляров
sl: OpenStack – pripravljanje primerkov
sv: OpenStack - Instansinitiering
uk: OpenStack - Ініціалізація примірника

source: This pattern installs the OpenStack instance initialization packages which support the provisioning and running of instances in the cloud framework (e.g. cloud-init).
ar: يعمل هذا النمط على تثبيت حزم تهيئة مثيل OpenStack والتي تدعم توفير المثيلات وتشغيلها في إطار عمل السحابة (على سبيل المثال، cloud-init).
ca: Aquest patró instal·la els paquets d’inicialització d’instàncies d’OpenStack que admeten el subministrament i l’execució d’instàncies al marc del núvol (per exemple, cloud-init).
cs: Tento vzor nainstaluje všechny balíčky pro inicializaci instancí OpenStack, které podporují zřizování a spouštění instancí v cloudové architektuře (např. cloud-init).
da: Mønsteret installerer initieringspakker for OpenStack-instansen som understøtter klargøring og kørslen af instanser i sky-frameworket (f.eks. cloud-init).
de: Dieses Schema installiert die Pakete zur OpenStack-Instanzinitialisierung, die die Bereitstellung und Ausführung von Instanzen im Cloud-Framework unterstützen (z. B. cloud-init).
es: Este patrón instala los paquetes de inicialización de la instancia de OpenStack con compatibilidad para el aprovisionamiento y la ejecución de instancias en la estructura de nube (por ejemplo, cloud-init).
id: Pola ini memasang paket inisialisasi instance OpenStack yang mendukung penyediaan dan menjalankan instance dalam kerangka kerja cloud (mis. cloud-init).
it: Questo modello consente di installare i pacchetti di inizializzazione delle istanze di OpenStack che supportano il provisioning e l'esecuzione delle istanze nell'infrastruttura cloud (ad esempio cloud-init).
pl: Ten wzorzec służy do instalowania pakietów inicjalizacji instancji OpenStack, które obsługują zaopatrywanie i uruchamianie instancji w środowisku chmury (np. cloud-init).
pt_br: Este padrão instala os pacotes de inicialização de instância do OpenStack, que suportam o aprovisionamento e a execução de instâncias na estrutura de nuvem (ex. cloud-init).
ru: Этот шаблон устанавливает пакеты для инициализации экземпляров OpenStack для подготовки и запуска экземпляров на облачной платформе (например, cloud-init).
sl: Ta vzorec namesti pakete za pripravljanje primerkov OpenStack, ki podpirajo oskrbovanje in poganjanje primerkov v ogrodju oblaka (npr. cloud-init).
sv: Detta mönster installerar paket för instansinitiering för OpenStack som stöder tilldelning och körning av instanser i molnramverket (t.ex. cloud-init).
uk: Цей шаблон встановлює пакунки ініціалізації примірника OpenStack, які підтримують надання та запуск примірника у хмарному фреймворку (наприклад, cloud-init).

source: OpenStack - Instance Tools
ar: OpenStack - أدوات المثيل
ca: OpenStack - Eines d'instància
cs: OpenStack – nástroje instancí
da: OpenStack - Instansværktøjer
de: OpenStack – Instanztools
es: OpenStack - Herramientas de la instancia
id: OpenStack - Perkakas Instance
it: OpenStack - Strumenti per istanze
pl: OpenStack - narzędzia do obsługi instancji
pt_br: OpenStack - Ferramentas de Instância
ru: OpenStack — инструменты экземпляров
sl: OpenStack – orodja za primerke
sv: OpenStack - Instansverktyg
uk: OpenStack - Інструменти примірника

source: This pattern install the OpenStack instance specific tools which are used to collect instance metadata.
ar: يعمل هذا النمط على تثبيت الأدوات الخاصة بمثيل OpenStack والتي يتم استخدامها لجمع بيانات تعريف المثيل.
ca: Aquest patró instal·la les eines específiques de la instància d'OpenStack que s'utilitzen per recopilar metadades de la instància.
cs: Tento vzor nainstaluje nástroje specifické pro instanci OpenStack, které se používají ke sběru metadat instance.
da: Mønsteret installerer specifikke værktøjer til OpenStack-instansen som bruges til at indsamle instans-metadata.
de: Dieses Schema installiert die instanzspezifischen OpenStack-Tools, die zur Erfassung von Instanzmetadaten dienen.
es: Este patrón instala las herramientas específicas de la instancia de OpenStack que se usan para recopilar metadatos de instancia.
id: Pola ini memasang perkakas spesifik instance OpenStack yang digunakan untuk mengumpulkan metadata instance.
it: Questo modello consente di installare gli strumenti specifici per le istanze di OpenStack che vengono utilizzati per raccogliere metadati delle istanze.
pl: Ten wzorzec służy do instalowania specyficznych dla instancji OpenStack narzędzi, które są używane do gromadzenia metadanych instancji.
pt_br: Este padrão instala as ferramentas específicas de instância do OpenStack, que são usadas para coletar metadados de instância.
ru: Этот шаблон устанавливает инструменты для работы с экземплярами OpenStack, используемые для сбора метаданных экземпляров.
sl: Ta vzorec namesti orodja specifična za primerke OpenStack, ki se uporabljajo za zbiranje metapodatkov primerkov.
sv: Detta mönster installerar instansspecifika verktyg för OpenStack som används för att samla in instansmetadata.
uk: Цей шаблон встановлює спеціальні інструменти OpenStack, які використовуються для збору метаданих примірника.

source: OpenStack - Tools
ar: OpenStack - الأدوات
ca: OpenStack - Eines
cs: OpenStack – nástroje
da: OpenStack - Værktøjer
es: OpenStack - Herramientas
fi: OpenStack - Työkalut
id: OpenStack - Perkakas
it: OpenStack - Strumenti
pl: OpenStack - narzędzia
pt_br: OpenStack - Ferramentas
ru: OpenStack — инструменты
sl: OpenStack – orodja
sv: OpenStack - Verktyg
uk: OpenStack - Інструменти

source: This pattern installs the OpenStack command line interface tools to communicate with the cloud framework (e.g. python-susepubliccloudinfo).
ar: يعمل هذا النمط على تثبيت أدوات واجهة سطر أوامر OpenStack للاتصال بإطار عمل السحابة (على سبيل المثال، python-susepubliccloudinfo).
ca: Aquest patró instal·la les eines d’interfície de línia d’ordres d'OpenStack per comunicar-se amb el marc del núvol (per exemple, python-susepubliccloudinfo).
cs: Tento vzor nainstaluje nástroje rozhraní příkazového řádku OpenStack na komunikaci s cloudovou architekturou (např. python-susepubliccloudinfo).
da: Mønsteret installerer kommandolinjegrænsflade-værktøjer for OpenStack til at kommunikere med sky-frameworket (f.eks. python-susepubliccloudinfo).
de: Dieses Schema installiert OpenStack-Kommandozeilentools zur Kommunikation mit dem Cloud-Framework (z. B. python-susepubliccloudinfo).
es: Este patrón instala las herramientas de interfaz de línea de comandos de OpenStack para comunicarse con la estructura de nube (por ejemplo, python-susepubliccloudinfo).
id: Pola ini memasang perkakas antarmuka baris perintah OpenStack untuk berkomunikasi dengan kerangka kerja cloud (mis. python-susepubliccloudinfo).
it: Questo modello consente di installare gli strumenti dell'interfaccia della riga di comando di OpenStack per comunicare con l'infrastruttura cloud (ad esempio python-susepubliccloudinfo).
pl: Ten wzorzec służy do instalowania narzędzi interfejsu wiersza poleceń usług OpenStack używanych do komunikacji ze środowiskiem chmury (np. python-susepubliccloudinfo).
pt_br: Este padrão instala as ferramentas de interface de linha de comando do OpenStack para comunicação com a estrutura de nuvem (e.g. python-susepubliccloudinfo).
ru: Этот шаблон устанавливает инструменты интерфейса командной строки OpenStack для обмена данными с облачной платформой (например, python-susepubliccloudinfo).
sl: Ta vzorec namesti orodja OpenStack za ukazno vrstico, ki omogočajo komunikacijo z oblačnim ogrodjem (npr. python-susepubliccloudinfo).
sv: Detta mönster installerar kommandoradsverktyg för OpenStack för att kommunicera med molnramverket (t.ex. python-susepubliccloudinfo).
uk: Цей шаблон встановлює інструменти інтерфейсу командного рядка OpenStack для зв’язку із хмарним фреймворком (наприклад, python-susepubliccloudinfo).

source: SAP BusinessOne Server Base
ar: قاعدة خادم SAP BusinessOne
ca: Servidor de base SAP BusinessOne
cs: Základ pro SAP BusinessOne Server
da: SAP BusinessOne-server grundlæggende
de: SAP BusinessOne-Serverbasis
es: Base del servidor de SAP BusinessOne
fi: SAP BusinessOne -palvelinpohja
id: Dasar Peladen SAP Business One
it: Base del server SAP BusinessOne
pl: Baza serwera SAP BusinessOne
pt_br: Servidor base SAP BusinessOne
ru: Базовый сервер SAP BusinessOne
sl: Osnova strežnika SAP BusinessOne
sv: SAP BusinessOne-serverbas
uk: Базовий сервер SAP BusinessOne

source: Set up the server for installing SAP BusinessOne systems.
ar: إعداد الخادم لتثبيت أنظمة SAP BusinessOne.
ca: Configureu el servidor per instal·lar sistemes SAP BusinessOne.
cs: Příprava serveru pro instalaci systémů SAP BusinessOne.
da: Opsæt serveren til installation af SAP BusinessOne-systemer.
de: Richten Sie den Server für die Installation von SAP BusinessOne-Systemen ein.
es: Configurar el servidor para instalar sistemas SAP BusinessOne.
fi: Määritä palvelin SAP BusinessOne -järjestelmien asentamista varten.
id: Siapkan peladen untuk memasang sistem SAP BusinessOne.
it: Imposta il server per l'installazione dei sistemi SAP BusinessOne.
pl: Konfiguracja serwera do instalowania systemów SAP BusinessOne.
pt_br: Configure o servidor para instalar os sistemas SAP BusinessOne.
ru: Настройка сервера для установки систем SAP BusinessOne.
sl: Nastavitve strežnika za nameščanje sistemov SAP BusinessOne.
sv: Konfigurera servern för att installera SAP BusinessOne-system.
uk: Налаштування серверу для встановлення систем SAP BusinessOne.

source: SAP HANA Server Base
ar: قاعدة خادم SAP HANA
ca: Base de servidor SAP HANA
cs: Základ pro SAP HANA Server
da: SAP HANA-server grundlæggende
de: SAP HANA-Serverbasis
es: Base del servidor de SAP HANA
fi: SAP HANA -palvelinpohja
id: Dasar Peladen SAP HANA
it: Base del server SAP HANA
pl: Baza serwera SAP HANA
pt_br: Servidor base SAP HANA
ru: Базовый сервер SAP HANA
sl: Osnova strežnika SAP HANA
sv: SAP HANA-serverbas
uk: Базовий сервер SAP HANA

source: Set up the server for installing SAP HANA systems.
ar: إعداد الخادم لتثبيت أنظمة SAP HANA.
ca: Configura el servidor per instal·lar els sistemes SAP HANA.
cs: Příprava serveru pro instalaci systémů SAP HANA.
da: Opsæt serveren til installation af SAP HANA-systemer.
de: Richten Sie den Server für die Installation von SAP HANA-Systemen ein.
es: Configurar el servidor para instalar sistemas SAP HANA.
fi: Määritä palvelin SAP HANA -järjestelmien asentamiseen.
id: Siapkan peladen untuk memasang sistem SAP HANA.
it: Imposta il server per l'installazione dei sistemi SAP HANA.
pl: Konfiguracja serwera do instalowania systemów SAP HANA.
pt_br: Configure o servidor para instalar sistemas SAP HANA.
ru: Настройка сервера для установки систем SAP HANA.
sl: Nastavitve strežnika za nameščanje sistemov SAP HANA.
sv: Konfigurera servern för att installera SAP HANA-system.
uk: Налаштування серверу для встановлення систем SAP HANA.

source: SAP NetWeaver Server Base
ar: قاعدة خادم SAP NetWeaver
ca: Base de servidor SAP NetWeaver
cs: Základ pro SAP NetWeaver Server
da: SAP NetWeaver-server grundlæggende
de: SAP NetWeaver-Serverbasis
es: Base del servidor de aplicaciones SAP NetWeaver
fi: SAP NetWeaver -palvelinpohja
id: Dasar Peladen SAP NetWeaver
it: Base del server SAP NetWeaver
pl: Baza serwera SAP NetWeaver
pt_br: Servidor base SAP NetWeaver
ru: Базовый сервер SAP NetWeaver
sl: Osnova strežnika SAP NetWeaver
sv: SAP NetWeaver-serverbas
uk: Базовий сервер SAP NetWeaver

source: Set up the server for installing SAP NetWeaver systems.
ar: إعداد الخادم لتثبيت أنظمة SAP NetWeaver.
ca: Configura el servidor per instal·lar els sistemes SAP NetWeaver.
cs: Příprava serveru pro instalaci systémů SAP NetWeaver.
da: Opsæt serveren til installation af SAP NetWeaver-systemer.
de: Richten Sie den Server für die Installation von SAP NetWeaver-Systemen ein.
es: Configurar el servidor para instalar sistemas SAP NetWeaver.
fi: Määritä palvelin SAP NetWeaver -järjestelmien asentamiseen.
id: Siapkan peladen untuk memasang sistem SAP NetWeaver.
it: Imposta il server per l'installazione dei sistemi SAP NetWeaver.
pl: Konfiguracja serwera do instalowania systemów SAP NetWeaver.
pt_br: Configure o servidor para instalar sistemas SAP NetWeaver.
ru: Настройка сервера для установки систем SAP NetWeaver.
sl: Nastavitve strežnika za nameščanje sistemov SAP NetWeaver.
sv: Konfigurera servern för att installera SAP NetWeaver-system.
uk: Налаштування серверу для встановлення систем SAP NetWeaver.

source: Tools and scripts for Common Criteria
ca: Eines i scripts per als criteris comuns
cs: Nástroje a skripty pro Obecná kritéria
de: Tools und Skripte für Common Criteria
es: Herramientas y guiones para criterios comunes
id: Perkakas dan skrip untuk Kriteria Umum
it: Strumenti e script per Common Criteria
pl: Narzędzia i skrypty dla Common Criteria
pt_br: Ferramentas e scripts para critérios comuns
ru: Инструменты и скрипты для Common Criteria
sl: Orodja in skripti za Common Criteria
sv: Verktyg och skripts för Common Criteria
uk: Інструменти та сценарії для Common Criteria

source: Infiniband (OFED)
ca: Infinibanda (OFED)
pl: Nieskończoność (OFED)
ru: Infinibаnd (OFED)

source: This pattern defines the OpenFabrics Enterprise Distribution (OFED) software base packages. The base pattern includes the packages you need to get your Infiniband adapter operational, that is IB kernel modules and basic user level libraries.
ar: يعمل هذا النمط على تعريف الحزم الرئيسية لبرنامج ‎‏OpenFabrics Enterprise Distribution (OFED)‎. يتضمن النمط الأساسي الحزم اللتي تحتاجها لتشغيل محوّل Infiniband، وهي وحدات نواة نمطية ل IB(Infiniband) ومكتبات مستوى المستخدم الأساسية.
ca: Aquest patró defineix els paquets de programari de base d'OpenFabrics Enterprise Distribution (OFED). El patró base inclou els paquets que necessiteu per fer funcionar l'adaptador Infiniband, és a dir, mòduls del nucli IB i biblioteques bàsiques de nivell d'usuari.
cs: Tento profil obsahuje balíčky založené na OpenFabrics Enterprise Distribution (OFED). Základní profil obsahuje IB moduly jádra a základní uživatelské knihovny.
da: Dette mønster definerer OpenFabrics Enterprise Distribution-softwaren (OFED) grundlæggende-pakker. Det grændlæggende mønster inkluderer de pakker som du har brug for til at få din Infiniband-adapter til at virke, altså IB-kernemoduler og grundlæggende brugerniveau-biblioteker.
de: Dieses Schemata beinhaltet die Basispakete der OpenFabrics Enterprise Distribution (OFED) Software. Das Basis-Schemata beinhaltet die Pakete die Sie benötigen um ihren Infiniband-Adapter zum laufen zu bringen: Die IB Kernel-Module und einfache Benutzerbibliotheken.
es: Este patrón define los paquetes de software base de OpenFabrics Enterprise Distribution (OFED). Incluye los paquetes necesitados para tener el adaptador Infiniband operacional, que son el IB módulos del kernel y bibliotecas básicas de nivel de usuario.
fi: Tämä ohjelmistoryhmä määrittää OpenFabrics Enterprise Distribution (OFED) -ohjelmiston peruspaketit. Perusohjelmistoryhmä sisältää paketit, joita tarvitset saadaksesi Infiniband-sovittimen toimintaan, nämä ovat IB ytimen moduuli ja peruskäyttäjätason kirjastot.
id: Pola ini mendefinisikan paket dasar perangkat lunak OpenFabrics Enterprise Distribution (OFED). Pola dasar mencakup paket yang Anda butuhkan untuk mendapatkan operasional adaptor Infiniband Anda, yaitu modul kernel IB dan library tingkat pengguna dasar.
it: Questo modello definisce i pacchetti dei programmi di base di OpenFabrics Enterprise Distribution (OFED). Il modello base include i pacchetti necessari per rendere funzionante l'adattatori Infiniband, cioè il modulo IB del kernel e le librerie di base a livello utente.
pl: Ten wzorzec definiuje podstawowe pakiety dla systemu OpenFabrics Enterprise Distribution (OFED). Zawarte są w nim podstawowe pakiety - moduły jądra IB i podstawowe biblioteki po stronie użytkownika, które umożliwiają uruchomienie adaptera Infiniband.
pt_br: Este padrão define os pacotes básicos da OpenFabrics Enterprise Distribution (OFED). O padrão básico inclui pacotes necessários para tornar seu adaptador InfiniBand operacional, que são módulos IB para o núcleo e bibliotecas básicas no nível de usuário.
ru: В этом шаблоне определены пакеты базового ПО OpenFabrics Enterprise Distribution (OFED). Этот базовый шаблон содержит пакеты, которые необходимы для запуска адаптера Infiniband, т. е. модули ядра IB и основные библиотеки уровня пользователя.
sl: Ta vzorec določa osnovne pakete za OpenFabrics Enterprise Distribution (OFED). Sem so vključeni paketi, ki so potrebni za delovanje vmesnika Infiniband, to pomeni module za jedro in osnovne uporabniške knjižnice.
sv: Med det här mönstret definieras paketen för programvarubasen OFED (OpenFabrics Enterprise Distribution). Basmönstret innehåller paketen som krävs för att använda Infiniband-adaptern, det vill säga IB-kärnmoduler och grundläggande bibliotek på användarnivå.
uk: Цей шаблон визначає базові пакунки ПЗ OFED (OpenFabrics Enterprise Distribution). Базовий шаблон містить пакунки, які потрібні для функціонування адаптера Infiniband, тобто модулі ядра IB і основні бібліотеки користувацького рівня.

source: The 32bit pattern complementing ofed.
ar: نمط 32bit المكمّل ل ofed.
ca: El patró de 32 bits que completa ofed.
cs: 32bitový vzor doplňující ofed.
da: 32-bit-mønsteret som komplimenterer ofed.
de: Das 32-Bit-Schema zur Ergänzung von ofed.
es: El patrón de 32 bits que complementa a ofed.
id: Pola 32bit melengkapi ofed.
it: Modello a 32 bit complementare a ofed.
pl: 32-bitowy wzorzec uzupełniający system OFED.
pt_br: O padrão de 32 bits que complementa ofed.
ru: Этот 32-разрядный шаблон дополняет ofed.
sl: 32-bitni vzorec, ki dopolnjuje ofed.
sv: 32-bitarsmönster som kompletterar ofed.
uk: 32-бітовий шаблон, який доповнює ofed.
