Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: This pattern installs the default container runtime packages for non-clustered systems.
ca: Aquest patró instal·la els paquets per defecte de l'entorn d'execució de contenidor per a sistemes sense clúster.
cs: Tato předloha instaluje výchozí kontejner spustitelných programů pro systémy neběžící v clusteru.
da: Dette mønster installerer standardpakkerne for container-runtime til systemer ikke i cluster.
de: Dieses Schema installiert die standardmäßigen Container-Laufzeitpakete für nicht geclusterte Systeme.
es: Este patrón instala los paquetes del entorno de ejecución del contenedor por defecto para sistemas no agrupados en clústeres.
fi: Tämä malli asentaa oletusarvoiset kontin ajettavat paketit ei-klusteroituja järjestelmiä varten.
id: Pola ini memasang paket runtime kontainer bawaan untuk sistem non-cluster.
it: Questo modello installa i pacchetti di default del runtime del container per i sistemi non in cluster.
pl: Ten wzorzec instaluje domyślne pakiety środowiska uruchomieniowego kontenera dla systemów nieklastrowanych.
pt_br: Este padrão instala os pacotes de tempo de execução do contêiner padrão para sistemas não cluster.
ru: Этот шаблон устанавливает пакеты по умолчанию среды выполнения контейнеров для бескластерных систем.
sl: Ta vzorec namesti privzete pakete izvajalnega okolja za vsebnike za sisteme, ki niso v gručah.
sv: Detta mönster installerar standardbehållar körtidspaketen för icke-klustrade system.
uk: Цей шаблон встановлює типове контейнерне середовище для безкластерних систем.

source: Container Runtime for kubernetes clustered systems
ca: Entorn d'execució de contenidor per a sistemes amb clúster de kubernetes
cs: Kontejner spustitelných programů pro systémy běžící v clusteru kubernet
da: Container-runtime til kubernetes-systemer i cluster
de: Container Laufzeit für Kubernetes-geclusterte Systeme
es: Entorno de ejecución del contenedor para sistemas agrupados kubernetes
fi: Kontin ajopaketit kubernetes klusteroituja järjestelmiä varten
id: Runtime Kontainer untuk sistem cluster kubernetes
it: Runtime del container per sistemi in cluster Kubernetes
pl: Container Runtime dla systemów klastrowych Kubernetes
pt_br: Tempo de execução do contêiner para sistemas em cluster kubernetes
ru: Среда выполнения контейнеров для кластерных систем kubernetes
sl: Izvajalno okolje za Kubernetes za sisteme v gručah
sv: Behållar körtid för kubernetes klustrade system
uk: Контейнерне середовище для кластерних систем kubernetes

source: This pattern installs the default container runtime packages for kubernetes clustered systems.
ca: Aquest patró instal·la els paquets per defecte de l'entorn d'execució de contenidor per a sistemes amb clúster de kubernetes.
cs: Tato předloha instaluje výchozí kontejner spustitelných programů pro systémy běžící v clusteru kubernet.
da: Dette mønster installerer standardpakkerne for container-runtime til kubernetes-systemer i cluster.
de: Dieses Schema installiert die standardmäßigen Container-Laufzeitpakete für Kubernetes Cluster-Systeme.
es: Este patrón instala los paquetes para el entorno de ejecución del contenedor predeterminado para sistemas agrupados kubernetes.
fi: Tämä malli asentaa oletusarvoiset kontin ajettavat paketit kubernetes klusteroituihin järjestelmiin.
id: Pola ini memasang paket runtime kontainer bawaan untuk sistem cluster kubernetes.
it: Questo modello installa i pacchetti di default del runtime del container per i sistemi in cluster Kubernetes.
pl: Ten wzorzec instaluje domyślne pakiety środowiska uruchomieniowego kontenera dla systemów klastrowanych Kubernetes.
pt_br: Este padrão instala os pacotes de tempo de execução do contêiner padrão para sistemas em cluster kubernetes.
ru: Этот шаблон устанавливает пакеты по умолчанию среды выполнения контейнеров для кластерных систем kubernetes.
sl: Ta vzorec namesti privzete pakete izvajalnega okolja za sisteme Kubernetes, ki so v gručah.
sv: Detta mönster installerar standardbehållar körtidpaketen för kubernetes-klustrade system.
uk: Цей шаблон встановлює типове контейнерне середовище для кластерних систем kubernetes.

source: Kubernetes kubeadm Stack
ca: Pila de kubeadm de Kubernetes
cs: Zásobník Kubernetes kubeadm
es: Pila de kubeadm de Kubernetes
fi: Kubernetes kubeadm pino
it: Stack kubeadm Kubernetes
pl: Kubernetes kubeadm Stos
pt_br: Pilha do kubeadm do Kubernetes
ru: Стек kubeadm для kubernetes
sl: Sklad Kubernetes kubeadm
uk: Стек kubeadm для kubernetes

source: This provides a vanilla kubeadm stack. It contains everything needed to setup kubernetes using kubeadm.
ca: Això proporciona una pila estàndard de kubeadm. Conté tot el necessari per configurar kubernetes usant kubeadm.
cs: Obsahuje zásobník vanilla kubeadm - vše potřebné pro nastavení kubernetů pomocí kubeadm.
da: Leverer en vanilla kubeadm-stak. Den indeholder alt hvad der er brug for til at sætte kubernetes op med kubeadm.
de: Dies stellt einen reinen kubeadm-Stapel bereit. Es enthält alles, was man braucht, um Kubernetes mit kubeadm einzurichten.
es: Proporciona una pila sin modificaciones de kubeadm. Contiene todo lo necesario para configurar kubernetes usando kubeadm.
fi: Tämä tarjoaa vakion kubeadm-pinon. Se sisältää kaiken, jota tarvitaan kubernetien asentamiseen kubeadmilla.
id: Ini menyediakan vanilla kubeadm stack. Ini berisi semua yang dibutuhkan untuk mengatur kubernetes menggunakan kubeadm.
it: Fornisce lo stack kubeadm senza modifiche. Contiene tutto quanto necessario per configurare Kubernetes utilizzando kubeadm.
pl: Zapewnia to waniliowy stos Kubeadm. Zawiera wszystko, co jest potrzebne do skonfigurowania kubernetes za pomocą kubeadm.
pt_br: Isto fornece uma pilha pura do kubeadm. Ele contém tudo o que é necessário para configurar os kubernetes usando o kubeadm.
ru: Предоставляет ванильный стек kubeadm. Содержит всё необходимое для настройки kubernetes с помощью kubeadm.
sl: To ponuja navaden sklad kubeadm. Vsebuje vse, kar je potrebno za postavitev Kubernetes z uporabo kubeadm.
sv: Detta ger dig en vanilj kubeadm stack. Den innehåller allt som behövs för att ställa in kubernetes med kubeadm.
uk: Забезпечує простий стек kubeadm. Він містить усе необхідне для налаштування kubernetes за допомогою kubeadm.

source: Utilities to manage kubernetes
ca: Utilitats per gestionar kubernetes
cs: Nástroje pro správu kubernetes
da: Redskaber til at håndtere kubernetter
de: Werkzeuge zum Verwalten von kubernetes
es: Utilidades para gestionar kubernetes
fi: Apuohjelmat kubernetin hallintaan
id: Utilitas untuk mengelola kubernetes
it: Utilità per gestire Kubernetes
pl: Narzędzia do zarządzania kubernetes
pt_br: Utilitários para gerenciar kubernetes
ru: Утилиты для управления kubernetes
sl: Orodja za upravljanje Kubernetes
sv: Verktyg för att hantera kubernetes
uk: Засоби для керування kubernetes

source: This pattern installs utilities helpful to manage kubernetes.
ca: Aquest patró instal·la utilitats útils per gestionar kubernetes.
cs: Tato předloha instaluje utility pomáhající spravovat cluster kubernet.
da: Mønsteret installerer redskaber til at hjælpe med at håndtere kubernetter.
de: Dieses Pattern installiert Dienstprogramme, die zum Verwalten von Kubernetes hilfreich sind.
es: Este patrón instala utilidades que sirven para gestionar Kubernetes.
fi: Tämä malli asentaa kubernetin hallintaan hyödyllisiä apuohjelmia.
id: Pola ini memasang paket utilitas yang berguna untuk mengelola kubernetes.
it: Questo modello installa le utilità che consentono di gestire Kubernetes.
pl: Ten wzorzec instaluje narzędzia pomocne w zarządzaniu Kubernetes.
pt_br: Esse padrão instala utilitários úteis para gerenciar os kubernetes.
ru: Этот шаблон устанавливает утилиты, полезные для управления kubernetes.
sl: Ta vzorec namesti orodja, ki pomagajo pri upravljanju Kubernetes-a.
sv: Detta mönster installerar verktyg som är användbara för att hantera kubernetes.
uk: Цей шаблон встановлює засоби, корисні для керування kubernetes.

source: Kubic Admin Node
ca: Node d'administració de Kubic
cs: Administrátorský uzel Kubic
es: Nodo de administrador de Kubic
fi: Kubic Admin solmu
id: Node Admin Kubic
it: Nodo amministrazione Kubic
pl: Węzeł administracyjny Kubic
pt_br: Nó de Administração Kubic
ru: Узел администрирования Kubic
sl: Administratorsko vozlišče Kubic
sv: Kubic Admin nod
uk: Вузол адміністрування Kubic

source: This pattern installs the software required for an openSUSE Kubic Admin Node.
ca: Aquest patró instal·la el programari necessari per al node d'administració de Kubic d'openSUSE.
cs: Tato šablona instaluje software nezbytný pro Administrátorský uzel openSUSE Kubic.
de: Dieses Pattern installiert die Software, die für einen openSUSE Kubic Admin Node benötigt wird.
es: Este patrón instala el software necesario para un nodo de administrador de openSUSE Kubic.
id: Pola ini memasang perangkat lunak yang diperlukan untuk sebuah Node Admin openSUSE Kubic.
it: Questo modello installa il software richiesto per un nodo amministrazione Kubic di openSUSE.
pl: Ten wzorzec instaluje oprogramowanie wymagane dla węzła administracyjnego openSUSE Kubic.
pt_br: Esse padrão instala o software necessário para um nó de administrador do openSUSE Kubic.
ru: Этот шаблон устанавливает программное обеспечение, необходимое для узла администрирования openSUSE Kubic.
sl: Ta vzorec namesti programsko opremo, ki je potrebno za administratorsko vozlišče openSUSE Kubic.
sv: Detta mönster installerar programvaran som krävs för en openSUSE Kubic Admin nod.
uk: Цей шаблон встановлює програмне забезпечення, необхідне для вузла адміністрування openSUSE Kubic.

source: Kubic Loadbalancer Node
ca: Node de l'equilibrador de càrrega de Kubic
cs: Uzel vyvážení zátěže Kubic
es: Nodo de balanceo de carga de Kubic
fi: Kubic latauksentasaus solmu
id: Node Loadbalancer Kubic
it: Nodo utilità di bilanciamento del carico Kubic
pl: Węzeł Kubic Load Balancer
pt_br: Nó do balanceador de carga do Kubic
ru: Узел балансировки Kubic
sl: Razdeljevalnik obremenitev Kubic
sv: Kubic lastbalanserare nod
uk: Вузол балансування Kubic

source: This pattern installs the the software required for an openSUSE Kubic Loadbalancer Node.
ca: Aquest patró instal·la el programari necessari per al node de l'equilibrador de càrrega de Kubic de l'openSUSE.
cs: Tato šablona instaluje software nezbytný pro uzel vyvážení zátěže openSUSE Kubic.
da: Mønsteret installerer den software som kræves af en openSUSE Kubic Loadbalancer-node.
de: Dieses Pattern installiert die benötigte Software für einen openSUSE Kubic Loadbalancer Node.
es: Este patrón instala el software necesario para un nodo equilibrador de carga de openSUSE Kubic.
fi: Tämä malli asentaa avoimen SUSE Kubic Loadbalancer -solmun edellyttämän ohjelmiston.
id: Pola ini memasang perangkat lunak yang diperlukan untuk Node Loadbalancer openSUSE Kubic.
it: Questo modello installa il software richiesto per un nodo utilità di bilanciamento del carico Kubic di openSUSE.
pl: Ten wzorzec instaluje oprogramowanie wymagane dla węzła openSUSE Kubic Loadbalancer.
pt_br: Esse padrão instala o software necessário para um nó openSUSE Kubic Loadbalancer.
ru: Этот шаблон устанавливает программное обеспечение, необходимое для узла балансировки openSUSE Kubic.
sl: Ta vzorec namesti programsko opremo, ki je potrebna za vozlišče razdeljevalnika obremenitev openSUSE Kubic.
sv: Detta mönster installerar programvaran som krävs för en openSUSE Kubic lastbalanserare nod.
uk: Цей шаблон встановлює програмне забезпечення, необхідне для вузла балансування OpenSUSE Kubic.

source: Kubic Worker Node
ca: Node del treballador de Kubic
cs: Pracovní uzel Kubic
es: Nodo de trabajo Kubic
fi: Kubic Worker solmu
id: Node Worker Kubic
it: Nodo di lavoro Kubic
pl: Węzeł roboczy Kubic
pt_br: Nó de trabalho Kubic
ru: Рабочий узел Kubic
sl: Delovno vozlišče Kubic
sv: Kubic Arbetarenod
uk: Робочий вузол Kubic

source: This pattern installs the the software required for an openSUSE Kubic Worker Node.
ca: Aquest patró instal·la el programari necessari per al node de treballador de Kubic de l'openSUSE.
cs: Tato šablona instaluje software nezbytný pro Pracovní uzel openSUSE Kubic.
da: Mønsteret installerer den software som kræves af en openSUSE Kubic Worker-node.
de: Dieses Muster installiert die für einen openSUSE Kubic Worker-Knoten erforderliche Software.
es: Este patrón instala el software necesario para un nodo de trabajador de openSUSE Kubic.
fi: Tämä malli asentaa avoimen SUSE Kubic Worker Noden edellyttämän ohjelmiston.
id: Pola ini memasang perangkat lunak yang diperlukan bagi suatu openSUSE Kubic Worker Node.
it: Questo modello installa il software richiesto per un nodo di lavoro Kubic di openSUSE.
pl: Ten wzorzec instaluje oprogramowanie wymagane dla węzła openSUSE Kubic Worker.
pt_br: Esse padrão instala o software necessário para um nó do Kubic Worker do openSUSE.
ru: Этот шаблон устанавливает программы, необходимые для рабочего узла openSUSE Kubic.
sl: Ta vzorec namesti programsko opremo, ki je potrebna za delovno vozlišče openSUSE Kubic.
sv: Detta mönster installerar programvaran som krävs för en openSUSE Kubic arbetarenod.
uk: Цей шаблон встановлює програмне забезпечення, необхідне для робочого вузла openSUSE Kubic.

source: Deepin Desktop Environment
ca: Entorn d'escriptori Deepin
cs: Pracovní prostředí Deepin
de: Deepin-Desktop-Umgebung
es: Entorno de escritorio Deepin
fi: Deepin-työpöytäympäristö
id: Lingkungan Destop Deepin
it: Ambiente desktop Deepin
pl: Środowisko graficzne Deepin
pt_br: Ambiente de trabalho Deepin
ru: Среда рабочего стола Deepin
sl: Namizno okolje deepin
sv: Deepin Skrivbordsmiljö
uk: Стільничне середовище Deepin

source: The Deepin desktop environment is a desktop environment using fashion metaphors.
ca: L’entorn d’escriptori Budgie és un entorn d’escriptori que usa metàfores de moda.
cs: Prostředí plochy Deepin je pracovní plocha používající moderní metafory.
fi: Deepin-työpöytä on työpöytäympäristö joka käyttää muodikkaita metaforia.
id: Lingkungan destop Deepin adalah lingkungan destop yang menggunakan metafora fesyen.
it: L'ambiente desktop Deepin è un ambiente desktop che si rifà alle metafore più di tendenza.
pl: Deepin to intuicyjne i atrakcyjne dla użytkowników środowisko graficzne.
pt_br: O Deepin é um ambiente de trabalho que usa metáforas da moda.
ru: Deepin — среда рабочего стола, использующая модные метафоры.
sl: Namizno okolje deepin uporablja metafore iz mode.
sv: Deepin-skrivbordsmiljön är en skrivbordsmiljö som använder modemetaforer.

source: Deepin Administration Tools
ca: Eines d'administració de Deepin
cs: Nástroje správy Deepin
de: Deepin-Administrationswerkzeuge
es: Herramientas de administración de Deepin
fi: Deepin-ylläpitotyökalut
id: Perkakas Administrasi Deepin
it: Strumenti di amministrazione Deepin
pl: Narzędzia administracyjne Deepin
pt_br: Ferramentas de administração do Deepin
ru: Инструменты администрирования Deepin
sl: Administratorska orodja deepin
sv: Deepin Administrationsverktyg
uk: Засоби адміністрування Deepin

source: Deepin Base System
ca: Sistema de base Deepin
cs: Základní systém Deepin
de: Deepin-Basissystem
es: Sistema base de Deepin
fi: Deepin perusjärjestelmä
id: Sistem Dasar Deepin
it: Sistema di base Deepin
pl: Podstawowy system Deepin
pt_br: Sistema base do Deepin
ru: Базовая система Deepin
sl: Osnovni sistem za deepin
sv: Deepin grundläggande system
uk: Базова система Deepin

source: Base packages for the Deepin desktop environment.
ca: Paquets de base per a l'entorn d'escriptori Deepin.
cs: Základní balíčky prostředí plochy Deepin.
de: Grundlegende Pakete für die Deepin-Desktop-Umgebung.
es: Paquetes base para el entorno de escritorio Deepin.
fi: Peruspaketit Deepin-työpöytäympäristölle.
id: Paket dasar untuk lingkungan destop Deepin.
it: Pacchetti di base per l'ambiente desktop Deepin.
pl: Podstawowe oprogramowanie dla środowiska Deepin.
pt_br: Pacotes básicos para o ambiente de trabalho Deepin.
ru: Основные пакеты для среды рабочего стола Deepin.
sl: Osnovni paketi za namizno okolje deepin.
sv: Bas paket för Deepin skrivbordsmiljön.
uk: Основні пакунки для стільничного середовища Deepin.

source: Deepin Internet
ca: Internet del Deepin
es: Internet de Deepin
id: Internet Deepin
it: Internet Deepin
pl: Internet Deepin
pt_br: Internet do Deepin
ru: Интернет Deepin
sl: Internet deepin
uk: Інтернет Deepin

source: Deepin Internet Applications.
ca: Aplicacions d'Internet del Deepin.
cs: Internetové aplikace pro Deepin.
de: Deepin-Internetanwendungen.
es: Aplicaciones para Internet de Deepin.
fi: Deepin-internetsovellukset.
id: Aplikasi Internet Deepin.
it: Applicazioni per internet di Deepin.
pl: Programy internetowe Deepin.
pt_br: Aplicativos de Internet do Deepin.
ru: Интернет-приложения для Deepin.
sl: Programi deepin za internet.
sv: Deepin Internetprogram.
uk: Інтернет-застосунки Deepin.

source: Deepin Multimedia
ca: Multimèdia del Deepin
cs: Multimédia pro Deepin
es: Multimedia de Deepin
id: Multimedia Deepin
it: Multimedia Deepin
pl: Multimedia Deepin
pt_br: Multimídia do Deepin
ru: Мультимедиа Deepin
sl: Večpredstavnost deepin
uk: Мультимедія Deepin

source: Deepin multimedia applications.
ca: Aplicacions multimèdia del Deepin.
cs: Multimediální aplikace pro Deepin.
de: Deepin-Multimedia-Anwendungen.
es: Aplicaciones multimedia de Deepin.
fi: Deepin-multimediasovellukset.
id: Aplikasi multimedia Deepin.
it: Applicazioni multimediali Deepin.
pl: Deepin aplikacje multimedialne.
pt_br: Aplicativos multimídia do Deepin.
ru: Мультимедиа приложения Deepin.
sl: Večpredstavnostni programi deepin.
sv: Deepin multimedia program.
uk: Мультимедійні застосунки Deepin.

source: Deepin Office
ca: Oficina del Deepin
cs: Kancelářské aplikace pro Deepin
es: Oficina de Deepin
fi: Deepin-toimisto
id: Perkantoran Deepin
it: Deepin per l'ufficio
pl: Biuro Deepin
ru: Офис Deepin
sl: Pisarna deepin
uk: Офіс Deepin

source: Deepin Utilities
ca: Utilitats del Deepin
cs: Nástroje Deepin
de: Deepin-Dienstprogramme
es: Utilidades de Deepin
fi: Deepin-apuohjelmat
id: Utilitas Deepin
it: Utilità Deepin
pl: Narzędzia Deepin
pt_br: Utilitários do Deepin
ru: Утилиты Deepin
sl: Orodja deepin
sv: Deepin Verktyg
uk: Утиліти Deepin

source: Remaining Software
ar: البرامج المتبقية
ca: Programari restant
cs: Ostatní software
da: Resterende software
de: Verbleibende Software
es: Software restante
fi: Jäljelle jääneet ohjelmat
id: Perangkat Lunak yang Tersisa
it: Programmi rimanenti
pl: Pozostałe oprogramowanie
pt_br: Outros programas
ru: Остальные программы
sl: Ostala programska oprema
sv: Återstående mjukvara
uk: Решта програм

source: Packages that are on CD but not in other patterns.
ar: الحزم على القرص المضغوط ولكن ليس في الأنماط الأخرى.
ca: Paquets que són al CD però no en altres patrons.
cs: Balíčky, které jsou na CD, ale nejsou součástí žádného profilu.
da: Pakker der er på CD men ikke i andre mønstre.
de: Pakete, die zwar auf CD sind, aber in keinem Schema aufgelistet werden.
es: Paquetes que están en el CD pero no en otros patrones.
fi: CD-levyllä olevat paketit, jotka eivät ole osa mitään kokonaisuutta.
id: Paket yang ada di CD tetapi tidak dalam pola lain.
it: Pacchetti che si trovano sul CD ma non in altri modelli.
pl: Pakiety znajdujące się na płycie CD, a nieprzypisane do innych wzorców.
pt_br: Pacotes que estão no CD, mas não estão em outros padrões.
ru: Пакеты на CD, не вошедшие в другие шаблоны.
sl: Paketi, ki so na zgoščenki, vendar niso v drugih vzorcih.
sv: Paket som finns på cd men inte i andra mönster.
uk: Пакунки на КД, що не ввійшли в інші шаблони.

source: Alternative Packages only for the DVD of openSUSE MicroOS
ca: Paquets alternatius només per al DVD del MicroSO d'openSUSE
cs: Alternativní balíčky pouze pro DVD s openSUSE MicroOS
da: Alternative pakker kun til openSUSE MicroOS-dvd'en
de: Alternative Pakete nur für die DVD von openSUSE MicroOS
es: Paquetes alternativos solo para el DVD de openSUSE MicroOS
fi: Vaihtoehtoiset paketit vain DVD openSUSE MicroOS
id: Paket Alternatif hanya untuk DVD openSUSE MicroOS
it: Pacchetti alternativi dedicati al DVD di openSUSE MicroOS
pl: Alternatywne pakiety tylko dla DVD z openSUSE MicroOS
pt_br: Pacotes alternativos apenas para o DVD do openSUSE MicroOS
ru: Альтернативные пакеты только для DVD openSUSE MicroOS
sl: Alternativni paketi, ki so samo za DVD od openSUSE MicroOS
sv: Alternativa paket endast för DVD:n för openSUSE MicroOS
uk: Альтернативні пакунки лише для DVD з openSUSE MicroOS

source: Alternative additional packages on a openSUSE MicroOS DVD.
ca: Paquets addicionals alternatius en un DVD del MicroSO d'openSUSE.
cs: Přídavné alternativní balíčky pro DVD openSUSE MicroOS.
da: Alternative yderligere pakker på en openSUSE MicroOS-dvd.
de: Alternative zusätzliche Pakete auf einer openSUSE MicroOS DVD.
es: Paquetes adicionales alternativos en un DVD de openSUSE MicroOS.
fi: Vaihtoehtoiset lisäpaketit openSUSE MicroOS DVD.
id: Paket alternatif tambahan pada DVD openSUSE MicroOS.
it: Pacchetti aggiuntivi alternativi su un DVD di openSUSE MicroOS.
pl: Alternatywne dodatkowe pakiety na dysku DVD openSUSE MicroOS.
pt_br: Pacotes alternativos adicionais para um DVD do openSUSE MicroOS.
ru: Альтернативные дополнительные пакеты на DVD openSUSE MicroOS.
sl: Alternativni dodatni paketi na DVD-ju od openSUSE MicroOS.
sv: Alternativa ytterligare paket på en openSUSE MicroOS DVD.
uk: Альтернативні додаткові пакунки на openSUSE MicroOS DVD.

source: MicroOS
ca: MicroSO
ru: MicrоOS

source: Apparmor Support
ca: Suport d'Apparmor
cs: Podpora Apparmor
de: Apparmor Unterstützung
es: Soporte de Apparmor
fi: Apparmor-tuki
id: Dukungan Apparmor
it: Supporto Apparmor
pl: Wsparcie Apparmor
pt_br: Suporte ao AppArmor
ru: Поддержка Apparmor
sl: Podpora za AppArmor
sv: Apparmor Stöd
uk: Підтримка Apparmor

source: Packages required to enable Apparmor on openSUSE MicroOS.
ca: Paquets necessaris per habilitar l'Apparmor al MicroSO d'openSUSE.
cs: Nezbytné balíčky umožňující Apparmor na openSUSE MicroOS.
da: Pakker som behøves for at aktivere Apparmor på openSUSE MicroOS.
de: Erforderliche Pakete, um Apparmor unter openSUSE MicroOS zu aktivieren.
es: Paquetes necesarios para habilitar Apparmor en openSUSE MicroOS.
fi: Paketit, jotka tarvitaan Apparmorin aktivoimiseksi openSUSE MicroOSissa.
id: Paket yang diperlukan untuk mengaktifkan Apparmor pada openSUSE MicroOS.
it: Pacchetti richiesti per abilitare Apparmor su openSUSE MicroOS.
pl: Pakiety wymagane do włączenia Apparmor w openSUSE MicroOS.
pt_br: Pacotes necessários para habilitar o AppArmor no openSUSE MicroOS.
ru: Пакеты, необходимые для включения Apparmor на openSUSE MicroOS.
sl: Paketi, ki so potrebni za omogočanje AppArmor-ja na openSUSE MicroOS.
sv: Paket som krävs för att aktivera Apparmor på openSUSE MicroOS.
uk: Пакунки, необхідні для ввімкнення Apparmor на openSUSE MicroOS.
