Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: This pattern installs the FIPS 140-2 specific packages that complete the various cryptographic modules in use. It is required if you want to run the machine with "fips=1". Please note that this pattern only enables FIPS 140-2 compliant operation, it does not directly make the system FIPS 140-2 certified nor validated. Please refer to SUSE official statements on the state of FIPS 140-2 certification.
ar: يعمل هذا النمط على تثبيت الحزم الخاصة بمعيار FIPS 140-2 والتي تُكمل وحدات التشفير النمطية المتعددة قيد الاستخدام. وهو ضروري إذا كنت تريد تشغيل الجهاز باستخدام "fips=1". الرجاء ملاحظة أن هذا النمط يعمل فقط على تمكين التشغيل المتوافق مع معيار FIPS 140-2، ولا يعتمد بشكل مباشر توافق النظام مع معيار FIPS 140-2 أو يتحقق من صحة ذلك. الرجاء الاطلاع على بيانات SUSE الرسمية حول حالة اعتماد معيار FIPS 140-2.
ca: Aquest patró instal·la els paquets específics FIPS 140-2 que completen els diversos mòduls criptogràfics en ús. Es requereix si voleu executar la màquina amb "fips =1". Tingueu en compte que aquest patró només permet l'operació compatible amb FIPS 140-2, no fa que el certificat FIPS 140-2 sigui correcte ni validat. Consulteu els extractes oficials de SUSE sobre l'estat de la certificació FIPS 140-2.
cs: Tento vzor nainstaluje balíčky specifické pro FIPS 140-2, které doplňují různé používané kryptogracické moduly. Je požadován, pokud chcete počítač spouštět s "fips=1". Upozrňujeme, že tento vzor jenom umožňuje provoz operací FIPS 140-2. Naučiní systém automaticky certifikovaným pro FIPS 140-2 ani ověřeným pro FIPS 140-2. Informace ohledně stavu certifikace FIPS 140-2 najdete v oficiálních prohlášeních SUSE.
da: Dette mønster installerer FIPS 140-2-specifikke pakker som fuldfører de forskellige kryptografiske moduler som er i brug. Det kræves hvis du vil køre maskinen med "fips=1". Bemærk venligst at mønsteret kun aktiverer FIPS 140-2-komplianshandling. Det gør ikke systemet direkte FIPS 140-2-certificeret eller valideret. Referer venligst til SUSEs officielle erklæringer om tilstanden af FIPS 140-2-certificering.
de: Dieses Schema installiert die FIPS 140-2-spezifischen Pakete zur Vervollständigung der verschiedenen verwendeten kryptographischen Module. Es ist erforderlich, wenn Sie das System mit "fips=1" ausführen möchten. Beachten Sie, dass dieses Schema nur einen FIPS 140-2-konformen Betrieb ermöglicht und das System im Hinblick auf den FIPS 140-2-Standard nicht zertifiziert oder validiert. Weitere Informationen erhalten Sie in den offiziellen SUSE-Erklärungen zum Status der FIPS 140-2-Zertifizierung.
es: Este patrón instala los paquetes específicos de FIPS 140-2 que completan varios módulos de cifrado en uso. Es necesario si se quiere ejecutar el equipo con "fips=1". Tenga en cuenta que este patrón solo habilita la operación compatible con FIPS 140-2, no certifica ni valida directamente el sistema FIPS 140-2. Consulte la documentación oficial de SUSE sobre el estado de la certificación de FIPS 140-2.
fi: Tämä kuvio asentaa FIPS 140-2 -kohtaiset paketit, jotka täydentävät käytössä olevia salausmoduuleja. Tämä vaatii, että konetta käytetään asetuksella ”fips=1”. Huomaa, että tämä kuvio ottaa käyttöön vain FIPS 140-2 -yhteensopivan toimintatilan eikä suoraan tee järjestelmästä FIPS 140-2 -varmennettua tai todennettua. FIPS 140-2 -varmennuksen tilasta löytyy lisätietoa SUSEn virallisesta lausunnosta.
id: Pola ini memasang paket spesifik FIPS 140-2 yang melengkapi berbagai modul kriptografi yang digunakan. Diperlukan jika Anda ingin menjalankan mesin dengan "fips=1". Harap dicatat bahwa pola ini hanya memungkinkan operasi yang mematuhi FIPS 140-2, itu tidak secara langsung membuat sistem bersertifikat FIPS 140-2 atau divalidasi. Silakan merujuk pada pernyataan resmi SUSE tentang status sertifikasi FIPS 140-2.
it: Questo modello consente di installare pacchetti specifici per FIPS 140-2 che completano vari moduli crittografici in uso. È richiesto per eseguire il computer con "fips=1". Nota: questo modello abilita solo l'operazione compatibile con FIPS 140-2, non esegue la certificazione né la convalida diretta FIPS 140-2 del sistema. Per conoscere lo stato della certificazione FIPS 140-2, fare riferimento alle dichiarazioni ufficiali SUSE.
pl: Ten wzorzec służy do instalowania pakietów specyficznych dla norm FIPS 140-2, które są uzupełnieniem różnych modułów kryptograficznych będących w użytku. Jest wymagany, jeśli komputer ma być uruchamiany z opcją "fips=1". Należy pamiętać, że ten wzorzec jedynie umożliwia wykonywanie operacji zgodnych z FIPS 140-2, natomiast nie sprawi, że system będzie certyfikowany lub zatwierdzony jako zgodny z tymi normami. Patrz: oficjalne oświadczenie SUSE dotyczące stanu certyfikacji zgodności z normami FIPS 140-2.
pt_br: Este padrão instala os pacotes específicos FIPS 140-2 que completam os vários módulos criptográficos em uso. É necessário se você deseja executar a máquina com "fips=1". Observe que este padrão só permite a operação compatível com FIPS 140-2, não torna o sistema diretamente certificado ou validado para FIPS 140-2. Consulte as declarações oficiais da SUSE sobre o estado da certificação FIPS 140-2.
ru: Этот шаблон устанавливает пакеты для FIPS 140-2, в которых реализованы различные криптографические модули. Он необходим для запуска компьютера с параметром «fips=1». Обратите внимание, что этот шаблон лишь позволяет включить поддержку возможностей FIPS 140-2. Он не обеспечивает сертификацию или соответствие системы требованиям FIPS 140-2. Состояние сертификации FIPS 140-2 см. в официальных заявлениях SUSE.
sl: Ta vzorec namesti pakete posebej za FIPS 140-2, ki dopolnijo razne kriptografske module, ki so v uporabi. Zahtevan je, če želite računalnik poganjati z »fips=1«. Vedite, da ta paket samo omogoči delovanje, ki je skladno s FIPS 140-2, in neposredno ne napravi sistema certificiranega ali potrjenega za FIPS 140-2. Oglejte si uradne izjave podjetja SUSE o stanju certificiranja FIPS 140-2.
sv: Detta mönster installerar FIPS 140-2-specifika paket som kompletterar olika kryptografiska moduler som används. Detta krävs om du vill köra enheten med "fips=1". Observera att detta mönster endast möjliggör FIPS 140-2-kompatibel användning, det gör inte att systemet direkt blir FIPS 140-2-certifierat eller -validerat. Se officiella SUSE-meddelanden för att se status på FIPS 140-2-certifiering.
uk: Цей шаблон встановлює спеціальні пакунки для FIPS 140-2, які доповнюють задіяні криптографічні модулі. Він потрібен для запуску комп'ютера з "fips=1". Зверніть увагу, що цей шаблон лише надає сумісність з FIPS 140-2, він не робить систему сертифікованою чи перевіреною за стандартом FIPS 140-2. Будь ласка, зверніться до офіційних заяв SUSE щодо стану сертифікації FIPS 140-2.

source: Primary Functions
ar: الوظائف الأساسية
ca: Funcions primàries
cs: Primární funkce
da: Primære funktioner
de: Primäre Funktionen
es: Funciones principales
fi: Ensisijaiset toiminnot
id: Fungsi Utama
it: Funzioni principali
pl: Funkcje podstawowe
pt_br: Funções principais
ru: Основные функции
sl: Glavne funkcije
sv: Primära funktioner
uk: Головні функції

source: Minimal Appliance Base
ar: الحد الأدنى من قاعدة الأجهزة
ca: Base mínima d'aplicacions
cs: Minimální funkční základ systémů
da: Minimal basis til appliance
de: Minimale Appliance-Basis
es: Base de dispositivo mínimo
fi: Minimaalinen laiteasennus
id: Dasar Appliance Minimal
it: Base appliance minimo
pl: Minimalna podstawa zastosowań
pt_br: Base mínima da aplicação
ru: Минимальная база для различных применений
sl: Minimalna osnova za namenske distribucije
sv: Minimal tillämpningsbas
uk: Базова система для різних застосувань

source: This is the minimal runtime system. It is really a minimal system. It is intended as base for Appliances.
ar: هذا هو الحد الأدنى من نظام التشغيل. إنه حقًا نظام بسيط. الغرض منه هو أن يكون قاعدة للأجهزة.
ca: Aquest és el sistema d'execució mínim. És realment un sistema mínim. Està pensat com a base per a aplicacions.
cs: Toto je minimální provozní systém. Je to opravdu minimální systém. Je zamýšlen jako základna aplikací.
de: Dies ist das minimale Laufzeitsystem. Es ist ein wirklich minimales System. Es ist als Basis für Anwendungen gedacht.
es: Este es el sistema de entorno de ejecución mínimo. Es un sistema realmente mínimo enfocado a servir como base para sistemas dedicados.
fi: Tämä on minimaalinen ajonaikaisjärjestelmä. Se on todella minimaalinen ja tarkoitettu säilöasennusperustaksi.
id: Ini adalah sistem runtime openSUSE minimal. Ini benar-benar sistem minimal, Anda bisa masuk dan shell akan dimulai, itu saja. Ini dimaksudkan sebagai dasar untuk Appliances.
it: Questo è il sistema di esecuzione minimale. È veramente un sistema minimale, inteso come base per i dispositivi.
pl: To jest minimalne środowisko uruchomieniowe. Stanowi ono absolutne minimum. Przeznaczony jest jako podstawa dla aplikacji.
pt_br: Este é o sistema de tempo de execução mínimo. É realmente um sistema mínimo. Destina-se como base para Eletrodomésticos.
ru: Это минимальная исполняемая система. Это действительно минимальная система. Она предназначена в качестве основы для контейнеров.
sl: To je res minimalni izvajalni sistem. Mišljen je kot osnova za namenske distribucije.
sv: Detta är det minimala körtidssystemet. Det är verkligen ett minimalt system, Det är avsett som bas för apparater.
uk: Це мінімальна система виконання. Це дійсно мінімальна система. Призначення - базис для віртуальних образів.

source: The 32bit pattern complementing minimal_base.
ar: نمط 32bit المكمل ل minimal_base.
ca: El patró de 32 bits que completa la base mínima.
cs: 32bitový vzor doplňující minimal_base.
da: 32-bit-mønsteret som komplimenterer minimal_base.
de: Das 32-Bit-Schema welches minimal_base ergänzt.
es: El patrón de 32 bits que complementa a minimal_base.
fi: minimal_base-kuviota täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi minimal_base.
it: Modello a 32 bit complementare a minimal_base.
pl: 32-bitowy wzorzec uzupełniający minimalny system podstawowy.
pt_br: O padrão de 32 bits que complementa a base mínima.
ru: 32-разрядный шаблон, который дополняет minimal_base.
sl: 32-bitni vzorec, ki dopolnjuje minimal_base.
sv: 32-bitarsmönstret som kompletterar minimal_base.
uk: 32-бітовий шаблон, який доповнює minimal_base.

source: Software Management
ar: إدارة البرامج
ca: Gestió de programari
cs: Správa softwaru
da: Softwarehåndtering
es: Gestión de software
fi: Ohjelmiston asennus
id: Pengelola Perangkat Lunak
it: Gestione dei programmi
pl: Zarządzanie oprogramowaniem
pt_br: Gerenciamento de software
ru: Управление программным обеспечением
sl: Upravljanje programov
sv: Programhantering
uk: Керування програмами

source: This pattern provides a graphical application and a command line tool for keeping your system up to date.
ar: يوفر هذا النمط تطبيق رسومي وأداة سطر الأوامر للحفاظ على النظام مُحدثاً.
ca: Aquest patró proporciona una aplicació gràfica i una eina de línia d'ordres per mantenir el sistema actualitzat.
cs: Tento vzor obsahuje grafickou aplikaci a nástroj příkazového řádku pro udržování systému v aktualizovaném stavu.
da: Dette mønster giver et grafisk program og et kommandolinjeværktøj til at holde dit system opdateret.
de: Dieses Schema enthält eine grafische Anwendung und ein Kommandozeilen-Werkzeug, um Ihr System auf dem aktuellen Stand zu halten.
es: Este patrón proporciona una aplicación gráfica y una herramienta en línea de comandos para mantener su sistema actualizado.
fi: Tämä tarjoaa graafisen ohjelmiston asennuksen, päivitysohjelman ja komentorivityökalun.
id: Pola ini menyediakan aplikasi grafis dan perkakas baris perintah untuk menjaga sistem Anda tetap mutakhir.
it: Questo modello fornisce un'applicazione grafica e uno strumento a riga di comando per mantenere il sistema aggiornato.
pl: Ten wzorzec zawiera program graficzny i narzędzie wiersza poleceń, która pozwala utrzymywać system w aktualnym stanie.
pt_br: Este padrão fornece um aplicativo gráfico e uma ferramente em linha de comando para manter seu sistema atualizado.
ru: Этот шаблон предоставляет графическое приложение и инструмент командной строки для поддержания системы в актуальном состоянии.
sl: Ta vzorec ponuja grafični program in orodje za ukazno vrstico za posodabljanje sistema.
sv: Detta mönster tillhandahåller ett grafiskt program och ett kommandoradsverktyg för att hålla systemet uppdaterat.
uk: Цей шаблон надає графічну програму і засіб командного рядка для оновлення вашої системи.

source: The 32bit pattern complementing sw_management.
ar: نمط 32bit المكمل ل sw_management.
ca: El patró de 32 bits que completa la gestió de programari.
cs: 32bitový vzor doplňující sw_management.
da: 32-bit-mønsteret som komplimenterer sw_management.
de: Das 32-Bit-Schema welches sw_management ergänzt.
es: El patrón de 32 bits que complementa a sw_management.
fi: sw_management-kuviota täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi sw_management.
it: Modello a 32 bit complementare a sw_management.
pl: 32-bitowy wzorzec uzupełniający zarządzanie oprogramowaniem.
pt_br: O padrão de 32 bits que complementa o gerenciamento de software.
ru: 32-разрядный шаблон, который дополняет sw_management.
sl: 32-bitni vzorec, ki dopolnjuje sw_management.
sv: 32-bitarsmönstret som kompletterar sw_management.
uk: 32-бітовий шаблон, який доповнює sw_management.

source: X Window System
ar: نظام النوافذ X
ca: Sistema de finestres X
cs: Systém X Window
da: X-vinduessystem
es: Sistema X Window
fi: X-ikkunointijärjestelmä
id: Sistem Jendela X
pl: System X Window
pt_br: Sistema de janelas X
ru: Система X Window
sl: Grafični sistem X Window
uk: Віконна система X

source: The X Window System provides the only standard platform-independent networked graphical window system bridging the heterogeneous platforms in today's enterprise: from network servers to desktops, thin clients, laptops, and handhelds, independent of operating system and hardware.
ar: يوفر نظام النوافذ X القياسي الوحيد الواجهة الرسومية لمنصات الشبكة المستقلة والتي تربط بين المنصات غير المتجانسة في مؤسسات اليوم: من خوادم الشبكة إلى أجهزة الكمبيوتر المكتبية، والعملاء وأجهزة الكمبيوتر المحمولة، والهواتف المحمولة، بغض النظر عن نظام التشغيل والأجهزة.
ca: El sistema de finestres X proporciona l'únic sistema de finestres gràfiques en xarxa, de plataforma independent i estàndard, que fa de pont entre les plataformes heterogènies a l'empresa d'avui: des dels servidors de xarxa fins a ordinadors de sobretaula, clients prims, ordinadors portàtils i dispositius de mà, independentment del sistema operatiu i el maquinari.
cs: X Window je systém na platformě nezávislým grafickým systémem spojujícím různé platformy. Díky nezávislosti na hardwaru a operačním systému spolehlivě slouží v serverech, pracovních stanicích, tenkých klientech, noteboocích a PDA.
da: X-vinduessystemet leverer det eneste standard platformsuafhængige forbundet grafiske vinduessystem der skaber bro mellem heterogene platforme i dagens virksomhed: fra netværksservere til stationære, tynde klienter, bærbare og håndholdte, uafhængig af styresystem og hardware.
de: Das seit mehr als 20 Jahren verwendete X Window System bietet das einzige plattformunabhängige vernetzte grafische System mit Fenstern, das die heterogenen Plattformen in den heutigen Unternehmen zusammenbringt: Von Netzwerkservern zu Desktops, Thin Clients, Laptops und Handhelds, unabhängig von Betriebssystem und Hardware.
es: El sistema X Window proporciona el único sistema gráfico de red estándar para todas las plataformas que sirve de puente entre las diferentes plataformas usadas en las empresas actuales: desde servidores de red a equipos de escritorio, clientes ligeros, equipos portátiles o dispositivos de mano (PDA), independientemente del sistema operativo o el hardware que se utilice.
fi: X-ikkunointijärjestelmä tarjoaa ainoan standardoidun, alustariippumattoman, verkotetun ikkunointijärjestelmän. Se mahdollistaa sekaympäristöt, jotka voivat koostua verkkopalvelimista, työasemista, thin-client-päätteistä, kannettavista tietokoneista ja kämmentietokoneista. X on käyttöjärjestelmästä ja laitteistosta riippumaton.
id: Sistem jendela X menyediakan satu-satunya sistem jendela grafis platform-independen jaringan yang menjembatani platform heterogen di perusahaan saat ini: dari peladen jaringan ke destop, thin client, laptop, dan handheld, independen dari sistem operasi dan perangkat keras.
it: L'X Window System fornisce l'unico sistema grafico a finestre standard e indipendente dalla piattaforma in grado di collegare le varie piattaforme delle aziende moderne: dai server di rete ai desktop, client leggeri, computer portatili e palmari, indipendentemente dal sistema operativo e dall'hardware.
pl: System X Window jest jedynym standardowym, niezależnym od platformy sieciowym graficznym systemem okienkowym, który niezależnie od systemu operacyjnego i sprzętu łączy różnorodne platformy współczesnego przedsiębiorstwa: od serwerów sieciowych po stacje robocze, klienty uproszczone, komputery i urządzenia przenośne.
pt_br: O sistema de janelas X oferece o único sistema padrão de janelas gráficas em rede independente de plataforma, unindo as plataformas heterogêneas das empresas atuais: de servidores de rede a áreas de trabalho, thin clients, notebooks e dispositivos portáteis, independentemente do sistema operacional e do hardware.
ru: Система X Window предоставляет стандартную платформо-независимую сетевую графическую оконную систему, объединяющую гетерогенные платформы современного корпоративного сектора: от серверов до рабочих столов, тонких клиентов, ноутбуков и наладонников, независимо от операционной системы и аппаратного обеспечения.
sl: Grafični sistem X Window System ponuja standardni omrežni grafični sistem, ki je na voljo za več različnih okolij: od omrežnih strežnikov do namizij, lahkih odjemalcev, prenosnikov in ročnih naprav. Neodvisen je od operacijskega sistema in strojne opreme.
sv: X Window System har funnits i över 20 år och är det enda grafiska fönstersystemet för nätverk som är standardiserat och plattformsoberoende. Det överbryggar de heterogena plattformarna i dagens företag, oberoende av operativsystem och maskinvara.
uk: Віконна система X надає єдину стандартну мережну систему графічних вікон, яка прокладає містки між різнорідними платформами в сучасних великих підприємствах: від мережних серверів до стільниць, тонких клієнтів, лептопів і кишенькових ПК, незалежно від операційних систем і обладнання.

source: The 32bit pattern complementing x11.
ar: نمط 32bit المكمل ل x11.
ca: El patró de 32 bits que complementa X11.
cs: 32bitový vzor doplňující X11.
da: 32-bit-mønsteret som komplimenterer x11.
de: Das 32-Bit-Schema welches x11 ergänzt.
es: El patrón de 32 bits que complementa a X11.
fi: x11-kuviota täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi x11.
it: Modello a 32 bit complementare a x11.
pl: 32-bitowy wzorzec uzupełniający system x11.
pt_br: O padrão de 32 bits que complementa o sistema de janelas X.
ru: 32-разрядный шаблон, который дополняет x11.
sl: 32-bitni vzorec, ki dopolnjuje x11.
sv: 32-bitarsmönster som kompletterar x11.
uk: 32-бітовий шаблон, який доповнює x11.

source: The 32bit pattern complementing x11_enhanced.
ar: نمط 32bit المكمل ل x11_enhanced.
ca: El patró de 32 bits que complementa X11 millorat.
cs: 32bitový vzor doplňující x11_enhanced.
da: 32-bit-mønsteret som komplimenterer x11_enhanced.
de: Das 32-Bit-Schema welches x11_enhanced ergänzt.
es: El patrón de 32 bits que complementa a x11_enhanced.
fi: x11_enhanced-kuviota täydentävä 32-bittinen kuvio.
id: Pola 32bit melengkapi x11_enhanced.
it: Modello a 32 bit complementare a x11_enhanced.
pl: 32-bitowy wzorzec uzupełniający rozszerzony system x11.
pt_br: O padrão de 32 bits que complementa o sistema de janelas X aprimorado.
ru: 32-разрядный шаблон, который дополняет x11_enhanced.
sl: 32-bitni vzorec, ki dopolnjuje x11_enhanced.
sv: 32-bitarsmönstret som kompletterar x11_enhanced.
uk: 32-бітовий шаблон, який доповнює x11_enhanced.

source: Fonts
ar: الخطوط
ca: Lletres
cs: Písma
da: Skrifttyper
de: Schriftarten
es: Fuentes tipográficas
fi: Kirjasimet
id: Fonta
it: Tipi di carattere
pl: Czcionki
pt_br: Fontes
ru: Шрифты
sl: Pisave
sv: Teckensnitt
uk: Шрифти

source: Base fonts and font configuration.
ar: الخطوط الأساسية وترتيب الخطوط.
ca: Lletres de base i configuració de tipus de lletres.
cs: Základní písma a jejich nastavení.
da: Grundlæggende skrifttyper og skrifttypekonfiguration.
de: Basis-Schriftarten und deren Konfiguration.
es: Fuentes tipográficas básicas y configuración de las fuentes.
fi: Peruskirjasimet ja kirjasinten asetukset.
id: Fonta dasar dan konfigurasi fonta.
it: Tipi di carattere di base e configurazione dei tipi di carattere.
pl: Podstawowe czcionki i ich konfiguracja.
pt_br: Fontes básicas e configuração de fontes.
ru: Основные шрифты и их настройки.
sl: Osnovne pisave in nastavitve pisav.
sv: Grundläggande teckensnitt och teckensnittsinställningar.
uk: Базові шрифти і налаштування шрифтів.

source: YaST User Interfaces
ar: واجهات مستخدم YaST
ca: Interfícies d'usuari del YaST
cs: YaST uživatelského rozhraní
da: YaST-brugergrænseflader
de: Benutzer-Oberflächen für YaST
es: Interfaces de usuario para YaST
fi: YaST-käyttöliittymät
id: Antarmuka pengguna YaST
it: Interfacce utente di YaST
pl: Interfejsy użytkownika YaST
pt_br: Interfaces do YaST
ru: Пользовательский интерфейс YaST
sl: Uporabniški vmesniki YaST
sv: YaST-användargränssnitt
uk: Користувацькі інтерфейси YaST

source: Graphical YaST user interfaces for minimal X desktop.
ar: واجهات المستخدم الرسومية في YaST لسطح المكتب المصغر X.
ca: Interfícies d'usuari gràfiques del YaST per a l'escriptori X mínim.
cs: Grafické rozhraní programu YaST pro minimální X systém.
da: Grafiske YaST-brugergrænseflader til minimalt X-skrivebord.
de: Grafische YaST-Benutzeroberflächen für den Minimalen X Desktop.
es: Interfaces gráficas de YaST para un escritorio X mínimo.
fi: YaST-ohjelman graafinen käyttöliittymä minimaaliselle X-työpöytäympäristölle.
id: Antarmuka pengguna YaST grafis untuk destop X minimal.
it: Interfacce utente grafiche di YaST per il desktop X minimale.
pl: Graficzny interfejs programu YaST dla minimalnej stacji roboczej X.
pt_br: Interfaces gráficas do YaST para uma área de trabalho X mínima.
ru: Графический пользовательский интерфейс YaST для минимального рабочего стола X.
sl: Grafični uporabniški vmesniki YaST za minimalno namizje na X.
sv: Grafiska YaST-användargränssnitt för minimalt X-skrivbord.
uk: Графічна оболонка користувача YaST для мінімальної X стільниці.

source: YaST Base Utilities
ar: أدوات ياست اﻷساسية YaST Base
ca: Utilitats de base del YaST
cs: Základní utility YaST
de: YaST Base-Hilfsprogramme
es: Utilidades básicas de YaST
fi: YaST – Perustyökalut
id: Utilitas Dasar YaST
it: Utilità base YaST
pl: Podstawowe narzędzia YaST
pt_br: Utilitários Base YaST
ru: Базовые утилиты YaST
sl: Osnovna orodja YaST
sv: YaST bas Verktyg
uk: Базові утиліти YaST

source: YaST tools for basic system administration.
ar: أدوات YaST لإدارة النظام الأساسي.
ca: Eines del YaST per a l'administració bàsica del sistema.
cs: Nástroje programu YaST pro základní správu systému.
da: YaST-værktøjer til grundlæggende systemadministration.
de: YaST-Tools für die grundlegende Systemadministration.
es: Herramientas YaST para administración básica del sistema.
fi: YaST-työkalut perusjärjestelmänhallintaan.
id: Perkakas YaST untuk administrasi sistem dasar.
it: Strumenti di YaST per l'amministrazione di base del sistema.
pl: Narzędzia YaST do podstawowej administracji systemem.
pt_br: Ferramentas YaST para uma administração básica do sistema.
ru: Инструменты YaST для базового системного администрирования.
sl: Orodja YaST za osnovno upravljanje sistema.
sv: YaST-verktyg för grundläggande systemadministration.
uk: Засоби YaST для простого адміністрування системи.
