Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: A selection of packages that installs the System z HW crypto stack on System z.
ar: مجموعة من الحزم تعمل على تثبيت صفيف تشفير الأجهزة لأنظمة z على نظام z.
ca: Una selecció de paquets que instal·len la criptografia System z HW al sistema z.
cs: Výběr balíčků instalujících šifrovací suitu ze Systému z HW na Systém z.
da: Et udvalg af pakker som installerer System z HW-cryptostakken på System z.
de: Eine Auswahl von Paketen, mit denen das System 'z HW crypto stack' auf System z installiert wird.
es: Una selección de paquetes que instala la pila de cifrado de hardware de System z.
id: Pilihan paket yang memasang stack kripto System z HW pada Sistem z.
it: Una selezione di pacchetti the installa lo stack di System z HW crypto su System z.
pl: Wybór pakietów, które służą do instalowania stosu szyfrowania sprzętowego na komputerach mainframe System z.
pt_br: Uma seleção de pacotes que instala a pilha de criptografia HW do System z no System z.
ru: Набор пакетов, которые устанавливают стек шифрования System z HW для System z.
sl: Nabor paketov, ki na System z namestijo sklad za šifriranje s strojno opremo.
sv: Ett urval av paket som installerar ett System z HW-krypteringsstack på System z.
uk: Вибір пакунків, які встановлюють стек шифрування System z HW на System z.

source: Xen Virtual Machine Host Server
ar: خادم استضافة جهاز Xen الظاهري
ca: Servidor amfitrió de màquina virtual de Xen
cs: Hostitelský systém pro Xen
da: Xen virtuel maskine-værtsserver
de: Hostserver für Xen Virtual Machine
es: Servidor anfitrión para la máquina virtual Xen
fi: Isäntäpalvelin Xen-virtuaalikoneille
id: Peladen Host Mesin Virtual Xen
it: Host server per macchine virtuali Xen
pl: Serwer maszyn wirtualnych Xen
pt_br: Servidor de máquina virtual Xen
ru: Хост-сервер виртуальных машин Xen
sl: Strežnik gostitelj navideznih računalnikov Xen
sv: VM-servern Xen
uk: Хост-сервер віртуальних машин Xen

source: XEN Virtualization Host and tools
ar: استضافة جهاز Xen الظاهري والأدوات
ca: Amfitrió de virtualització XEN i eines
cs: Virtualizační hostitel XEN a nástroje
da: Vært og værktøjer til XEN-virtualisering
de: XEN-Virtualisierungs-Host und Tools
es: Host de virtualización XEN y herramientas
fi: XEN-virtualisointipalvelin ja -työkalut
id: Host dan perkakas Virtualisasi XEN
it: Strumenti e host di virtualizzazione di XEN
pl: Host wirtualizacji XEN i narzędzia
pt_br: Host e ferramentas de virtualização para XEN
ru: Хост и инструменты виртуализации XEN
sl: Gostitelj navideznih računalnikov Xen in povezana orodja
sv: Värd och verktyg för XEN-virtualisering
uk: Вузол та інструменти віртуалізації XEN

source: This will provide all minimal system to get a running XEN Hypervisor and be able to configure, manage, and monitor virtual machines on a single physical machine.
ar: سيوفر ذلك الحد الأدنى من متطلبات النظام لتشغيل بيئة أجهزة XEN الظاهرية والقدرة على تكوين الأجهزة الظاهرية وإدارتها ومراقبتها على جهاز فعلي واحد.
ca: Això proporcionarà a tots els sistemes mínims per posar un hipervisor Xen en funcionament i poder configurar, gestionar i monitorar màquines virtuals en una sola màquina física.
cs: Poskytuje kompletní minimální systém pro spuštění XEN hypervizoru a možnosti jeho nastavení, správy a monitorování virtuálních strojů na jednom fyzickém stroji.
da: Det leverer et minimalt system til at få et kørende XEN-hypervisor og være i stand til at konfigurere, håndtere og overvåge virtuelle maskiner på en enkelt fysisk maskine.
de: Dies stellt einen funktionsfähigen XEN Hypervisor für alle minimalen Systeme bereit und ermöglicht die Konfiguration, Verwaltung und Überwachung von mehreren virtuellen Maschinen über eine einzige physische Maschine.
es: Esto proporciona un sistema mínimo para tener un Hipervisor XEN en funcionamiento y poder configurar, gestionar y supervisar máquinas virtuales en un único sistema físico.
fi: Tämä tarjoaa XEN-hypervisiirin ajamiseen tarvittavan vähimmäisjärjestelmän, jolla voi määrittää, hallita ja valvoa useita virtuaalikoneita yksittäisellä fyysisellä koneella.
id: Ini akan memberikan semua sistem minimal untuk menjalankan Hypervisor XEN yang berjalan dan dapat mengkonfigurasi, mengelola, dan memantau mesin virtual pada satu mesin fisik.
it: Viene fornito tutto il sistema minimo per eseguire un Hypervisor XEN e poter configurare, gestire e monitorare le macchine virtuali su un unico computer fisico.
pl: Zapewnia kompletny minimalny system pozwalający uruchomić hyperwizora XEN, co z kolei umożliwi konfigurowanie i monitorowanie maszyn wirtualnych oraz zarządzanie nimi na jednej fizycznej maszynie.
pt_br: Isso fornece um sistema mínimo para ter um XEN Hypervisor em funcionamento e ser capaz de configurar, gerenciar e monitorar máquinas virtuais em um único sistema físico.
ru: Пакет для создания минимальной ситсемы для запуска гипервизора XEN для настройки, администрирования и отслеживания работы виртуальных машин на одном физическом компьютере.
sl: To ponuja minimalni sistem za poganjanje hipervizorja Xen in omogoča nastavljanje, upravljanje in nadzorovanje navideznih računalnikov na enem fizičnem računalniku.
sv: Detta ger alla minimala system en XEN-hypervisor som körs för att konfigurera, hantera och övervaka virtuella enheter på en enskild fysiskt enhet.
uk: Пакунок для створення мінімальної системи для запуску гіпервізора XEN із можливостями налаштовувати, керувати та відстежувати віртуальні машини на одній фізичній машині.

source: Transactional Base System
ar: نظام قاعدة المعاملات
ca: Sistema de base transaccional
cs: Základní transakční systém
da: Transaktionelt grundlæggende system
de: Transaktionales Basissystem
es: Sistema transaccional básico
fi: Kaupallinen perusjärjestelmä
id: Sistem Dasar Transactional
it: Sistema transazionale di base
pl: Podstawowy system stacji roboczej
pt_br: Sistema base transacional
ru: Транзакционная базовая система
sl: Transakcijski osnovni sistem
sv: Transaktionellt bassystem
uk: Транзакційна базова система

source: This is the base system for a host updated by Transactional Updates. Includes Tools for systems with a read-only root filesystem.
ar: هذا هو النظام الأساسي للمضيف الذي تم تحديثه بواسطة تحديثات المعاملات. يتضمن أدوات للأنظمة مع نظام ملفات جذر للقراءة فقط.
ca: Aquest és el sistema de base per a un amfitrió actualitzat per actualitzacions transaccionals. Inclou eines per a sistemes amb un sistema de fitxers d'arrel només de lectura.
cs: Toto je základní systém pro počítač aktualizovaný transakčními aktualizacemi. Obsahuje nástroje pro systémy s kořenovým systémem souborů jen pro čtení (read-only root filesystem).
da: Dette er det grundlæggende system til en vært som opdateres af transaktionelle opdateringer. Inkluderer værktøjer til systemer med et skrivebeskyttet rodfilsystem.
de: Dies ist das Basissystem für einen Host, der durch transaktionale Aktualisierungen aktualisiert wird. Beinhaltet Werkzeuge für Systeme mit einem Nur-Lesen Rootdateisystem.
es: Sistema base para equipos actualizados mediante actualizaciones transaccionales. Incluye herramientas para sistemas con el sistema de archivos raíz de solo lectura.
fi: Tämä on transaktionaalisten päivitysten päivittämä perusjärjestelmä. Sisältää järjestelmätyökalut ja vain luettavan juuritiedostojärjestelmän.
id: Ini adalah sistem dasar untuk host yang diperbarui oleh Transactional Updates. Termasuk Perkakas untuk sistem dengan sistem berkas root hanya-baca.
it: Questo è il sistema di base per un host aggiornato tramite aggiornamenti transazionali. Include strumenti per sistemi con file system in sola lettura.
pl: Jest to system podstawowy dla hosta aktualizowanego przez aktualizacje transakcyjne. Zawiera narzędzia dla systemów z głównym systemem plików tylko do odczytu.
pt_br: Este é o sistema base para uma máquina atualizada por atualizações transacionais. Inclui ferramentas para sistemas com um sistema raiz de arquivos somente leitura.
ru: Это базовая система для компьютера, обновляемого транзакционными обновлениями. Включает инструменты для систем с корневой файловой системой только для чтения.
sl: To je osnovni sistem za gostitelja, ki se ga posodablja s transakcijskimi posodobitvami. Vsebuje orodja za sisteme s korenskim datotečnim sistemom samo za branje.
sv: Detta är bassystemet för en värd som uppdateras av Transaktionella uppdateringar. Inkluderar verktyg för system med ett skrivskyddat rootfilsystem.
uk: Це базова система для вузла, який оновлюється транзакційними оновленнями. Включає засоби для систем із кореневою файловою системою лише для читання.

source: GEO Clustering for High Availability
ar: تكوين أنظمة المجموعات حسب المناطق الجغرافية لقابلية الوصول العالية
ca: Clústers de GEO per a disponibilitat alta
cs: GEO Clustering pro vysokou dostupnost
da: GEO-clustering til høj tilgængelighed
de: GEO-Clustering für High Availability
fi: GEO-klusterointi korkean käytettävyyden vuoksi
id: Geo Clustering untuk Ketersediaan Tinggi (High Availability)
it: GEO Cluster per alta disponibilità
pl: Usługi klastrowe GEO dla wysokiej dostępności
pt_br: GEO Clustering para alta disponibilidade
ru: Кластеризация GEO для высокой доступности
sl: Gručenje GEO za visoko razpoložljivost
sv: GEO-klustring för hög åtkomlighet
uk: Кластеризація GEO для високої доступності

source: This pattern provides tools for building multi-site clustering setups based on the SUSE Linux Enterprise High-Availability and its GEO extension.
ar: يوفر هذا النمط أدوات لتنفيذ عمليات الإعداد الخاصة بتكوين أنظمة المجموعات في المواقع المتعددة استنادًا إلى SUSE Linux Enterprise High-Availability وملحق GEO الخاص به.
ca: Aquest patró proporciona eines per crear configuracions de clústers de diversos llocs basades en l’alta disponibilitat de SUSE Linux Enterprise i la seva extensió GEO.
cs: Tento vzor poskytuje nástroje pro vytváření clusterových konfigurací s více lokalitami na SUSE Linux Enterprise High-Availability a rozšíření GEO.
da: Dette mønster giver værktøjer til at bygge multisted-clustering-opsætninger baseret på SUSE Linux Enterprise høj tilgængelig og dets GEO-udvidelse.
de: Dieses Schema enthält Tools zur Erstellung von Cluster-Einrichtungen, die mehrere Sites umfassen, auf Basis der SUSE Linux Enterprise High-Availability- und GEO-Extension.
es: Este patrón proporciona herramientas para crear configuraciones de agrupación en clústeres multisitio en SUSE Linux Enterprise High-Availability y su extensión GEO.
id: Pola ini menyediakan perkakas untuk membangun pengaturan pengelompokan multi-situs berdasarkan SUSE Linux Enterprise High-Availability dan ekstensi GEO-nya.
it: Questo modello fornisce gli strumenti per creare configurazioni clustering multisito in base a SUSE Linux Enterprise High-Availability e alla rispettiva estensione GEO.
pl: Ten wzorzec zawiera narzędzia do tworzenia wieloośrodkowych konfiguracji klastrowania bazujących na wysokiej dostępności systemu SUSE Linux Enterprise oraz na jego rozszerzeniu GEO.
pt_br: Este padrão fornece ferramentas para criar configurações de clustering de vários sites com base no SUSE Linux Enterprise High-Availability e sua extensão GEO.
ru: Этот шаблон содержит инструменты для создания мультисайтовых кластерных конфигураций на базе средств обеспечения высокой доступности SUSE Linux Enterprise и соответствующего расширения GEO.
sl: Za vzorec ponuja orodja za postavljanje gruč z računalniki na več mestih, ki so osnovane na SUSE Linux Enterprise High-Availability in razširitvi GEO.
sv: Detta mönster levererar verktyg för att bygga klusterinstallationer på flera platser baserade på SUSE Linux Enterprise med hög tillgänglighet och dess GEO-tillägg.
uk: Цей шаблон надає інструменти для створення налаштувань кластеризації кількох сайтів на основі SUSE Linux Enterprise High-Availability та його розширення GEO.

source: High Availability
ar: قابلية وصول عالية
ca: Alta disponibilitat
cs: Vysoká dostupnost
da: Høj tilgængelighed
de: Hochverfügbarkeit
es: Alta disponibilidad (HA)
fi: Korkea saatavuus
id: Ketersediaan Tinggi (High Availability)
it: Alta disponibilità
pl: Wysoka dostępność
pt_br: Alta disponibilidade
ru: Высокая доступность
sl: Visoka razpoložljivost
sv: Hög tillgänglighet
uk: Висока наявність

source: Provide tools to ensure a high degree of operational continuity and reduce the downtimes of your system.
ar: توفير الأدوات لضمان درجة عالية من استمرار التشغيل وخفض أوقات التعطل بالنظام.
ca: Proporciona eines per garantir un alt grau de continuïtat operativa i reduir els temps d'inactivitat del sistema.
cs: Nabízí nástroje k zajištění operability a výkonu systému.
da: Giver værktøjer til sikringen af en høj grad operationel kontinuitet og reducerer dit systems nedetider.
de: Bietet Werkzeuge, die einen weitgehend unterbrechungsfreien Betrieb gewährleisten und die Ausfallzeiten Ihres Systems verringern.
es: Proporciona herramientas para garantizar un alto grado de continuidad del funcionamiento y reducir los tiempos de inactividad del sistema.
fi: Tarjoaa työkalut, jotka takaavat toiminnan yhtäjaksoisuuden ja vähentävät järjestelmän alhaalla oloaikaa.
id: Menyediakan perkakas untuk memastikan tingkat kelangsungan operasional yang tinggi dan mengurangi waktu henti sistem Anda.
it: Fornisce gli strumenti per garantire un elevato livello di continuità operativa e ridurre i tempi di inattività del sistema.
pl: Zestaw narzędzi zapewniających wysoki stopień ciągłości operacyjnej i ograniczających czas przestoju systemu.
pt_br: Fornece ferramentas para garantir um alto grau de continuidade operacional e reduzir os tempos de inatividade do sistema.
ru: Инструменты для обеспечения непрерывной работы системы и сокращения времени ее простоев.
sl: Ponuja orodja za zagotavljanje visoke stopnje nepretrganega delovanja in zmanjšanja časa nedelovanja sistema.
sv: Konfigurera verktyg som ökar kontinuiteten i systemets funktion och minskar avbrotten.
uk: Надає засоби, які забезпечують високий рівень безперервного функціонування вашої системи.

source: Help and Documentation, various books.
ar: الإرشادات والتوثيق، كتب متعددة.
ca: Ajuda i documentació, diversos llibres.
cs: Nápověda a dokumentace, různé knihy.
da: Hjælp og dokumentation, diverse bøger.
de: Hilfe und Dokumentation, verschiedene Bücher.
es: Ayuda y documentación, varios libros.
fi: Ohje ja dokumentaatio, erilaisia kirjoja.
id: Bantuan dan Dokumentasi, berbagai buku.
it: Guide e documentazione, libri vari.
pl: Pomoc oraz dokumentacja - różne podręczniki.
pt_br: Ajuda e documentação, vários livros.
ru: Справка и документация, различные книги.
sl: Pomoč in dokumentacija, razne knjige.
sv: Hjälp och dokumentation, flera böcker.
uk: Довідка та документація, різні книги.

source: Graphics
ar: الصور
ca: Gràfics
cs: Grafika
da: Grafik
de: Grafiken
es: Gráficos
fi: Grafiikka
id: Grafis
it: Grafica
pl: Grafika
pt_br: Gráficos
ru: Графика
sl: Grafika
sv: Grafik
uk: Графіка

source: Handling of digital photos and graphics.
ar: معالجة الصور الرقمية والرسومات.
ca: Gestió de fotografies i gràfics digitals.
cs: Práce s fotografiemi a grafikou.
da: Håndtering af digitale fotos og grafik.
de: Bearbeitung von digitalen Fotos und Grafiken.
es: Gestión de fotografías digitales y gráficos.
fi: Digikuvien ja grafiikan käsittely.
id: Penanganan foto dan grafis digital.
it: Gestione di immagini e fotografie digitali.
pl: Obsługa zdjęć cyfrowych i grafiki.
pt_br: Tratamento de fotografias digitais e gráficos.
ru: Обработка цифровых фотографий и рисунков.
sl: Obdelovanje digitalnih fotografij in grafike.
sv: Hantering av digitala foton och grafik.
uk: Обробка цифрових фотографій та графіки.

source: Desktop Functions
ar: وظائف سطح المكتب
ca: Funcions d'escriptori
cs: Pracovní stanice
da: Skrivebordsfunktioner
de: Desktopfunktionen
es: Funciones de escritorio
fi: Työpöytätoiminnot
id: Fungsi Destop
it: Funzioni desktop
pl: Funkcje stacji roboczej
pt_br: Funções da área de trabalho
ru: Функции рабочего стола
sl: Namizne funkcije
sv: Skrivbordsfunktioner
uk: Стільничні функції

source: Mobile
ca: Mòbil
cs: Mobilní
de: Mobil
es: Móvil
fi: Mobiili
id: Seluler
it: Dispositivo mobile
pl: Mobilny
pt_br: Móvel
ru: Мобильный
sl: Mobilnost
sv: Mobil
uk: Портативна стільниця

source: Multimedia
ar: الوسائط المتعددة
ca: Multimèdia
cs: Multimédia
da: Multimedie
pl: Multimedie
pt_br: Multimídia
ru: Мультимедиа
sl: Predstavnost
uk: Мультимедіа

source: Multimedia players, sound editing tools, video and image manipulation applications.
ar: برامج تشغيل الوسائط المتعددة وأدوات تحرير الصوت وتطبيقات استخدام مقاطع الفيديو والصور.
ca: Reproductors multimèdia, eines d'edició de so, vídeo i aplicacions de manipulació d'imatges.
cs: Multimediální přehrávače, nástroje pro editaci zvuku, programy pro práci s obrázky a videem.
da: Multimedieafspillere, lydredigeringsværktøjer, video- og billedmanipulationsprogrammer.
de: Multimedia-Player, Sound-Editoren, Video- und Bildbearbeitungsanwendungen.
es: Reproductores multimedia, herramientas de edición de sonido, aplicaciones de manipulación de imágenes y vídeo.
fi: Multimediasoittimet sekä äänen-, kuvan- ja videonkäsittelysovellukset.
id: Pemutar multimedia, perkakas penyunting suara, aplikasi manipulasi video dan gambar.
it: Lettori multimediali, strumenti di elaborazione audio, applicazioni per l'elaborazione di video e di immagini.
pl: Odtwarzacze multimedialne, edytory dźwiękowe, graficzne i wideo.
pt_br: Reprodutores multimídia, ferramentas para edição de som, aplicativos de manipulação de vídeo e imagem.
ru: Мультимедийные проигрыватели, инструменты редактирования звука, приложения для управления изображениями и видео.
sl: Predstavnostni predvajalniki, urejevalniki zvoka, programi za urejanje videa in slik.
sv: Multimediespelare, ljudredigeringsverktyg, video- och bildhanteringsprogram.
uk: Програвачі мультимедії, засоби редагування аудіо, програми маніпуляції відео і зображень.

source: Technical Writing
ar: الكتابة التقنية
ca: Escriptura tècnica
cs: Technické psaní
da: Tekniske skriveværktøjer
de: Technische Dokumentation
es: Escritos técnicos
fi: Tekninen dokumentointi
id: Penulisan Teknis
it: Scrittura tecnica
pl: Pisma techniczne
pt_br: Escrita técnica
ru: Создание технических текстов
sl: Tehnično pisanje
sv: Teknisk dokumentation
uk: Технічні статті

source: Authoring tools and editors for creating technical documentation.
ar: أدوات الكتابة والتحرير لإنشاء وثائق تقنية.
ca: Eines d'autoria i editors per crear documentació tècnica.
cs: Vývojové nástroje a editory pro tvorbu technické dokumentace.
da: Skriveværktøjer og redigeringsprogrammer til at oprette teknisk dokumentation.
de: Autoren-Werkzeuge und Editoren zum Erstellen technischer Dokumentationen.
es: Herramientas de autor y editores para crear documentación técnica.
fi: Työkalut ja muokkaimet teknisten dokumentaatioiden luomiseen.
id: Perkakas pembuat dan peyunting untuk membuat dokumentasi teknis.
it: Strumenti ed editor di scrittura per la creazione della documentazione tecnica.
pl: Narzędzia dla autorów oraz edytory do tworzenia dokumentacji technicznej.
pt_br: Ferramentas de autoração e editores para a criação de documentação técnica.
ru: Инструменты создания и редактирования технической документации.
sl: Orodja za pisanje in urejanje tehnične dokumentacije.
sv: Skrivverktyg och redigerare för att skapa teknisk dokumentation.
uk: Засоби створення і редагування технічної документації.

source: GNOME Desktop Environment (Wayland)
ar: بيئة سطح المكتب GNOME (Wayland)‎
ca: Entorn d'escriptori GNOME (Wayland)
cs: Desktopové prostředí GNOME (Wayland)
da: GNOME-skrivebordsmiljø (Wayland)
de: GNOME-Desktopumgebung (Wayland)
es: Entorno de escritorio GNOME (Wayland)
fi: GNOME-työpöytäympäristö (Wayland)
id: Lingkungan Destop GNOME (Wayland)
it: Ambiente desktop GNOME (Wayland)
pl: Środowisko graficzne GNOME (Wayland)
pt_br: Ambiente de trabalho GNOME (Wayland)
ru: Среда рабочего стола GNOME (Wayland)
sl: Namizno okolje GNOME (Wayland)
sv: GNOME-skrivbordsmiljö (Wayland)
uk: Стільничне середовище GNOME (Wayland)

source: The GNOME desktop environment is an intuitive and attractive desktop for users. This pattern installs components for GNOME to run with Wayland and X11 technologies.
ar: تعد بيئة سطح المكتب GNOME عبارة عن سطح مكتب حدسي وجذاب للمستخدمين. يعمل هذا النمط على تثبيت المكونات لتشغيل GNOME مع تقنيات Wayland وX11.
ca: L'entorn d'escriptori GNOME és un escriptori intuïtiu i atractiu per als usuaris. Aquest patró instal·la components per al GNOME per executar-se amb les tecnologies Wayland i X11.
cs: Desktopové prostředí GNOME je intuitivní a atraktivní plocha pro uživatele. Tento vzor nainstaluje komponenty, aby GNOME mohlo běžet s technologiemi Wayland a X11.
da: GNOME-skrivebordsmiljøet er et intuitivt og attraktivt skrivebord til brugere. Mønsteret installerer komponenter så GNOME kan kører med Wayland- og X11-teknologier.
de: Die GNOME-Desktopumgebung ist eine intuitive und attraktive Arbeitsoberfläche für Benutzer. Dieses Schema installiert Komponenten, um GNOME mit der Wayland- und X11-Technologie ausführen zu können.
es: El entorno de escritorio GNOME es un escritorio atractivo e intuitivo para los usuarios. Este patrón instala los componentes para que GNOME se ejecute con las tecnologías Wayland y X11.
fi: GNOME on intuitiivinen ja vetovoimainen työpöytäympäristö. Tämä kuvio asentaa GNOMEn osat Wayland- ja X11-alustoja varten.
id: Lingkungan destop GNOME adalah destop yang intuitif dan menarik bagi pengguna. Pola ini memasang komponen untuk GNOME agar dapat berjalan dengan teknologi Wayland dan X11.
it: L'ambiente desktop GNOME è un desktop per utenti intuitivo e interessante. Questo modello consente di installare i componenti per eseguire GNOME con le tecnologie Wayland e X11.
pl: GNOME to intuicyjne i atrakcyjne dla użytkowników środowisko graficzne. Ten wzorzec służy do instalowania składników środowiska GNOME, które pozwolą na korzystanie z technologii Wayland oraz X11.
pt_br: O ambiente de trabalho GNOME é uma área de trabalho atraente e intuitiva para os usuários. Esse padrão instala os componentes do GNOME para serem executados com as tecnologias Wayland e X11.
ru: Среда рабочего стола GNOME — это интуитивный и привлекательный рабочий стол для пользователей. Этот шаблон устанавливает компоненты для запуска GNOME с использованием технологий Wayland и X11.
sl: Namizno okolje GNOME je intuitivno in privlačno uporabniško namizje. Ta vzorec namesti komponente za poganjanje GNOME na grafičnih sistemih Wayland in X11.
sv: GNOME-skrivbordsmiljön är en intuitiv och attraktiv skrivbordsmiljö för användare. Detta mönster installerar komponenter för GNOME som kan köras med Wayland- och X11-teknik.
uk: Стільничне середовище GNOME - це інтуїтивно зрозуміла та приваблива стільниця для користувачів. Цей шаблон встановлює компоненти для роботи GNOME з технологіями Wayland і X11.

source: GNOME Graphics
ar: رسومات GNOME
ca: Gràfics del GNOME
cs: Grafika GNOME
da: GNOME-grafik
de: GNOME-Grafiken
es: Gráficos de GNOME
fi: GNOME-grafiikka
id: Grafis GNOME
it: Grafica GNOME
pl: Grafika GNOME
pt_br: Gráficos do GNOME
ru: Графика для GNOME
sl: Grafika GNOME
sv: GNOME-grafik
uk: Графіка для GNOME

source: Handling of digital photos and graphics
ar: معالجة الصور الرقمية والرسومات
ca: Gestió de fotografies i gràfics digitals
cs: Práce s digitálními fotografiemi a grafikou
da: Håndtering af digitale fotos og grafik
de: Bearbeitung von digitalen Fotos und Grafiken
es: Manejo de fotografías digitales y gráficos
fi: Digikuvien ja grafiikan käsittely
id: Penanganan foto dan grafis digital
it: Gestione di immagini e fotografie digitali
pl: Obsługa cyfrowych zdjęć i grafik
pt_br: Tratamento de fotografias digitais e gráficos
ru: Обработка цифровых фотографий и рисунков
sl: Obdelovanje digitalnih fotografij in grafike
sv: Hantering av digitala foton och grafik
uk: Обробка цифрових фотографій та графіки
