Repository: openSUSE/packages-i18n
Catalog: */po/patterns.*.po
Languages: ar, ca, cs, da, de, es, fi, id, it, pl, pt_br, ru, sl, sv, uk

source: GNOME Desktop
ar: سطح المكتب GNOME
ca: Escriptori GNOME
cs: Pracovní plocha GNOME
da: GNOME-skrivebord
es: Escritorio GNOME
fi: GNOME-työpöytä
id: Destop GNOME
it: Desktop GNOME
pl: Środowisko GNOME
pt_br: Área de trabalho GNOME
ru: Рабочий стол GNOME
sl: Namizje GNOME
sv: GNOME-skrivbordsmiljö
uk: Стільниця GNOME

source: GNOME Multimedia
ar: الوسائط المتعددة في GNOME
ca: Multimèdia del GNOME
cs: GNOME multimédia
da: GNOME-multimedie
es: Multimedia de GNOME
it: Multimedia GNOME
pl: Multimedia GNOME
pt_br: Multimídia do GNOME
ru: Мультимедиа GNOME
sl: Predstavnost GNOME
uk: Мультимедія GNOME

source: GNOME Desktop Environment (X11)
ar: بيئة سطح المكتب GNOME (X11)‎
ca: Entorn d'escriptori GNOME (X11)
cs: Desktopové prostředí GNOME (X11)
da: GNOME-skrivebordsmiljø (X11)
de: GNOME-Desktopumgebung (X11)
es: Entorno de escritorio GNOME (X11)
fi: GNOME-työpöytäympäristö (X11)
id: Lingkungan Destop GNOME (X11)
it: Ambiente desktop GNOME (X11)
pl: Środowisko graficzne GNOME (X11)
pt_br: Ambiente de trabalho do GNOME (X11)
ru: Среда рабочего стола GNOME (X11)
sl: Namizno okolje GNOME (X11)
sv: GNOME-skrivbordsmiljö (X11)
uk: Стільничне середовище GNOME (X11)

source: The GNOME desktop environment is an intuitive and attractive desktop for users. This pattern installs a full featured GNOME desktop environment, including Office suite, E-Mail client, Web Browser, File Manager, running with X11 technology.
ar: بيئة سطح المكتب GNOME هي بيئة سطح مكتب سهلة وجذابة للمستخدمين. يعمل هذا النمط على تثبيت بيئة سطح المكتب GNOME بكامل ميزاتها، بما في ذلك مجموعة تطبيقات Office وعميل البريد الإلكتروني ومتصفح الويب ومدير الملفات , للعمل من خلال تقنية X11.
ca: L'entorn d'escriptori GNOME és un escriptori intuïtiu i atractiu per als usuaris. Aquest patró instal·la un entorn d'escriptori GNOME complet, incloent-hi un conjunt de programes d'oficina, un client de correu electrònic, un navegador web, un administrador de fitxers; amb tecnologia X11.
cs: Prostředí pracovní plochy GNOME je intuitivní a atraktivní pracovní plocha pro uživatele. Tato sestava instaluje úplné prostředí pracovní plochy GNOME, včetně sady Office, klienta e-mailu, webového prohlížeče, vše pro technologii X11.
da: GNOME-skrivebordsmiljøet er et intuitivt og attraktivt skrivebord til brugere. Mønsteret installerer et fuldt udrustet GNOME-skrivebordsmiljø, inklusiv kontorsuite, e-mailklient, webbrowser, filhåndtering, kørende med X11-teknologi.
de: Die GNOME-Desktopumgebung ist eine intuitive und attraktive Arbeitsoberfläche für Benutzer. Dieses Schema installiert eine vollständig ausgestattete GNOME-Desktopumgebung, einschließlich Office-Paket, E-Mail-Client, Webbrowser und Dateimanager, die mit der X11-Technologie ausgeführt wird.
es: El entorno de escritorio GNOME es un escritorio intuitivo y atractivo para los usuarios. Este patrón instala el entorno de escritorio GNOME al completo, incluyendo la suite Office, el cliente de correo electrónico, el navegador web y el gestor de archivos. Funciona con la tecnología de X11.
fi: GNOME on intuitiivinen ja vetovoimainen työpöytäympäristö. Tämä kuvio asentaa täydellisen GNOME-työpöytäympäristön toimisto-, sähköposti-, selain- ja tiedostonhallintaohjelmineen X11-alustaa varten.
id: Lingkungan destop GNOME adalah destop yang intuitif dan menarik bagi pengguna. Pola ini memasang lingkungan destop GNOME berfitur lengkap, termasuk aplikasi Perkantoran, klien Surel, Peramban Web, Manajer Berkas, berjalan dengan teknologi X11.
it: L'ambiente desktop GNOME è un desktop per utenti intuitivo e interessante. Questo modello consente di installare un ambiente desktop GNOME dotato di tutte le funzioni, tra cui la suite di Office, il client e-mail, il browser Web, il gestore di file, che viene eseguito con la tecnologia X11.
pl: GNOME to intuicyjne i atrakcyjne dla użytkowników środowisko graficzne. Ten wzorzec służy do instalowania działającego w systemie X11 kompletnego środowiska graficznego GNOME zawierającego pakiet Office, klienta poczty e-mail, przeglądarkę internetową oraz menedżer plików.
pt_br: O ambiente de trabalho GNOME é um desktop intuitivo e atraente para os usuários. Esse padrão instala todo o ambiente de área de trabalho do GNOME, incluindo o pacote de escritório, o cliente de e-mail, o navegador da Web, o gerenciador de arquivos, em execução na tecnologia X11.
ru: Среда рабочего стола GNOME — это интуитивный и привлекательный рабочий стол для пользователей. Этот шаблон устанавливает полнофункциональную среду рабочего стола GNOME, включая пакет Office, почтовый клиент, веб-браузер и файловый менеджер, на базе технологии X11.
sl: Namizno okolje GNOME je intuitivno in privlačno uporabniško namizje. Ta vzorec namesti namizno okolje GNOME z vsemi funkcijami, vključno s pisarniškim paketom, e-poštnim odjemalcem, spletnim brskalnikom, upravljalnikom datotek. Uporablja se grafični sistem X11.
sv: GNOM-skrivbordsmiljön är en intuitiv och attraktiv skrivbordsmiljö för användare. Detta mönster installerar en fullständig GNOME-skrivbordsmiljö med alla funktioner, inklusive Office-serie, e-postklient, webbläsare, filhanterare, och körs med X11-teknik.
uk: Стільничне середовище GNOME - це інтуїтивно зрозуміла та приваблива стільниця для користувачів. Цей шаблон встановлює повнофункціональне стільничне середовище GNOME, включно з офісним пакетом, клієнтом електронної пошти, WEB-переглядачем, менеджером файлів, що працює за технологією X11.

source: Office Software
ar: برامج Office
ca: Programari d'oficina
cs: Kancelářské programy
da: Kontorsoftware
de: Büroprogramme
es: Software de oficina
fi: Toimisto-ohjelmisto
id: Perangkat Lunak Perkantoran
it: Programmi per l'ufficio
pl: Oprogramowanie biurowe
pt_br: Programas de escritório
ru: Офисные программы
sl: Pisarniški programi
sv: Office-programvara
uk: Офісні програми

source: Office software for your desktop environment including LibreOffice.
ar: برامج Office لبيئة سطح المكتب لديك بما في ذلك LibreOffice.
ca: Programari d'oficina per a l'entorn d'escriptori que inclou el LibreOffice.
cs: Kancelářské programy pro vaše desktopovéprostředí včetně LibreOffice.
da: Kontorsoftware til dit skrivebordsmiljø inklusiv LibreOffice.
de: Büroprogramme für den Desktop - inklusive LibreOffice.
es: Software de oficina para su entorno de escritorio, incluyendo LibreOffice.
fi: Toimistosovellukset sisältävät myös LibreOffice-ohjelmiston.
id: Perangkat lunak perkantoran untuk lingkungan destop Anda termasuk LibreOffice.
it: Programmi per l'ufficio per l'ambiente desktop, incluso LibreOffice.
pl: Oprogramowanie biurowe wraz z pakietem LibreOffice.
pt_br: Programas de escritório para o seu ambiente de trabalho incluindo o LibreOffice.
ru: Офисные программы для вашей среды рабочего стола, в том числе LibreOffice.
sl: Pisarniška programska oprema za namizno okolje, vključno z LibreOffice.
sv: Kontorsprogram för din skrivbordsmiljö, inklusive LibreOffice.
uk: Офісне ПЗ для вашого стільничного середовища, включно з LibreOffice.

source: Misc. Proprietary Packages
ar: منوعات. حزم مملوكة
ca: Miscel·lània de paquets de propietat
cs: Různé proprietární balíčky
da: Div. proprietære pakker
de: Verschiedene proprietäre Pakete
es: Varios paquetes de código cerrado (privativos)
fi: Sekalaiset suljetun lähdekoodin paketit
id: Aneka Paket Proprietari
it: Pacchetti proprietari vari
pl: Dodatkowe pakiety zastrzeżone
pt_br: Pacotes proprietários diversos
ru: Различные проприетарные пакеты
sl: Razni zaprto-kodni paketi
sv: Diverse icke öppen-källkodsprogram
uk: Різні пакунки з невідкритим кодом

source: Packages that are proprietary and not under an Open Source license
ar: حزم مملوكة وليست مفتوح المصدر
ca: Paquets que són de propietat i que no tenen llicència de codi obert
cs: Proprietární balíčky - nejsou šířeny pod některou z licencí Open Source
da: Pakker som er proprietære og ikke under en open source-licens
de: Proprietäre Pakete, die über keine Open-Source-Lizenz verfügen
es: Paquetes privativos que no están bajo ninguna licencia de software libre
fi: Paketit, jotka ovat suljettuja eivätkä Open Source -lisenssin alaisia
id: Paket yang merupakan proprietari dan tidak di bawah lisensi Open Source
it: Pacchetti che sono proprietari e non sotto una licenza open source
pl: Pakiety zastrzeżone, które nie są objęte licencją oprogramowania o otwartym kodzie źródłowym
pt_br: Pacotes que são proprietários e não estão sob uma licença de código-fonte aberto
ru: Проприетарные пакеты, не имеющие открытой лицензии
sl: Paketi ki so zaprto-kodni in niso pod svobodno in odprto-kodno licenco
sv: Paket som är proprietära och inte under en öppen källkodslicens
uk: Пакунки, які є власницькими та не поширюються під ліцензією відкритого коду

source: Proprietary Software
ar: البرمجيات الاحتكارية
ca: Programari de propietat
cs: Proprietární software
da: Proprietær software
de: Proprietäre Software
es: Software privativo
fi: Suljetun koodin ohjelmistot
id: Perangkat Lunak Proprietari
it: Programmi proprietari
pl: Oprogramowanie zastrzeżone
pt_br: Software proprietário
ru: Несвободные программы
sl: Zaprto-kodni programi
sv: Program med icke öppen källkod
uk: Закрите ПЗ

source: Packages that are proprietary and not under an Open Source license.
ar: الحزم مسجلة الملكية وليس تحت ترخيص مفتوح المصدر.
ca: Paquets que són de propietat i que no tenen llicència de codi obert.
cs: Balíčky, které nejsou šířeny pod některou z open source licencí.
da: Pakker som er proprietære og ikke under en open source-licens.
de: Proprietäre Pakete, die keiner Open-Source-Lizenz unterliegen.
es: Paquetes privativos que no están bajo licencia de software libre.
fi: Paketit, jotka eivät ole Open Source -lisenssin alaisia.
id: Paket yang merupakan proprietari dan tidak di bawah lisensi Open Source.
it: Pacchetti che sono proprietari e non sotto una licenza open source.
pl: Pakiety zastrzeżone, które nie są objęte licencją oprogramowania o otwartym kodzie źródłowym.
pt_br: Pacotes que são proprietários e não estão sob uma licença de código-fonte aberto.
ru: Проприетарные пакеты, не имеющие открытой лицензии.
sl: Paketi ki so zaprto-kodni in niso pod svobodno in odprto-kodno licenco.
sv: Paket som inte har öppen källkod och inte har en öppen källkodslicens.
uk: Пакунки, які не є під ліцензією відкритого коду.

source: Cinnamon is a modern Linux desktop which provides advanced innovative features and a traditional user experience. It's easy to use, powerful and flexible.
ca: El Cinnamon és un escriptori de Linux modern que proporciona funcions innovadores avançades i una experiència d'usuari tradicional. És fàcil d’usar, potent i flexible.
cs: Cinnamon je moderní linuxové pracovní prostředí poskytující pokročilé inovativní funkce a tradiční uživatelskou zkušenost. Je snadno použitelné, výkonné a flexibilní.
de: Cinnamon ist ein moderner Linux-Desktop, der fortschrittliche innovative Funktionen und eine traditionelle Benutzererfahrung bietet. Cinnamon ist einfach zu bedienen, leistungsstark und flexibel.
es: Cinnamon es un moderno escritorio Linux que proporciona innovadoras funciones avanzadas y una experiencia de usuario tradicional. Es fácil de usar, potente y flexible.
fi: Cinnamon on moderni Linux työpöytä joka tarjokaa edistyneitä innovatiivisia ominaisuuksia ja perinteisen käyttökokemuksen. Se on helppokäyttöinen, tehokas ja muokkaantuva.
id: Cinnamon adalah destop Linux modern yang menyediakan fitur inovatif yang canggih dan pengalaman pengguna tradisional. Sangat mudah digunakan, kuat, dan fleksibel.
it: Cinnamon è un moderno desktop Linux che fornisce funzionalità innovative avanzate e un'esperienza utente tradizionale. È di facile utilizzo, potente e flessibile.
pl: Cinnamon to nowoczesny pulpit Linux, który zapewnia zaawansowane, innowacyjne funkcje i tradycyjne wrażenia użytkownika. Jest łatwy w użyciu, wydajny i elastyczny.
pt_br: Cinnamon é uma área de trabalho moderna do Linux que oferece recursos avançados e inovadores e uma experiência do usuário tradicional. É fácil de usar, avançada e flexível.
ru: Cinnamon — это современная среда рабочего стола для Linux, предоставляющая продвинутые инновационные возможности в традиционной парадигме использования. Мощная и гибкая простая в использовании оболочка.
sl: Cinnamon je moderno namizno okolje, ki ponuja napredne inovativne zmožnosti in tradicionalno uporabniško izkušnjo. Je preprost za uporabo, zmogljiv in prilagodljiv.
sv: Cinnamon är en modern Linux-skrivbordsmiljö som ger avancerade innovativa funktioner och en traditionell användarupplevelse. Den är lätt att använda, kraftfull och flexibel.
uk: Cinnamon - це сучасна стільниця Linux, яка забезпечує передові інноваційні функції та традиційну майстерність користувача. Вона проста у використанні, потужна та гнучка.

source: Base System (alias pattern for base)
ca: Sistema de base (patró d'àlies per a base)
cs: Základní systém (alias předloha pro základnu)
de: Basissystem (Alias-Schema für Basis)
es: Sistema base (alias del patrón base)
id: Sistem Dasar (pola alias untuk basis)
it: Sistema di base (modello alias per base)
pl: System podstawowy (wzorzec aliasu dla systemu podstawowego)
pt_br: Sistema base (padrão para base)
ru: Базовая система (шаблон-псевдоним base)
sl: Osnovni sistem (drugo ime za vzorec base)
sv: Bassystem (aliasmönster för bas)
uk: Базова система (псевдонім шаблону base)

source: Console Tools
ar: أدوات وحدة التحكم
ca: Eines de consola
cs: Textové nástroje
da: Konsolværktøjer
de: Konsolenwerkzeuge
es: Herramientas de consola
fi: Konsolityökalut
id: Perkakas Konsol
it: Strumenti della console
pl: Narzędzia konsolowe
pt_br: Ferramentas de console
ru: Инструменты консоли
sl: Konzolna orodja
sv: Konsollverktyg
uk: Консольні засоби

source: Applications useful for those using the console and no graphical desktop environment.
ar: تطبيقات مفيدة لمن لا يستخدم بيئة سطح المكتب الرسومية.
ca: Aplicacions útils per als que facin servir la consola i no pas un entorn d'escriptori gràfic.
cs: Aplikace užitečné pro uživatele nepoužívající grafické prostředí.
da: Programmer som er nyttig til dem der bruger konsollen og intet grafisk skrivebordsmiljø.
de: Anwendungen für Benutzer, die lieber an der Konsole ohne grafische Desktopumgebung arbeiten, nützlich sind.
es: Aplicaciones útiles para aquellos que utilicen la consola y un entorno no gráfico de escritorio.
fi: Sovellukset, jotka ovat tarpeellisia konsolikäytössä ja ei-graafisissa käyttöympäristöissä.
id: Aplikasi yang berguna untuk mereka yang menggunakan konsol dan tidak ada lingkungan destop grafis.
it: Applicazioni utili per quelli che usano la console anziché l'ambiente grafico desktop.
pl: Programy użyteczne dla użytkowników korzystających z konsoli (bez środowiska graficznego).
pt_br: Aplicativos úteis para aqueles que usam o console e nenhum ambiente gráfico de área de trabalho.
ru: Приложения для использующих только консоль, а не графические среды рабочего стола.
sl: Programi, ki so uporabni za uporabo v konzoli in brez grafičnega namiznega okolja.
sv: Program användbara för människor som använder konsollen och ingen grafisk skrivbordsmiljö.
uk: Застосунки, корисні для тих, хто використовує консоль і не має графічного стільничного середовища.

source: Tests for the Update Stack
ar: اختبارات لمجموعة التحديث
ca: Proves per a la pila d'actualitzacions
cs: Testování aktualizace
da: Tests til opdateringsstakken
de: Tests für den Aktualisierungsprozess
es: Pruebas para la pila (stack) de actualización
fi: Päivityksen testaus
id: Uji untuk Tumpukan Pemutakhiran
it: Verifiche per il sistema d'aggiornamento
pl: Testy dla stosu aktualizacji
pt_br: Testes para o software de atualização
ru: Тестирование обновлений
sl: Preizkusi za posodobitveni sklad
sv: Tester för uppdateringsstacken
uk: Тестування оновлень

source: Packages used for testing that the update stack works. These tiny packages do not have any functionality themselves.
ar: الحزم المستخدمة لاختبار حزمة التحديث. هذه الحزم صغيرة ليس لها وظيفة إضافية.
ca: Paquets usats per provar que la pila d'actualitzacions funciona. Aquests petits paquets no tenen cap funcionalitat per si mateixos.
cs: Balíčky pro testování aktualizace. Tyto balíčky nemají žádnou funkci.
da: Pakker som bruges til at teste om opdateringsstakken virker. Disse meget små pakker har ikke nogen funktionalitet i sig selv.
de: Pakete, die nur für Tests von späteren Aktualisierungen erstellt wurden. Diese kleinen Pakete besitzen selbst keine eigene Funktionalität.
es: Paquetes utilizados para pruebas que usan las actualizaciones de pila (stack). Estos diminutos paquetes no tienen ninguna funcionalidad en sí mismos.
fi: Paketit, joita käytetään testaamaan päivityksen toimimista. Nämä pienet paketit eivät itsessään sisällä minkäänlaista toiminnallisuutta.
id: Paket yang digunakan untuk menguji apakah tumpukan pemutakhiran berfungsi. Paket-paket kecil ini tidak memiliki fungsi sendiri.
it: Pacchetti usati per verificare il funzionamento del sistema d'aggiornamento. Questi piccoli pacchetti non hanno altre funzionalità.
pl: Małe pakiety do testowania sprawności stosu aktualizacji. Pakiety te samodzielnie nie mają żadnej funkcjonalności.
pt_br: Pacotes utilizados para testar se o software de atualização funciona. Estes minúsculos pacotes não possuem nenhuma funcionalidade.
ru: Пакеты, используемые для тестирования работы стека обновлений. Эти крошечные пакеты сами по себе никакой функциональности не имеют.
sl: Paketi, ki se uporabljajo za preizkušanje pravilnega delovanja posodobitvenega sklada. Ti majhni paketi sami po sebi ne prinašajo nobene funkcionalnosti.
sv: Paket som används för att testa att uppdateringsstacken fungerar. Dessa små paket har ingen funktion i sig.
uk: Пакунки, використовувані для тестування роботи стека оновлень. Ці крихітні пакунки самі по собі ніякої функціональності не мають.

source: Budgie Desktop Environment
ca: Entorn d'escriptori del Budgie
cs: Pracovní prostředí Budgie
fi: Budgie-työpöytäympäristö
id: Lingkungan Destop Budgie
it: Ambiente desktop Budgie
pl: Środowisko graficzne Budgie
pt_br: Ambiente de trabalho Budgie
ru: Среда рабочего стола Budgie
sl: Namizno okolje Budgie
sv: Budgie Skrivbordsmiljö

source: The Budgie Desktop is a feature-rich, modern desktop designed to keep out the way of the user.
ca: L'escriptori Budgie és un escriptori modern i ric en funcions dissenyat per no fer nosa a l'usuari.
cs: Pracovní prostředí Budgie je funkčně bohatá moderní pracovní plocha navržená tak, aby se přizpůsobila uživateli.
fi: Budgie-työpöytä on monipuolinen moderni työpöytä joka on suunniteltu pysymään poissa käyttäjän tieltä.
id: Budgie Destop adalah destop modern yang kaya fitur yang dirancang untuk pengguna.
it: Budgie Desktop è un desktop moderno e ricco di funzioni progettato per offrire facilità di utilizzo all'utente.
pl: Budgie Desktop to bogate w funkcje, nowoczesne środowisko zaprojektowane tak, aby nie przeszkadzał użytkownikowi.
pt_br: O ambiente de trabalho Budgie é moderno e rico em recursos, projetado para não ficar no caminho do usuário.
ru: Budgie Desktop - это многофункциональная и современная среда рабочего стола, разработанная чтобы не мешать пользователю.
sl: Namizno okolje Budgie je bogato z zmožnostmi, moderno in zasnovano, da ni na poti uporabniku.
sv: Budgie skrivbordsmiljön är en funktionsrik, modern skrivbordsmiljö designad för att inte vara ivägen för användaren.

source: Applets for Budgie Desktop Environment
ca: Miniaplicacions per a l'entorn d'escriptori del Budgie
cs: Appletz pro pracovní prostředí Budgie
id: Aplet untuk Lingkungan Destop Budgie
it: Applet per l'ambiente Budgie Desktop
pl: Aplety dla Budgie Desktop Environment
pt_br: Miniaplicativos para o ambiente de trabalho Budgie
ru: Апплеты для среды рабочего стола Budgie
sl: Programčki za namizno okolje Budgie
sv: Applets för Budgie skrivbordsmiljön

source: Budgie Desktop
ca: Escriptori Budgie
cs: Pracovní plocha Budgie
fi: Budgie-työpöytä
id: Destop Budgie
pl: Pulpit Budgie
pt_br: Área de trabalho Budgie
ru: Среда рабочего стола Budgie
sl: Namizje Budgie
sv: Budgie Skrivbordsmiljö

source: Ceph base
ca: Base de Ceph
cs: Základ šablony Ceph
de: Ceph Basis
es: Base de Ceph
fi: Ceph alusta
id: Ceph dasar
it: Ceph di base
pl: Podstawa Ceph
pt_br: Base Ceph
ru: Основные пакеты ceph
sl: Osnova za Ceph
sv: Ceph bas
uk: Базові пакунки Ceph

source: This provides the base for the Ceph, Rook, Ceph CSI driver packages and containers.
ca: Això proporciona la base per als paquets de controladors de Ceph, Rook, Ceph CSI i contenidors.
cs: Základna pro balíčky ovladačů a kontejnery Ceph, Rook, Ceph CSI.
de: Dies stellt die Basis für Ceph, Rook, Ceph CSI Treiberpakete und Container zur Verfügung.
es: Proporciona la base para los paquetes de controladores y contenedores Ceph, Rook y Ceph CSI.
id: Ini menyediakan dasar untuk paket dan kontainer penggerak Ceph, Rook, Ceph CSI.
it: Fornisce la base per i pacchetti driver e i container Ceph, Rook, Ceph CSI.
pl: Stanowi to podstawę dla pakietów sterowników i kontenerów Ceph, Rook, Ceph CSI.
pt_br: Isso fornece a base para os pacotes e contêineres de driver Ceph, Rook, Ceph CSI.
ru: Предоставляет основу для пакетов драйверов Ceph, Rook, Ceph CSI и контейнеров.
sl: To ponuja osnovo za gonilnike in vsebnike Ceph, Rook ter Ceph CSI.
sv: Detta utgör basen för Ceph, Rook, Ceph CSI-drivrutinspaket och behållare.
uk: Надає базові пакунки драйверів Ceph, Rook, Ceph CSI та контейнерів.

source: Containers
ca: Contenidors
cs: Kontejnery
da: Containere
de: Container
es: Contenedores
fi: Kontit
id: Kontainer
it: Container
pl: Kontenery
pt_br: Contêiners
ru: Контейнеры
sl: Vsebniki
uk: Контейнери

source: Cinnamon Desktop Environment
ca: Entorn d'escriptori Cinnamon
cs: Prostředí plochy Cinnamon
de: Cinnamon-Desktop-Umgebung
es: Entorno de escritorio Cinnamon
fi: Cinnamon-työpöytäympäristö
id: Lingkungan Destop Cinnamon
it: Ambiente desktop Cinnamon
pl: Środowisko graficzne Cinnamon
pt_br: Ambiente de trabalho Cinnamon
ru: Среда рабочего стола Cinnamon
sl: Namizno okolje Cinnamon
sv: Cinnamon skrivbordsmiljö
uk: Стільничне середовище Cinnamon

source: Cinnamon Base System
ca: Sistema de base Cinnamon
cs: Základní systém Cinnamon
de: Cinnamon-Basissystem
es: Sistema básico de Cinnamon
id: Sistem Dasar Cinnamon
it: Sistema di base Cinnamon
pl: Cinnamon system podstawowy
pt_br: Sistema base do Cinnamon
ru: Базовая система Cinnamon
sl: Osnovni sistem za Cinnamon
sv: Cinnamon Bassystem
uk: Базова система Cinnamon

source: Base packages for the cinnamon Desktop Environment
ca: Paquets de base per a l'entorn d'escriptori Cinnamon
cs: Základní balíčky prostředí pracovní plochy Cinnamon
de: Grundlegende Pakete für die Cinnamon-Desktop-Umgebung
es: Paquetes básicos para el entorno de escritorio Cinnamon
fi: Peruspaketit Cinnamon-työpöytäympäristölle
id: Paket dasar untuk Lingkungan Destop cinnamon
it: Pacchetti di base per l'ambiente desktop Cinnamon
pl: Podstawowe oprogramowanie dla środowiska cinnamon
pt_br: Pacotes básicos para o ambiente de trabalho Cinnamon
ru: Основные пакеты для среды рабочего стола Cinnamon
sl: Osnovni paketi za namizno okolje Cinnamon
sv: Bas paket för cinnamon skrivbordsmiljön
uk: Основні пакунки для стільничного середовища Сinnamon

source: C/C++ Development
ar: برمجة C++/C
ca: Desenvolupament de C/C++
cs: Vývoj C/C++
da: C-/C++-udvikling
de: C/C++-Entwicklung
es: Desarrollo en C/C++
fi: C/C++ -kehitys
id: Pengembangan C/C++
it: Sviluppo in C/C++
pl: Programowanie w języku C/C++
pt_br: Desenvolvimento em C/C++
ru: Разработка на C/C++
sl: Razvoj C/C++
sv: C/C++-utveckling
uk: Розробка на C/C++
