Repository: openSUSE/packages-i18n
Catalog: */po/php.*.po
Languages: ca

source: Dependency Management for PHP
ca: Gestió de dependències per a PHP

source: Composer is a dependency manager tracking local dependencies of your projects and libraries.
ca: Composer és un gestor de dependències que fa el seguiment de les dependències locals dels vostres projectes i biblioteques.

source: PHP Coding Standards Fixer
ca: Fixador de normes de codificació PHP

source: The PHP Coding Standards Fixer (PHP CS Fixer) tool fixes code to follow standards; this can be the PHP coding standards as defined in the PSR-1, PSR-2, etc., or other community driven ones like the Symfony one. Custom styles can also be defined through configuration. It can modernise code (like converting the pow function to the ** operator on PHP 5.6) and (micro) optimize it.
ca: L'eina PHP Coding Standards Fixer (PHP CS Fixer) corregeix el codi per seguir els estàndards; aquests poden ser els estàndards de codificació PHP tal com es defineixen en el PSR-1, PSR-2, etc., o altres impulsats per la comunitat com el Symfony. Els estils personalitzats també es poden definir a través de la configuració. Pot modernitzar el codi (com convertir la funció pow a l'operador ** en PHP 5.6) i (micro) optimitzar-lo.

source: Abstraction of various SASL mechanism responses
ca: Abstracció de diverses respostes del mecanisme SASL

source: Provides code to generate responses to common SASL mechanisms, including: - Digest-MD5 - CramMD5 - Plain - Anonymous - Login (Pseudo mechanism)
ca: Proporciona codi per generar respostes a mecanismes SASL comuns, incloent: - Digest-MD5 - CramMD5 - Pla - Anònim - Login (mecanisme Pseudo)

source: Database abstraction layer
ca: Capa d'abstracció de la base de dades

source: PEAR MDB2 is a merge of the PEAR DB and Metabase php database abstraction layers. It provides a common API for all supported RDBMS. The main difference to most other DB abstraction packages is that MDB2 goes much further to ensure portability. MDB2 provides most of its many features optionally that can be used to construct portable SQL statements: * Object-Oriented API * A DSN (data source name) or array format for specifying database servers * Datatype abstraction and on demand datatype conversion * Various optional fetch modes to fix portability issues * Portable error codes * Sequential and non sequential row fetching as well as bulk fetching * Ability to make buffered and unbuffered queries * Ordered array and associative array for the fetched rows * Prepare/execute (bind) named and unnamed placeholder emulation * Sequence/autoincrement emulation * Replace emulation * Limited sub select emulation * Row limit emulation * Transactions/savepoint support * Large Object support * Index/Unique Key/Primary Key support * Pattern matching abstraction * Module framework to load advanced functionality on demand * Ability to read the information schema * RDBMS management methods (creating, dropping, altering) * Reverse engineering schemas from an existing database * SQL function call abstraction * Full integration into the PEAR Framework * PHPDoc API documentation
ca: PEAR MDB2 és una fusió de les capes d'abstracció de la base de dades PEAR DB i Metabase php. Proporciona una API comuna per a tots els RDBMS compatibles. La principal diferència per a la majoria dels altres paquets d'abstracció de DB és que MDB2 va molt més enllà per garantir la portabilitat. MDB2 proporciona la majoria de les seves moltes característiques opcionalment que es poden utilitzar per construir sentències SQL portàtils: * API orientada a objectes * Un format DSN (nom de la font de dades) o matriu per a especificar servidors de base de dades * abstracció de tipus de dades i conversió de tipus de dades sota demanda * Diversos modes opcionals de recuperació per corregir problemes de portabilitat * Codis d'error portables * Recuperació seqüencial i no seqüencial de files, així com la captura massiva * Capacitat per a fer consultes a la memòria intermèdia i no a la memòria intermèdia * Matriu ordenada i matriu associativa per a les files recuperades * Prepara/executa l'emulació del marcador de posició amb nom i sense nom * Emulació de seqüència/increment automàtic * Substitueix l'emulació * Emulació limitada de subselecciona * Emulació del límit de fila * Implementació d'assentaments/punts de desament * Implementació d'objectes grans * Implementació de l'índex/clau única/clau primària * Abstracció que coincideix amb el patró * Framework de mòduls per carregar funcionalitats avançades sota demanda * Capacitat per a llegir l'esquema d'informació * Mètodes de gestió RDBMS (crear, deixar anar, alterar) * Règims d'enginyeria inversa d'una base de dades existent * funció SQL crida abstracció * Integració completa en el Marc PEAR * Documentació de l'API PHPDoc

source: MySQLi MDB2 driver
ca: Controlador MDB2 de MySQLi

source: This is the MySQLi MDB2 driver.
ca: Aquest és el controlador MySQLi MDB2.

source: PHP classes to create MIME messages
ca: Classes PHP per crear missatges MIME

source: Mail_Mime provides classes to deal with the creation and manipulation of MIME messages. It allows to create e-mail messages consisting of text parts, HTML parts, inline HTML images, attachments and attached (embedded) messages. It supports non-ASCII characters in filenames, subjects, recipients, etc.
ca: MailMime proporciona classes per tractar amb la creació i manipulació de missatges MIME. Permet crear missatges de correu electrònic que consisteixen en parts de text, parts HTML, imatges HTML en línia, adjunts i missatges adjunts (incrustats). Admet caràcters no ASCII en noms de fitxer, temes, destinataris, etc.

source: PHP library for Punycode encoding and decoding
ca: Biblioteca PHP per a la codificació i descodificació de Punycode

source: The package provides a class which allows one to convert from and to internationalized domain names (RFC 3490). They can be used with various registries worldwide to be translated between their original (localized) form and their encoded form as it will be used in the DNS (Domain Name System).
ca: El paquet proporciona una classe que permet convertir des de i a noms de domini internacionalitzats (RFC 3490). Es poden utilitzar amb diversos registres a tot el món per traduir entre la seva forma original (localitzada) i la seva forma codificada, ja que s'utilitzarà en el DNS (Domain Name System).

source: Object oriented interface for searching and manipulating LDAP-entries
ca: Interfície orientada a objectes per cercar i manipular entrades LDAP

source: Net_LDAP2 is the successor of Net_LDAP which is a clone of Perls Net::LDAPobject interface to directory servers. It does contain most of Net::LDAP's features but has some own too. With Net_LDAP2 you have: * A simple object-oriented interface to connections, searches entries and filters. * Support for tls and ldap v3. * Simple modification, deletion and creation of ldap entries. * Support for schema handling. Net_LDAP2 layers itself on top of PHP's existing ldap extensions.
ca: NetLDAP2 és el successor de NetLDAP, que és un clon de la interfície de Perls Net::LDAPobject als servidors de directori. Conté la majoria de les funcions de Net::LDAP, però també té algunes pròpies. Amb NetLDAP2 tens: * Una interfície senzilla orientada a objectes a connexions, cerca entrades i filtres. * Suport per a tls i ldap v3. * Simplement modificació, eliminació i creació d'entrades ldap. * Suport per a la manipulació de l'esquema. NetLDAP2 es col·loca a sobre de les extensions ldap existents de PHP.

source: An implementation of the SMTP protocol
ca: Una implementació del protocol SMTP

source: Provides an implementation of the SMTP protocol using PEAR's Net_Socket class.
ca: Proporciona una implementació del protocol SMTP utilitzant la classe NetSocket de PEAR.

source: PHP module for talking to a sieve server
ca: Mòdul PHP per parlar amb un servidor de «sieve»

source: This package provides an API to talk to servers implementing the managesieve protocol. It can be used to install and remove sieve scripts, mark them active etc.
ca: Aquest paquet proporciona una API per parlar amb els servidors que implementen el protocol de gestió. Es pot utilitzar per instal·lar i eliminar scripts de «sieve», marcar-los actius, etc.

source: Network Socket Interface
ca: Interfície de sòcol de xarxa

source: Net_Socket is a class interface to TCP sockets. It provides blocking and non-blocking operation, with different reading and writing modes (byte-wise, block-wise, line-wise and special formats like network byte-order ip addresses).
ca: NetSocket és una interfície de classe per a sòcols TCP. Proporciona operacions de bloqueig i no bloqueig, amb diferents modes de lectura i escriptura (byte-wise, block-wise, line-wise i formats especials com adreces ip d'ordre de bytes de xarxa).

source: XML parsing class based on PHP's bundled expat
ca: Classe d'anàlisi XML basada en l'expatriat empaquetat de PHP

source: This is an XML parser based on PHPs built-in xml extension. It supports two basic modes of operation: "func" and "event". In "func" mode, it will look for a function named after each element (xmltag_ELEMENT for start tags and xmltag_ELEMENT_ for end tags), and in "event" mode it uses a set of generic callbacks. Since version 1.2.0 there's a new XML_Parser_Simple class that makes parsing of most XML documents easier, by automatically providing a stack for the elements. Furthermore its now possible to split the parser from the handler object, so you do not have to extend XML_Parser anymore in order to parse a document with it.
ca: Aquest és un analitzador XML basat en l'extensió xml integrada en PHP. Suporta dos modes bàsics de funcionament: "func" i "event". En el mode "func", buscarà una funció anomenada després de cada element (xmltagELEMENT per a les etiquetes d'inici i xmltagELEMENT per a les etiquetes finals), i en el mode "event" utilitza un conjunt de crides de retorn genèriques. Des de la versió 1.2.0 hi ha una nova classe XMLParserSimple que facilita l'anàlisi de la majoria de documents XML, proporcionant automàticament una pila per als elements. A més, ara és possible dividir l'analitzador de l'objecte del gestor, de manera que ja no heu d'estendre XMLParser per tal d'analitzar un document amb ell.

source: Interpreter for the PHP scripting language version 7
ca: Intèrpret per al llenguatge PHP scripting versió 7

source: PHP is a server-side HTML embedded scripting language designed primarily for web development but also used as a general-purpose programming language. This package contains the base files for all subpackages and must be installed in order to use PHP. Additionally, extension modules and server modules (e.g. for Apache) may be installed.
ca: PHP és un llenguatge de script incrustat HTML del costat del servidor dissenyat principalment per al desenvolupament web, però també utilitzat com a llenguatge de programació de propòsit general. Aquest paquet conté els fitxers base per a tots els subpaquets i s'ha d'instal·lar per utilitzar PHP. A més, es poden instal·lar mòduls d'extensió i mòduls de servidor (p. ex. per a Apache).

source: APCu - APC User Cache
ca: APCu - Memòria cau d'usuari APC

source: APCu is userland caching: APC stripped of opcode caching in preparation for the deployment of Zend Optimizer+ as the primary solution to opcode caching in future versions of PHP.
ca: APCu és userland caching: APC desposseït de memòria cau opcode en preparació per al desplegament de Zend Optimizer+ com la solució principal per a la memòria cau opcode en futures versions de PHP.

source: "Binary Calculator" extension for PHP
ca: Extensió «Calculadora binària» per a PHP

source: Binary Calculator which supports numbers of any size and precision, represented as strings.
ca: Calculadora binària que admet nombres de qualsevol mida i precisió, representada com a cadenes.

source: bzip2 codec support for PHP
ca: Implementació del còdec bzip2 per a PHP

source: PHP functions to read and write bzip2 (.bz2) compressed files.
ca: PHP funciona per llegir i escriure fitxers comprimits bzip2 (.bz2).

source: PHP7 Extension Module
ca: Mòdul d'extensió PHP7

source: PHP functions for converting between different calendar formats.
ca: Funcions PHP per a la conversió entre diferents formats de calendari.

source: PHP is a server-side HTML embedded scripting language designed primarily for web development but also used as a general-purpose programming language. This package contains the standard implementation of PHP, namely Zend PHP. Included are the PHP command-line binary and the configuration file (php.ini). Additional documentation is available in package php-doc.
ca: PHP és un llenguatge de script incrustat HTML del costat del servidor dissenyat principalment per al desenvolupament web, però també utilitzat com a llenguatge de programació de propòsit general. Aquest paquet conté la implementació estàndard de PHP, concretament Zend PHP. S'inclouen el binari de línia d'ordres PHP i el fitxer de configuració (php.ini). La documentació addicional està disponible al paquet php-doc.

source: Character class extension for PHP
ca: Extensió de classe de caràcters per a PHP

source: PHP functions for checking whether a character or string falls into a certain character class according to the current locale.
ca: Funcions PHP per comprovar si un caràcter o una cadena cauen en una classe de caràcters determinada segons la configuració regional actual.

source: libcurl integration for PHP
ca: Integració de la libcurl per al PHP

source: PHP interface to libcurl that allows you to connect to and communicate with servers of many different types, using protocols of many different types.
ca: Interfície PHP a libcurl que permet connectar-se i comunicar-se amb servidors de molts tipus diferents, utilitzant protocols de molts tipus diferents.

source: Database abstraction layer for PHP
ca: Capa d'abstracció de base de dades per a PHP

source: This is a general abstraction layer for several file-based databases. As such, functionality is limited to a common subset of features supported by modern databases such as Sleepycat Software's DB2. (This is not to be confused with IBM's DB2 software, which is supported through the ODBC functions.)
ca: Aquesta és una capa d'abstracció general per a diverses bases de dades basades en fitxers. Com a tal, la funcionalitat es limita a un subconjunt comú de característiques suportades per bases de dades modernes com la DB2 de Sleepycat Software. (Això no s'ha de confondre amb el programari DB2 d'IBM, que és compatible amb les funcions ODBC.)

source: PHP7 development files for C/C++ extensions
ca: Fitxers de desenvolupament PHP7 per a extensions C/C++

source: PHP is a server-side HTML embedded scripting language designed primarily for web development but also used as a general-purpose programming language. This package contains the C headers to build PHP extensions.
ca: PHP és un llenguatge de script incrustat HTML del costat del servidor dissenyat principalment per al desenvolupament web, però també utilitzat com a llenguatge de programació de propòsit general. Aquest paquet conté les capçaleres C per a construir extensions PHP.

source: Document Object Model extension for PHP
ca: Extensió del model d'objecte de document per a PHP

source: This module adds Document Object Model (DOM) support.
ca: Aquest mòdul afegeix la implementació del Model d'Objecte de Document (DOM).

source: Embedded SAPI Library
ca: Biblioteca SAPI incrustada

source: PHP is a server-side, cross-platform HTML embedded scripting language. If you are completely new to PHP and want to get some idea of how it works, have a look at the Introductory tutorial. Once you get beyond that have a look at the example archive sites and some of the other resources available in the links section.
ca: PHP és un llenguatge de script incrustat en HTML multiplataforma i amb servidor. Si ets completament nou en PHP i vols fer-te una idea de com funciona, fes una ullada al tutorial d'introducció. Un cop superats, podeu consultar els llocs d'arxiu d'exemple i alguns dels altres recursos disponibles a l'apartat d'enllaços.

source: Spell checking extension for PHP
ca: Extensió de verificació ortogràfica per a PHP

source: Enchant is the PHP binding for the Enchant library. Enchant steps in to provide uniformity and conformity on top of all spelling libraries, and implements certain features that may be lacking in any individual provider library. Everything should "just work" for any and every definition of "just working."
ca: Enchant és la vinculació PHP per a la biblioteca Enchant. Enchant s'intervé per proporcionar uniformitat i conformitat a sobre de totes les biblioteques ortogràfiques, i implementa certes característiques que poden mancar en qualsevol biblioteca proveïdor individual. Tot hauria de "treballar" per a qualsevol definició de "treballar".

source: EXIF metadata extensions for PHP
ca: Extensions de metadades EXIF per a PHP

source: PHP functions for extracting EXIF (Exchangable Image File Format; metadata from images) information stored in headers of JPEG and TIFF images.
ca: Funcions PHP per a extreure informació EXIF (Format de fitxer d'imatge extraïble; metadades de les imatges) emmagatzemades a les capçaleres de les imatges JPEG i TIFF.

source: FastCGI PHP7 Module
ca: Mòdul PHP7 FastCGI

source: File identification extension for PHP
ca: Extensió d'identificació de fitxers per a PHP

source: The functions in this module try to guess the content type and encoding of a file by looking for certain magic byte sequences at specific positions within the file. It uses (a bundled version of) libmagic to heuristically determine this.
ca: Les funcions d'aquest mòdul intenten endevinar el tipus de contingut i la codificació d'un fitxer buscant certes seqüències de bytes màgics en posicions específiques dins del fitxer. Utilitza (una versió empaquetada de) libmagic per determinar-ho heurísticament.

source: FastCGI Process Manager PHP7 Module
ca: Mòdul del gestor de processos FastCGI PHP7

source: FTP protocol support for PHP
ca: Implementació de protocol FTP per a PHP

source: PHP functions for access to file servers speaking the File Transfer Protocol (FTP) as defined in RFC 959.
ca: PHP funciona per accedir als servidors de fitxers que parlen del Protocol de transferència de fitxers (FTP) tal com es defineix a RFC 959.

source: GD Graphics Library extension for PHP
ca: Extensió de la biblioteca GD Graphics per a PHP

source: PHP functions to create and manipulate image files in a variety of different image formats, including GIF, PNG, JPEG, WBMP, and XPM. Even more convenient: PHP can output image streams directly to a browser.
ca: PHP funciona per crear i manipular fitxers d'imatge en una varietat de formats d'imatge diferents, incloent GIF, PNG, JPEG, WBMP i XPM. Encara més convenient: PHP pot generar fluxos d'imatges directament a un navegador.

source: Native language support for PHP
ca: Implementació de la llengua nativa per a PHP

source: PHP functions that implement a Native Language Support (NLS) API which can be used to internationalize your PHP applications.
ca: Funcions PHP que implementen una API de Suport a la Llengua Nativa (NLS) que es pot utilitzar per internacionalitzar les vostres aplicacions PHP.

source: Wrapper to the GraphicsMagick library
ca: Captura a la biblioteca GraphicsMagick

source: PHP extension to create, modify and obtain meta information of images using the GraphicsMagick API
ca: Extensió PHP per crear, modificar i obtenir metainformació d'imatges utilitzant l'API GraphicsMagick

source: Bignum extension for PHP
ca: Extensió Bignum per a PHP

source: PHP functions for work with arbitrary-length integers using the GNU MP library.
ca: PHP funciona per treballar amb enters de longitud arbitrària utilitzant la biblioteca GNU MP.

source: PHP framework delivered as C extension
ca: Marc PHP lliurat com a extensió C

source: ICE is a PHP framework delivered as C extension. You don't need learn or use the C language, since the functionality is exposed as PHP classes.
ca: L'ICE és un marc PHP lliurat com a extensió C. No cal aprendre ni utilitzar el llenguatge C, ja que la funcionalitat s'exposa com a classes PHP.

source: Character set conversion functions for PHP
ca: Funcions de conversió de conjunts de caràcters per a PHP

source: This module contains an interface to iconv character set conversion facility. With this module, a string represented by a local character set can be turned into another character set, which may be the Unicode character set. Supported character sets depend on the iconv implementation of your system.
ca: Aquest mòdul conté una interfície a la instal·lació de conversió de conjunts de caràcters iconv. Amb aquest mòdul, una cadena representada per un joc de caràcters local es pot convertir en un altre joc de caràcters, que pot ser el joc de caràcters Unicode. Els jocs de caràcters admesos depenen de la implementació iconv del vostre sistema.

source: Wrapper to the ImageMagick library
ca: Captura a la biblioteca ImageMagick

source: PHP extension to create, modify and obtain meta information of images using the ImageMagick API
ca: Extensió PHP per crear, modificar i obtenir metainformació d'imatges utilitzant l'API ImageMagick

source: ICU integration for PHP
ca: Integració ICU per a PHP

source: The internationalization (intl) extension is a wrapper for the ICU library, enabling PHP programmers to perform UCA (Unicode Collation Algorithm) conformant collation as well as date, time, number and currency formatting in their scripts.
ca: L'extensió d'internacionalització (intl) és un embolcall per a la biblioteca de l'UCI, que permet als programadors de PHP realitzar la col·lació conforme amb UCA (algorisme de col·lecció d'Unicode), així com la data, l'hora, el nombre i el format de moneda en els seus scripts.

source: JSON (de)serializer functions for PHP
ca: Funcions JSON (de)serialitzadores per a PHP

source: This extension implements the JavaScript Object Notation (JSON) data-interchange format.
ca: Aquesta extensió implementa el format d'intercanvi de dades JavaScript Object Notation (JSON).

source: LDAP protocol support for PHP
ca: Implementació de protocol LDAP per a PHP

source: PHP interface to the Lightweight Directory Access Protocol (LDAP).
ca: Interfície PHP al Lightweight Directory Access Protocol (LDAP).

source: Phabrcator PHP utility classes
ca: Classes d'utilitat PHP del Phabrcator
