Repository: openSUSE/packages-i18n
Catalog: */po/php.*.po
Languages: ca

source: phpMyAdmin can manage a whole MySQL server (needs a super-user) as well as a single database. To accomplish the latter you'll need a properly set up MySQL user who can read/write only the desired database. It's up to you to look up the appropriate part in the MySQL manual. Currently phpMyAdmin can: * browse and drop databases, tables, views, fields and indexes * create, copy, drop, rename and alter databases, tables, fields and indexes * maintenance server, databases and tables, with proposals on server configuration * execute, edit and bookmark any SQL-statement, even batch-queries * load text files into tables * create^1 and read dumps of tables * export^1 data to various formats: CSV, XML, PDF, ISO/IEC 26300 - OpenDocument Text and Spreadsheet, Word, Excel and L^AT[E]X formats * import data and MySQL structures from Microsoft Excel and OpenDocument spreadsheets, as well as XML, CSV, and SQL files * administer multiple servers * manage MySQL users and privileges * check referential integrity in MyISAM tables * using Query-by-example (QBE), create complex queries automatically connecting required tables * create PDF graphics of your Database layout * search globally in a database or a subset of it * transform stored data into any format using a set of predefined functions, like displaying BLOB-data as image or download-link * track changes on databases, tables and views * support InnoDB tables and foreign keys (see FAQ 3.6) * support mysqli, the improved MySQL extension (see FAQ 1.17) * communicate in 57 different languages * synchronize two databases residing on the same as well as remote servers (see FAQ 9.1)
ca: phpMyAdmin pot gestionar un servidor MySQL complet (necessita un superusuari) així com una única base de dades. Per aconseguir aquest últim, necessitareu un usuari MySQL que pugui llegir/escriure correctament només la base de dades desitjada. Depèn de tu buscar la part adequada en el manual de MySQL. Actualment phpMyAdmin pot: * navegar i deixar anar bases de dades, taules, vistes, camps i índexs * crear, copiar, canviar de nom i alterar bases de dades, taules, camps i índexs * manteniment servidor, bases de dades i taules, amb propostes a la configuració del servidor * executar, editar i marcar fitxers de text en taules * exportar dades en formats CSV, XML, PDF i L1AT[E]X * importar dades i estructures de MySQL de fulls de càlcul de Microsoft Excel i OpenDocument, així com fitxers XML, CSV i SQL * gestionar múltiples servidors * consultar automàticament les taules requerides * crear gràfics complexos de la disposició de la base de dades * cercar globalment en una base de dades o un subconjunt d'elles * transformar les dades emmagatzemades en qualsevol format utilitzant un conjunt de funcions predefinides, * donar suport a taules InnoDB i claus estrangeres (veure FAQ 1.17) * comunicar en 57 idiomes diferents * sincronitzar dues bases de dades que resideixen en el mateix (veure FAQ 9).

source: Apache configuration for phpMyAdmin
ca: Configuració d'Apache per al phpMyAdmin

source: Translations for package phpMyAdmin
ca: Traduccions per al paquet phpMyAdmin

source: Provides translations for the "phpMyAdmin" package.
ca: Proporciona traduccions per al paquet «phpMyAdmin».

source: Administration of PostgreSQL over the web
ca: Administració de PostgreSQL a través de la web

source: phpPgAdmin is a web-based administration tool for PostgreSQL. It is perfect for PostgreSQL DBAs, newbies and hosting services. Features * Administer multiple servers * Support for PostgreSQL 9.x.x, 10.x, 11.x, 12.x * Manage all aspects of: o Users & groups o Databases o Schemas o Tables, indexes, constraints, triggers, rules & privileges o Views, sequences & functions o Advanced objects o Reports * Easy data manipulation: o Browse tables, views & reports o Execute arbitrary SQL o Select, insert, update and delete * Dump table data in a variety of formats: SQL, COPY, XML, XHTML, CSV, Tabbed, pg_dump * Import SQL scripts, COPY data, XML, CSV and Tabbed * Supports the Slony master-slave replication engine * Excellent language support: o Available in 27 languages o No encoding conflicts. Edit Russian data using a Japanese interface! * Easy to install and configure
ca: El phpPgAdmin és una eina d'administració basada en web per a PostgreSQL. És perfecte per a serveis de PostgreSQL DBAs, newbies i hosting. Característiques * Administra diversos servidors * Suport per PostgreSQL 9.x.x, 10.x, 11.x, 12.x * Gestiona tots els aspectes de: o Grups d'usuaris o Bases de dades o Esquemes o Taules, índexs, restriccions, desencadenants, privilegis de regles o Vistes, funcions de seqüències o Objectes avançats o Informes * Fàcil manipulació de dades: o Navegar per taules, veure informes o Executar SQL arbitrari o Seleccionar, inserir, actualitzar i eliminar * Bolca les dades de la taula en diversos formats: SQL, COPY, XML, XHTML, CSV, Tabbed, pgdump * Importa scripts SQL, COPIA dades, XML, CSV i Tabbed * Permet el motor de replicació Slony master-slave * Excel·lent suport lingüístic: o Disponible en 27 idiomes o Sense conflictes de codificació. Edita les dades en rus utilitzant una interfície japonesa! * Fàcil d'instal·lar i configurar

source: Apache configuration for phpPgAdmin
ca: Configuració d'Apache per al phpPgAdmin

source: PHP extension to create, modify and obtain meta information of images using the ImageMagick API.
ca: Extensió PHP per crear, modificar i obtenir metainformació d'imatges utilitzant l'API ImageMagick.

source: PHP Memcache client Extension
ca: Extensió del client PHP Memcache

source: Memcached is a caching daemon designed especially for dynamic web applications to decrease database load by storing objects in memory. This extension allows you to work with memcached through handy OO and procedural interfaces. The extension allows use to store sessions in memcached via memcache.
ca: Memcached és un dimoni de memòria cau dissenyat especialment per a aplicacions web dinàmiques per disminuir la càrrega de la base de dades emmagatzemant objectes en memòria. Aquesta extensió permet treballar amb memcached a través d'interfícies d'OO i procediment. L'extensió permet l'ús per emmagatzemar sessions en memcached via memcache.

source: Phalcon is a framework for PHP7 written as a C extension. Zephir is a high-level language, something between C and PHP. It is both dynamic and static typed and it supports the features we need to create and maintain a project like Phalcon.
ca: Phalcon és un framework per PHP7 escrit com una extensió C. Zephir és un llenguatge d'alt nivell, alguna cosa entre C i PHP. És dinàmic i estàtic i suporta les característiques que necessitem per crear i mantenir un projecte com Phalcon.

source: PSR Extension Module
ca: Mòdul d'extensió PSR

source: This extension provides the accepted PSR interfaces, so they can be used in an extension.
ca: Aquesta extensió proporciona les interfícies PSR acceptades, de manera que es poden utilitzar en una extensió.

source: This extension provides functions to generate and analyse universally unique identifiers (UUIDs).
ca: Aquesta extensió proporciona funcions per generar i analitzar identificadors universalment únics (UUIDs).

source: PHP bzip2 codec support
ca: Implementació del còdec PHP bzip2

source: PHP Extension Module
ca: Mòdul d'extensió PHP

source: PHP libcurl integration
ca: Integració de PHP libcurl

source: PHP development files for C/C++ extensions
ca: Fitxers de desenvolupament PHP per a extensions C/C++

source: FastCGI PHP Module
ca: Mòdul PHP FastCGI

source: Main interface to C code and data
ca: Interfície principal al codi C i a les dades

source: This extension allows the loading of shared libraries (.DLL or .so), calling of C functions and accessing of C data structures in pure PHP, without having to have deep knowledge of the Zend extension API, and without having to learn a third "intermediate" language.
ca: Aquesta extensió permet la càrrega de biblioteques compartides (.DLL o .so), la crida de funcions C i l'accés d'estructures de dades C en PHP pur, sense haver de tenir un coneixement profund de l'API d'extensió Zend, i sense haver d'aprendre un tercer llenguatge "intermedi".

source: FastCGI Process Manager PHP Module
ca: Mòdul PHP del gestor de processos FastCGI

source: Apache configuration for PHP-FPM
ca: Configuració Apache per a PHP-FPM

source: Configuration for Apache to pass all requests for PHP scripts to the PHP-FPM server using reverse proxy.
ca: Configuració perquè l'Apache passi totes les sol·licituds de scripts PHP al servidor PHP-FPM utilitzant proxy invers.

source: PHP readline extension
ca: Extensió de lectura PHP

source: PHP binding for the Tidy HTML cleaner
ca: Vinculació PHP per al netejador d'HTML Tidy
