Repository: openSUSE/packages-i18n
Catalog: */po/php.*.po
Languages: ca

source: libphutil is a collection of utility classes and functions for PHP. It is used by Phabricator and Arcanist. Some of the major components of libphutil are: * Core Utilities: a collection of useful functions like ipull() which simplify common data manipulation; * Filesystem: classes like Filesystem which provide a strict API for filesystem access and throw exceptions on failure, making it easier to write robust code which interacts with files; * Command Execution: libphutil provides a powerful system command primitive in ExecFuture which makes it far easier to write command-line scripts which execute system commands (see Command Execution); * xsprintf(): allows you to define sprintf()-style functions which use custom conversions; and * Library System: an introspectable, inventoried system for organizing PHP code and managing dependencies, supported by static analysis.
ca: libphutil és una col·lecció de classes d'utilitat i funcions per a PHP. És utilitzat per Phabricator i Arcanist. Alguns dels components principals de la libphutil són: * Utilitats bàsiques: una col·lecció de funcions útils com ipull() que simplifiquen la manipulació de dades comunes; * Sistema de fitxers: classes com Sistema de fitxers que proporcionen una API estricta per a l'accés al sistema de fitxers i llancen excepcions en cas de fallada, facilitant l'escriptura de codi robust que interactua amb els fitxers; * Execució d'ordres: libphutil proporciona una potent primitiva d'ordres del sistema a ExecFuture que fa molt més fàcil escriure scripts de línia d'ordres que executen ordres del sistema (vegeu Execució d'ordres); * xsprintf(): permet definir funcions d'estil sprintf() que utilitzen conversions personalitzades; i * Library System: un sistema introspectable i inventariat per a l'organització del codi PHP i la gestió de les dependències, suportat per l'anàlisi estàtica.

source: LZF compression
ca: Compressió LZF

source: This package handles LZF de/compression.
ca: Aquest paquet gestiona la descompressió LZF.

source: PHP extension providing access to maxminddb databases
ca: Extensió PHP que proporciona accés a bases de dades maxminddb

source: This extension provides access to maxminddb databases and is a drop-in replacement for MaxMind\Db\Reader.
ca: Aquesta extensió proporciona accés a les bases de dades maxminddb i és un reemplaçament per a MaxMind\Db\Reader.

source: Multibyte string functions for PHP
ca: Funcions de cadena multibyte per a PHP

source: mbstring provides multibyte specific string functions that help dealing with multibyte encodings in PHP. mbstring handles character encoding conversion between the possible encoding pairs. mbstring handles Unicode-based encodings such as UTF-8 and UCS-2 and many single-byte encodings for convenience.
ca: mbstring proporciona funcions de cadena específiques multibyte que ajuden a tractar amb codificacions multibyte en PHP. El «mbstring» gestiona la conversió de codificació de caràcters entre els parells de codificació possibles. mbstring maneja codificacions basades en Unicode com UTF-8 i UCS-2 i moltes codificacions d'un sol byte per conveniència.

source: PHP MemcacheD client Extension
ca: Extensió del client PHP MemcacheD

source: This extension uses libmemcached library to provide API for communicating with memcached servers.
ca: Aquesta extensió utilitza la biblioteca libmemcached per proporcionar API per comunicar-se amb servidors memcached.

source: MySQL database client for PHP
ca: Client de base de dades MySQL per a PHP

source: PHP functions for access to MySQL database servers.
ca: Funcions PHP per a l'accés a servidors de bases de dades MySQL.

source: ODBC extension for PHP
ca: Extensió ODBC per a PHP

source: This module adds Open Database Connectivity (ODBC) support.
ca: Aquest mòdul afegeix el suport Open Database Connectivity (ODBC).

source: Opcode cache extension for PHP
ca: Extensió de la memòria cau d'opcode per a PHP

source: OPcache improves PHP performance by storing precompiled script bytecode in shared memory, thereby removing the need for PHP to load and parse scripts on each request.
ca: OPcache millora el rendiment de PHP mitjançant l'emmagatzematge de bytecode de script precompilat en memòria compartida, eliminant així la necessitat de PHP per carregar i analitzar scripts en cada sol·licitud.

source: OpenSSL integration for PHP
ca: Integració OpenSSL per a PHP

source: This extension binds functions of OpenSSL library for symmetric and asymmetric encryption and decryption, PBKDF2, PKCS#7, PKCS#12, X.509 and other crypto operations. It also provides an implementation of TLS streams.
ca: Aquesta extensió enllaça funcions de la biblioteca OpenSSL per a xifrar i desxifrar simètrics i asimètrics, PBKDF2, PKCS77, PKCS,12, X.509 i altres operacions de criptografia. També proporciona una implementació de fluxos TLS.

source: Process Control extension for PHP
ca: Extensió de control de processos per a PHP

source: Process Control support in PHP implements the Unix style of process creation, program execution, signal handling and process termination (fork, waitpid, signal, WIF flags, etc.)
ca: El suport de Process Control en PHP implementa l'estil Unix de creació de processos, execució de programes, manipulació de senyals i terminació de processos (forca, waitpid, senyal, banderes WIF, etc.)

source: PHP Data Objects extension for PHP
ca: Extensió PHP Data Objects per a PHP

source: The PHP Data Objects (PDO) extension defines an interface for accessing databases in PHP. Each database driver that implements the PDO interface can expose database-specific features as regular extension functions. Note that you use a database-specific PDO driver to access a database server. PDO provides a data-access abstraction layer, which means that, regardless of the database used, you use the same functions to issue queries and fetch data. PDO does not provide a database abstraction; it does not rewrite SQL or emulate missing features.
ca: L'extensió PHP Data Objects (PDO) defineix una interfície per accedir a bases de dades en PHP. Cada controlador de base de dades que implementa la interfície PDO pot exposar les característiques específiques de la base de dades com a funcions d'extensió regular. Tingueu en compte que utilitzeu un controlador PDO específic de base de dades per accedir a un servidor de base de dades. PDO proporciona una capa d'abstracció d'accés a dades, el que significa que, independentment de la base de dades utilitzada, utilitzeu les mateixes funcions per emetre consultes i obtenir dades. PDO no proporciona una abstracció de base de dades; no reescriu SQL ni emula característiques que manquen.

source: PHP Extension and Application Repository
ca: Extensió PHP i repositori d'aplicacions

source: PEAR is a code repository for PHP extensions and PHP library code similar to TeX's CTAN and Perl's CPAN. This package provides an access to the repository. See https://pear.php.net/manual for more details.
ca: PEAR és un repositori de codi per a extensions PHP i codi de biblioteca PHP similar al CTAN de TeX i CPAN de Perl. Aquest paquet proporciona un accés al repositori. Consulteu https://pear.php.net/manual per a més detalls.

source: PHP Extension Community Library
ca: Biblioteca comunitària d'extensió PHP

source: PECL is a repository for PHP Extensions, providing a directory of all known extensions and hosting facilities for downloading and development of PHP extensions. See https://pecl.php.net for more details.
ca: PECL és un repositori d'extensions PHP, que proporciona un directori de totes les extensions conegudes i instal·lacions d'allotjament per a la descàrrega i el desenvolupament d'extensions PHP. Consulteu https://pecl.php.net per a més detalls.

source: PostgreSQL database client for PHP
ca: Client de base de dades PostgreSQL per a PHP

source: PHP functions for access to PostgreSQL database servers. It includes both traditional pgsql and pdo_pgsql drivers.
ca: Funcions PHP per a l'accés a servidors de bases de dades PostgreSQL. Inclou tant pgsql com pdopgsql tradicionals.

source: Phalcon is an open source, full stack framework for PHP 5 written as a C-extension, optimized for high performance. You don't need learn or use the C language, since the functionality is exposed as PHP classes ready for you to use. Zephir is a high level language, something between C and PHP. It’s both dynamic and static typed and it supports just the features we need to create and maintain a project like Phalcon.
ca: Phalcon és un framework de codi obert i de pila completa per a PHP 5 escrit com una extensió C, optimitzat per a un alt rendiment. No cal aprendre ni utilitzar el llenguatge C, ja que la funcionalitat s'exposa com a classes PHP llestes perquè puguis utilitzar. Zephir és un llenguatge d'alt nivell, alguna cosa entre C i PHP. És dinàmic i estàtic i suporta només les característiques que necessitem per crear i mantenir un projecte com Phalcon.

source: PHP Archive extension for PHP
ca: Extensió PHP Archive per a PHP

source: The phar extension provides a way to put entire PHP applications into a single file called a "phar" (PHP Archive) for distribution and installation. In addition, the phar extension also provides a file-format abstraction method for creating and manipulating tar and zip files through the PharData class, much as PDO provides a unified interface for accessing different databases. Phar also can convert between tar, zip and phar file formats.
ca: L'extensió phar proporciona una manera de posar aplicacions PHP senceres en un sol fitxer anomenat "phar" (PHP Archive) per a la distribució i la instal·lació. A més, l'extensió phar també proporciona un mètode d'abstracció de format de fitxer per crear i manipular fitxers tar i zip a través de la classe PharData, de la mateixa manera que PDO proporciona una interfície unificada per accedir a diferents bases de dades. Phar també pot convertir entre formats de fitxer tar, zip i phar.

source: Testing framework for PHP
ca: Marc de proves per a PHP

source: PHPUnit is a programmer-oriented testing framework for PHP. It is an instance of the xUnit architecture for unit testing frameworks.
ca: PHPUnit és un marc de proves orientat al programador per a PHP. És una instància de l'arquitectura xUnit per als marcs de proves d'unitats.

source: POSIX functions for PHP
ca: Funcions POSIX per a PHP

source: This module contains an interface to those functions defined in the IEEE 1003.1 (POSIX.1) standards document which are not accessible through other means.
ca: Aquest mòdul conté una interfície d'aquestes funcions definides en el document d'estàndards IEEE 1003.1 (POSIX.1) que no són accessibles a través d'altres mitjans.

source: PHP7 readline extension
ca: Extensió de línia de lectura PHP7

source: PHP interface to libedit, which provides editable command line as well as PHP interactive mode (php -a).
ca: Interfície PHP a libedit, que proporciona una línia d'ordres editable, així com el mode interactiu PHP (php -a).

source: API for communicating with Redis servers
ca: API per comunicar-se amb servidors Redis

source: This extension provides an API for communicating with Redis servers
ca: Aquesta extensió proporciona una API per comunicar-se amb els servidors de Redis

source: Alternate, low-level shared memory implementation for PHP
ca: Implementació de memòria compartida alternativa i de baix nivell per a PHP

source: An extension created as an alternative to the sysvmsg module.
ca: Una extensió creada com a alternativa al mòdul sysvmsg.

source: A PHP wrapper for libsmbclient
ca: Un embolcall PHP per a libsmbclient

source: smbclient is a PHP extension that uses Samba's libsmbclient library to provide Samba related functions and 'smb' streams to PHP programs.
ca: smbclient és una extensió PHP que utilitza la biblioteca libsmbclient de Samba per proporcionar funcions relacionades amb Samba i fluxos 'smb' als programes PHP.

source: SNMP extension for PHP
ca: Extensió SNMP per a PHP

source: The SNMP extension provides a toolset for managing remote devices via the Simple Network Management Protocol. As it is a wrapper around the underlying Net-SNMP library, all basic concepts are the same and the PHP functions change their behavior depending on the Net-SNMP configuration files and environment variables.
ca: L'extensió SNMP proporciona un conjunt d'eines per gestionar dispositius remots a través del protocol de gestió de xarxes simple. Com que és un embolcall al voltant de la biblioteca subjacent Net-SNMP, tots els conceptes bàsics són els mateixos i les funcions PHP canvien el seu comportament depenent dels fitxers de configuració Net-SNMP i les variables d'entorn.

source: SOAP/WSDL extension module for PHP
ca: Mòdul d'extensió SOAP/WSDL per a PHP

source: This module provides SOAP support. SOAP extension can be used to write SOAP Servers and Clients. It supports subsets of SOAP 1.1, SOAP 1.2 and WSDL 1.1 specifications.
ca: Aquest mòdul proporciona suport SOAP. L'extensió SOAP es pot utilitzar per escriure servidors i clients SOAP. És compatible amb subconjunts de les especificacions SOAP 1.1, SOAP 1.2 i WSDL 1.1.

source: Berkeley sockets API for PHP
ca: API de sòcols de Berkeley per a PHP

source: The socket extension implements a low-level interface to the socket communication functions based on the BSD sockets API, providing the possibility to act as a socket server as well as a client.
ca: L'extensió del sòcol implementa una interfície de baix nivell per a les funcions de comunicació del sòcol basades en l'API de sòcols BSD, proporcionant la possibilitat d'actuar com a servidor de sòcol i com a client.

source: Cryptographic Extension Based on Libsodium
ca: Extensió criptogràfica basada en el libsodi

source: PHP binding to libsodium software library for encryption, decryption, signatures, password hashing and more.
ca: Vinculació de PHP a la biblioteca de programari libsodium per al xifratge, desxifratge, signatures, hashing de contrasenya i molt més.

source: SQLite database client for PHP
ca: Client de base de dades SQLite per a PHP

source: This is an extension for the SQLite Embeddable SQL Database Engine. https://www.sqlite.org SQLite is a C library that implements an embeddable SQL database engine. Programs that link with the SQLite library can have SQL database access without running a separate RDBMS process. SQLite is not a client library used to connect to a big database server. SQLite is the server. The SQLite library reads and writes directly to and from the database files on disk. This package includes sqlite and pdo_sqlite modules for sqlite version 2 and 3 respectively.
ca: Aquesta és una extensió per al motor de base de dades SQL incrustable SQL. https://www.sqlite.org SQLite és una biblioteca C que implementa un motor de base de dades SQL incrustable. Els programes que enllacen amb la biblioteca SQLite poden tenir accés a la base de dades SQL sense executar un procés RDBMS separat. SQLite no és una biblioteca de client utilitzada per connectar-se a un servidor de base de dades gran. SQLite és el servidor. La biblioteca SQLite llegeix i escriu directament des dels fitxers de la base de dades en el disc. Aquest paquet inclou mòduls sqlite i pdosqlite per a la versió 2 i 3 de sqlite, respectivament.

source: SysV Message Queue support for PHP
ca: Implementació de la cua de missatges SysV per a PHP

source: This module provides System V Message Queue support.
ca: Aquest mòdul proporciona suport per a la cua de missatges System V.

source: SysV Semaphore support for PHP
ca: Suport SysV Semaphore per a PHP

source: PHP interface for System V semaphores.
ca: Interfície PHP per a semàfors System V.

source: SysV Shared Memory support for PHP
ca: Suport de memòria compartida SysV per a PHP

source: PHP interface for System V shared memory.
ca: Interfície PHP per a la memòria compartida del System V.

source: Run php upstream testsuite.
ca: Executa el testuite de php upstream.

source: PHP7 binding for the Tidy HTML cleaner
ca: Vinculació PHP7 per al netejador d'HTML Tidy

source: Tidy is an extension based on Libtidy (http://tidy.sourceforge.net) and allows a PHP developer to clean, repair, and traverse HTML, XHTML, and XML documents -- including ones with embedded scripting languages such as PHP or ASP within them using OO constructs.
ca: Tidy és una extensió basada en Libtidy (http://tidy.sourceforge.net) i permet a un desenvolupador PHP netejar, reparar i travessar documents HTML, XHTML i XML, incloent-hi aquells amb llenguatges de script incrustats com PHP o ASP utilitzant construccions OO.

source: Extension module to access Zend Engine's PHP tokenizer
ca: Mòdul d'extensió per accedir al tokenitzador PHP de Zend Engine

source: The tokenizer functions provide an interface to the PHP tokenizer embedded in the Zend Engine. Using these functions you may write your own PHP source analyzing or modification tools without having to deal with the language specification at the lexical level.
ca: Les funcions de tokenizer proporcionen una interfície al tokenizer PHP incrustat al motor Zend. Utilitzant aquestes funcions podeu escriure la vostra pròpia font de PHP analitzant o modificant eines sense haver de tractar amb l'especificació del llenguatge a nivell lèxic.

source: PHP UUID support functions
ca: Funcions de suport UUID de PHP

source: This extension provides functions to generate and analyse universally unique identifiers (UUIDs).
ca: Aquesta extensió proporciona funcions per generar i analitzar identificadors universalment únics (UUIDs).

source: Extended PHP debugger
ca: Depurador PHP ampliat

source: The Xdebug extension helps debugging scripts by providing debug information such as: * stack and function traces in error messages with: o full parameter display for user defined functions o function name, file name and line indications o support for member functions * memory allocation * protection for infinite recursions Xdebug also provides: * profiling information for PHP scripts * code coverage analysis * capabilities to debug your scripts interactively with a debug client
ca: L'extensió Xdebug ajuda a depurar scripts proporcionant informació de depuració com: * traces de pila i funció en missatges d'error amb: o visualització de paràmetres complets per a funcions definides per l'usuari o nom de funció, nom de fitxer i indicacions de línia o suport per a funcions de membre * assignació de memòria * protecció per a recursions infinites Xdebug també proporciona: * informació de perfil per a scripts PHP * anàlisi de cobertura de codi * capacitats per a depurar els vostres scripts interactivament amb un client de depuració

source: Streaming XML reader extension for PHP
ca: Extensió lectora XML Streaming per a PHP

source: The XMLReader extension is an XML Pull parser. The reader acts as a cursor going forward on the document stream and stopping at each node on the way.
ca: L'extensió XMLReader és un analitzador XML Pull. El lector actua com un cursor que avança sobre el flux del document i s'atura a cada node en el camí.

source: XML RPC support for PHP
ca: Implementació XML RPC per a PHP

source: This module adds XMLRPC-EPI support.
ca: Aquest mòdul afegeix el suport XMLRPC-EPI.

source: Streaming-based XML writer extension for PHP
ca: Extensió d'escriptura XML basada en Streaming per a PHP

source: XMLWriter wraps the libxml xmlWriter API. Represents a writer that provides a non-cached, forward-only means of generating streams or files containing XML data.
ca: XMLWriter embolcalla l'API xmlWriter de libxml. Representa un escriptor que proporciona un mitjà de generació de fluxos o fitxers que contenen dades XML que no estan encastats i només cap endavant.

source: PHP's XSL extension implements the XSL (Extensible Stylesheet Language) standard, performing XSLT transformations using the libxslt library
ca: L'extensió XSL de PHP implementa l'estàndard XSL (Extensible Stylesheet Language), realitzant transformacions XSLT utilitzant la biblioteca libxslt

source: ZIP archive support for PHP
ca: Suport d'arxiu ZIP per a PHP

source: This extension allows to transparently read or write ZIP compressed archives and the files inside them.
ca: Aquesta extensió permet llegir o escriure arxius comprimits ZIP de manera transparent i els fitxers que hi ha dins.

source: Zlib compression support for PHP
ca: Implementació de compressió Zlib per a PHP

source: This module enables to transparently read and write gzip (.gz) compressed files, through versions of most of the filesystem functions which work with gzip-compressed files (and uncompressed files, too, but not with sockets).
ca: Aquest mòdul permet llegir i escriure fitxers comprimits gzip (.gz) de manera transparent, a través de versions de la majoria de les funcions del sistema de fitxers que funcionen amb fitxers comprimits gzip (i fitxers sense comprimir, també, però no amb sòcols).

source: Interpreter for the PHP scripting language version 8
ca: Intèrpret per al llenguatge PHP scripting versió 8

source: PHP8 Extension Module
ca: Mòdul d'extensió PHP8

source: PHP8 development files for C/C++ extensions
ca: Fitxers de desenvolupament PHP8 per a extensions C/C++

source: FastCGI PHP8 Module
ca: Mòdul PHP8 FastCGI

source: FastCGI Process Manager PHP8 Module
ca: Mòdul PHP8 del gestor de processos FastCGI

source: PHP8 readline extension
ca: Extensió de línia de lectura PHP8

source: PHP8 binding for the Tidy HTML cleaner
ca: Vinculació PHP8 per al netejador d'HTML Tidy

source: Administration of MySQL over the web
ca: Administració de MySQL a través de la web
