Repository: openSUSE/packages-i18n
Catalog: */po/rubygem.*.po
Languages: ca

source: This library allows for the identification of a file's likely MIME content type. This is release 1.25.1, fixing an issue with priority comparison for mime-types 1.x. The current release is 2.0, which only supports Ruby 1.9 or later. Release 1.25.1 contains all features of 1.25, including the experimental caching and lazy loading functionality. The caching and lazy loading features were initially implemented by Greg Brockman (gdb). As these features are experimental, they are disabled by default and must be enabled through the use of environment variables. The cache is invalidated on a per-version basis; the cache for version 1.25 will not be reused for any later version. To use lazy loading, set the environment variable +RUBY_MIME_TYPES_LAZY_LOAD+ to any value other than 'false'. When using lazy loading, the initial startup of MIME::Types is around 12–25× faster than normal startup (on my system, normal startup is about 90 ms; lazy startup is about 4 ms). This isn't generally useful, however, as the MIME::Types database has not been loaded. Lazy startup and load is just *slightly* faster—around 1 ms. The real advantage comes from using the cache. To enable the cache, set the environment variable +RUBY_MIME_TYPES_CACHE+ to a filename where MIME::Types will have read-write access. The first time a new version of MIME::Types is run using this file, it will be created, taking a little longer than normal. Subsequent loads using the same cache file will be approximately 3½× faster (25 ms) than normal loads. This can be combined with +RUBY_MIME_TYPES_LAZY_LOAD+, but this is *not* recommended in a multithreaded or multiprocess environment where all threads or processes will be using the same cache file. As the caching interface is still experimental, the only values cached are the default MIME::Types database, not any custom MIME::Types added by users. MIME types are used in MIME-compliant communications, as in e-mail or HTTP traffic, to indicate the type of content which is transmitted. MIME::Types provides the ability for detailed information about MIME entities (provided as a set of MIME::Type objects) to be determined and used programmatically. There are many types defined by RFCs and vendors, so the list is long but not complete; don't hesitate to ask to add additional information. This library follows the IANA collection of MIME types (see below for reference). MIME::Types for Ruby was originally based on MIME::Types for Perl by Mark Overmeer, copyright 2001 - 2009. MIME::Types is built to conform to the MIME types of RFCs 2045 and 2231. It tracks the {IANA registry}[http://www.iana.org/assignments/media-types/] ({ftp}[ftp://ftp.iana.org/assignments/media-types]) with some unofficial types added from the {LTSW collection}[http://www.ltsw.se/knbase/internet/mime.htp] and added by the users of MIME::Types.
ca: Aquesta biblioteca permet la identificació del tipus de contingut MIME probable d'un fitxer. Aquesta és la versió 1.25.1, que soluciona un problema amb la comparació de prioritat per als tipus MIME 1.x. El llançament actual és 2.0, que només suporta Ruby 1.9 o posterior. La versió 1.25.1 conté totes les característiques de 1.25, incloent la memòria cau experimental i la funcionalitat de càrrega mandrosa. Les funcions de memòria cau i càrrega mandrosa van ser implementades inicialment per Greg Brockman (gdb). Com que aquestes característiques són experimentals, estan desactivades per defecte i s'han d'habilitar mitjançant l'ús de variables d'entorn. La memòria cau està invalidada per versió; la memòria cau per a la versió 1.25 no es reutilitzarà per a cap versió posterior. Per a utilitzar una càrrega mandrosa, establiu la variable d'entorn +RUBYMIMETYPESLAZYLOAD+ a qualsevol valor que no sigui «fals». Quan s'utilitza càrrega mandrosa, l'inici inicial de MIME::Types és al voltant de 12–25). més ràpid que l'inici normal (en el meu sistema, l'inici normal és d'uns 90 ms; l'inici mandrós és d'uns 4 ms). Això no és generalment útil, però, ja que la base de dades MIME::Types no s'ha carregat. Lazy startup i càrrega és només *lleugerament* més ràpid, al voltant d'1 ms. L'avantatge real prové de l'ús de la memòria cau. Per a habilitar la memòria cau, establiu la variable d'entorn +RUBYMIMETYPESCACHE+ a un nom de fitxer on MIME::Types tindrà accés de lectura-escriptura. La primera vegada que s'executi una nova versió de MIME::Types utilitzant aquest fitxer, es crearà, trigant una mica més del normal. Les càrregues posteriors que utilitzen el mateix fitxer de memòria cau seran aproximadament 3122. més ràpids (25 ms) que les càrregues normals. Això es pot combinar amb +RUBYMIMETYPESLAZYLOAD+, però això *no* es recomana en un entorn multifil o multiprocés on tots els fils o processos utilitzaran el mateix fitxer de memòria cau. Com que la interfície de memòria cau encara és experimental, els únics valors a la memòria cau són la base de dades MIME::Types per defecte, no qualsevol MIME::Types personalitzat afegit pels usuaris. Els tipus MIME s'utilitzen en comunicacions compatibles amb MIME, com en el trànsit de correu electrònic o HTTP, per indicar el tipus de contingut que es transmet. MIME::Types proporciona la capacitat per a obtenir informació detallada sobre les entitats MIME (proporcionada com un conjunt d'objectes MIME::Type) que s'han de determinar i utilitzar de manera programàtica. Hi ha molts tipus definits per RFCs i venedors, de manera que la llista és llarga però no completa; no dubteu a demanar afegir informació addicional. Aquesta biblioteca segueix la col·lecció IANA de tipus MIME (vegeu més avall per a la referència). MIME::Types for Ruby es va basar originalment en MIME::Types for Perl per Mark Overmeer, copyright 2001 - 2009. MIME::Types està construït per ajustar-se als tipus MIME dels RFC 2045 i 2231. Segueix el registre {IANA}[http://www.iana.org/assignments/media-types/] ({ftp}[ftp://ftp.iana.org/assignments/media-types]) amb alguns tipus no oficials afegits de la col·lecció {LTSW}[http://www.ltsw.se/knbase/internet/mime.htp] i afegits pels usuaris de MIME::Types.

source: The mime-types library provides a library and registry for
ca: La biblioteca de tipus MIME proporciona una biblioteca i un registre per

source: The mime-types library provides a library and registry for information about MIME content type definitions. It can be used to determine defined filename extensions for MIME types, or to use filename extensions to look up the likely MIME type definitions. Version 3.0 is a major release that requires Ruby 2.0 compatibility and removes deprecated functions. The columnar registry format introduced in 2.6 has been made the primary format; the registry data has been extracted from this library and put into {mime-types-data}[https://github.com/mime-types/mime-types-data]. Additionally, mime-types is now licensed exclusively under the MIT licence and there is a code of conduct in effect. There are a number of other smaller changes described in the History file.
ca: La biblioteca de tipus MIME proporciona una biblioteca i un registre per a la informació sobre les definicions de tipus MIME. Es pot utilitzar per determinar les extensions de nom de fitxer definides per als tipus MIME, o per utilitzar les extensions de nom de fitxer per cercar les definicions de tipus MIME probables. La versió 3.0 és una versió important que requereix compatibilitat amb Ruby 2.0 i elimina funcions obsoletes. El format de registre columnar introduït en 2.6 s'ha fet el format principal; les dades de registre s'han extret d'aquesta biblioteca i s'han posat en {mime-types-data}[https://github.com/mime-types/mime-types-data]. A més, els tipus MIME ara estan llicenciats exclusivament sota la llicència del MIT i hi ha un codi de conducta en vigor. Hi ha una sèrie d'altres canvis més petits descrits al fitxer Historial.

source: mime-types-data provides a registry for information about MIME media
ca: mime-types-data proporciona un registre per a la informació sobre el mitjà MIME

source: mime-types-data provides a registry for information about MIME media type definitions. It can be used with the Ruby mime-types library or other software to determine defined filename extensions for MIME types, or to use filename extensions to look up the likely MIME type definitions.
ca: mime-types-data proporciona un registre per a la informació sobre les definicions de tipus MIME. Es pot utilitzar amb la biblioteca de tipus MIME de Ruby o amb un altre programari per determinar les extensions de nom de fitxer definides per als tipus MIME, o per utilitzar extensions de nom de fitxer per cercar les definicions de tipus MIME probables.

source: RDoc documentation for mime-types-data
ca: Documentació RDoc per a tipus MIME-data

source: RDoc documentation for mime-types
ca: Documentació RDoc per a tipus MIME

source: Test suite for mime-types
ca: Conjunt de proves per a tipus MIME

source: Fast mime detection by extension or content
ca: Detecció ràpida del mime per extensió o contingut

source: Fast mime detection by extension or content in pure ruby (Uses freedesktop.org.xml shared-mime-info database).
ca: Detecció ràpida de mims per extensió o contingut en rubí pur (Usa freedesktop.org.xml shared-mime-info database).

source: RDoc documentation for mimemagic
ca: Documentació RDoc per a mimemagic

source: Test suite for mimemagic
ca: Test suite per a mimemagic

source: A lightweight mime type lookup toy
ca: Una joguina lleugera de cerca de tipus MIME

source: A lightweight mime type lookup toy.
ca: Una joguina lleugera de tipus MIME.

source: RDoc documentation for mini_mime
ca: Documentació RDoc per al minimime

source: Simplistic port-like solution for developers
ca: Solució simple semblant a un port per a desenvolupadors

source: Simplistic port-like solution for developers. It provides a standard and simplified way to compile against dependency libraries without messing up your system.
ca: Solució simplista semblant a un port per a desenvolupadors. Proporciona una manera estàndard i simplificada de compilar contra biblioteques de dependències sense fer malbé el vostre sistema.

source: RDoc documentation for mini_portile2
ca: Documentació RDoc per al miniportile2

source: Test suite for mini_portile2
ca: Conjunt de proves per al miniportile2

source: A class based configuration library
ca: Una biblioteca de configuració basada en classes

source: A class based configuration library.
ca: Una biblioteca de configuració basada en classes.

source: RDoc documentation for mixlib-config
ca: Documentació RDoc per a mixlib-config

source: Test suite for mixlib-config
ca: Prova el conjunt per a la mixlib-config

source: MessagePack, a binary-based efficient data interchange format
ca: MessagePack, un format d'intercanvi de dades eficient basat en binari

source: MessagePack is a binary-based efficient object serialization library. It enables to exchange structured objects between many languages like JSON. But unlike JSON, it is very fast and small.
ca: MessagePack és una biblioteca de serialització d'objectes eficient basada en binaris. Permet intercanviar objectes estructurats entre molts llenguatges com JSON. Però a diferència de JSON, és molt ràpid i petit.

source: RDoc documentation for msgpack
ca: Documentació RDoc per a msgpack

source: Test suite for msgpack
ca: Test suite per a msgpack

source: A common interface to multiple JSON libraries
ca: Una interfície comuna a diverses biblioteques JSON

source: A common interface to multiple JSON libraries, including Oj, Yajl, the JSON gem (with C-extensions), the pure-Ruby JSON gem, NSJSONSerialization, gson.rb, JrJackson, and OkJson.
ca: Una interfície comuna a múltiples biblioteques JSON, incloent Oj, Yajl, la gemma JSON (amb extensions C), la gemma JSON pura-Ruby, NSJSONSerialization, gson.rb, JrJackson, i OkJson.

source: RDoc documentation for multi_json
ca: Documentació RDoc per a multijson

source: A generic swappable back-end for XML parsing
ca: Un back-end genèric relliscable per a l'anàlisi XML

source: Provides swappable XML backends utilizing LibXML, Nokogiri, Ox, or REXML.
ca: Proporciona dorsals XML que utilitzen LibXML, Nokogiri, Ox o REXML.

source: RDoc documentation for multi_xml
ca: Documentació RDoc per multixml

source: A multipart form post accessory for Net::HTTP
ca: Un accessori d'entrada de formulari multipart per a Net::HTTP

source: Use with Net::HTTP to do multipart form posts. IO values that have file.
ca: Utilitzeu-lo amb Net::HTTP per a fer entrades multipart. Valors d'E/S que tenen fitxer.

source: RDoc documentation for multipart-post
ca: Documentació RDoc per a multipart-post

source: Test suite for multipart-post
ca: Conjunt de proves per al post multipart

source: Mustache is a framework-agnostic way to render logic-free views
ca: Mustache és una manera d'anàlisi de marc per a renderitzar vistes lliures de lògica

source: Inspired by ctemplate, Mustache is a framework-agnostic way to render logic-free views. As ctemplates says, "It emphasizes separating logic from presentation: it is impossible to embed application logic in this template language. Think of Mustache as a replacement for your views. Instead of views consisting of ERB or HAML with random helpers and arbitrary logic, your views are broken into two parts: a Ruby class and an HTML template.
ca: Inspirat en el ctemplate, Mustache és una manera agnòstica de crear vistes lliures de lògica. Com diu ctemplates, "emfasitza separar la lògica de la presentació: és impossible incrustar la lògica d'aplicació en aquest llenguatge de plantilla. Penseu en Mustache com a substitut de les vostres opinions. En lloc de les vistes que consisteixen en ERB o HAML amb ajudants aleatoris i lògica arbitrària, les vostres vistes es divideixen en dues parts: una classe Ruby i una plantilla HTML.

source: RDoc documentation for mustache
ca: Documentació RDoc per a bigoti

source: Test suite for mustache
ca: Prova el conjunt per a bigoti

source: Your personal string matching expert
ca: El vostre expert personal en concordança de cadenes

source: A library implementing patterns that behave like regular expressions.
ca: Una biblioteca que implementa patrons que es comporten com expressions regulars.

source: RDoc documentation for mustermann
ca: Documentació RDoc per a mustermann

source: Grape syntax for Mustermann
ca: Sintaxi de gra per a Mustermann

source: Adds Grape style patterns to Mustermman.
ca: Afegeix patrons d'estil de raïm a Mustermman.

source: RDoc documentation for mustermann-grape
ca: Documentació RDoc per a mustermann-grape

source: Test suite for mustermann-grape
ca: Conjunt de proves per a la grapa de mustermann

source: Test suite for mustermann
ca: Conjunt de proves per a mustermann

source: Net::LDAP for Ruby (also called net-ldap) implements client access
ca: Net::LDAP for Ruby (també anomenat net-ldap) implementa l'accés del client

source: Net::LDAP for Ruby (also called net-ldap) implements client access for the Lightweight Directory Access Protocol (LDAP), an IETF standard protocol for accessing distributed directory services. Net::LDAP is written completely in Ruby with no external dependencies. It supports most LDAP client features and a subset of server features as well. Net::LDAP has been tested against modern popular LDAP servers including OpenLDAP and Active Directory. The current release is mostly compliant with earlier versions of the IETF LDAP RFCs (2251-2256, 2829-2830, 3377, and 3771). Our roadmap for Net::LDAP 1.0 is to gain full <em>client</em> compliance with the most recent LDAP RFCs (4510-4519, plutions of 4520-4532).
ca: Net::LDAP for Ruby (també anomenat net-ldap) implementa l'accés del client per al Lightweight Directory Access Protocol (LDAP), un protocol estàndard IETF per accedir als serveis de directori distribuït. Net::LDAP s'escriu completament en Ruby sense dependències externes. És compatible amb la majoria de les característiques del client LDAP i un subconjunt de característiques del servidor també. Net::LDAP ha estat provat contra servidors LDAP populars moderns, incloent OpenLDAP i Active Directory. El llançament actual és majoritàriament compatible amb les versions anteriors dels RFC LDAP IETF (2251-2256, 2829-2830, 3377, i 3771). El nostre full de ruta per a Net::LDAP 1.0 és obtenir el compliment complet <em>client</em> amb els RFCs LDAP més recents (4510-4519, plutions of 4520-4532).

source: RDoc documentation for net-ldap
ca: Documentació RDoc per a net-ldap

source: Test suite for net-ldap
ca: Prova el conjunt per a «net-ldap»

source: A pure Ruby implementation of the SCP client protocol
ca: Una implementació pura de Ruby del protocol del client SCP

source: A pure Ruby implementation of the SCP client protocol.
ca: Una implementació pura de Ruby del protocol del client SCP.

source: RDoc documentation for net-scp
ca: Documentació RDoc per a net-scp

source: A pure Ruby implementation of the SFTP client protocol
ca: Una implementació pura de Ruby del protocol del client SFTP

source: A pure Ruby implementation of the SFTP client protocol.
ca: Una implementació pura de Ruby del protocol del client SFTP.

source: RDoc documentation for net-sftp
ca: Documentació RDoc per a net-sftp

source: Net::SSH: a pure-Ruby implementation of the SSH2 client protocol
ca: Net::SSH: una implementació pura de Ruby del protocol de client SSH2

source: Net::SSH: a pure-Ruby implementation of the SSH2 client protocol. It allows you to write programs that invoke and interact with processes on remote servers, via SSH2.
ca: Net::SSH: una implementació pura de Ruby del protocol de client SSH2. Permet escriure programes que invoquen i interactuen amb processos en servidors remots, via SSH2.

source: RDoc documentation for net-ssh
ca: Documentació RDoc per a net-ssh

source: A simple library to assist in establishing tunneled Net::SSH
ca: Una biblioteca senzilla per ajudar a establir Net::SSH en túnel

source: A simple library to assist in establishing tunneled Net::SSH connections.
ca: Una biblioteca senzilla per ajudar en l'establiment de connexions Net::SSH.

source: RDoc documentation for net-ssh-gateway
ca: Documentació RDoc per a net-ssh-gateway

source: Library to read and write netrc files
ca: Biblioteca per llegir i escriure fitxers netrc

source: This library can read and update netrc files, preserving formatting including comments and whitespace.
ca: Aquesta biblioteca pot llegir i actualitzar els fitxers netrc, preservant el format, inclosos els comentaris i els espais en blanc.

source: RDoc documentation for netrc
ca: Documentació RDoc per a netrc

source: Test suite for netrc
ca: Conjunt de proves per a netrc

source: New IO for Ruby
ca: Nova E/S per a Ruby

source: Cross-platform asynchronous I/O primitives for scalable network clients and servers. Inspired by the Java NIO API, but simplified for ease-of-use.
ca: primitives d'E/S asíncrones multiplataforma per a clients i servidors de xarxa escalables. Inspirat en l'API de Java NIO, però simplificat per a la facilitat d'ús.

source: RDoc documentation for nio4r
ca: Documentació RDoc per a nio4r

source: Test suite for nio4r
ca: Test suite per a nio4r

source: Nokogiri (鋸) is an HTML, XML, SAX, and Reader parser
ca: Nokogiri ( an) és un analitzador HTML, XML, SAX i Reader

source: Nokogiri (鋸) is an HTML, XML, SAX, and Reader parser. Among Nokogiri's many features is the ability to search documents via XPath or CSS3 selectors.
ca: Nokogiri ( an) és un analitzador HTML, XML, SAX i Reader. Entre les moltes característiques de Nokogiri hi ha la capacitat de cercar documents a través de selectors XPath o CSS3.

source: RDoc documentation for nokogiri
ca: Documentació RDoc per a nokogiri

source: Test suite for nokogiri
ca: Conjunt de proves per a nokogiri

source: XML to Hash translator
ca: Traducció XML a Hash

source: XML to Hash translator.
ca: Traductor XML a Hash.

source: RDoc documentation for nori
ca: Documentació RDoc per a nori

source: Test suite for nori
ca: Conjunt de proves per a nori

source: OAuth Core Ruby implementation
ca: Implementació de OAuth Core Ruby

source: OAuth Core Ruby implementation.
ca: Implementació d'OAuth Core Ruby.

source: RDoc documentation for oauth
ca: Documentació RDoc per a oauth

source: A Ruby wrapper for the OAuth 2.0 protocol
ca: Un embolcall Ruby per al protocol OAuth 2.0

source: A Ruby wrapper for the OAuth 2.0 protocol built with a similar style to the original OAuth spec.
ca: Un embolcall de Ruby per al protocol OAuth 2.0 construït amb un estil similar a l'especificació original d'OAuth.

source: RDoc documentation for oauth2
ca: Documentació RDoc per a oauth2

source: A generalized Rack framework for multiple-provider authentication
ca: Un marc de treball Rack generalitzat per a l'autenticació de múltiples proveïdors

source: A generalized Rack framework for multiple-provider authentication.
ca: Un marc de treball Rack generalitzat per a l'autenticació de múltiples proveïdors.

source: RDoc documentation for omniauth
ca: Documentació RDoc per a l'omniauth

source: Official OmniAuth strategy for GitHub
ca: Estratègia oficial d'OmniAuth per a GitHub

source: Official OmniAuth strategy for GitHub.
ca: Estratègia oficial d'OmniAuth per a GitHub.

source: RDoc documentation for omniauth-github
ca: Documentació RDoc per a omniauth-github

source: Test suite for omniauth-github
ca: Test suite per a omniauth-github

source: This is the strategy for authenticating to your GitLab service
ca: Aquesta és l'estratègia per autenticar-te al teu servei GitLab

source: This is the strategy for authenticating to your GitLab service.
ca: Aquesta és l'estratègia per autenticar-te al teu servei GitLab.

source: RDoc documentation for omniauth-gitlab
ca: Documentació RDoc per a omniauth-gitlab

source: Test suite for omniauth-gitlab
ca: Conjunt de proves per a omniauth-gitlab

source: A Google OAuth2 strategy for OmniAuth 1.x
ca: Una estratègia de Google OAuth2 per a OmniAuth 1.x

source: A Google OAuth2 strategy for OmniAuth 1.x. This allows you to login to Google with your ruby app.
ca: Una estratègia de Google OAuth2 per a OmniAuth 1.x. Això us permet iniciar sessió a Google amb la vostra aplicació ruby.

source: RDoc documentation for omniauth-google-oauth2
ca: Documentació RDoc per a omniauth-google-oauth2

source: Test suite for omniauth-google-oauth2
ca: Test suite per a omniauth-google-oauth2

source: A generic OAuth (1.0/1.0a) strategy for OmniAuth
ca: Una estratègia genèrica d'OAuth (1.0/1.0a) per a OmniAuth

source: A generic OAuth (1.0/1.0a) strategy for OmniAuth.
ca: Una estratègia genèrica d'OAuth (1.0/1.0a) per a OmniAuth.

source: RDoc documentation for omniauth-oauth
ca: Documentació RDoc per a omniauth-oauth

source: Test suite for omniauth-oauth
ca: Prova el conjunt per a omniauth-oauth

source: An abstract OAuth2 strategy for OmniAuth
ca: Una estratègia abstracta d'OAuth2 per a OmniAuth

source: An abstract OAuth2 strategy for OmniAuth.
ca: Una estratègia abstracta d'OAuth2 per a OmniAuth.

source: RDoc documentation for omniauth-oauth2
ca: Documentació RDoc per a omniauth-oauth2

source: Test suite for omniauth-oauth2
ca: Conjunt de proves per a omniauth-oauth2

source: open4
ca: obert4

source: open child process with handles on pid, stdin, stdout, and stderr: manage child processes and their io handles easily.
ca: obrir el procés fill amb nanses en pid, stdin, stdout i stderr: gestionar els processos fills i les seves nanses io fàcilment.

source: RDoc documentation for open4
ca: Documentació RDoc per a open4

source: Test suite for open4
ca: Conjunt de proves per a open4

source: OpenID Connect Server & Client Library
ca: Biblioteca del client OpenID Connect Server

source: OpenID Connect Server & Client Library.
ca: Biblioteca del client OpenID Connect Server.
