Repository: openSUSE/packages-i18n
Catalog: */po/rubygem.*.po
Languages: ca

source: Trollop is a commandline option parser for Ruby that just gets out of your way. One line of code per option is all you need to write. For that, you get a nice automatically-generated help page, robust option parsing, command subcompletion, and sensible defaults for everything you don't specify.
ca: Trollop és un analitzador d'opcions de la línia d'ordres per a Ruby que acaba de sortir del vostre camí. Una línia de codi per opció és tot el que cal escriure. Per a això, obteniu una pàgina d'ajuda generada automàticament, una anàlisi robusta d'opcions, subcompleció d'ordres i valors predeterminats assenyats per a tot el que no especifiqueu.

source: RDoc documentation for trollop
ca: Documentació RDoc per trollop

source: Test suite for trollop
ca: Conjunt de proves per a trollop

source: Turbolinks makes navigating your web application faster
ca: Turbolinks fa que la navegació per la vostra aplicació web sigui més ràpida

source: Rails engine for Turbolinks 5 support.
ca: Motor de carrils per al suport Turbolinks 5.

source: RDoc documentation for turbolinks
ca: Documentació RDoc per als enllaços turbo

source: Turbolinks JavaScript assets
ca: Turbolinks actius JavaScript

source: RDoc documentation for turbolinks-source
ca: Documentació RDoc per a turbolinks-source

source: Daylight savings aware timezone library
ca: Biblioteca de fus horari d'estiu

source: TZInfo provides daylight savings aware transformations between times in different time zones.
ca: TZInfo proporciona transformacions conscients de l'estalvi de llum diürna entre moments en diferents zones horàries.

source: RDoc documentation for tzinfo
ca: Documentació RDoc per a tzinfo

source: Test suite for tzinfo
ca: Conjunt de proves per a tzinfo

source: Ruby wrapper for UglifyJS JavaScript compressor
ca: Ajustador Ruby per al compressor JavaScript UglifyJS

source: Uglifier minifies JavaScript files by wrapping UglifyJS to be accessible in Ruby.
ca: Uglifier minifica els fitxers JavaScript ajustant UglifyJS perquè siguin accessibles a Ruby.

source: RDoc documentation for uglifier
ca: Documentació RDoc per a uglifier

source: A wrapper library to bring Unicode Normalization Form support to
ca: Una biblioteca d'embolcalls per a donar suport al formulari de normalització Unicode

source: This is a wrapper library to bring Unicode Normalization Form support to Ruby/JRuby.
ca: Aquesta és una biblioteca d'embolcalls per a donar suport al formulari de normalització Unicode a Ruby/JRuby.

source: RDoc documentation for unf
ca: Documentació RDoc per a unf

source: Test suite for unf
ca: Prova el conjunt per a unf

source: Unicode Normalization Form support library for CRuby
ca: Biblioteca de suport per al formulari de normalització Unicode per a CRuby

source: Unicode Normalization Form support library for CRuby.
ca: La biblioteca de suport per al formulari de normalització Unicode per al CRuby.

source: RDoc documentation for unf_ext
ca: Documentació del RDoc per a «unfext»

source: Test suite for unf_ext
ca: Prova el conjunt per a unfext

source: Converts strings to/from a slightly modified base64 that contains
ca: Converteix les cadenes a/des d'una base64 lleugerament modificada que conté

source: Converts strings to/from a slightly modified base64 that contains only url-safe characters.
ca: Converteix les cadenes a/des d'una base64 lleugerament modificada que només conté caràcters segurs per a l'URL.

source: RDoc documentation for url_safe_base64
ca: Documentació RDoc per a urlsafebase64

source: Test suite for url_safe_base64
ca: Prova el conjunt per a urlsafebase64

source: Tool and library for testing Vagrant plugins
ca: Eina i biblioteca per provar els connectors de Vagrant

source: vagrant-spec is a both a specification of how Vagrant and its various components should behave as well as a library of testing helpers that let you write your own unit and acceptance tests for Vagrant. The library provides a set of helper methods in addition to RSpec matchers and expectations to help you both unit test and acceptance test Vagrant components. The RSpec components are built on top of the helper methods so that the test library can be used with your test framework of choice, but the entire tool is geared very heavily towards RSpec.
ca: Vagrant-spec és una especificació de com Vagrant i els seus diversos components s'han de comportar, així com una biblioteca d'ajudants de proves que us permeten escriure la vostra pròpia unitat i proves d'acceptació per Vagrant. La biblioteca proporciona un conjunt de mètodes d'ajuda, a més dels aparelladors RSpec i les expectatives per ajudar-vos tant a la prova d'unitats com a la prova d'acceptació components Vagrant. Els components RSpec es construeixen sobre els mètodes d'ajuda perquè la biblioteca de proves es pugui utilitzar amb el vostre marc de proves d'elecció, però tota l'eina està orientada molt cap a RSpec.

source: RDoc documentation for vagrant-spec
ca: Documentació del RDoc per a «vagrant-spec»

source: Test suite for vagrant-spec
ca: Prova el conjunt per a l'aspecte vagrant

source: Ruby library for the HashiCorp Vagrant Cloud API
ca: Biblioteca Ruby per a l'API HashiCorp Vagrant Cloud

source: Ruby library for the HashiCorp Vagrant Cloud API.
ca: Biblioteca Ruby per a l'API HashiCorp Vagrant Cloud.

source: RDoc documentation for vagrant_cloud
ca: Documentació RDoc per a vagrantcloud

source: Library for validating email addresses in Rails 3 models
ca: Biblioteca per a la validació d'adreces de correu electrònic en els models Rails 3

source: Library for validating email addresses in Rails 3 models.
ca: Biblioteca per validar adreces de correu electrònic en models Rails 3.

source: RDoc documentation for validate_email
ca: Documentació RDoc per a validar correu

source: Library for validating urls in Rails
ca: Biblioteca per validar urls a Rails

source: Library for validating urls in Rails.
ca: Biblioteca per a la validació d'urls en Rails.

source: RDoc documentation for validate_url
ca: Documentació del RDoc per a l'url de validació

source: Attributes on Steroids for Plain Old Ruby Objects
ca: Atributs sobre esteroides per a objectes Ruby antics llis

source: Attributes on Steroids for Plain Old Ruby Objects.
ca: Atributs sobre esteroides per a objectes Ruby antics llis.

source: RDoc documentation for virtus
ca: Documentació RDoc per a virtus

source: Test suite for virtus
ca: Conjunt de proves per a virtus

source: Rack middleware that provides authentication for rack applications
ca: Rack middleware que proporciona autenticació per a aplicacions de rack

source: Rack middleware that provides authentication for rack applications.
ca: Rack middleware que proporciona autenticació per a aplicacions de rack.

source: RDoc documentation for warden
ca: Documentació del RDoc per al guarda

source: Test suite for warden
ca: Test suite per a guardià

source: A debugging tool for your Ruby on Rails applications
ca: Una eina de depuració per a les aplicacions Ruby on Rails

source: A debugging tool for your Ruby on Rails applications.
ca: Una eina de depuració per a les vostres aplicacions Ruby on Rails.

source: RDoc documentation for web-console
ca: Documentació RDoc per a la consola web

source: Ruby WebFinger client library, following IETF WebFinger WG spec
ca: Biblioteca del client Ruby WebFinger, seguint l'especificació WG de WebFinger IETF

source: Ruby WebFinger client library.
ca: Biblioteca client de Ruby WebFinger.

source: RDoc documentation for webfinger
ca: Documentació RDoc per a webfinger

source: Test suite for webfinger
ca: Test suite per a webfinger

source: Library for stubbing HTTP requests in Ruby
ca: Biblioteca per a suplantar les sol·licituds HTTP a Ruby

source: WebMock allows stubbing HTTP requests and setting expectations on HTTP requests.
ca: WebMock permet sufocar les sol·licituds HTTP i establir expectatives sobre les sol·licituds HTTP.

source: RDoc documentation for webmock
ca: Documentació RDoc per a la maqueta web

source: Test suite for webmock
ca: Prova el conjunt per a la maqueta web

source: Use webpack to manage app-like JavaScript modules in Rails
ca: Utilitza webpack per gestionar mòduls JavaScript similars a les aplicacions a Rails

source: Use webpack to manage app-like JavaScript modules in Rails.
ca: Utilitzeu webpack per gestionar mòduls de JavaScript similars a les aplicacions a Rails.

source: RDoc documentation for webpacker
ca: Documentació RDoc per al webpacker

source: Test suite for webpacker
ca: Test suite per a webpacker

source: HTTP server toolkit
ca: Conjunt d'eines del servidor HTTP

source: WEBrick is an HTTP server toolkit that can be configured as an HTTPS server, a proxy server, and a virtual-host server.
ca: WEBrick és un conjunt d'eines del servidor HTTP que es pot configurar com un servidor HTTPS, un servidor intermediari i un servidor amfitrió virtual.

source: RDoc documentation for webrick
ca: Documentació RDoc per al webrick

source: WebSocket protocol handler with pluggable I/O
ca: Gestor de protocol WebSocket amb E/S connectable

source: WebSocket protocol handler with pluggable I/O.
ca: Gestor de protocol WebSocket amb E/S endollat.

source: RDoc documentation for websocket-driver
ca: Documentació RDoc per a websocket-driver

source: Generic extension manager for WebSocket connections
ca: Gestor d'extensions genèriques per a les connexions WebSocket

source: Generic extension manager for WebSocket connections.
ca: Gestor d'extensions genèriques per a connexions WebSocket.

source: RDoc documentation for websocket-extensions
ca: Documentació RDoc per a extensions de websocket

source: Ruby library for Windows Remote Management
ca: Biblioteca Ruby per a la gestió remota de Windows

source: Ruby library for Windows Remote Management.
ca: Biblioteca Ruby per a la gestió remota de Windows.

source: RDoc documentation for winrm
ca: Documentació RDoc per a winrm

source: Ruby library for running commands as elevated
ca: Biblioteca Ruby per a executar ordres com a elevades

source: Ruby library for running commands via WinRM as elevated through a scheduled task.
ca: Biblioteca de Ruby per executar ordres a través de WinRM com a elevada a través d'una tasca programada.

source: RDoc documentation for winrm-elevated
ca: Documentació RDoc per a winrm-elevated

source: WinRM File System
ca: Sistema de fitxers WinRM

source: Ruby library for file system operations via Windows Remote Management.
ca: Biblioteca Ruby per a operacions del sistema de fitxers a través de la gestió remota de Windows.

source: RDoc documentation for winrm-fs
ca: Documentació RDoc per a winrm-fs

source: XDG provides an interface for using XDG directory standard
ca: XDG proporciona una interfície per utilitzar l'estàndard de directori XDG

source: XDG provides an interface for using XDG directory standard.
ca: XDG proporciona una interfície per utilitzar l'estàndard de directori XDG.

source: RDoc documentation for xdg
ca: Documentació RDoc per a xdg

source: Test suite for xdg
ca: Conjunt de proves per a xdg

source: Documentation tool for consistent and usable documentation in Ruby
ca: Eina de documentació per a documentació consistent i utilitzable a Ruby

source: YARD is a documentation generation tool for the Ruby programming language. It enables the user to generate consistent, usable documentation that can be exported to a number of formats very easily, and also supports extending for custom Ruby constructs such as custom class level definitions.
ca: YARD és una eina de generació de documentació per al llenguatge de programació Ruby. Permet a l'usuari generar documentació coherent i utilitzable que es pot exportar a una sèrie de formats molt fàcilment, i també suporta l'extensió per a construccions Ruby personalitzades, com ara definicions de nivell de classe personalitzades.

source: RDoc documentation for yard
ca: Documentació RDoc per al pati

source: Test suite for yard
ca: Conjunt de proves per al pati

source: Rake tasks providing basic work-flow for Yast development
ca: Tasques d'execució que proporcionen un flux de treball bàsic per al desenvolupament de Yast

source: Rake tasks that support work-flow of Yast developer. It allows packaging repo, send it to build service, create submit request to target repo or run client from git repo.
ca: Tasques d'execució que suporten el flux de treball del desenvolupador Yast. Permet embalatge de dipòsit, enviar-lo per construir el servei, crear la sol·licitud d'enviament al repositori objectiu o executar el client des de git repo.

source: RDoc documentation for yast-rake
ca: Documentació RDoc per a la iast-rake

source: A simple REST client for the Docker Remote API
ca: Un client REST simple per a l'API remota de Docker

source: A simple REST client for the Docker Remote API.
ca: Un client REST simple per a l'API de Docker Remote.

source: RDoc documentation for docker-api
ca: Documentació RDoc per a docker-api

source: Test suite for docker-api
ca: Test suite per docker-api

source: Passenger apache module
ca: Mòdul Passenger apache

source: A modern web server and application server for Ruby, Python and Node.js, optimized for performance, low memory usage and ease of use. This package holds the apache2 sub package for passenger
ca: Un servidor web modern i un servidor d'aplicacions per a Ruby, Python i Node.js, optimitzat per al rendiment, baix ús de memòria i facilitat d'ús. Aquest paquet conté el subpaquet apache2 per al passatger

source: Passenger Nginx module
ca: Mòdul Passenger Nginx

source: A modern web server and application server for Ruby, Python and Node.js, optimized for performance, low memory usage and ease of use. This package holds the nginx sub package for passenger
ca: Un servidor web modern i un servidor d'aplicacions per a Ruby, Python i Node.js, optimitzat per al rendiment, baix ús de memòria i facilitat d'ús. Aquest paquet conté el subpaquet nginx per al passatger

source: RDoc documentation for rice
ca: Documentació RDoc per a l'arròs

source: FastCGI library for Ruby
ca: Biblioteca FastCGI per a Ruby

source: FastCGI is a language independent, scalable, open extension to CGI that provides high performance without the limitations of server specific APIs. For more information, see http://www.fastcgi.com/. This is the fork of fcgi implementation for ruby but with ruby1.9 - ruby1.9.1 compability
ca: FastCGI és un llenguatge independent, escalable, d'extensió oberta a CGI que proporciona un alt rendiment sense les limitacions de les API específiques del servidor. Per a més informació, consulteu http://www.fastcgi.com/. Aquesta és la bifurcació de la implementació de fcgi per a ruby però amb la compatibilitat ruby1.9 - ruby1.9.1

source: RDoc documentation for ruby-fcgi
ca: Documentació RDoc per a ruby-fcgi

source: Test suite for ruby-fcgi
ca: Conjunt de proves per a ruby-fcgi

source: Debase is a fast implementation of the standard Ruby debugger
ca: Debase és una implementació ràpida del depurador Ruby estàndard

source: Debase is a fast implementation of the standard Ruby debugger debug.rb for Ruby 2.0. It is implemented by utilizing a new Ruby TracePoint class. The core component provides support that front-ends can build on. It provides breakpoint handling, bindings for stack frames among other things.
ca: Debase és una implementació ràpida del depurador estàndard Ruby debug.rb per a Ruby 2.0. S'implementa utilitzant una nova classe de Ruby TracePoint. El component principal proporciona suport sobre el qual els frontals poden basar-se. Proporciona manipulació de punts de ruptura, vinculacions per a marcs de pila, entre altres coses.

source: Provides an implementation of the XDG Base Directory Specification
ca: Proporciona una implementació de l'especificació de directori de base XDG

source: Provides an implementation of the XDG Base Directory Specification.
ca: Proporciona una implementació de l'especificació de directori de base XDG.

source: Ascii85 encoder/decoder
ca: Codificador/descodificador Ascii85

source: Ascii85 provides methods to encode/decode Adobe's binary-to-text encoding of the same name.
ca: Ascii85 proporciona mètodes per codificar/descodificar la codificació binària-text d'Adobe del mateix nom.

source: Inbound email handling framework
ca: Marc de gestió de correu electrònic entrant

source: Receive and process incoming emails in Rails applications.
ca: Rebre i processar correus electrònics entrants en aplicacions Rails.

source: Email composition and delivery framework (part of Rails)
ca: Composició de correu electrònic i marc de lliurament (part de Rails)

source: Email on Rails. Compose, deliver, and test emails using the familiar controller/view pattern. First-class support for multipart email and attachments.
ca: Correu electrònic a Rails. Redacta, lliura i prova els correus electrònics utilitzant el patró de control/visualització familiar. Suport de primera classe per a correus electrònics i adjunts multipart.

source: Rich text framework
ca: Marc de text enriquit

source: Edit and display rich text in Rails applications.
ca: Edita i mostra text enriquit en aplicacions Rails.

source: Declare job classes that can be run by a variety of queuing backends.
ca: Declara les classes de feina que es poden executar amb una varietat de dorsals de cua.

source: A Ruby implementation of AES Key Wrap, a.k.a RFC 3394, a.k.a NIST
ca: Una implementació Ruby d'AES Key Wrap, a.k.a RFC 3394, a.k.a NIST

source: A Ruby implementation of AES Key Wrap, a.k.a RFC 3394, a.k.a NIST Key Wrap.
ca: Una implementació Ruby d'AES Key Wrap, a.k.a RFC 3394, a.k.a NIST Key Wrap.

source: reading Adobe Font Metrics (afm) files
ca: lectura de fitxers Adobe Font Metrics (afm)

source: a simple library to read afm files and use the data conveniently.
ca: una biblioteca senzilla per llegir fitxers afm i utilitzar les dades de manera còmoda.

source: A library for working with Abstract Syntax Trees
ca: Una biblioteca per treballar amb arbres de sintaxi abstractes

source: A library for working with Abstract Syntax Trees.
ca: Una biblioteca per treballar amb arbres de sintaxi abstractes.

source: A pure Ruby library for event-driven IO
ca: Una biblioteca Ruby pura per a IO impulsada per esdeveniments

source: A pure Ruby library for event-driven IO.
ca: Una biblioteca Ruby pura per a IO impulsada per esdeveniments.

source: A performance benchmarking library
ca: Una biblioteca de benchmarking de rendiment

source: The Benchmark module provides methods for benchmarking Ruby code, giving detailed reports on the time taken for each task.
ca: El mòdul Benchmark proporciona mètodes per a la comparació de dades del codi Ruby, proporcionant informes detallats sobre el temps que es triga en cada tasca.

source: Retrieve the binding of a method's caller, or further up the stack
ca: Recupera la vinculació d'una crida d'un mètode, o més amunt de la pila

source: Provides the Binding#of_caller method. Using binding_of_caller we can grab bindings from higher up the call stack and evaluate code in that context. Allows access to bindings arbitrarily far up the call stack, not limited to just the immediate caller. Recommended for use only in debugging situations. Do not use this in production apps.
ca: Proporciona el mètode Binding.ofcaller. Utilitzant bindingofcaller podem agafar les vinculacions de més amunt de la pila de crides i avaluar el codi en aquest context. Permet l'accés a les vinculacions arbitràriament lluny de la pila de crides, no limitat a només el cridador immediat. Recomanat per al seu ús només en situacions de depuració. No utilitzeu això a les aplicacions de producció.

source: Patch-level verification for Bundler
ca: Verificació de nivell de pedaç per al Bundler

source: bundler-audit provides patch-level verification for Bundled apps.
ca: bundler-audit proporciona verificació a nivell de pedaç per a les aplicacions Bundled.

source: Capistrano - Welcome to easy deployment with Ruby over SSH
ca: Capistrano - Benvinguts a un desplegament fàcil amb Ruby sobre SSH

source: Capistrano is a utility and framework for executing commands in parallel on multiple remote machines, via SSH.
ca: Capistrano és una utilitat i un marc de treball per executar ordres en paral·lel en múltiples màquines remotes, a través de SSH.

source: Actor-based concurrent object framework for Ruby
ca: Marc de treball d'objecte concurrent basat en l'actor per a Ruby

source: Celluloid enables people to build concurrent programs out of concurrent objects just as easily as they build sequential programs out of sequential objects.
ca: El cel·luloide permet a les persones construir programes concurrents a partir d'objectes concurrents de la mateixa manera que construeixen programes seqüencials a partir d'objectes seqüencials.

source: Create changelog for SLE images for Docker
ca: Crea un registre de canvis per a les imatges SLE per a l'acoblador

source: A tool to generate Docker images changelog starting from the .packages files created by kiwi.
ca: Una eina per a generar el registre de canvis d'imatges Docker a partir dels fitxers .packages creats pel kiwi.

source: Basic utility functions for Core Chef Infra development
ca: Funcions bàsiques d'utilitat per al desenvolupament Core Chef Infra

source: Basic utility functions for Core Chef Infra development.
ca: Funcions bàsiques d'utilitat per al desenvolupament Core Chef Infra.

source: Colorize your text in the terminal
ca: Acoloreix el text al terminal

source: Colorize your text in the terminal.
ca: Acoloreix el text al terminal.

source: The complete solution for Ruby command-line executables
ca: La solució completa per als executables de la línia d'ordres de Ruby

source: The complete solution for Ruby command-line executables. Commander bridges the gap between other terminal related libraries you know and love (OptionParser, HighLine), while providing many new features, and an elegant API.
ca: La solució completa per als executables de la línia d'ordres Ruby. Commander cobreix la bretxa entre altres biblioteques relacionades amb terminals que coneixeu i estimeu (OptionParser, HighLine), alhora que proporciona moltes funcionalitats noves i una API elegant.

source: A cool framework for doing high performance I/O in Ruby
ca: Un marc fresc per fer I/O d'alt rendiment a Ruby

source: Cool.io provides a high performance event framework for Ruby which uses the libev C library.
ca: Cool.io proporciona un marc d'esdeveniments d'alt rendiment per a Ruby que utilitza la biblioteca libev C.

source: a library for building easy-to-use command-line tools
ca: una biblioteca per construir eines de línia d'ordres fàcils d'utilitzar

source: Cri allows building easy-to-use command-line interfaces with support for subcommands.
ca: Cri permet construir interfícies de línia d'ordres fàcils d'utilitzar amb suport per a subordres.

source: Ruby CSS parser
ca: Analitzador CSS de Ruby

source: A set of classes for parsing CSS in Ruby.
ca: Un conjunt de classes per analitzar CSS a Ruby.

source: Provide Ruby core source files
ca: Proporciona fitxers de codi font del nucli de Ruby

source: Provide Ruby core source files for C extensions that need them.
ca: Proporciona fitxers de codi font del nucli de Ruby per a les extensions C que els necessiten.
