Repository: openSUSE/packages-i18n
Catalog: */po/rubygem.*.po
Languages: ca

source: URIs for your models makes it easy to pass references around.
ca: Els URI per als vostres models faciliten el pas de referències.

source: RDoc documentation for globalid
ca: Documentació RDoc per a globalid

source: A simple Ruby framework for building REST-like APIs
ca: Un marc de treball Ruby senzill per a construir APIs semblants a REST

source: A Ruby framework for rapid API development with great conventions.
ca: Un marc Ruby per al ràpid desenvolupament de l'API amb grans convencions.

source: RDoc documentation for grape
ca: Documentació RDoc per al raïm

source: Test suite for grape
ca: Conjunt de proves per a raïm

source: A configurable and documented Rails view helper for adding gravatars
ca: Ajudant de vista de Rails configurable i documentat per a afegir gravatars

source: A configurable and documented Rails view helper for adding gravatars into your Rails application.
ca: Un ajudant de visualització de Rails configurable i documentat per a afegir gravatars a la vostra aplicació Rails.

source: RDoc documentation for gravatar_image_tag
ca: Documentació del RDoc per a gravatarimagetag

source: Test suite for gravatar_image_tag
ca: Conjunt de proves per a gravatarimagetag

source: A FFI wrapper around the system GSSAPI library
ca: Un embolcall FFI al voltant de la biblioteca GSSAPI del sistema

source: A FFI wrapper around the system GSSAPI library. Please make sure and read the Yard docs or standard GSSAPI documentation if you have any questions. There is also a class called GSSAPI::Simple that wraps many of the common features used for GSSAPI.
ca: Un embolcall FFI al voltant de la biblioteca GSSAPI del sistema. Si us plau, assegureu-vos de llegir els documents Yard o la documentació estàndard de GSSAPI si teniu qualsevol pregunta. També hi ha una classe anomenada GSSAPI::Simple que embolcalla moltes de les característiques comunes utilitzades per GSSAPI.

source: RDoc documentation for gssapi
ca: Documentació del RDoc per al gssapi

source: Test suite for gssapi
ca: Conjunt de proves per al gssapi

source: Translates Ruby Hashes to XML
ca: Tradueix Ruby Hashes a XML

source: Gyoku translates Ruby Hashes to XML.
ca: Gyoku tradueix Ruby Hashes a XML.

source: RDoc documentation for gyoku
ca: Documentació RDoc per al gyoku

source: Test suite for gyoku
ca: Test suite per al gyoku

source: An elegant, structured (X)HTML/XML templating engine
ca: Un motor templatador elegant i estructurat (X)HTML/XML

source: Haml (HTML Abstraction Markup Language) is a layer on top of HTML or XML that's designed to express the structure of documents in a non-repetitive, elegant, and easy way by using indentation rather than closing tags and allowing Ruby to be embedded with ease. It was originally envisioned as a plugin for Ruby on Rails, but it can function as a stand-alone templating engine.
ca: Haml (HTML Abstraction Markup Language) és una capa sobre HTML o XML que està dissenyada per expressar l'estructura dels documents d'una manera no repetitiva, elegant i fàcil utilitzant el sagnat en lloc de tancar etiquetes i permetent que Ruby s'incrusti amb facilitat. Originalment es va concebre com un connector per a Ruby on Rails, però pot funcionar com un motor de templatació independent.

source: RDoc documentation for haml
ca: Documentació RDoc per haml

source: let your Gemfile do the configuring
ca: Deixa que el teu Gemfile faci la configuració

source: Haml-rails provides Haml generators for Rails 4. It also enables Haml as the templating engine for you, so you don't have to screw around in your own application.rb when your Gemfile already clearly indicated what templating engine you have installed. Hurrah.
ca: Haml-rails proporciona generadors Haml per Rails 4. També permet que Haml sigui el motor de templating per a vostè, de manera que no ha de cargolar en la seva pròpia aplicació.rb quan el seu Gemfile ja va indicar clarament quin motor de templating ha instal·lat. Hurrah.

source: RDoc documentation for haml-rails
ca: Documentació RDoc per haml-rails

source: Test suite for haml-rails
ca: Conjunt de proves per a haml-rails

source: Efficient, immutable, thread-safe collection classes for Ruby
ca: Classes de col·lecció eficients, immutables i segures per a Ruby

source: Efficient, immutable, thread-safe collection classes for Ruby.
ca: Classes de col·lecció eficients, immutables i segures per a Ruby.

source: RDoc documentation for hamster
ca: Documentació RDoc per al hàmster

source: Test suite for hamster
ca: Test suite per a hàmster

source: HashDiff is a diff lib to compute the smallest difference between
ca: HashDiff és una lib de diff per calcular la diferència més petita entre

source: HashDiff is a diff lib to compute the smallest difference between two hashes. .
ca: HashDiff és una lib de diff per calcular la diferència més petita entre dos hashes. .

source: RDoc documentation for hashdiff
ca: Documentació RDoc per al hashdiff

source: Test suite for hashdiff
ca: Prova el conjunt per al hashdiff

source: Internal HashiCorp service to check version information
ca: Servei intern de HashiCorp per comprovar la informació de la versió

source: Internal HashiCorp service to check version information.
ca: Servei intern de HashiCorp per comprovar la informació de la versió.

source: RDoc documentation for hashicorp-checkpoint
ca: Documentació RDoc per al hashicorp-checkpoint

source: Test suite for hashicorp-checkpoint
ca: Conjunt de proves per al hashicorp-checkpoint

source: Your friendly neighborhood hash library
ca: La vostra biblioteca de hash del veïnat

source: Hashie is a collection of classes and mixins that make hashes more powerful.
ca: Hashie és una col·lecció de classes i mixins que fan que els hashes siguin més potents.

source: RDoc documentation for hashie
ca: Documentació RDoc per al hashie

source: Test suite for hashie
ca: Test suite per a hashie

source: Hashicorp Configuration Language parser for Ruby
ca: Analitzador del llenguatge de configuració de Hashicorp per a Ruby

source: Hashicorp Configuration Language parser and checker for Ruby.
ca: Analitzador i verificador del llenguatge de configuració de Hashicorp per a Ruby.

source: RDoc documentation for hcl-checker
ca: Documentació RDoc per al verificador hcl

source: HighLine is a high-level command-line IO library
ca: HighLine és una biblioteca IO de línia d'ordres d'alt nivell

source: A high-level IO library that provides validation, type conversion, and more for command-line interfaces. HighLine also includes a complete menu system that can crank out anything from simple list selection to complete shells with just minutes of work.
ca: Una biblioteca d'IO d'alt nivell que proporciona validació, conversió de tipus i més per a interfícies de línia d'ordres. HighLine també inclou un sistema de menús complet que pot eliminar qualsevol cosa des de la selecció de llista simple fins a completar els shells amb només minuts de treball.

source: RDoc documentation for highline
ca: Documentació RDoc per a la línia alta

source: Test suite for highline
ca: Prova el conjunt per a la línia alta

source: Find files in a set of paths
ca: Cerca fitxers en un conjunt de camins

source: A Ruby library for finding files in a set of paths.
ca: Una biblioteca Ruby per a trobar fitxers en un conjunt de camins.

source: RDoc documentation for hike
ca: Documentació RDoc per a l'excursió

source: A fast, high resolution timer library for recording peformance
ca: Una biblioteca de temporitzador ràpida i d'alta resolució per a enregistrar la peformància

source: A fast, high resolution timer library for recording peformance metrics. * (http://github.com/copiousfreetime/hitimes) * (http://github.com.org/copiousfreetime/hitimes) * email jeremy at copiousfreetime dot org * `git clone url git://github.com/copiousfreetime/hitimes.git`.
ca: Una biblioteca de temporitzador ràpida i d'alta resolució per a l'enregistrament de mètriques de peformància. * (http://github.com/copiousfreetime/hitimes) * (http://github.com.org/copiousfreetime/hitimes) * email jeremy at copiousfreetime dot org * .git clone url git://github.com/copiousfreetime/hitimes.git..

source: RDoc documentation for hitimes
ca: Documentació RDoc per a temps d'inactivitat

source: Test suite for hitimes
ca: Prova el conjunt d'hitimes

source: A fast and flexible HTML Parser
ca: Un analitzador HTML ràpid i flexible

source: Hpricot is a flexible HTML parser written in C. It's designed to be similar to Tanaka Akira's HTree, and has a library. Hpricot can read broken XML files, since many of the same techniques can be used.
ca: Hpricot és un analitzador HTML flexible escrit en C. Està dissenyat per ser similar a HTree de Tanaka Akira, i té una biblioteca. Hpricot pot llegir fitxers XML trencats, ja que es poden utilitzar moltes de les mateixes tècniques.

source: RDoc documentation for hpricot
ca: Documentació RDoc per a hpricot

source: Test suite for hpricot
ca: Test suite per a hpricot

source: Converts HTML into Haml
ca: Converteix HTML en Haml

source: Converts HTML into Haml.
ca: Converteix HTML en Haml.

source: RDoc documentation for html2haml
ca: Documentació RDoc per a html2haml

source: Test suite for html2haml
ca: Test suite per a html2haml

source: A Ruby library to handle HTTP Cookies based on RFC 6265
ca: Una biblioteca Ruby per gestionar les galetes HTTP basades en RFC 6265

source: HTTP::Cookie is a Ruby library to handle HTTP Cookies based on RFC 6265. It has with security, standards compliance and compatibility in mind, to behave just the same as today's major web browsers. It has builtin support for the legacy cookies.txt and the latest cookies.sqlite formats of Mozilla Firefox, and its modular API makes it easy to add support for a new backend store.
ca: HTTP::Cookie és una biblioteca de Ruby per gestionar les cookies HTTP basades en RFC 6265. Té en compte la seguretat, el compliment de les normes i la compatibilitat, per comportar-se igual que els principals navegadors web d'avui dia. Ha incorporat el suport per als formats tradicionals de cookies.txt i cookies.sqlite de Mozilla Firefox, i la seva API modular fa que sigui fàcil afegir suport per a una nova botiga de dorsals.

source: RDoc documentation for http-cookie
ca: Documentació RDoc per a la cookie http

source: Test suite for http-cookie
ca: Prova el paquet per a la galeta http

source: Simple callback-based HTTP request/response parser
ca: Analitzador senzill de sol·licituds/respostes HTTP basat en la crida de retorn

source: Ruby bindings to http://github.com/ry/http-parser and http://github.com/a2800276/http-parser.java.
ca: Ruby vincula a http://github.com/ry/http-parser i http://github.com/a2800276/http-parser.java.

source: RDoc documentation for http_parser.rb
ca: Documentació RDoc per a httpparser.rb

source: Test suite for http_parser.rb
ca: Prova el conjunt per a httpparser.rb

source: gives something like the functionality of libwww-perl (LWP) in Ruby
ca: dona alguna cosa com la funcionalitat de libwww-perl (LWP) a Ruby

source: gives something like the functionality of libwww-perl (LWP) in Ruby.
ca: dona alguna cosa com la funcionalitat de libwww-perl (LWP) a Ruby.

source: RDoc documentation for httpclient
ca: Documentació RDoc per a httpclient

source: Test suite for httpclient
ca: Prova el conjunt per a httpclient

source: New wave Internationalization support for Ruby
ca: Implementació de la internacionalització de New Wave per a Ruby

source: New wave Internationalization support for Ruby.
ca: Suport a la internacionalització de New Wave per a Ruby.

source: RDoc documentation for i18n
ca: Documentació RDoc per a l'i18n

source: Test suite for i18n
ca: Test suite per a l'i18n

source: Deep Freeze Ruby Objects
ca: Congelació profunda dels objectes Ruby

source: Deep Freeze Ruby Objects.
ca: Profund congela els objectes Ruby.

source: RDoc documentation for ice_nine
ca: Documentació RDoc per a icenine

source: Test suite for ice_nine
ca: Test suite per a icenine

source: Create JSON structures via a Builder-style DSL
ca: Crea estructures JSON a través d'un DSL d'estil Builder

source: Create JSON structures via a Builder-style DSL.
ca: Crea estructures JSON a través d'una DSL a l'estil Builder.

source: RDoc documentation for jbuilder
ca: Documentació RDoc per al jbuilder

source: Test suite for jbuilder
ca: Conjunt de proves per al jbuilder

source: Rebuild your Jekyll site when a file changes with the `--watch`
ca: Reconstrueix el lloc Jekyll quan un fitxer canviï amb el the--watch the

source: Rebuild your Jekyll site when a file changes with the `--watch` switch.
ca: Reconstrueix el lloc Jekyll quan un fitxer canviï amb l'interruptor the--watch..

source: RDoc documentation for jekyll-watch
ca: Documentació RDoc per a «jekyll-watch»

source: Use jQuery with Rails 4+
ca: Usa jQuery amb Rails 4+

source: This gem provides jQuery and the jQuery-ujs driver for your Rails 4+ application.
ca: Aquesta joia proporciona jQuery i el controlador jQuery-ujs per a la vostra aplicació Rails 4+.

source: RDoc documentation for jquery-rails
ca: Documentació RDoc per a jquery-rails

source: Test suite for jquery-rails
ca: Conjunt de proves per a jquery-rails

source: Brings Rails named routes to javascript
ca: Porta les vies amb nom a javascript

source: Generates javascript file that defines all Rails named routes as javascript helpers.
ca: Genera un fitxer javascript que defineix totes les rutes de Rails com a ajudants de javascript.

source: RDoc documentation for js-routes
ca: Documentació RDoc per a js-routes

source: Test suite for js-routes
ca: Conjunt de proves per a js-routes

source: JSON Web Token and its family (JSON Web Signature, JSON Web
ca: JSON Web Token i la seva família (JSON Web Signature, JSON Web

source: JSON Web Token and its family (JSON Web Signature, JSON Web Encryption and JSON Web Key) in Ruby.
ca: JSON Web Token i la seva família (JSON Web Signature, JSON Web Encryption i JSON Web Key) a Ruby.

source: RDoc documentation for json-jwt
ca: Documentació RDoc per a json-jwt

source: Test suite for json-jwt
ca: Conjunt de proves per a json-jwt

source: Ruby JSON Schema Validator
ca: Validador d'esquema Ruby JSON

source: RDoc documentation for json-schema
ca: Documentació RDoc per a json-schema

source: Test suite for json-schema
ca: Conjunt de proves per a json-schema

source: JSON Implementation for Ruby
ca: Implementació de JSON per a Ruby

source: This is a JSON implementation in pure Ruby.
ca: Es tracta d'una implementació de JSON en Ruby pur.

source: RDoc documentation for json_pure
ca: Documentació RDoc per a jsonpure

source: JSON Web Token implementation in Ruby
ca: Implementació de JSON Web Token a Ruby

source: A pure ruby implementation of the RFC 7519 OAuth JSON Web Token (JWT) standard.
ca: Implementació de rubí pur de l'estàndard RFC 7519 OAuth JSON Web Token (JWT).

source: RDoc documentation for jwt
ca: Documentació RDoc per a jwt

source: Test suite for jwt
ca: Test suite per a jwt

source: kinder, gentler I/O for Ruby
ca: més amable, suau E/S per a Ruby

source: kgio provides non-blocking I/O methods for Ruby without raising exceptions on EAGAIN and EINPROGRESS. It is intended for use with the unicorn Rack server, but may be used by other applications (that run on Unix-like platforms).
ca: kgio proporciona mètodes d'E/S no bloquejadors per a Ruby sense aixecar excepcions en EAGAIN i EINPROGRESS. Està pensat per al seu ús amb el servidor Unicorn Rack, però pot ser utilitzat per altres aplicacions (que s'executen en plataformes similars a Unix).

source: RDoc documentation for kgio
ca: Documentació RDoc per al kgio

source: Test suite for kgio
ca: Conjunt de proves per al kgio

source: kramdown is a fast, pure-Ruby Markdown-superset converter
ca: El kramdown és un convertidor Markdown-superset ràpid i pur

source: kramdown is yet-another-markdown-parser but fast, pure Ruby, using a strict syntax definition and supporting several common extensions.
ca: El kramdown encara és un altre analitzador de marcatge però ràpid i pur Ruby, utilitzant una definició de sintaxi estricta i suportant diverses extensions comunes.

source: RDoc documentation for kramdown
ca: Documentació RDoc per al kramdown

source: Test suite for kramdown
ca: Prova el conjunt per al kramdown

source: Rake tasks providing basic work-flow for libyui development
ca: Tasques d'execució que proporcionen un flux de treball bàsic per al desenvolupament de libyui

source: Rake tasks that support work-flow of libyui developer. It allows packaging a repo, sending it to build service, creating submit request to target repo or running client from git repo. Heavily inspired in yast-rake.
ca: Tasques d'execució que suporten el flux de treball del desenvolupador libyui. Permet empaquetar un dipòsit, enviar-lo per construir el servei, crear una sol·licitud de lliurament al repositori objectiu o executar el client des del git repo. Molt inspirat en la gavardina.

source: RDoc documentation for libyui-rake
ca: Documentació RDoc per a libyui-rake

source: Command line execution utilities
ca: Utilitats d'execució de línia d'ordres

source: Command line builders and executors.
ca: Constructors i executors de línia de comandament.

source: RDoc documentation for lino
ca: Documentació RDoc per al lino

source: A secure, non-evaling end user template engine with aesthetic markup
ca: Un motor de plantilles d'usuari final segur i no esquivant amb marcatge estètic

source: A secure, non-evaling end user template engine with aesthetic markup.
ca: Un motor de plantilla d'usuari final segur i no esquivant amb marcatge estètic.

source: RDoc documentation for liquid
ca: Documentació RDoc per a líquid

source: Test suite for liquid
ca: Conjunt de proves per a líquid

source: Listen to file modifications
ca: Escolta les modificacions de fitxer

source: The Listen gem listens to file modifications and notifies you about the changes. Works everywhere!.
ca: La joia Listen escolta les modificacions dels fitxers i us notifica els canvis. Treballa a tot arreu!

source: LittlePlugger is a module that provides Gem based plugin management
ca: LittlePlugger és un mòdul que proporciona la gestió de connectors basada en Gem

source: LittlePlugger is a module that provides Gem based plugin management. By extending your own class or module with LittlePlugger you can easily manage the loading and initializing of plugins provided by other gems.
ca: LittlePlugger és un mòdul que proporciona la gestió de connectors basada en Gem. En estendre la seva pròpia classe o mòdul amb LittlePlugger es pot gestionar fàcilment la càrrega i inicialització dels connectors proporcionats per altres gemmes.

source: RDoc documentation for little-plugger
ca: Documentació del RDoc per al connector petit

source: Test suite for little-plugger
ca: Prova el conjunt per al connector petit

source: Ruby-Locale is the pure ruby library which provides basic APIs for
ca: Ruby-Locale és la biblioteca ruby pura que proporciona API bàsiques per

source: Ruby-Locale is the pure ruby library which provides basic APIs for localization.
ca: Ruby-Locale és la biblioteca ruby pura que proporciona APIs bàsiques per a la localització.

source: RDoc documentation for locale
ca: Documentació RDoc per a la configuració regional

source: Test suite for locale
ca: Prova el conjunt per a la configuració regional

source: Log4r, logging framework for ruby
ca: Log4r, marc de treball de registre per a ruby

source: See also: http://logging.apache.org/log4j.
ca: Vegeu també: http://logging.apache.org/log4j.

source: RDoc documentation for log4r
ca: Documentació RDoc per a log4r

source: A flexible and extendable logging library for Ruby
ca: Una biblioteca de registre flexible i extensible per a Ruby

source: **Logging** is a flexible logging library for use in Ruby programs based on the design of Java's log4j library. It features a hierarchical logging system, custom level names, multiple output destinations per log event, custom formatting, and more.
ca: **Logging** és una biblioteca de registre flexible per al seu ús en programes Ruby basada en el disseny de la biblioteca log4j de Java. Disposa d'un sistema de registre jeràrquic, noms de nivell personalitzats, múltiples destinacions de sortida per esdeveniment de registre, format personalitzat, i més.

source: RDoc documentation for logging
ca: Documentació RDoc per a l'enregistrament

source: Test suite for logging
ca: Prova el conjunt per a l'enregistrament

source: HTML/XML manipulation and sanitization based on Nokogiri
ca: Manipulació HTML/XML i higienització basada en Nokogiri

source: Loofah is a general library for manipulating and transforming HTML/XML documents and fragments. It's built on top of Nokogiri and libxml2, so it's fast and has a nice API. Loofah excels at HTML sanitization (XSS prevention). It includes some nice HTML sanitizers, which are based on HTML5lib's whitelist, so it most likely won't make your codes less secure.
ca: Loofah és una biblioteca general per manipular i transformar documents i fragments HTML/XML. Està construït sobre Nokogiri i libxml2, així que és ràpid i té una bona API. Loofah excel·leix en la desinfecció HTML (prevenció XSS). Inclou alguns desinfectants HTML agradables, que es basen en la llista blanca d'HTML5lib, de manera que el més probable és que no farà que els vostres codis siguin menys segurs.

source: RDoc documentation for loofah
ca: Documentació RDoc per a loofah

source: Test suite for loofah
ca: Prova el conjunt per a la loofah

source: Mail provides a nice Ruby DSL for making, sending and reading emails
ca: Mail proporciona un bon Ruby DSL per a fer, enviar i llegir correus electrònics

source: A really Ruby Mail handler.
ca: Un gestor de correu realment Ruby.

source: RDoc documentation for mail
ca: Documentació RDoc per al correu

source: Simple mime type detection using magic numbers, filenames, and
ca: Detecció simple de tipus MIME utilitzant nombres màgics, noms de fitxer i

source: Simple mime type detection using magic numbers, filenames, and extensions.
ca: Detecció simple de tipus MIME utilitzant nombres màgics, noms de fitxer i extensions.

source: RDoc documentation for marcel
ca: Documentació RDoc per a marcel

source: Adds a metaclass method to all Ruby objects
ca: Afegeix un mètode de metaclasse a tots els objectes Ruby

source: Adds a metaclass method to all Ruby objects.
ca: Afegeix un mètode de metaclasse a tots els objectes Ruby.

source: RDoc documentation for metaclass
ca: Documentació RDoc per a metaclass

source: Test suite for metaclass
ca: Conjunt de proves per a metaclasse

source: retrieve the sourcecode for a method
ca: recupera el codi font per a un mètode

source: retrieve the sourcecode for a method.
ca: recupera el codi font d'un mètode.

source: RDoc documentation for method_source
ca: Documentació RDoc per a methodsource

source: Test suite for method_source
ca: Prova el conjunt per a methodsource

source: This library allows for the identification of a file's likely MIME
ca: Aquesta biblioteca permet identificar el MIME probable d'un fitxer
