Repository: openSUSE/packages-i18n
Catalog: */po/rubygem.*.po
Languages: ca

source: a library which enable you to define abstract method in Ruby
ca: una biblioteca que us permet definir el mètode abstracte a Ruby

source: 'abstract.rb' is a library which enable you to define abstract method in Ruby.
ca: 'abstract.rb' és una biblioteca que us permet definir el mètode abstracte en Ruby.

source: RDoc documentation for abstract
ca: Documentació RDoc per a abstract

source: Documentation generated at gem installation time. Usually in RDoc and RI formats.
ca: Documentació generada a l'hora d'instal·lació de la gem. Normalment en formats RDoc i RI.

source: Test suite for abstract
ca: Prova el conjunt per a abstracte

source: Test::Unit or RSpec files, useful for developers.
ca: Fitxers Test::Unit o RSpec, útils per a desenvolupadors.

source: Tiny library enabling you to define abstract methods in Ruby classes
ca: Biblioteca petita que us permet definir mètodes abstractes a les classes de Ruby

source: Abstract Method is a tiny library enabling you to define abstract methods in Ruby classes and modules.
ca: El mètode abstracte és una petita biblioteca que us permet definir mètodes abstractes a les classes i mòduls de Ruby.

source: RDoc documentation for abstract_method
ca: Documentació del RDoc per a l'abstractmethod

source: WebSocket framework for Rails
ca: Marc de treball WebSocket per a Rails

source: Structure many real-time application concerns into channels over a single WebSocket connection.
ca: Estructura moltes preocupacions d'aplicacions en temps real en canals a través d'una única connexió WebSocket.

source: RDoc documentation for actioncable
ca: Documentació RDoc per a «actioncable»

source: Email composition, delivery, and receiving framework (part of Rails)
ca: Composició de correu electrònic, lliurament i marc de recepció (part de Rails)

source: Email on Rails. Compose, deliver, receive, and test emails using the familiar controller/view pattern. First-class support for multipart email and attachments.
ca: Correu electrònic a Rails. Redacta, lliura, rep i prova els correus electrònics utilitzant el patró de control/visualització familiar. Suport de primera classe per a correus electrònics i adjunts multipart.

source: RDoc documentation for actionmailer
ca: Documentació RDoc per a «actionmailer»

source: Web-flow and rendering framework putting the VC in MVC (part of
ca: Flux web i marc de treball de renderització posant el VC a MVC (part de

source: Web apps on Rails. Simple, battle-tested conventions for building and testing MVC web applications. Works with any Rack-compatible server.
ca: Aplicacions web a Rails. Convencions simples i provades en batalla per a la construcció i prova d'aplicacions web MVC. Funciona amb qualsevol servidor compatible amb Rack.

source: RDoc documentation for actionpack
ca: Documentació RDoc per a actionpack

source: Rendering framework putting the V in MVC (part of Rails)
ca: Marc de renderització posant el V a MVC (part de Rails)

source: Simple, battle-tested conventions and helpers for building web pages.
ca: Convencions simples i provades en batalles i ajudants per a la construcció de pàgines web.

source: RDoc documentation for actionview
ca: Documentació RDoc per a actionview

source: ActionView helper to render currently active links
ca: Ajudant ActionView per a renderitzar els enllaços actualment actius

source: Helpful method when you need to add some logic that figures out if the link (or more often navigation item) is selected based on the current page or other arbitrary condition.
ca: Mètode útil quan cal afegir alguna lògica que esbrini si l'enllaç (o més sovint l'element de navegació) està seleccionat en funció de la pàgina actual o d'una altra condició arbitrària.

source: RDoc documentation for active_link_to
ca: Documentació RDoc per a activelinkto

source: Test suite for active_link_to
ca: Prova el conjunt per a «activelinkto»

source: Job framework with pluggable queues
ca: Marc de treball amb cues endolls

source: Declare job classes that can be run by a variety of queueing backends.
ca: Declara les classes de treball que es poden executar amb una varietat de dorsals de cua.

source: RDoc documentation for activejob
ca: Documentació RDoc per a activejob

source: A toolkit for building modeling frameworks (part of Rails)
ca: Un conjunt d'eines per a la construcció de marcs de modelatge (part de Rails)

source: A toolkit for building modeling frameworks like Active Record. Rich support for attributes, callbacks, validations, serialization, internationalization, and testing.
ca: Un conjunt d'eines per a construir marcs de modelatge com Active Record. Suport enriquit per atributs, callbacks, validacions, serialització, internacionalització i proves.

source: RDoc documentation for activemodel
ca: Documentació RDoc per a activemodel

source: Object-relational mapper framework (part of Rails)
ca: Marc de treball de mapatge relacional d'objectes (part de Rails)

source: Databases on Rails. Build a persistent domain model by mapping database tables to Ruby classes. Strong conventions for associations, validations, aggregations, migrations, and testing come baked-in.
ca: Bases de dades sobre Rails. Construeix un model de domini persistent mitjançant l'assignació de taules de base de dades a les classes Ruby. Les convencions sòlides per a associacions, validacions, agregacions, migracions i proves venen al forn.

source: RDoc documentation for activerecord
ca: Documentació RDoc per a activerecord

source: Local and cloud file storage framework
ca: Marc de treball d'emmagatzematge de fitxers locals i en núvol

source: Attach cloud and local files in Rails applications.
ca: Adjunta els fitxers cloud i locals a les aplicacions Rails.

source: RDoc documentation for activestorage
ca: Documentació RDoc per a l'emmagatzematge actiu

source: A toolkit of support libraries and Ruby core extensions extracted
ca: S'ha extret un conjunt d'eines de biblioteques de suport i extensions del nucli de Ruby

source: A toolkit of support libraries and Ruby core extensions extracted from the Rails framework. Rich support for multibyte strings, internationalization, time zones, and testing.
ca: Un conjunt d'eines de biblioteques de suport i extensions del nucli de Ruby extretes del marc de treball Rails. Suport enriquit per a cadenes multibyte, internacionalització, zones horàries i proves.

source: RDoc documentation for activesupport
ca: Documentació RDoc per a «activesupport»

source: URI Implementation
ca: Implementació de l'URI

source: Addressable is an alternative implementation to the URI implementation that is part of Ruby's standard library. It is flexible, offers heuristic parsing, and additionally provides extensive support for IRIs and URI templates.
ca: Addressable és una implementació alternativa a la implementació URI que forma part de la biblioteca estàndard de Ruby. És flexible, ofereix una anàlisi heurística i, a més, proporciona un ampli suport per a plantilles IRI i URI.

source: Addressable is a replacement for the URI implementation that is part of Ruby's standard library. It more closely conforms to the relevant RFCs and adds support for IRIs and URI templates.
ca: Addressable és un reemplaçament per a la implementació d'URI que forma part de la biblioteca estàndard de Ruby. S'ajusta més estretament als RFC pertinents i afegeix suport per a plantilles IRI i URI.

source: RDoc documentation for addressable
ca: Documentació RDoc per a direccionables

source: Test suite for addressable
ca: Prova el conjunt per a adreçables

source: Airbrussh pretties up your SSHKit and Capistrano output
ca: L'Airbrussh fa pujar la sortida de SSHKit i Capistrano

source: A replacement log formatter for SSHKit that makes Capistrano output much easier on the eyes. Just add Airbrussh to your Capfile and enjoy concise, useful log output that is easy to read.
ca: Un formatador de registre de reemplaçament per a SSHKit que fa que la sortida de Capistrano sigui molt més fàcil als ulls. Només has d'afegir Airbrussh al teu Capfile i gaudir d'una sortida de registre concisa i útil que és fàcil de llegir.

source: RDoc documentation for airbrussh
ca: Documentació RDoc per a l'aerògraf

source: AMQP 0.9.1 encoding & decoding library
ca: Biblioteca de descodificació AMQP 0.9.1

source: amq-protocol is an AMQP 0.9.1 serialization library for Ruby. It is not a client: the library only handles serialization and deserialization.
ca: amq-protocol és una biblioteca de serialització AMQP 0.9.1 per a Ruby. No és un client: la biblioteca només s'encarrega de la serialització i la deserialització.

source: RDoc documentation for amq-protocol
ca: Documentació RDoc per a amq-protocol

source: Test suite for amq-protocol
ca: Conjunt de proves per a amq-protocol

source: Mature EventMachine-based RabbitMQ client
ca: Client RabbitMQ basat en Mature EventMachine

source: Mature EventMachine-based RabbitMQ client.
ca: Client RabbitMQ basat en màquina Madura EventMachine.

source: RDoc documentation for amqp
ca: Documentació RDoc per a amqp

source: Test suite for amqp
ca: Conjunt de proves per a l'amqp

source: Provides POSIX tarchive management from Ruby programs
ca: Proporciona la gestió de tarchive POSIX dels programes Ruby

source: Archive::Tar::Minitar is a pure-Ruby library and command-line utility that provides the ability to deal with POSIX tar(1) archive files. The implementation is based heavily on Mauricio Ferna'ndez's implementation in rpa-base, but has been reorganised to promote reuse in other projects.
ca: Archive::Tar::Minitar és una biblioteca i una utilitat de línia d'ordres pure-Ruby que proporciona la capacitat de tractar amb fitxers d'arxiu POSIX tar(1). La implementació es basa en gran mesura en la implementació de Mauricio Ferna'ndez a rpa-base, però s'ha reorganitzat per promoure la reutilització en altres projectes.

source: RDoc documentation for archive-tar-minitar
ca: Documentació RDoc per a archive-tar-minitar

source: Arel Really Exasperates Logicians
ca: Arel realment exaspera els lògics

source: Arel Really Exasperates Logicians Arel is a SQL AST manager for Ruby. It 1. Simplifies the generation of complex SQL queries 2. Adapts to various RDBMSes It is intended to be a framework framework; that is, you can build your own ORM with it, focusing on innovative object and collection modeling as opposed to database compatibility and query generation.
ca: Arel Really Exasperates Logicians Arel és un gestor SQL AST per a Ruby. 1. Simplifica la generació de consultes SQL complexes 2. S'adapta a diversos RDBMSes Es pretén que sigui un marc de treball; és a dir, podeu construir el vostre propi ORM amb ell, centrant-vos en la modelització d'objectes i col·leccions innovadores en lloc de la compatibilitat de bases de dades i la generació de consultes.

source: RDoc documentation for arel
ca: Documentació RDoc per a arel

source: An implementation of the AsciiDoc text processor and publishing
ca: Implementació del processador de text AsciiDoc i publicació

source: A fast, open source text processor and publishing toolchain for converting AsciiDoc content to HTML 5, DocBook 5, and other formats.
ca: Un processador de text de codi obert i una cadena d'eines de publicació ràpida per convertir contingut d'AsciiDoc a HTML 5, DocBook 5 i altres formats.

source: RDoc documentation for asciidoctor
ca: Documentació RDoc per a l'asciidoctor

source: attr_required and attr_optional
ca: attrrequired i attroptional

source: attr_required and attr_optional.
ca: Autònom i attropcional.

source: RDoc documentation for attr_required
ca: Documentació RDoc per a l'attrrequired

source: Test suite for attr_required
ca: Test suite per a attrrequired

source: Parse CSS and add vendor prefixes to CSS rules using values from the
ca: Analitza CSS i afegeix prefixos de proveïdor a les regles CSS utilitzant valors de

source: Parse CSS and add vendor prefixes to CSS rules using values from the Can I Use website.
ca: Analitza CSS i afegeix prefixos de proveïdor a les regles CSS utilitzant valors del lloc web Can I Use.

source: RDoc documentation for autoprefixer-rails
ca: Documentació RDoc per a autoprefixer-rails

source: Test suite for autoprefixer-rails
ca: Conjunt de proves per a autoprefixer-rails

source: Abstract types for logic programming
ca: Tipus abstractes per a la programació lògica

source: Define types with optional constraints for use within axiom and other libraries.
ca: Defineix els tipus amb restriccions opcionals per al seu ús dins de l'axioma i altres biblioteques.

source: RDoc documentation for axiom-types
ca: Documentació RDoc per a tipus d'axioma

source: Test suite for axiom-types
ca: Conjunt de proves per a tipus d'axioma

source: Ruby extension for base32 encoding and decoding
ca: Extensió Ruby per a la codificació base32 i la descodificació

source: Ruby extension for base32 encoding and decoding.
ca: Extensió de Ruby per a la codificació i descodificació en base32.

source: RDoc documentation for base32
ca: Documentació RDoc per a base32

source: Test suite for base32
ca: Conjunt de proves per a base32

source: OpenBSD's bcrypt() password hashing algorithm
ca: Algorisme de hashing de contrasenya bcrypt() d'OpenBSD

source: bcrypt() is a sophisticated and secure hash algorithm designed by The OpenBSD project for hashing passwords. The bcrypt Ruby gem provides a simple wrapper for safely handling passwords.
ca: bcrypt() és un algorisme de hash sofisticat i segur dissenyat pel projecte OpenBSD per a hashing contrasenyes. La gemma bcrypt Ruby proporciona un embolcall senzill per gestionar contrasenyes de forma segura.

source: RDoc documentation for bcrypt
ca: Documentació RDoc per al bcrypt

source: Test suite for bcrypt
ca: Prova el conjunt per al bcrypt

source: OpenBSD's bcrypt_pbkdf (a variant of PBKDF2 with bcrypt-based PRF)
ca: OpenBSD bcryptpbkdf (una variant de PBKDF2 amb PRF basat en bcrypt)

source: This gem implements bcrypt_pbkdf (a variant of PBKDF2 with bcrypt-based PRF).
ca: Aquesta joia implementa bcryptpbkdf (una variant de PBKDF2 amb PRF basat en bcrypt).

source: RDoc documentation for bcrypt_pbkdf
ca: Documentació RDoc per a bcryptpbkdf

source: Test suite for bcrypt_pbkdf
ca: Test suite per a bcryptpbkdf

source: A declarative way to read and write binary file formats
ca: Una manera declarativa de llegir i escriure formats de fitxer binari

source: BinData is a declarative way to read and write binary file formats. This means the programmer specifies *what* the format of the binary data is, and BinData works out *how* to read and write data in this format. It is an easier ( and more readable ) alternative to ruby's #pack and #unpack methods.
ca: BinData és una manera declarativa de llegir i escriure formats de fitxer binari. Això vol dir que el programador especifica *quin* és el format de les dades binàries, i BinData treballa *com* per llegir i escriure dades en aquest format. És una alternativa més fàcil (i més llegible) als mètodes andpack i andunpack de ruby.

source: RDoc documentation for bindata
ca: Documentació RDoc per a bindata

source: Test suite for bindata
ca: Test suite per a bindata

source: Bindings for your Ruby exceptions
ca: Vinculacions per a les vostres excepcions de Ruby

source: Bindings for your Ruby exceptions.
ca: Vinculacions per a les vostres excepcions de Ruby.

source: RDoc documentation for bindex
ca: Documentació RDoc per a bindex

source: Test suite for bindex
ca: Conjunt de proves per al bindex

source: Retrieve the binding of a method's caller. Can also retrieve
ca: Recupera l'enquadernació d'una crida d'un mètode. També es pot recuperar

source: Retrieve the binding of a method's caller. Can also retrieve bindings even further up the stack.
ca: Recupera l'enquadernació d'una crida d'un mètode. També pot recuperar les vinculacions encara més amunt de la pila.

source: RDoc documentation for binding_of_caller
ca: Documentació RDoc per a bindingofcaller

source: Test suite for binding_of_caller
ca: Prova el conjunt per a «bindingofcaller»

source: Boot large ruby/rails apps faster
ca: Arrenca les aplicacions de ruby/rails grans més ràpidament

source: Boot large ruby/rails apps faster.
ca: Arrenca les aplicacions de ruby/rails grans més ràpidament.

source: RDoc documentation for bootsnap
ca: Documentació RDoc per a bootsnap

source: Extensions to Core Ruby classes
ca: Extensions a les classes core Ruby

source: Extensions to Core Ruby classes.
ca: Extensions a les classes Core Ruby.

source: RDoc documentation for buff-extensions
ca: Documentació RDoc per a extensions de buff

source: Test suite for buff-extensions
ca: Conjunt de proves per a extensions de buff

source: Buff up your code with a mixin for querying the platform running Ruby
ca: Afegiu el vostre codi amb un mixin per consultar la plataforma que executa Ruby

source: A mixin for querying the platform running Ruby.
ca: Un mixin per consultar la plataforma que executa Ruby.

source: RDoc documentation for buff-ruby_engine
ca: Documentació RDoc per a buff-rubyengine

source: Test suite for buff-ruby_engine
ca: Conjunt de proves per al buff-rubyengine

source: Builders for MarkUp
ca: Constructors per a MarkUp

source: Builder provides a number of builder objects that make creating structured data simple to do. Currently the following builder objects are supported: * XML Markup * XML Events.
ca: El Builder proporciona una sèrie d'objectes de construcció que fan que la creació de dades estructurades sigui senzilla de fer. Actualment s'admeten els següents objectes del constructor: * Marcatge XML * Esdeveniments XML.

source: RDoc documentation for builder
ca: Documentació RDoc per al constructor

source: Test suite for builder
ca: Conjunt de proves per al constructor

source: The best way to manage your application's dependencies
ca: La millor manera de gestionar les dependències de la teva aplicació

source: Bundler manages an application's dependencies through its entire life, across many machines, systematically and repeatably.
ca: Bundler gestiona les dependències d'una aplicació al llarg de tota la seva vida, a través de moltes màquines, de manera sistemàtica i repetible.

source: RDoc documentation for bundler
ca: Documentació RDoc per al contenidor

source: Ruby fast debugger - base + CLI
ca: Depurador ràpid Ruby - base + CLI

source: Byebug is a Ruby debugger. It's implemented using the TracePoint C API for execution control and the Debug Inspector C API for call stack navigation. The core component provides support that front-ends can build on. It provides breakpoint handling and bindings for stack frames among other things and it comes with an easy to use command line interface.
ca: Byebug és un depurador Ruby. Està implementat utilitzant l'API TracePoint C per al control d'execució i l'API Debug Inspector C per a la navegació de pila de trucades. El component principal proporciona suport sobre el qual els frontals poden basar-se. Proporciona manipulació de punts de ruptura i vinculacions per a fotogrames de pila entre altres coses i ve amb una interfície de línia d'ordres fàcil d'utilitzar.

source: RDoc documentation for byebug
ca: Documentació RDoc per a byebug

source: Command line interface for CloudFoundry UAA
ca: Interfície de línia d'ordres per a la UAA de CloudFoundry

source: Client command line tools for interacting with the CloudFoundry User Account and Authorization (UAA) server. The UAA is an OAuth2 Authorization Server so it can be used by webapps and command line apps to obtain access tokens to act on behalf of users. The tokens can then be used to access protected resources in a Resource Server. This library can be used by clients (as a convenient wrapper for mainstream oauth gems) or by resource servers.
ca: Eines de línia d'ordres del client per interactuar amb el servidor CloudFoundry User Account and Authorization (UAA). L'UAA és un servidor d'autorització OAuth2, de manera que pot ser utilitzat per webapps i aplicacions de línia d'ordres per obtenir tokens d'accés per actuar en nom dels usuaris. Els testimonis es poden utilitzar per accedir a recursos protegits en un servidor de recursos. Aquesta biblioteca pot ser utilitzada pels clients (com un embolcall convenient per a les gemmes d'oauth principals) o pels servidors de recursos.

source: RDoc documentation for cf-uaac
ca: Documentació RDoc per a cf-uaac

source: Test suite for cf-uaac
ca: Conjunt de proves per a cf-uaac

source: CFA (Config Files API) provides an easy way to create models on top
ca: CFA (Config Files API) proporciona una manera fàcil de crear models a la part superior

source: Library offering separation of parsing and file access from the rest of the logic for managing configuraton files. It has built-in support for parsing using augeas lenses and also for working with files directly in memory.
ca: Biblioteca que ofereix la separació de l'anàlisi i l'accés a fitxers de la resta de la lògica per a la gestió dels fitxers configuraton. Té suport incorporat per analitzar utilitzant lents augeas i també per treballar amb fitxers directament en memòria.

source: RDoc documentation for cfa
ca: Documentació RDoc per a cfa

source: Models for GRUB2 configuration files
ca: Models per a fitxers de configuració GRUB2

source: Models allowing easy read and modification of GRUB2 configuration files. It is a plugin for cfa framework.
ca: Models que permeten la lectura i modificació fàcils dels fitxers de configuració GRUB2. És un connector per al marc de treball cfa.

source: RDoc documentation for cfa_grub2
ca: Documentació RDoc per a cfagrub2

source: Your swiss army knife for executing external commands in Ruby safely
ca: El vostre ganivet de l'exèrcit suïssa per executar ordres externes a Ruby de forma segura

source: Your swiss army knife for executing external commands in Ruby safely and conveniently.
ca: El ganivet de l'exèrcit suïssa per executar ordres externes a Ruby de manera segura i còmoda.

source: RDoc documentation for cheetah
ca: Documentació RDoc per a guepard

source: A simple and reliable solution for controlling external programs
ca: Una solució senzilla i fiable per al control de programes externs

source: This gem aims at being a simple and reliable solution for controlling external programs running in the background on any Ruby / OS combination.
ca: Aquesta joia té com a objectiu ser una solució senzilla i fiable per controlar programes externs que s'executen en segon pla en qualsevol combinació de Ruby / OS.

source: RDoc documentation for childprocess
ca: Documentació RDoc per al procés fill

source: Test suite for childprocess
ca: Prova el conjunt per al procés fill

source: Describe public cloud instance types
ca: Descriu els tipus d'instàncies del núvol públic

source: Describe public cloud instance types.
ca: Descriu els tipus d'instàncies públiques al núvol.

source: RDoc documentation for cloud-instancetype
ca: Documentació RDoc per cloud-instancetype

source: Fast syntax highlighting for selected languages
ca: Ressaltat ràpid de la sintaxi per a les llengües seleccionades

source: Fast and easy syntax highlighting for selected languages, written in Ruby. Comes with RedCloth integration and LOC counter.
ca: Ressaltat de sintaxi ràpid i fàcil per a les llengües seleccionades, escrit en Ruby. Ve amb integració RedCloth i comptador LOC.

source: RDoc documentation for coderay
ca: Documentació RDoc per a la coderay

source: Powerful, flexible and configurable coercion library
ca: Biblioteca de coerció potent, flexible i configurable

source: Powerful, flexible and configurable coercion library. And nothing more.
ca: Biblioteca de coerció potent, flexible i configurable. I res més.

source: RDoc documentation for coercible
ca: Documentació RDoc per a coercible

source: Test suite for coercible
ca: Conjunt de proves per a coercible
