Repository: openSUSE/packages-i18n
Catalog: */po/rubygem.*.po
Languages: ca

source: RDoc documentation for rest-client
ca: Documentació RDoc per al client descans

source: Test suite for rest-client
ca: Conjunt de proves per al client de descans

source: An XML toolkit for Ruby
ca: Un joc d'eines XML per a Ruby

source: An XML toolkit for Ruby.
ca: Un conjunt d'eines XML per a Ruby.

source: RDoc documentation for rexml
ca: Documentació RDoc per a rexml

source: Builds manuals
ca: Construeix manuals

source: Ronn builds manuals. It converts simple, human readable textfiles to roff for terminal display, and also to HTML for the web.
ca: Ronn construeix manuals. Converteix fitxers de text senzills i llegibles per humans a roff per a la visualització de terminal, i també a HTML per a la web.

source: RDoc documentation for ronn
ca: Documentació del RDoc per a la corona

source: Test suite for ronn
ca: Conjunt de proves per a la corona

source: A pure-ruby colorizer based on pygments
ca: Un colorant pur-ruby basat en pigments

source: Rouge aims to a be a simple, easy-to-extend drop-in replacement for pygments.
ca: Rouge té com a objectiu ser un simple, fàcil d'extendre reemplaçament per als pigments.

source: RDoc documentation for rouge
ca: Documentació RDoc per al rouge

source: Meta-gem that depends on the other components
ca: Metagema que depèn de la resta de components

source: BDD for Ruby.
ca: BDD per en Ruby.

source: Behaviour Driven Development for Ruby
ca: Desenvolupament impulsat pel comportament de Ruby

source: Behaviour Driven Development for Ruby. Making TDD Productive and Fun.
ca: Desenvolupament impulsat pel comportament de Ruby. Fent que TDD sigui productiu i divertit.

source: RSpec runner and formatters
ca: RSpec runner i formatadors

source: BDD for Ruby. RSpec runner and example groups.
ca: BDD per en Ruby. RSpec runner i grups d'exemple.

source: rspec-core provides the structure for writing executable examples of how your code should behave, and an rspec command with tools to constrain which examples get run and tailor the output.
ca: rspec-core proporciona l'estructura per escriure exemples executables de com s'ha de comportar el vostre codi, i una ordre rspec amb eines per restringir quins exemples s'executen i adaptar la sortida.

source: RDoc documentation for rspec-core
ca: Documentació RDoc per al rspec-core

source: RDoc documentation for rspec
ca: Documentació RDoc per al rspec

source: API to express expected outcomes of a code example
ca: API per a expressar els resultats esperats d'un exemple de codi

source: rspec-expectations provides a simple, readable API to express expected outcomes of a code example.
ca: rspec-expectations proporciona una API simple i llegible per expressar els resultats esperats d'un exemple de codi.

source: Provides a simple, readable API to express expected outcomes of a code example
ca: Proporciona una API simple i llegible per expressar els resultats esperats d'un exemple de codi

source: RDoc documentation for rspec-expectations
ca: Documentació RDoc per a les expectatives

source: Provides "its" method formerly part of rspec-core
ca: Proporciona el mètode «its» que anteriorment formava part del rspec-core

source: RSpec extension gem for attribute matching.
ca: Gem d'extensió RSpec per a la coincidència d'atributs.

source: RDoc documentation for rspec-its
ca: Documentació RDoc per a rspec-its

source: Test suite for rspec-its
ca: Prova el conjunt per al rspec-its

source: RSpec's 'test double' framework, with support for stubbing and mocking
ca: Marc de treball 'test double' de RSpec, amb suport per a l'estub i la burla

source: RSpec's 'test double' framework, with support for stubbing and mocking.
ca: Marc de treball 'test double' de RSpec, amb suport per a l'estub i la burla.

source: RSpecs test double framework, with support for stubbing and mocking
ca: Marc de treball doble de prova RSpecs, amb suport per a l'obturació i la burla

source: rspec-mocks is a test-double framework for rspec with support for method stubs, fakes, and message expectations on generated test-doubles and real objects alike.
ca: Rspec-mocks és un marc de prova doble per a Rspec amb suport per a mètodes stubs, falsificacions i expectatives de missatge sobre els tests-dobles generats i els objectes reals per igual.

source: RDoc documentation for rspec-mocks
ca: Documentació RDoc per a «rspec-mocks»

source: Common code needed by the other RSpec gems
ca: Codi comú necessari per a les altres gemmes RSpec

source: Support utilities for RSpec gems.
ca: Admet les utilitats per a les gemmes RSpec.

source: RDoc documentation for rspec-support
ca: Documentació RDoc per al suport de «rspec»

source: Ruby bindings for augeas
ca: Vinculacions Ruby per a augeas

source: Provides bindings for augeas.
ca: Proporciona vinculacions per a augeas.

source: RDoc documentation for ruby-augeas
ca: Documentació RDoc per a ruby-augeas

source: Ruby module for interaction with D-Bus
ca: Mòdul Ruby per a la interacció amb D-Bus

source: Pure Ruby module for interaction with D-Bus IPC system.
ca: Mòdul pur Ruby per a la interacció amb el sistema IPC D-Bus.

source: RDoc documentation for ruby-dbus
ca: Documentació RDoc per a ruby-dbus

source: Test suite for ruby-dbus
ca: Prova el conjunt per a ruby-dbus

source: Ruby bindings for LIBVIRT
ca: Vinculacions Ruby per a LIBVIRT

source: Ruby bindings for libvirt.
ca: Vinculacions Ruby per a libvirt.

source: RDoc documentation for ruby-libvirt
ca: Documentació RDoc per a ruby-libvirt

source: A library for consuming and serving OpenID identities
ca: Una biblioteca per consumir i servir les identitats OpenID

source: A library for consuming and serving OpenID identities.
ca: Una biblioteca per consumir i servir les identitats OpenID.

source: RDoc documentation for ruby-openid
ca: Documentació RDoc per a ruby-openid

source: Test suite for ruby-openid
ca: Conjunt de proves per a ruby-openid

source: A simple Ruby wrapper for invoking Terraform commands
ca: Un embolcall Ruby simple per invocar ordres de Terraform

source: Wraps the Terraform CLI so that Terraform can be invoked from a Ruby script or Rakefile.
ca: Ajusta el Terraform CLI perquè el Terraforme es pugui invocar des d'un script Ruby o Rakefile.

source: RDoc documentation for ruby-terraform
ca: Documentació RDoc per a ruby-terraform

source: Extracts supported Ruby versions from Travis file
ca: Extreu les versions Ruby admeses del fitxer Travis

source: Creates a version constraint of supported Rubies,suitable for a gemspec file.
ca: Crea una restricció de versió de Rubies admeses, adequades per a un fitxer gemspec.

source: RDoc documentation for ruby_dep
ca: Documentació RDoc per a rubydep

source: Pure Ruby implementation of Array#dig and Hash#dig for Ruby < 2.3
ca: Implementació pura de Ruby de Array anddig i Hash anddig per a Ruby and 2.3

source: Pure Ruby implementation of Array#dig and Hash#dig for Ruby < 2.3.
ca: Pure Ruby implementació de Array anddig i Hash anddig per a Ruby . 2.3.

source: RDoc documentation for ruby_dig
ca: Documentació RDoc per a rubydig

source: Test suite for ruby_dig
ca: Prova el conjunt per a rubydig

source: ruby_parser (RP) is a ruby parser written in pure ruby (utilizing
ca: rubyparser (RP) és un analitzador ruby escrit en ruby pur (utilitzant

source: ruby_parser (RP) is a ruby parser written in pure ruby (utilizing racc--which does by default use a C extension). RP's output is the same as ParseTree's output: s-expressions using ruby's arrays and base types. As an example: def conditional1 arg1 return 1 if arg1 == 0 return 0 end becomes: s(:defn, :conditional1, s(:args, :arg1), s(:if, s(:call, s(:lvar, :arg1), :==, s(:lit, 0)), s(:return, s(:lit, 1)), nil), s(:return, s(:lit, 0))) Tested against 801,039 files from the latest of all rubygems (as of 2013-05): * 1.8 parser is at 99.9739% accuracy, 3.651 sigma * 1.9 parser is at 99.9940% accuracy, 4.013 sigma * 2.0 parser is at 99.9939% accuracy, 4.008 sigma.
ca: rubyparser (RP) és un analitzador ruby escrit en ruby pur (utilitzant racc--que per defecte utilitza una extensió C). La sortida de RP és la mateixa que la sortida de ParseTree: s-expressions que utilitzen matrius i tipus de base de ruby. Com a exemple: def conditional1 arg1 retorna 1 si arg1 the 0 retorna 0 acaba: s(:defn, :conditional1, s(:args, :arg1), s(:if, s(:lvar, :arg1), :,, s(:lit, 0)), s(:return, s(:lit, 1)), nil), s(:return, s(:lit, 0)))) Provat amb 801.039 fitxers de tots els rubygems (a partir del 2013-05): * 1.8 l'analitzador té una precisió del 99.9739%, 3.651 sigma * 1.9 l'analitzador té una precisió del 99.9940%, 4.013 sigma * L'analitzador 2.0 té una precisió del 99.9939%, 4.008 sigma.

source: RDoc documentation for ruby_parser
ca: Documentació RDoc per a l'analitzador de rubí

source: Test suite for ruby_parser
ca: Prova el conjunt per a l'analitzador de rubí

source: Ruby/NTLM library
ca: Biblioteca Ruby/NTLM

source: Ruby/NTLM provides message creator and parser for the NTLM authentication.
ca: Ruby/NTLM proporciona creador de missatges i analitzador per a l'autenticació NTLM.

source: RDoc documentation for rubyntlm
ca: Documentació RDoc per a rubyntlm

source: Test suite for rubyntlm
ca: Test suite per a rubyntlm

source: rubyzip is a ruby module for reading and writing zip files
ca: rubyzip és un mòdul ruby per a llegir i escriure fitxers zip

source: rubyzip is a ruby module for reading and writing zip files.
ca: rubyzip és un mòdul ruby per a llegir i escriure fitxers zip.

source: RDoc documentation for rubyzip
ca: Documentació RDoc per a rubyzip

source: Test suite for rubyzip
ca: Conjunt de proves per a rubyzip

source: SameYAML provides an alternative implementation of YAML.load
ca: SameYAML proporciona una implementació alternativa de YAML.load

source: Parse YAML safely.
ca: Analitza el YAML amb seguretat.

source: RDoc documentation for safe_yaml
ca: Documentació RDoc per a safeyaml

source: Test suite for safe_yaml
ca: Test suite per a safeyaml

source: A powerful but elegant CSS compiler that makes CSS fun again
ca: Un compilador CSS potent però elegant que torna a fer-lo divertit

source: Sass makes CSS fun again. Sass is an extension of CSS, adding nested rules, variables, mixins, selector inheritance, and more. It's translated to well-formatted, standard CSS using the command line tool or a web-framework plugin.
ca: Sass torna a fer que el CSS sigui divertit. Sass és una extensió de CSS, afegint regles niades, variables, mixins, herència de selectors, i més. Es tradueix a CSS estàndard ben formatat utilitzant l'eina de línia d'ordres o un connector de marcs web.

source: RDoc documentation for sass
ca: Documentació RDoc per a sass

source: Fork of guard/listen
ca: Forquilla de guàrdia/escolta

source: This fork of guard/listen provides a stable API for users of the ruby Sass CLI.
ca: Aquesta bifurcació de guarda/escolta proporciona una API estable per als usuaris del ruby Sass CLI.

source: RDoc documentation for sass-listen
ca: Documentació RDoc per a sass-listen

source: Sass adapter for the Rails asset pipeline
ca: Adaptador Sass per al gasoducte d'actius Rails

source: Sass adapter for the Rails asset pipeline.
ca: Adaptador Sass per a la canonada d'actius Rails.

source: RDoc documentation for sass-rails
ca: Documentació RDoc per a sass-rails

source: Test suite for sass
ca: Test suite per a sass

source: securecompare is a gem that implements a constant time string
ca: securecompare és una joia que implementa una cadena de temps constant

source: securecompare borrows the secure_compare private method from ActiveSupport::MessageVerifier which lets you do safely compare strings without being vulnerable to timing attacks. Useful for Basic HTTP Authentication in your rack/rails application.
ca: securecompare presta el mètode privat SECUREcompare d'ActiveSupport::MessageVerifier que permet comparar cadenes de manera segura sense ser vulnerable a atacs de temps. Útil per a l'autenticació HTTP bàsica a la vostra aplicació de rack/rails.

source: RDoc documentation for securecompare
ca: Documentació RDoc per a securecompare

source: Test suite for securecompare
ca: Prova el conjunt per a «segurcompare»

source: sexp_processor branches from ParseTree bringing all the generic sexp
ca: branques de sexpprocessador de ParseTree portant tot el sexp genèric

source: sexp_processor branches from ParseTree bringing all the generic sexp processing tools with it. Sexp, SexpProcessor, Environment, etc... all for your language processing pleasure.
ca: Branques de sexpprocessador de ParseTree portant totes les eines de processament de sexp genèriques amb ell. Sexp, SexpProcessor, Environment, etc... tot per al vostre plaer de processar el llenguatge.

source: RDoc documentation for sexp_processor
ca: Documentació RDoc per al sexpprocessador

source: Test suite for sexp_processor
ca: Conjunt de proves per al sexpprocessador

source: Setup signal handler which dumps backtrace of running threads and
ca: Configura el gestor de senyals que bolca la traça inversa dels fils en execució i

source: Setup signal handler which dumps backtrace of running threads and number of allocated objects per class. Require 'sigdump/setup', send SIGCONT, and see /tmp/sigdump-<pid>.log.
ca: Configura el gestor de senyals que bolca la traça inversa dels fils en execució i el nombre d'objectes assignats per classe. Requereix «sigdump/setup», envia SIGCONT i mira /tmp/sigdump-<pid>.log.

source: RDoc documentation for sigdump
ca: Documentació RDoc per a «sigdump»

source: Code coverage for Ruby 1.9+ with a powerful configuration library
ca: Cobertura de codi per a Ruby 1.9+ amb una potent biblioteca de configuració

source: Code coverage for Ruby 1.9+ with a powerful configuration library and automatic merging of coverage across test suites.
ca: Cobertura de codi per a Ruby 1.9+ amb una potent biblioteca de configuració i fusió automàtica de cobertura a través de conjunts de proves.

source: RDoc documentation for simplecov
ca: Documentació RDoc per a simplecov

source: Default HTML formatter for SimpleCov code coverage tool for ruby 1.9+
ca: Formatador HTML per defecte per a l'eina de cobertura de codi SimpleCov per a ruby 1.9+

source: Default HTML formatter for SimpleCov code coverage tool for ruby 1.9+.
ca: Formatador HTML per defecte per a l'eina de cobertura de codi SimpleCov per a ruby 1.9+.

source: RDoc documentation for simplecov-html
ca: Documentació RDoc per a «simplecov-html»

source: Test suite for simplecov-html
ca: Prova el conjunt per a «simplycov-html»

source: Test suite for simplecov
ca: Test suite per a simplecov

source: Punycode ACE to unicode UTF-8 (and vice-versa) string conversion
ca: Punycode ACE a conversió de cadena unicode UTF-8 (i viceversa)

source: This gem allows easy conversion from punycode ACE strings to unicode UTF-8 strings and vice-versa.
ca: Aquesta gemma permet una fàcil conversió de les cadenes ACE de punycode a les cadenes UTF-8 d'unicode i viceversa.

source: RDoc documentation for simpleidn
ca: Documentació RDoc per a simpleidn

source: Classy web-development dressed in a DSL
ca: Desenvolupament web elegant vestit amb una DSL

source: Sinatra is a DSL for quickly creating web applications in Ruby with minimal effort.
ca: Sinatra és una DSL per crear ràpidament aplicacions web a Ruby amb un esforç mínim.

source: RDoc documentation for sinatra
ca: Documentació RDoc per a sinatra

source: Slim is a template language
ca: Slim és un llenguatge de plantilla

source: Slim is a template language whose goal is reduce the syntax to the essential parts without becoming cryptic.
ca: Slim és un llenguatge de plantilla l'objectiu del qual és reduir la sintaxi a les parts essencials sense convertir-se en críptic.

source: RDoc documentation for slim
ca: Documentació RDoc per a slim

source: Test suite for slim
ca: Conjunt de proves per a prim

source: Rails application preloader
ca: Precarregador d'aplicacions Rails

source: Preloads your application so things like console, rake and tests run faster.
ca: Precarrega l'aplicació de manera que coses com la consola, rake i proves s'executin més ràpid.

source: RDoc documentation for spring
ca: Documentació RDoc per a la primavera

source: Makes spring watch files using the listen gem
ca: Fa que els fitxers de seguiment de primavera utilitzin la joia d'escolta

source: Makes spring watch files using the listen gem.
ca: Fa que els fitxers de seguiment de primavera utilitzin la joia de l'escolta.

source: RDoc documentation for spring-watcher-listen
ca: Documentació del RDoc per a l'observació de primavera

source: Test suite for spring-watcher-listen
ca: Conjunt de proves per a l'escolta de l'observador de primavera

source: Rack-based asset packaging system
ca: Sistema d'empaquetament d'actius basat en paquets

source: Sprockets is a Rack-based asset packaging system that concatenates and serves JavaScript, CoffeeScript, CSS, LESS, Sass, and SCSS.
ca: Sprockets és un sistema d'envasat d'actius basat en Rack que concatena i serveix JavaScript, CoffeeScript, CSS, LESS, Sass i SCSS.

source: RDoc documentation for sprockets
ca: Documentació RDoc per a sprockets

source: Sprockets Rails integration
ca: Integració de Sprockets Rails

source: Sprockets Rails integration.
ca: Integració de Sprockets Rails.

source: RDoc documentation for sprockets-rails
ca: Documentació RDoc per a sprockets-rails

source: This module allows Ruby programs to interface with the SQLite3
ca: Aquest mòdul permet als programes Ruby interactuar amb el SQLite3

source: This module allows Ruby programs to interface with the SQLite3 database engine (http://www.sqlite.org). You must have the SQLite engine installed in order to build this module. Note that this module is only compatible with SQLite 3.6.16 or newer.
ca: Aquest mòdul permet als programes Ruby interactuar amb el motor de base de dades SQLite3 (http://www.sqlite.org). Heu de tenir instal·lat el motor SQLite per construir aquest mòdul. Tingueu en compte que aquest mòdul només és compatible amb SQLite 3.6.16 o més recent.

source: RDoc documentation for sqlite3
ca: Documentació RDoc per al sqlite3

source: Test suite for sqlite3
ca: Conjunt de proves per al sqlite3

source: SSHKit makes it easy to write structured, testable SSH commands in
ca: SSHKit fa que sigui fàcil escriure ordres SSH estructurades i comprovables a

source: A comprehensive toolkit for remotely running commands in a structured manner on groups of servers.
ca: Un conjunt d'eines complet per a executar ordres de forma estructurada de forma remota en grups de servidors.

source: RDoc documentation for sshkit
ca: Documentació RDoc per a sshkit

source: Test suite for sshkit
ca: Prova el conjunt per a «sshkit»

source: SWD (Simple Web Discovery) Client Library
ca: SWD (Simple Web Discovery) Biblioteca Client

source: SWD (Simple Web Discovery) Client Library.
ca: Biblioteca Client SWD (Simple Web Discovery).

source: RDoc documentation for swd
ca: Documentació RDoc per a swd

source: Test suite for swd
ca: Conjunt de proves per a swd

source: Template compilation framework in Ruby
ca: Marc de treball de compilació de plantilles en Ruby

source: Template compilation framework in Ruby.
ca: Marc de treball de compilació de plantilles a Ruby.

source: RDoc documentation for temple
ca: Documentació RDoc per al temple

source: Test suite for temple
ca: Conjunt de proves per al temple

source: Ruby library that colors strings using ANSI escape sequences
ca: Biblioteca Ruby que acoloreix les cadenes utilitzant seqüències d'escapament ANSI

source: This library uses ANSI escape sequences to control the attributes of terminal output.
ca: Aquesta biblioteca utilitza seqüències d'escapament ANSI per controlar els atributs de la sortida del terminal.

source: RDoc documentation for term-ansicolor
ca: Documentació RDoc per term-ansicolor

source: An xUnit family unit testing framework for Ruby
ca: Un marc de proves d'unitats familiars xUnit per a Ruby

source: test-unit (Test::Unit) is unit testing framework for Ruby, based on xUnit principles. These were originally designed by Kent Beck, creator of extreme programming software development methodology, for Smalltalk's SUnit. It allows writing tests, checking results and automated testing in Ruby.
ca: Test-unit (Test::Unit) és un marc de proves d'unitats per a Ruby, basat en els principis xUnit. Aquests van ser dissenyats originalment per Kent Beck, creador de la metodologia de desenvolupament de programari de programació extrema, per al SUnit de Smalltalk. Permet l'escriptura de proves, la comprovació de resultats i les proves automatitzades a Ruby.

source: RDoc documentation for test-unit
ca: Documentació RDoc per a la unitat de prova

source: Test suite for test-unit
ca: Conjunt de proves per a unitat de prova

source: A collection of text algorithms
ca: Una col·lecció d'algorismes de text

source: A collection of text algorithms: Levenshtein, Soundex, Metaphone, Double Metaphone, Porter Stemming.
ca: Una col·lecció d'algorismes de text: Levenshtein, Soundex, Metaphone, Double Metaphone, Porter Stemming.

source: RDoc documentation for text
ca: Documentació RDoc per al text

source: Test suite for text
ca: Prova el conjunt per al text

source: Thor is a toolkit for building powerful command-line interfaces
ca: Thor és un conjunt d'eines per construir interfícies de línia d'ordres potents

source: Thor is a toolkit for building powerful command-line interfaces.
ca: Thor és un conjunt d'eines per construir interfícies de línia d'ordres potents.

source: RDoc documentation for thor
ca: Documentació RDoc per al thor

source: Thread-safe collections and utilities for Ruby
ca: Col·leccions i utilitats segures per al fil de Ruby

source: A collection of data structures and utilities to make thread-safe programming in Ruby easier.
ca: Una col·lecció d'estructures de dades i utilitats per facilitar la programació segura de fils a Ruby.

source: RDoc documentation for thread_safe
ca: Documentació RDoc per a threadsafe

source: Test suite for thread_safe
ca: Prova el conjunt per a threadsafe

source: Generic interface to multiple Ruby template engines
ca: Interfície genèrica a múltiples motors de plantilles Ruby

source: Generic interface to multiple Ruby template engines.
ca: Interfície genèrica a múltiples motors de plantilla Ruby.

source: RDoc documentation for tilt
ca: Documentació RDoc per a tilt

source: Test suite for tilt
ca: Prova el conjunt per a inclinació

source: Useful stuff
ca: Coses útils

source: All the stuff that isn't good/big enough for a real library.
ca: Totes les coses que no són prou grans per a una biblioteca real.

source: RDoc documentation for tins
ca: Documentació RDoc per a les llaunes

source: A Ruby-based text parsing and interpretation DSL
ca: Una DSL d'anàlisi i interpretació de text basada en Ruby

source: A Ruby-based text parsing and interpretation DSL.
ca: Un DSL d'anàlisi i interpretació de text basat en Ruby.

source: RDoc documentation for treetop
ca: Documentació RDoc per treetop

source: Test suite for treetop
ca: Prova el conjunt per a dalt de l'arbre

source: Trollop is a commandline option parser for Ruby that just gets out
ca: Trollop és un analitzador d'opcions de la línia d'ordres per a Ruby que acaba de sortir
