Repository: openSUSE/packages-i18n
Catalog: */po/rubygem.*.po
Languages: ca

source: Nokogiri (鋸) makes it easy and painless to work with XML and HTML from Ruby. It provides a sensible, easy-to-understand API for reading, writing, modifying, and querying documents. It is fast and standards-compliant by relying on native parsers like libxml2 (C) and xerces (Java).
ca: Nokogiri ( and) fa que sigui fàcil i indolor treballar amb XML i HTML de Ruby. Proporciona una API assenyada i fàcil de comprendre per llegir, escriure, modificar i consultar documents. És ràpid i compatible amb els estàndards en basar-se en analitzadors nadius com libxml2 (C) i xerces (Java).

source: Optimist is a commandline option parser for Ruby that just gets out
ca: Optimist és un analitzador d'opcions de línia d'ordres per a Ruby que acaba de sortir

source: Optimist is a commandline option parser for Ruby that just gets out of your way. One line of code per option is all you need to write. For that, you get a nice automatically-generated help page, robust option parsing, command subcompletion, and sensible defaults for everything you don't specify.
ca: Optimist és un analitzador d'opcions de la línia d'ordres per a Ruby que acaba de sortir del vostre camí. Una línia de codi per opció és tot el que cal escriure. Per a això, obteniu una pàgina d'ajuda generada automàticament, una anàlisi robusta d'opcions, subcompleció d'ordres i valors predeterminats assenyats per a tot el que no especifiqueu.

source: Simple and easy way to know if you're on windows or not (reliably),
ca: Una manera senzilla i fàcil de saber si estàs en finestres o no (de manera fiable),

source: The OS gem allows for some useful and easy functions, like OS.windows? (=> true or false) OS.bits ( => 32 or 64) etc".
ca: La joia del SO permet algunes funcions útils i fàcils, com ara OS.windows? ( or cert o fals) OS.bits ( 32 32 o 64) etc.

source: A Ruby parser written in pure Ruby
ca: Un analitzador Ruby escrit en Ruby pur

source: A Ruby parser written in pure Ruby.
ca: Un analitzador Ruby escrit en Ruby pur.

source: PDF::Core is used by Prawn to render PDF documents
ca: PDF::Core és utilitzat per Prawn per renderitzar documents PDF

source: PDF::Core is used by Prawn to render PDF documents.
ca: PDF::Core és utilitzat per Prawn per a renderitzar documents PDF.

source: A library for accessing the content of PDF files
ca: Una biblioteca per accedir al contingut dels fitxers PDF

source: The PDF::Reader library implements a PDF parser conforming as much as possible to the PDF specification from Adobe.
ca: La biblioteca PDF::Reader implementa un analitzador PDF que s'ajusta tant com sigui possible a l'especificació PDF d'Adobe.

source: A fast and nimble PDF generator for Ruby
ca: Un generador PDF ràpid i àgil per a Ruby

source: Prawn is a fast, tiny, and nimble PDF generator for Ruby.
ca: Prawn és un generador de PDF ràpid, petit i àgil per a Ruby.

source: Provides icon fonts for PrawnPDF
ca: Proporciona tipus de lletra d'icones per a PrawnPDF

source: Prawn::Icon provides various icon fonts including FontAwesome, PaymentFont and Foundation Icons for use with the Prawn PDF toolkit.
ca: Prawn::Icon proporciona diversos tipus de lletra d'icones, incloent FontAwesome, PaymentFont i les icones de la base per al seu ús amb el kit d'eines Prawn PDF.

source: SVG renderer for Prawn PDF library
ca: Representador SVG per a la biblioteca Prawn PDF

source: This gem allows you to render SVG directly into a PDF using the 'prawn' gem. Since PDF is vector-based, you'll get nice scaled graphics if you use SVG instead of an image.
ca: Aquesta gemma permet renderitzar SVG directament en un PDF utilitzant la gemma 'prawn'. Com que el PDF està basat en vectors, obtindreu gràfics escalats si utilitzeu SVG en lloc d'una imatge.

source: Provides tables for PrawnPDF
ca: Proporciona taules per a PrawnPDF

source: Prawn::Table provides tables for the Prawn PDF toolkit.
ca: Prawn::Table proporciona taules per al joc d'eines Prawn PDF.

source: Prawn::Templates allows using PDFs as templates in Prawn
ca: Prawn::Templates permet utilitzar PDF com a plantilles a Prawn

source: A extention to prawn that allows to include other pdfs either as background to write upon or to combine several pdf documents into one.
ca: Una extensió a la gamba que permet incloure altres pdfs ja sigui com a fons per escriure o per combinar diversos documents pdf en un.

source: A runtime developer console and IRB alternative with powerful
ca: Una consola de desenvolupadors en temps d'execució i alternativa IRB amb potent

source: Pry is a runtime developer console and IRB alternative with powerful introspection capabilities. Pry aims to be more than an IRB replacement. It is an attempt to bring REPL driven programming to the Ruby language.
ca: Pry és una consola de desenvolupament en temps d'execució i alternativa IRB amb potents capacitats d'introspecció. Pry pretén ser més que un substitut de l'IRB. És un intent de portar la programació impulsada per la REPL al llenguatge Ruby.

source: Puma is a simple, fast, threaded, and highly parallel HTTP 1.1
ca: Puma és un HTTP 1.1 simple, ràpid, enfilat i molt paral·lel

source: Puma is a simple, fast, threaded, and highly parallel HTTP 1.1 server for Ruby/Rack applications. Puma is intended for use in both development and production environments. It's great for highly parallel Ruby implementations such as Rubinius and JRuby as well as as providing process worker support to support CRuby well.
ca: Puma és un servidor HTTP 1.1 senzill, ràpid, amb fils i molt paral·lel per a aplicacions Ruby/Rack. Puma està destinat a ser utilitzat tant en entorns de desenvolupament com de producció. És genial per a implementacions molt paral·leles de Ruby com Rubinius i JRuby, així com proporcionar suport als treballadors del procés per donar suport a CRuby.

source: If you have a memory leak in your web code puma_worker_killer can
ca: Si teniu una fuita de memòria al vostre codi web, pumaworkerkiller pot

source: Kills pumas, the code kind .
ca: Mata pumes, el tipus de codi.

source: OO authorization for Rails
ca: Autorització OO per a Rails

source: Object oriented authorization for Rails applications.
ca: Autorització orientada a objectes per a aplicacions Rails.

source: Rack provides a minimal, modular and adaptable interface for developing web applications in Ruby. By wrapping HTTP requests and responses in the simplest way possible, it unifies and distills the API for web servers, web frameworks, and software in between (the so-called middleware) into a single method call.
ca: Rack proporciona una interfície mínima, modular i adaptable per al desenvolupament d'aplicacions web a Ruby. En embolicar les sol·licituds i respostes HTTP de la manera més senzilla possible, unifica i destil·la l'API per a servidors web, frameworks web i programari entremig (l'anomenat middleware) en una única crida de mètode.

source: Common locale data and translations for Rails i18n
ca: Dades locals comunes i traduccions per a Rails i18n

source: A set of common locale data and translations to internationalize and/or localize your Rails applications.
ca: Un conjunt de dades i traduccions locals comunes per internacionalitzar i/o localitzar les vostres aplicacions Rails.

source: Colorize printed text on ANSI terminals
ca: Acoloreix el text imprès en terminals ANSI

source: Colorize printed text on ANSI terminals.
ca: Acoloreix el text imprès als terminals ANSI.

source: Rake-based Ruby Extension (C, Java) task generator
ca: Generador de tasques Ruby Extension (C, Java) basat en el Rake

source: Provide a standard and simplified way to build and package Ruby extensions (C, Java) using Rake as glue.
ca: Proporciona una manera estàndard i simplificada de construir i empaquetar extensions Ruby (C, Java) utilitzant Rake com a cola.

source: Red Datasets provides classes that provide common datasets such as
ca: Red Datasets proporciona classes que proporcionen conjunts de dades comuns com

source: You can use datasets easily because you can access each dataset with multiple ways such as `#each` and Apache Arrow Record Batch.
ca: Podeu utilitzar conjunts de dades fàcilment perquè podeu accedir a cada conjunt de dades amb múltiples maneres com andcadascun and i Apache Arrow Record Batch.

source: Scanner, lexer, parser for ruby's regular expressions
ca: Escàner, lexer, analitzador per a les expressions regulars de ruby

source: A library for tokenizing, lexing, and parsing Ruby regular expressions.
ca: Una biblioteca per tokenitzar, lexing i analitzar expressions regulars de Ruby.

source: Convert html code into markdown
ca: Converteix el codi HTML en Markdown

source: Map simple html back into markdown, e.g. if you want to import existing html data in your application.
ca: Mapeu html senzill de nou a markdown, p. ex. si voleu importar dades html existents a l'aplicació.

source: Ruby Interface for C++ Extensions
ca: Interfície Ruby per a extensions C++

source: Rice is a C++ interface to Ruby's C API. It provides a type-safe and exception-safe interface in order to make embedding Ruby and writing Ruby extensions with C++ easier.
ca: Rice és una interfície de C++ a l'API C de Ruby. Proporciona una interfície segura de tipus i segura d'excepcions per tal de facilitar la incrustació de Ruby i l'escriptura d'extensions Ruby amb C++.

source: Ruby bindings for rpm (package manager)
ca: Vinculacions Ruby per a rpm (gestor de paquets)

source: Ruby bindings for rpm. Almost a drop-in replacement for ruby-rpm. Uses FFI.
ca: Vinculacions Ruby per a rpm. Gairebé un reemplaçament per ruby-rpm. Utilitza FFI.

source: rspec-rails is a testing framework for Rails 3+.
ca: Rspec-rails és un marc de proves per a Rails 3+.

source: rspec-rails is a testing framework for Rails 5+.
ca: Rspec-rails és un marc de proves per a Rails 5+.

source: Automatic Ruby code style checking tool
ca: Eina automàtica de comprovació de l'estil de codi Ruby

source: RuboCop is a Ruby code style checking and code formatting tool. It aims to enforce the community-driven Ruby Style Guide.
ca: RuboCop és una eina de comprovació d'estil de codi i format de codi Ruby. El seu objectiu és fer complir la guia d'estil Ruby impulsada per la comunitat.

source: RuboCop tools to deal with Ruby code AST
ca: Eines RuboCop per a tractar el codi Ruby AST

source: RuboCop's Node and NodePattern classes.
ca: Classes de Node i NodePattern de RuboCop.

source: Ruby/ProgressBar is a flexible text progress bar library for Ruby
ca: Ruby/ProgressBar és una biblioteca de progrés de text flexible per a Ruby

source: Ruby/ProgressBar is an extremely flexible text progress bar library for Ruby. The output can be customized with a flexible formatting system including: percentage, bars of various formats, elapsed time and estimated time remaining.
ca: Ruby/ProgressBar és una biblioteca de progrés de text extremadament flexible per a Ruby. La sortida es pot personalitzar amb un sistema de formatació flexible que inclou: percentatge, barres de diversos formats, temps transcorregut i temps estimat restant.

source: RubyRC4 is a pure Ruby implementation of the RC4 algorithm
ca: RubyRC4 és una implementació pura de Ruby de l'algorisme RC4

source: RubyRC4 is a pure Ruby implementation of the RC4 algorithm.
ca: RubyRC4 és una implementació pura de Ruby de l'algorisme RC4.

source: Shim library for Module#ruby2_keywords
ca: Biblioteca Shim per a Modulesruby2keywords

source: Shim library for Module#ruby2_keywords.
ca: Biblioteca Shim per a Module.ruby2keywords.

source: ruby_parser (RP) is a ruby parser written in pure ruby (utilizing racc--which does by default use a C extension). It outputs s-expressions which can be manipulated and converted back to ruby via the ruby2ruby gem. As an example: def conditional1 arg1 return 1 if arg1 == 0 return 0 end becomes: s(:defn, :conditional1, s(:args, :arg1), s(:if, s(:call, s(:lvar, :arg1), :==, s(:lit, 0)), s(:return, s(:lit, 1)), nil), s(:return, s(:lit, 0))) Tested against 801,039 files from the latest of all rubygems (as of 2013-05): * 1.8 parser is at 99.9739% accuracy, 3.651 sigma * 1.9 parser is at 99.9940% accuracy, 4.013 sigma * 2.0 parser is at 99.9939% accuracy, 4.008 sigma * 2.6 parser is at 99.9972% accuracy, 4.191 sigma.
ca: rubyparser (RP) és un analitzador ruby escrit en ruby pur (utilitzant racc--que per defecte utilitza una extensió C). Produeix s-expressions que poden ser manipulades i convertides de nou a ruby a través de la gemma ruby2ruby. Com a exemple: def conditional1 arg1 retorna 1 si arg1 the 0 retorna 0 acaba: s(:defn, :conditional1, s(:args, :arg1), s(:if, s(:lvar, :arg1), :,, s(:lit, 0)), s(:return, s(:lit, 1)), nil), s(:return, s(:lit, 0)))) Provat amb 801.039 fitxers de tots els rubygems (a partir del 2013-05): * 1.8 l'analitzador té una precisió del 99.9739%, 3.651 sigma * 1.9 l'analitzador té una precisió del 99.9940%, 4.013 sigma * L'analitzador 2.0 té una precisió del 99.9939%, 4.008 sigma * 2.6 analitzador amb una precisió del 99.9972%, 4.191 sigma.

source: Ruby module for reading and writing zip files
ca: Mòdul Ruby per a llegir i escriure fitxers zip

source: Ruby Sass is deprecated! See https://sass-lang.com/ruby-sass for details. Sass makes CSS fun again. Sass is an extension of CSS, adding nested rules, variables, mixins, selector inheritance, and more. It's translated to well-formatted, standard CSS using the command line tool or a web-framework plugin.
ca: Ruby Sass és obsolet! Vegeu https://sass-lang.com/ruby-sass per a més detalls. Sass torna a fer que el CSS sigui divertit. Sass és una extensió de CSS, afegint regles niades, variables, mixins, herència de selectors, i més. Es tradueix a CSS estàndard ben formatat utilitzant l'eina de línia d'ordres o un connector de marcs web.

source: Use libsass with Ruby!
ca: Utilitza libsass amb Ruby!

source: Use libsass with Ruby!.
ca: Utilitza libsass amb Ruby!.

source: Integrate SassC-Ruby into Rails
ca: Integra el SassC-Ruby a Rails

source: We all love working with Sass, but compilation can take quite a long time for larger codebases. This gem integrates the C implementation of Sass, LibSass, into the asset pipeline.
ca: A tots ens encanta treballar amb Sass, però la compilació pot trigar molt de temps per a bases de codi més grans. Aquesta joia integra la implementació en C de Sass, LibSass, en el pipeline d'actius.

source: rdoc html with javascript search index
ca: html del rdoc amb l'índex de cerca javascript

source: rdoc generator html with javascript search index.
ca: html del generador rdoc amb índex de cerca javascript.

source: node-semver rewritten in ruby, for comparison and inclusion of
ca: node-semver reescrit en ruby, per a la comparació i inclusió de

source: node-semver rewritten in ruby, for comparison and inclusion of semantic versions and ranges.
ca: node-semver reescrit en ruby, per a la comparació i inclusió de versions i rangs semàntics.

source: ServerEngine - multiprocess server framework
ca: ServerEngine - framework del servidor multiprocés

source: A framework to implement robust multiprocess servers like Unicorn.
ca: Un marc de treball per implementar servidors multiprocés robustos com Unicorn.

source: Code coverage for Ruby
ca: Cobertura de codi per a Ruby

source: Code coverage for Ruby with a powerful configuration library and automatic merging of coverage across test suites.
ca: Cobertura de codi per a Ruby amb una potent biblioteca de configuració i fusió automàtica de cobertura a través de conjunts de proves.

source: Default HTML formatter for SimpleCov code coverage tool for ruby 2.4+
ca: Formatador HTML per defecte per a l'eina de cobertura de codi SimpleCov per al ruby 2.4+

source: Default HTML formatter for SimpleCov code coverage tool for ruby 2.4+.
ca: Formatador HTML per defecte per a l'eina de cobertura de codi SimpleCov per a ruby 2.4+.

source: JSON formatter for SimpleCov
ca: Formatador JSON per a SimpleCov

source: JSON formatter for SimpleCov.
ca: Formatador JSON per a SimpleCov.

source: Simple Lightweight Option Parsing
ca: Analització simple d'opcions lleugeres

source: A DSL for gathering options and parsing command line flags.
ca: Una DSL per a recollir opcions i analitzar les banderes de la línia d'ordres.

source: Sprockets is a Rack-based asset packaging system that concatenates and serves JavaScript, CoffeeScript, CSS, Sass, and SCSS.
ca: Sprockets és un sistema d'envasat d'actius basat en Rack que concatena i serveix JavaScript, CoffeeScript, CSS, Sass i SCSS.

source: Asset path helpers for Sprockets 2.x & 3.x applications.
ca: Asset path helpers per a aplicacions Sprockets 2.x 3.x.

source: Ruby client for the Stomp messaging protocol
ca: Client Ruby per al protocol de missatgeria Stomp

source: Ruby client for the Stomp messaging protocol.
ca: Client Ruby per al protocol de missatgeria Stomp.

source: a fast strptime/strftime engine
ca: un motor ràpid en temps de transmissió

source: a fast strptime/strftime engine which uses VM.
ca: un motor ràpid de temps de transmissió/strftime que utilitza VM.

source: A module that provides a two-phase lock with a counter
ca: Un mòdul que proporciona un bloqueig en dues fases amb un comptador

source: A module that provides a two-phase lock with a counter.
ca: Un mòdul que proporciona un bloqueig de dues fases amb un comptador.

source: Simple, feature rich ascii table generation library
ca: Simple, característica rica biblioteca de generació de taules ascii

source: Simple, feature rich ascii table generation library.
ca: Simple, compta amb una rica biblioteca de generació de taules ascii.

source: Pure Ruby one-shot and periodic timers
ca: Temporitzadors d'una sola captura i periòdics Pure Ruby

source: Pure Ruby one-shot and periodic timers.
ca: Pure Ruby one-shot i temporitzadors periòdics.

source: Create and manage complex tmux sessions easily
ca: Crea i gestiona fàcilment sessions complexes de tmux

source: Create and manage complex tmux sessions easily.
ca: Crea i gestiona fàcilment sessions complexes de tmux.

source: A racc based toml parser
ca: Un analitzador de toml basat en el «racc»

source: A racc based toml parser.
ca: Un analitzador de toml basat en el «racc».

source: A Parsing Expression Grammar (PEG) Parser generator DSL for Ruby.
ca: Un analitzador d'expressions gramaticals (PEG) DSL per a Ruby.

source: Trollop is a commandline option parser for Ruby that just gets out of your way. **DEPRECATION** This gem has been renamed to optimist and will no longer be supported. Please switch to optimist as soon as possible.
ca: Trollop és un analitzador d'opcions de la línia d'ordres per a Ruby que acaba de sortir del vostre camí. **DEPRECACIÓ** Aquesta joia s'ha reanomenat optimista i ja no serà compatible. Si us plau, canvieu a optimista tan aviat com sigui possible.

source: TrueType Font Metrics Parser
ca: Analitzador de les mètriques de tipus de lletra TrueType

source: Font Metrics Parser for the Prawn PDF generator.
ca: Analitzador de mètriques de tipus de lletra per al generador de PDF Prawn.

source: Time Zone Library
ca: Biblioteca de la zona horària

source: TZInfo provides access to time zone data and allows times to be converted using time zone rules.
ca: TZInfo proporciona accés a les dades de la zona horària i permet convertir els temps utilitzant les regles de la zona horària.

source: Timezone Data for TZInfo
ca: Dades de la zona horària per a TZInfo

source: TZInfo::Data contains data from the IANA Time Zone database packaged as Ruby modules for use with TZInfo.
ca: TZInfo::Data conté dades de la base de dades de la zona horària IANA empaquetades com a mòduls Ruby per al seu ús amb TZInfo.

source: Determines the monospace display width of a string in Ruby
ca: Determina l'amplada de visualització monoespai d'una cadena en Ruby

source: [Unicode 14.0.0] Determines the monospace display width of a string using EastAsianWidth.txt, Unicode general category, and other data.
ca: [Unicode 14.0.0] Determina l'amplada de visualització monoespai d'una cadena utilitzant EastAsianWidth.txt, categoria general Unicode i altres dades.

source: An authentication library compatible with all Rack-based frameworks
ca: Una biblioteca d'autenticació compatible amb tots els frameworks basats en Rack

source: An authentication library compatible with all Rack-based frameworks.
ca: Una biblioteca d'autenticació compatible amb tots els frameworks basats en Rack.

source: Universal Ruby library to handle WebSocket protocol
ca: Biblioteca Universal Ruby per gestionar el protocol WebSocket

source: Universal Ruby library to handle WebSocket protocol.
ca: Biblioteca Universal Ruby per gestionar el protocol WebSocket.

source: A simple API for XML processing
ca: Una API senzilla per al processament XML

source: A simple API for XML processing.
ca: Una API senzilla per al processament XML.

source: Xmlhash is a naive form of XML::Simple
ca: Xmlhash és una forma ingenu de XML::Simple

source: A small C module that wraps libxml2's xmlreader to parse a XML string into a ruby hash.
ca: Un petit mòdul C que envolta el xmlreader de libxml2 per analitzar una cadena XML en un hash ruby.

source: Ruby C bindings to the excellent Yajl JSON stream-based parser
ca: Vinculació de Ruby C a l'excel·lent analitzador basat en el flux de Yajl JSON

source: Ruby C bindings to the excellent Yajl JSON stream-based parser library.
ca: Ruby C enllaça a l'excel·lent biblioteca d'analitzadors basada en el flux Yajl JSON.

source: Efficient and thread-safe constant autoloader
ca: Carregador automàtic constant eficient i segur de fil

source: Zeitwerk implements constant autoloading with Ruby semantics. Each gem and application may have their own independent autoloader, with its own configuration, inflector, and logger. Supports autoloading, reloading, and eager loading.
ca: Zeitwerk implementa una càrrega automàtica constant amb la semàntica Ruby. Cada gem i aplicació pot tenir el seu propi carregador automàtic independent, amb la seva pròpia configuració, inflector i logger. Permet la càrrega automàtica, la recàrrega i la càrrega impacient.
