Repository: openSUSE/packages-i18n
Catalog: */po/rubygem.*.po
Languages: ca

source: RDoc documentation for openid_connect
ca: Documentació RDoc per a openidconnect

source: Test suite for openid_connect
ca: Test suite per a openidconnect

source: orm_adapter provides a single point of entry for using basic
ca: ormadaptaer proporciona un únic punt d'entrada per a utilitzar BASIC

source: Provides a single point of entry for using basic features of ruby ORMs.
ca: Proporciona un únic punt d'entrada per a l'ús de les característiques bàsiques dels ORM de rubí.

source: RDoc documentation for orm_adapter
ca: Documentació RDoc per a ormadaptador

source: Test suite for orm_adapter
ca: Test suite per a ormadaptador

source: Rake tasks providing tasks to package project in git and integration
ca: Descarta les tasques que proporcionen tasques per empaquetar el projecte en git i integració

source: Rake tasks to allow easy packaging ruby projects in git for Build Service or other packaging service.
ca: Tasques d'envasat per permetre projectes ruby fàcils en git per a Build Service o un altre servei d'envasat.

source: RDoc documentation for packaging_rake_tasks
ca: Documentació RDoc per packagingraketasks

source: Terminal painter!
ca: Pintor terminal!

source: Terminal painter with RGB and 256 (fallback) color and terminal effects support. No string extensions! Usage: Paint['string', :red, :bright].
ca: Pintor terminal amb suport RGB i 256 (fallback) color i efectes de terminal. No hi ha extensions de cadena! Ús: Pintura['cadena', :red, :bright].

source: RDoc documentation for paint
ca: Documentació RDoc per a la pintura

source: Run any kind of code in parallel processes
ca: Executa qualsevol tipus de codi en processos paral·lels

source: Run any kind of code in parallel processes.
ca: Executa qualsevol tipus de codi en processos paral·lels.

source: RDoc documentation for parallel
ca: Documentació RDoc per al paral·lel

source: Run Test::Unit / RSpec / Cucumber / Spinach in parallel
ca: Executa Test::Unit / RSpec / Cogombre / Espinacs en paral·lel

source: Run Test::Unit / RSpec / Cucumber / Spinach in parallel.
ca: Executa Test::Unit / RSpec / Cucumber / Spinach en paral·lel.

source: RDoc documentation for parallel_tests
ca: Documentació RDoc per a proves paral·leles

source: A fast and robust web server and application server for Ruby, Python
ca: Un servidor web i un servidor d'aplicacions ràpid i robust per a Ruby, Python

source: A modern web server and application server for Ruby, Python and Node.js, optimized for performance, low memory usage and ease of use.
ca: Un servidor web modern i un servidor d'aplicacions per a Ruby, Python i Node.js, optimitzat per al rendiment, baix ús de memòria i facilitat d'ús.

source: RDoc documentation for passenger
ca: Documentació RDoc per al passatger

source: PathExpander helps pre-process command-line arguments expanding
ca: PathExpander ajuda a l'expansió dels arguments de preprocessament de la línia d'ordres

source: PathExpander helps pre-process command-line arguments expanding directories into their constituent files. It further helps by providing additional mechanisms to make specifying subsets easier with path subtraction and allowing for command-line arguments to be saved in a file. NOTE: this is NOT an options processor. It is a path processor (basically everything else besides options). It does provide a mechanism for pre-filtering cmdline options, but not with the intent of actually processing them in PathExpander. Use OptionParser to deal with options either before or after passing ARGV through PathExpander.
ca: PathExpander ajuda a preprocessar els arguments de la línia d'ordres expandint directoris als seus fitxers constituents. A més, ajuda proporcionant mecanismes addicionals per facilitar l'especificació de subconjunts amb la resta de camins i permetent que els arguments de la línia d'ordres es desen en un fitxer. NOTA: aquest no és un processador d'opcions. És un processador de camins (bàsicament tota la resta a part de les opcions). Proporciona un mecanisme per prefiltrar les opcions de la línia de cm, però no amb la intenció de processar-les realment a PathExpander. Utilitzeu OptionParser per a gestionar les opcions abans o després de passar l'ARGV a través de PathExpander.

source: RDoc documentation for path_expander
ca: Documentació RDoc per a l'explorador de camins

source: Test suite for path_expander
ca: Prova el conjunt per a «pathexpander»

source: Almost like Pathname but just a little less insane
ca: Gairebé com Pathname però una mica menys boig

source: Like Pathname but a little less insane.
ca: Com Pathname però una mica menys boig.

source: RDoc documentation for pathutil
ca: Documentació RDoc per a pathutil

source: Pg is the Ruby interface to the PostgreSQL RDBMS
ca: Pg és la interfície Ruby al RDBMS PostgreSQL

source: Pg is the Ruby interface to the {PostgreSQL RDBMS}[http://www.postgresql.org/]. It works with {PostgreSQL 9.2 and later}[http://www.postgresql.org/support/versioning/]. A small example usage: require 'pg' conn = PG.connect( dbname: 'sales' ) conn.exec( "SELECT * FROM pg_stat_activity" ) do |result| puts " PID | User | Query" result.each do |row| puts " %7d | | %s " % row.values_at('procpid', 'usename', 'current_query') end end.
ca: Pg és la interfície Ruby a {PostgreSQL RDBMS}[http://www.postgresql.org/]. Funciona amb {PostgreSQL 9.2 i posteriors}[http://www.postgresql.org/support/versioning/]. Un petit ús d'exemple: requereix «pg» conn . PG.connect( dbname: 'sales' ) conn.exec( "SELECT * FROM pgstatactivity" ) do .result. posa " PID . User . Consulta" resultat.each do .row. posa " %7d . . %s " % row.valuesat('procpid', 'usename', 'currentquery') final.

source: RDoc documentation for pg
ca: Documentació RDoc per a pg

source: Test suite for pg
ca: Prova de conjunt per a pg

source: A pkg-config implementation for Ruby
ca: Una implementació de pkg-config per a Ruby

source: pkg-config can be used in your extconf.rb to properly detect need libraries for compiling Ruby native extensions.
ca: pkg-config es pot utilitzar en el vostre extconf.rb per detectar adequadament les biblioteques necessàries per compilar les extensions natives de Ruby.

source: RDoc documentation for pkg-config
ca: Documentació RDoc per a pkg-config

source: Test suite for pkg-config
ca: Prova el conjunt per a pkg-config

source: Convert gettext PO files to JSON
ca: Converteix fitxers PO de gettext a JSON

source: Convert gettext PO files to JSON objects so that you can use it in your application.
ca: Converteix fitxers PO de gettext en objectes JSON perquè pugueu utilitzar-los en la vostra aplicació.

source: RDoc documentation for po_to_json
ca: Documentació RDoc per a potojson

source: Test suite for po_to_json
ca: Conjunt de proves per a potojson

source: Augment 'require' to load non-Ruby file types
ca: Augmenta el «require» per a carregar tipus de fitxers que no siguin «Ruby»

source: The Polyglot library allows a Ruby module to register a loader for the file type associated with a filename extension, and it augments 'require' to find and load matching files.
ca: La biblioteca Polyglot permet que un mòdul Ruby registri un carregador per al tipus de fitxer associat amb una extensió de nom de fitxer, i augmenta «requereix» per a trobar i carregar fitxers que coincideixin.

source: RDoc documentation for polyglot
ca: Documentació RDoc per al poliglot

source: An IRB alternative and runtime developer console
ca: Una consola de desenvolupadors alternativa i en temps d'execució de l'IRB

source: An IRB alternative and runtime developer console.
ca: Una consola de desenvolupament alternativa i en temps d'execució de l'IRB.

source: Provides YARD and extended documentation support for Pry
ca: Proporciona suport de documentació ampliada i YARD per a Pry

source: Pry Doc is a Pry REPL plugin. It provides extended documentation support for the REPL by means of improving the `show-doc` and `show-source` commands. With help of the plugin the commands are be able to display the source code and the docs of Ruby methods and classes implemented in C.
ca: Pry Doc és un connector Pry REPL. Proporciona suport de documentació ampliat per a la REPL mitjançant la millora de les ordres theshow-doc. i theshow-source.. Amb l'ajuda del connector, les ordres són capaces de mostrar el codi font i els documents dels mètodes i classes de Ruby implementats en C.

source: Test suite for pry-doc
ca: Test suite per a pry-doc

source: Domain name parser based on the Public Suffix List
ca: Analitzador de noms de domini basat en la llista de sufixos públics

source: PublicSuffix can parse and decompose a domain name into top level domain, domain and subdomains.
ca: PublicSuffix pot analitzar i descompondre un nom de domini en domini de primer nivell, domini i subdominis.

source: RDoc documentation for public_suffix
ca: Documentació RDoc per al sufix públic

source: Test suite for public_suffix
ca: Prova de suite per al sufix públic

source: Puma is a simple, fast, threaded, and highly concurrent HTTP 1.1
ca: Puma és un HTTP 1.1 senzill, ràpid, amb fils i molt concurrent

source: Puma is a simple, fast, threaded, and highly concurrent HTTP 1.1 server for Ruby/Rack applications. Puma is intended for use in both development and production environments. It's great for highly concurrent Ruby implementations such as Rubinius and JRuby as well as as providing process worker support to support CRuby well.
ca: Puma és un servidor HTTP 1.1 senzill, ràpid, amb fils i molt concurrent per a aplicacions Ruby/Rack. Puma està destinat a ser utilitzat tant en entorns de desenvolupament com de producció. És genial per a implementacions Ruby altament concurrents com Rubinius i JRuby, així com proporcionar suport als treballadors de processos per donar suport a CRuby.

source: RDoc documentation for puma
ca: Documentació RDoc per a puma

source: A modular Ruby webserver interface
ca: Una interfície modular del servidor web Ruby

source: Rack provides a minimal, modular and adaptable interface for developing web applications in Ruby. By wrapping HTTP requests and responses in the simplest way possible, it unifies and distills the API for web servers, web frameworks, and software in between (the so-called middleware) into a single method call. Also see http://rack.github.io/.
ca: Rack proporciona una interfície mínima, modular i adaptable per al desenvolupament d'aplicacions web a Ruby. En embolicar les sol·licituds i respostes HTTP de la manera més senzilla possible, unifica i destil·la l'API per a servidors web, frameworks web i programari entremig (l'anomenat middleware) en una única crida de mètode. Vegeu també http://rack.github.io/.

source: Rack provides a minimal, modular and adaptable interface for developing web applications in Ruby. By wrapping HTTP requests and responses in the simplest way possible, it unifies and distills the API for web servers, web frameworks, and software in between (the so-called middleware) into a single method call. Also see https://rack.github.io/.
ca: Rack proporciona una interfície mínima, modular i adaptable per al desenvolupament d'aplicacions web a Ruby. En embolicar les sol·licituds i respostes HTTP de la manera més senzilla possible, unifica i destil·la l'API per a servidors web, frameworks web i programari entremig (l'anomenat middleware) en una única crida de mètode. Vegeu també https://rack.github.io/.

source: HTTP Accept* for Ruby/Rack
ca: Acceptació HTTP* per a Ruby/Rack

source: HTTP Accept, Accept-Charset, Accept-Encoding, and Accept-Language for Ruby/Rack.
ca: HTTP Accepta, Accepta el joc, Accepta la codificació i Accepta l'idioma per a Ruby/Rack.

source: RDoc documentation for rack-accept
ca: Documentació RDoc per a rack-accept

source: Test suite for rack-accept
ca: Prova el conjunt per acceptar el rack

source: RDoc documentation for rack
ca: Documentació RDoc per al rack

source: OAuth 2.0 Server & Client Library - Both Bearer and MAC token type
ca: Biblioteca del client del servidor OAuth 2.0 - Tant del tipus Bearer com del tipus de testimoni MAC

source: OAuth 2.0 Server & Client Library. Both Bearer and MAC token type are supported.
ca: Biblioteca del client del servidor OAuth 2.0. Tant el tipus Bearer com el tipus MAC són compatibles.

source: RDoc documentation for rack-oauth2
ca: Documentació RDoc per a rack-oauth2

source: Test suite for rack-oauth2
ca: Conjunt de proves per al rack-oauth2

source: Protect against typical web attacks, works with all Rack apps,
ca: Protegeix contra atacs web típics, funciona amb totes les aplicacions Rack,

source: Protect against typical web attacks, works with all Rack apps, including Rails.
ca: Protegeix contra atacs web típics, funciona amb totes les aplicacions Rack, incloent Rails.

source: RDoc documentation for rack-protection
ca: Documentació RDoc per a la protecció de cremalleres

source: A request/response rewriting HTTP proxy. A Rack app
ca: Una sol·licitud/resposta reescrivint el servidor intermediari HTTP. Una aplicació de Rack

source: A Rack app that provides request/response rewriting proxy capabilities with streaming.
ca: Una aplicació Rack que proporciona capacitats de reescriptura de sol·licituds/respostes amb streaming.

source: RDoc documentation for rack-proxy
ca: Documentació RDoc per al rack-proxy

source: Test suite for rack-proxy
ca: Prova el conjunt per al rack-proxy

source: Simple testing API built on Rack
ca: API de proves simples construïda a Rack

source: Rack::Test is a small, simple testing API for Rack apps. It can be used on its own or as a reusable starting point for Web frameworks and testing libraries to build on. Most of its initial functionality is an extraction of Merb 1.0's request helpers feature.
ca: Rack::Test és una API de proves petita i senzilla per a aplicacions Rack. Es pot utilitzar per si sol o com a punt de partida reutilitzable per als frameworks web i les biblioteques de proves per construir. La major part de la seva funcionalitat inicial és una extracció de la funció d'ajudants de peticions de Merb 1.0.

source: RDoc documentation for rack-test
ca: Documentació del RDoc per a la prova de rack

source: Test suite for rack-test
ca: Conjunt de proves per a rack-test

source: Test suite for rack
ca: Prova el conjunt per al faristol

source: Full-stack web application framework
ca: Marc d'aplicacions web de pila completa

source: Ruby on Rails is a full-stack web framework optimized for programmer happiness and sustainable productivity. It encourages beautiful code by favoring convention over configuration.
ca: Ruby on Rails és un framework web de full-stack optimitzat per a la felicitat del programador i la productivitat sostenible. Fomenta el codi bonic afavorint la convenció sobre la configuració.

source: Deprecated sanitizer API extracted from Action View
ca: API desinfectant obsoleta extreta de la vista d'acció

source: Deprecated sanitizer API extracted from Action View.
ca: API desinfectant obsoleta extreta de la vista d'acció.

source: RDoc documentation for rails-deprecated_sanitizer
ca: Documentació RDoc per a rails-deprecatedsanitizer

source: Test suite for rails-deprecated_sanitizer
ca: Conjunt de proves per a rails-deprecatedsanitizer

source: RDoc documentation for rails
ca: Documentació RDoc per a rails

source: Dom and Selector assertions for Rails applications
ca: Afirmacions Dom i Selector per a aplicacions Rails

source: This gem can compare doms and assert certain elements exists in doms using Nokogiri. .
ca: Aquesta joia pot comparar les nines i afirmar que hi ha certs elements en les nines utilitzant Nokogiri. .

source: RDoc documentation for rails-dom-testing
ca: Documentació RDoc per a proves de rails

source: Test suite for rails-dom-testing
ca: Conjunt de proves per a proves de rails-dom-testing

source: HTML sanitization to Rails applications (part of Rails)
ca: Aplicacions HTML de desinfecció a Rails (part de Rails)

source: HTML sanitization for Rails applications.
ca: Higienització HTML per a aplicacions Rails.

source: RDoc documentation for rails-html-sanitizer
ca: Documentació RDoc per a rails-html-sanitizer

source: Test suite for rails-html-sanitizer
ca: Conjunt de proves per a rails-html-sanitizer

source: Overrides Rails' built in logger to send all logs to stdout
ca: Sobreescriu els registres construïts per Rails per enviar tots els registres a stdout

source: Sets Rails to log to stdout.
ca: Estableix les línies a iniciar sessió a stdout.

source: RDoc documentation for rails_stdout_logging
ca: Documentació RDoc per a railsstdoutlogging

source: Test suite for rails_stdout_logging
ca: Conjunt de proves per a railsstdoutlogging

source: Tools for creating, working with, and running Rails applications
ca: Eines per a crear, treballar i executar aplicacions Rails

source: Rails internals: application bootup, plugins, generators, and rake tasks.
ca: Interns de les vies: arrencades d'aplicacions, connectors, generadors i tasques de rake.

source: RDoc documentation for railties
ca: Documentació RDoc per a railties

source: real-time stats for preforking Rack servers
ca: estadístiques en temps real per a preforjar servidors Rack

source: raindrops is a real-time stats toolkit to show statistics for Rack HTTP servers. It is designed for preforking servers such as unicorn, but should support any Rack HTTP server on platforms supporting POSIX shared memory. It may also be used as a generic scoreboard for sharing atomic counters across multiple processes.
ca: raindrops és un conjunt d'eines d'estadístiques en temps real per a mostrar estadístiques dels servidors HTTP de Rack. Està dissenyat per a la preforja de servidors com unicorn, però hauria de donar suport a qualsevol servidor HTTP Rack en plataformes que suportin memòria compartida POSIX. També es pot utilitzar com a marcador genèric per compartir comptadors atòmics en múltiples processos.

source: RDoc documentation for raindrops
ca: Documentació RDoc per a gotes de pluja

source: Test suite for raindrops
ca: Conjunt de proves per a gotes de pluja

source: Rake is a Make-like program implemented in Ruby
ca: Rake és un programa Make-like implementat a Ruby

source: Rake is a Make-like program implemented in Ruby. Tasks and dependencies are specified in standard Ruby syntax. Rake has the following features: * Rakefiles (rake's version of Makefiles) are completely defined in standard Ruby syntax. No XML files to edit. No quirky Makefile syntax to worry about (is that a tab or a space?) * Users can specify tasks with prerequisites. * Rake supports rule patterns to synthesize implicit tasks. * Flexible FileLists that act like arrays but know about manipulating file names and paths. * A library of prepackaged tasks to make building rakefiles easier. For example, tasks for building tarballs and publishing to FTP or SSH sites. (Formerly tasks for building RDoc and Gems were included in rake but they're now available in RDoc and RubyGems respectively.) * Supports parallel execution of tasks.
ca: Rake és un programa Make-like implementat a Ruby. Les tasques i dependències s'especifiquen en la sintaxi Ruby estàndard. Rake té les següents característiques: * Els fitxers Rake (versió de Makefiles) estan completament definits en la sintaxi Ruby estàndard. No hi ha fitxers XML a editar. No hi ha cap sintaxi de Makefile peculiar per a preocupar-se (és una pestanya o un espai?) * Els usuaris poden especificar tasques amb prerequisits. * Rake admet patrons de regles per sintetitzar tasques implícites. * Llistes de fitxers flexibles que actuen com a matrius però que saben sobre la manipulació de noms de fitxer i camins. * Una biblioteca de tasques preempaquetades per facilitar la construcció de fitxers rake. Per exemple, tasques per construir tarballs i publicar a llocs FTP o SSH. (Antigament les tasques de construcció de RDoc i Gems estaven incloses en rake, però ara estan disponibles en RDoc i RubyGems, respectivament.) * Permet l'execució paral·lela de tasques.

source: Rake is a Make-like program implemented in Ruby. Tasks and dependencies are specified in standard Ruby syntax. Rake has the following features: * Rakefiles (rake's version of Makefiles) are completely defined in standard Ruby syntax. No XML files to edit. No quirky Makefile syntax to worry about (is that a tab or a space?) * Users can specify tasks with prerequisites. * Rake supports rule patterns to synthesize implicit tasks. * Flexible FileLists that act like arrays but know about manipulating file names and paths. * Supports parallel execution of tasks.
ca: Rake és un programa Make-like implementat a Ruby. Les tasques i dependències s'especifiquen en la sintaxi Ruby estàndard. Rake té les següents característiques: * Els fitxers Rake (versió de Makefiles) estan completament definits en la sintaxi Ruby estàndard. No hi ha fitxers XML a editar. No hi ha cap sintaxi de Makefile peculiar per a preocupar-se (és una pestanya o un espai?) * Els usuaris poden especificar tasques amb prerequisits. * Rake admet patrons de regles per sintetitzar tasques implícites. * Llistes de fitxers flexibles que actuen com a matrius però que saben sobre la manipulació de noms de fitxer i camins. * Permet l'execució paral·lela de tasques.

source: RDoc documentation for rake
ca: Documentació RDoc per al rake

source: Very simple & usable FSEvents API
ca: API de FSEvents usables molt simple

source: FSEvents API with Signals catching (without RubyCocoa).
ca: API de FSEvents amb Senyals capturant (sense RubyCocoa).

source: RDoc documentation for rb-fsevent
ca: Documentació RDoc per a rb-fsevent

source: A Ruby wrapper for Linux inotify, using FFI
ca: Un embolcall Ruby per a Linux inotify, utilitzant FFI

source: A Ruby wrapper for Linux inotify, using FFI.
ca: Un embolcall Ruby per a Linux inotify, utilitzant FFI.

source: RDoc documentation for rb-inotify
ca: Documentació RDoc per a rb-inotify

source: Test suite for rb-inotify
ca: Test suite per a rb-inotify

source: A Ruby wrapper for BSD's kqueue, using FFI
ca: Un embolcall Ruby per al kqueue de BSD, utilitzant FFI

source: A Ruby wrapper for BSD's kqueue, using FFI.
ca: Un embolcall Ruby per a la kqueue de BSD, utilitzant FFI.

source: RDoc documentation for rb-kqueue
ca: Documentació RDoc per a rb-kqueue

source: Test suite for rb-kqueue
ca: Conjunt de proves per a rb-kqueue

source: Fast Implementation of Gruber's Markdown in C
ca: Implementació ràpida del Markdown de Gruber en C

source: Fast Implementation of Gruber's Markdown in C.
ca: Implementació ràpida del Markdown de Gruber en C.

source: RDoc documentation for rdiscount
ca: Documentació RDoc per al descompte

source: Test suite for rdiscount
ca: Prova el conjunt per al descompte

source: Markdown that smells nice
ca: Markdown que fa bona olor

source: A fast, safe and extensible Markdown to (X)HTML parser.
ca: Un Markdown ràpid, segur i extensible a l'analitzador (X)HTML.

source: RDoc documentation for redcarpet
ca: Documentació RDoc per a la catifa vermella

source: Test suite for redcarpet
ca: Conjunt de proves per a la catifa vermella

source: A set of Rails responders to dry up your application
ca: Un conjunt de responedors de Rails per assecar la teva aplicació

source: A set of Rails responders to dry up your application.
ca: Un conjunt de responedors de Rails per assecar la teva aplicació.

source: RDoc documentation for responders
ca: Documentació RDoc per als enquestadors

source: Simple HTTP and REST client for Ruby, inspired by microframework
ca: Client HTTP i REST senzill per a Ruby, inspirat en microframework

source: A simple HTTP and REST client for Ruby, inspired by the Sinatra microframework style of specifying actions: get, put, post, delete.
ca: Un client HTTP i REST senzill per a Ruby, inspirat en l'estil de microestructura de Sinatra per especificar accions: get, put, post, delete.
