Repository: openSUSE/packages-i18n
Catalog: */po/rubygem.*.po
Languages: ca

source: CoffeeScript adapter for the Rails asset pipeline
ca: Adaptador CoffeeScript per al gasoducte d'actius Rails

source: CoffeeScript adapter for the Rails asset pipeline.
ca: Adaptador CoffeeScript per a la canonada d'actius Rails.

source: RDoc documentation for coffee-rails
ca: Documentació del RDoc per a cafeteres

source: Ruby CoffeeScript Compiler
ca: Ruby CoffeeScript Compilador

source: Ruby CoffeeScript is a bridge to the JS CoffeeScript compiler.
ca: Ruby CoffeeScript és un pont cap al compilador JS CoffeeScript.

source: RDoc documentation for coffee-script
ca: Documentació RDoc per a coffee-script

source: The CoffeeScript Compiler
ca: El compilador CoffeeScript

source: CoffeeScript is a little language that compiles into JavaScript. Underneath all of those embarrassing braces and semicolons, JavaScript has always had a gorgeous object model at its heart. CoffeeScript is an attempt to expose the good parts of JavaScript in a simple way.
ca: CoffeeScript és un petit llenguatge que compila en JavaScript. Sota totes aquestes avergonyides claus i punt i coma, JavaScript sempre ha tingut un magnífic model d'objecte en el seu cor. CoffeeScript és un intent d'exposar les bones parts de JavaScript d'una manera senzilla.

source: RDoc documentation for coffee-script-source
ca: Documentació RDoc per a coffee-script-source

source: Add some color to your life
ca: Afegeix una mica de color a la teva vida

source: >> puts "this is red".red >> puts "this is red with a blue background (read: ugly)".red_on_blue >> puts "this is red with an underline".red.underline >> puts "this is really bold and really blue".bold.blue >> logger.debug "hey this is broken!".red_on_yellow # in rails >> puts Color.red "This is red" # but this part is mostly untested.
ca: . posa "això és vermell".red . posa "això és vermell amb un fons blau (llegir: lleig)".redonblue . posa "això és vermell amb un subratllat".red.underline . posa "això és realment negreta i realment blau".bold.blue . logger.debug "escolta això està trencat!".redonyellow . en rails . posa Color.red "Això és vermell" . però aquesta part és majoritàriament no provada.

source: RDoc documentation for colored
ca: Documentació RDoc per a color

source: Test suite for colored
ca: Conjunt de proves per a color

source: Modern concurrency tools for Ruby. Inspired by Erlang, Clojure,
ca: Eines modernes de concurrència per a Ruby. Inspirat en Erlang, Clojure,

source: Modern concurrency tools including agents, futures, promises, thread pools, actors, supervisors, and more. Inspired by Erlang, Clojure, Go, JavaScript, actors, and classic concurrency patterns.
ca: Eines modernes de concurrència que inclouen agents, futurs, promeses, piscines de fils, actors, supervisors, i més. Inspirat en Erlang, Clojure, Go, JavaScript, actors i patrons de concurrència clàssics.

source: RDoc documentation for concurrent-ruby
ca: Documentació RDoc per a concurrent-ruby

source: Really simple JSON and XML parsing, ripped from Merb and Rails
ca: Anàlisi JSON i XML realment senzill, extret de Merb i Rails

source: Really simple JSON and XML parsing, ripped from Merb and Rails.
ca: Anàlisi JSON i XML realment senzill, extret de Merb i Rails.

source: RDoc documentation for crack
ca: Documentació del RDoc per al crack

source: Test suite for crack
ca: Test suite per a crack

source: CSS parser based on the CSS Syntax Level 3 spec
ca: Analitzador CSS basat en l'especificació CSS Syntax Level 3

source: Crass is a pure Ruby CSS parser based on the CSS Syntax Level 3 spec.
ca: Crass és un analitzador de CSS Ruby pur basat en l'especificació CSS Syntax Level 3.

source: RDoc documentation for crass
ca: Documentació RDoc per a crass

source: Test suite for crass
ca: Test suite per a crass

source: A Ruby wrapper for the MRI 2.0 debug_inspector API
ca: Un embolcall Ruby per a l'API de l'inspector de depuració MRI 2.0

source: A Ruby wrapper for the MRI 2.0 debug_inspector API.
ca: Un embolcall Ruby per a l'API de l'inspector de depuració MRI 2.0.

source: RDoc documentation for debug_inspector
ca: Documentació del RDoc per a l'inspector de depuració

source: Test suite for debug_inspector
ca: Prova el conjunt per a l'inspector de depuració

source: Database-backed asynchronous priority queue system -- Extracted from
ca: Sistema de cua de prioritat asíncrona amb suport de base de dades -- extret de

source: Delayed_job (or DJ) encapsulates the common pattern of asynchronously executing longer tasks in the background. It is a direct extraction from Shopify where the job table is responsible for a multitude of core tasks.
ca: Delayedjob (o DJ) encapsula el patró comú d'executar asíncronament tasques més llargues en segon pla. És una extracció directa de Shopify on la taula de treball és responsable de multitud de tasques bàsiques.

source: RDoc documentation for delayed_job
ca: Documentació RDoc per a delayedjob

source: Test suite for delayed_job
ca: Prova el conjunt per a treballs retardats

source: Module that adds descendant tracking to a class
ca: Mòdul que afegeix seguiment descendent a una classe

source: Module that adds descendant tracking to a class.
ca: Mòdul que afegeix seguiment descendent a una classe.

source: RDoc documentation for descendants_tracker
ca: Documentació RDoc per a «descendentstracker»

source: Test suite for descendants_tracker
ca: Prova el conjunt per al «descendenttracker»

source: Flexible authentication solution for Rails with Warden
ca: Solució d'autenticació flexible per Rails amb Warden

source: Flexible authentication solution for Rails with Warden.
ca: Solució d'autenticació flexible per a Rails amb Guardià.

source: RDoc documentation for devise
ca: Documentació RDoc per a la idea

source: Translations for the devise gem
ca: Traduccions per a la joia de l'elaboració

source: Translations for the devise gem.
ca: Traduccions per a la joia de la idea.

source: RDoc documentation for devise-i18n
ca: Documentació RDoc per a devise-i18n

source: Test suite for devise
ca: Test suite per a idear

source: Devise extension to allow authentication via LDAP
ca: Defineix l'extensió per a permetre l'autenticació via LDAP

source: Devise extension to allow authentication via LDAP.
ca: Dissenya l'extensió per permetre l'autenticació via LDAP.

source: RDoc documentation for devise_ldap_authenticatable
ca: Documentació RDoc per a «deviseldapauthenticatable»

source: Test suite for devise_ldap_authenticatable
ca: Prova el conjunt per a «deviseldapauthenticatable»

source: Diff::LCS computes the difference between two Enumerable sequences
ca: Diff::LCS calcula la diferència entre dues seqüències enumerables

source: Diff::LCS computes the difference between two Enumerable sequences using the McIlroy-Hunt longest common subsequence (LCS) algorithm. It includes utilities to create a simple HTML diff output format and a standard diff-like tool. This is release 1.3, providing a tentative fix to a long-standing issue related to incorrect detection of a patch direction. Also modernizes the gem infrastructure, testing infrastructure, and provides a warning-free experience to Ruby 2.4 users.
ca: Diff::LCS calcula la diferència entre dues seqüències enumerables utilitzant l'algorisme de la subseqüència comuna més llarga de McIlroy-Hunt (LCS). Inclou utilitats per crear un format de sortida de diferències HTML simple i una eina estàndard similar a les diferències. Aquest és el llançament 1.3, proporcionant una solució provisional a un problema de llarga data relacionat amb la detecció incorrecta d'una direcció de pegat. També modernitza la infraestructura de gemmes, prova d'infraestructura i proporciona una experiència sense avisos als usuaris de Ruby 2.4.

source: RDoc documentation for diff-lcs
ca: Documentació RDoc per a diff-lcs

source: Test suite for diff-lcs
ca: Conjunt de proves per a diff-lcs

source: A convenient way to diff string in ruby
ca: Una manera còmoda de difondre la cadena en ruby

source: Convenient diffing in ruby.
ca: Difusió convenient en rubí.

source: RDoc documentation for diffy
ca: Documentació RDoc per a diffy

source: Test suite for diffy
ca: Prova el conjunt per a diffy

source: Ruby gem to treat Ruby objects as a domain-specific language
ca: Gem de Ruby per tractar els objectes de Ruby com un llenguatge específic de domini

source: Docile treats the methods of a given ruby object as a DSL (domain specific language) within a given block. Killer feature: you can also reference methods, instance variables, and local variables from the original (non-DSL) context within the block. Docile releases follow Semantic Versioning as defined at semver.org.
ca: Docile tracta els mètodes d'un objecte ruby donat com una DSL (llenguatge específic del domini) dins d'un bloc donat. Funció Killer: també podeu fer referència a mètodes, variables d'instància i variables locals del context original (no-DSL) dins del bloc. Les versions dòcils segueixen la versió semàntica tal com es defineix a semver.org.

source: Docile turns any Ruby object into a DSL. Especially useful with the Builder pattern.
ca: Dòcil converteix qualsevol objecte Ruby en un DSL. Especialment útil amb el patró del constructor.

source: RDoc documentation for docile
ca: Documentació RDoc per a dòcil

source: Test suite for docile
ca: Conjunt de proves per a dòcil

source: Domain Name manipulation library for Ruby
ca: Biblioteca de manipulació de noms de domini per a Ruby

source: This is a Domain Name manipulation library for Ruby. It can also be used for cookie domain validation based on the Public Suffix List.
ca: Aquesta és una biblioteca de manipulació de noms de domini per a Ruby. També es pot utilitzar per a la validació del domini de cookies basada en la Llista de Sufixos Públics.

source: RDoc documentation for domain_name
ca: Documentació RDoc per al nom de domini

source: Test suite for domain_name
ca: Prova el conjunt per al domini

source: An efficient digital signature library providing the Ed25519
ca: Una biblioteca de signatura digital eficient que proporciona l'Ed25519

source: A Ruby binding to the Ed25519 elliptic curve public-key signature system described in RFC 8032.
ca: Una unió de Ruby al sistema de signatura de clau pública de corba el·líptica Ed25519 descrit en RFC 8032.

source: RDoc documentation for ed25519
ca: Documentació RDoc per a ed25519

source: EventMachine based WebSocket server
ca: Servidor WebSocket basat en EventMachine

source: EventMachine based WebSocket server.
ca: Servidor WebSocket basat en EventMachine.

source: RDoc documentation for em-websocket
ca: Documentació RDoc per a em-websocket

source: Test suite for em-websocket
ca: Test suite per a em-websocket

source: Module to define equality, equivalence and inspection methods
ca: Mòdul per definir mètodes d'igualtat, equivalència i inspecció

source: Module to define equality, equivalence and inspection methods.
ca: Mòdul per definir mètodes d'igualtat, equivalència i inspecció.

source: RDoc documentation for equalizer
ca: Documentació RDoc per a equalitzador

source: Test suite for equalizer
ca: Prova el conjunt per a l'equalitzador

source: Small ERB Implementation
ca: Implementació petita d'ERB

source: Erubi is a ERB template engine for ruby. It is a simplified fork of Erubis.
ca: Erubi és un motor de plantilles ERB per a ruby. És una forquilla simplificada d'Erubis.

source: RDoc documentation for erubi
ca: Documentació RDoc per a erubi

source: a fast and extensible eRuby implementation which supports
ca: una implementació d'eRuby ràpida i extensible que suporta

source: Erubis is an implementation of eRuby and has the following features: * Very fast, almost three times faster than ERB and about 10% faster than eruby. * Multi-language support (Ruby/PHP/C/Java/Scheme/Perl/Javascript) * Auto escaping support * Auto trimming spaces around '<% %>' * Embedded pattern changeable (default '<% %>') * Enable to handle Processing Instructions (PI) as embedded pattern (ex. '<?rb ... ?>') * Context object available and easy to combine eRuby template with YAML datafile * Print statement available * Easy to extend and customize in subclass * Ruby on Rails support.
ca: Erubis és una implementació d'eRuby i té les següents característiques: * Molt ràpid, gairebé tres vegades més ràpid que ERB i al voltant d'un 10% més ràpid que eruby. * Suport multiidioma (Ruby/PHP/C/Java/Scheme/Perl/Javascript) * Suport d'escapament automàtic * Es retallen automàticament els espais al voltant de '<% %>' * Patró incrustat modificable (predeterminat '<% %>') * Habilita per gestionar les instruccions de processament (PI) com a patró incrustat (ex. '<?rb ... ?>') * Objecte contextual disponible i fàcil de combinar la plantilla eRuby amb el fitxer de dades YAML * Expressió d'impressió disponible * Fàcil d'estendre i personalitzar en subclasse * Suport Ruby on Rails.

source: RDoc documentation for erubis
ca: Documentació RDoc per a erubis

source: Test suite for erubis
ca: Conjunt de proves per a erubis

source: Ruby/EventMachine library
ca: Biblioteca Ruby/EventMachine

source: EventMachine implements a fast, single-threaded engine for arbitrary network communications. It's extremely easy to use in Ruby. EventMachine wraps all interactions with IP sockets, allowing programs to concentrate on the implementation of network protocols. It can be used to create both network servers and clients. To create a server or client, a Ruby program only needs to specify the IP address and port, and provide a Module that implements the communications protocol. Implementations of several standard network protocols are provided with the package, primarily to serve as examples. The real goal of EventMachine is to enable programs to easily interface with other programs using TCP/IP, especially if custom protocols are required.
ca: EventMachine implementa un motor ràpid i d'un sol fil per a comunicacions de xarxa arbitràries. És extremadament fàcil d'utilitzar a Ruby. EventMachine embolcalla totes les interaccions amb sòcols IP, permetent que els programes es concentrin en la implementació de protocols de xarxa. Es pot utilitzar per crear tant servidors de xarxa com clients. Per crear un servidor o client, un programa Ruby només ha d'especificar l'adreça IP i el port, i proporcionar un Mòdul que implementi el protocol de comunicacions. Les implementacions de diversos protocols de xarxa estàndard es proporcionen amb el paquet, principalment per servir com a exemples. L'objectiu real d'EventMachine és permetre que els programes puguin interactuar fàcilment amb altres programes utilitzant TCP/IP, especialment si es requereixen protocols personalitzats.

source: RDoc documentation for eventmachine
ca: Documentació RDoc per a la màquina d'esdeveniments

source: speed, persistence, http(s)
ca: velocitat, persistència, http(s)

source: EXtended http(s) CONnections.
ca: Conneccions http(s) extingides.

source: RDoc documentation for excon
ca: Documentació RDoc per a excon

source: Run JavaScript code from Ruby
ca: Executa el codi JavaScript de Ruby

source: ExecJS lets you run JavaScript code from Ruby.
ca: ExecJS us permet executar codi JavaScript des de Ruby.

source: RDoc documentation for execjs
ca: Documentació RDoc per a execjs

source: factory_girl provides a framework and DSL for defining and using
ca: factorygirl proporciona un marc i DSL per definir i utilitzar

source: factory_girl provides a framework and DSL for defining and using factories - less error-prone, more explicit, and all-around easier to work with than fixtures.
ca: factorygirl proporciona un marc i una DSL per definir i utilitzar fàbriques - menys propenses a errors, més explícites i més fàcils de treballar que els fixtures.

source: RDoc documentation for factory_girl
ca: Documentació RDoc per a factorygirl

source: A fake FTP server for use with RSpec
ca: Un servidor FTP fals per utilitzar amb RSpec

source: This is a gem that allows you to test FTP implementations in ruby. It is a minimal single-client FTP server that can be bound to any arbitrary port on localhost.
ca: Aquesta és una joia que permet provar les implementacions FTP en ruby. És un servidor FTP mínim d'un sol client que pot estar lligat a qualsevol port arbitrari en localhost.

source: RDoc documentation for fake_ftp
ca: Documentació RDoc per a «fakeftp»

source: Test suite for fake_ftp
ca: Prova el conjunt per a «fakeftp»

source: HTTP/REST API client library
ca: Biblioteca de client API HTTP/REST

source: HTTP/REST API client library.
ca: Biblioteca client API HTTP/REST.

source: RDoc documentation for faraday
ca: Documentació RDoc per a faraday

source: Various middleware for Faraday
ca: Diversos middleware per a Faraday

source: Various middleware for Faraday.
ca: Diversos middleware per a Faraday.

source: RDoc documentation for faraday_middleware
ca: Documentació RDoc per a faradaymiddleware

source: A simple, fast, memory-efficient and threadsafe implementation of
ca: Una implementació senzilla, ràpida, eficient en memòria i segura de fils

source: A simple, fast, memory-efficient and threadsafe implementation of GetText.
ca: Una implementació senzilla, ràpida, eficient en memòria i segura de fils de GetText.

source: RDoc documentation for fast_gettext
ca: Documentació RDoc per a fastgettext

source: Ruby FFI library.
ca: Biblioteca Ruby FFI.

source: RDoc documentation for ffi
ca: Documentació RDoc per a ffi

source: Test suite for ffi
ca: Prova el conjunt per a la ffi

source: Shared classes and tests for fog providers and services
ca: Classes i proves compartides per a proveïdors i serveis de boira

source: Shared classes and tests for fog providers and services.
ca: Classes i proves compartides per a proveïdors i serveis de boira.

source: RDoc documentation for fog-core
ca: Documentació RDoc per a fog-core

source: Test suite for fog-core
ca: Prova el conjunt per al nucli de boira

source: JSON parsing for fog providers
ca: Anàlisi JSON per a proveïdors de boira

source: Extraction of the JSON parsing tools shared between a number of providers in the 'fog' gem.
ca: Extracció de les eines d'anàlisi JSON compartides entre diversos proveïdors de la gemma «boira».

source: RDoc documentation for fog-json
ca: Documentació RDoc per a fog-json

source: Test suite for fog-json
ca: Test suite per a fog-json

source: Module for the 'fog' gem to support libvirt
ca: Mòdul per a la gemma «boira» per a admetre libvirt

source: This library can be used as a module for 'fog' or as standalone libvirt provider.
ca: Aquesta biblioteca es pot utilitzar com a mòdul per a «fog» o com a proveïdor independent de libvirt.

source: RDoc documentation for fog-libvirt
ca: Documentació RDoc per a fog-libvirt

source: XML parsing for fog providers
ca: Anàlisi XML per a proveïdors de boira

source: Extraction of the XML parsing tools shared between a number of providers in the 'fog' gem.
ca: Extracció de les eines d'anàlisi XML compartides entre un nombre de proveïdors de la gemma «boira».

source: RDoc documentation for fog-xml
ca: Documentació RDoc per a fog-xml

source: Test suite for fog-xml
ca: Test suite per fog-xml

source: an asset gemification of the font-awesome icon font library
ca: una gemificació d'actius de la biblioteca de tipus de lletra de les icones font-awesome

source: font-awesome-rails provides the Font-Awesome web fonts and stylesheets as a Rails engine for use with the asset pipeline.
ca: Font-awesome-rails proporciona les fonts web i fulls d'estil Font-Awesome com a motor Rails per al seu ús amb el pipeline d'actius.

source: RDoc documentation for font-awesome-rails
ca: Documentació RDoc per a fonts-awesome-rails

source: Test suite for font-awesome-rails
ca: Conjunt de proves per a «font-awesome-rails»

source: STDOUT text formatting
ca: Format de text STDOUT

source: Ruby STDOUT text formatting
ca: Format de text Ruby STDOUT

source: RDoc documentation for formatador
ca: Documentació RDoc per al formatador

source: Forwardable with hash, and instance variable extensions
ca: Reenviable amb extensions de hash i de variable instància

source: Forwardable with hash, and instance variable extensions.
ca: Reenviable amb extensions de hash i variables d'instància.

source: RDoc documentation for forwardable-extended
ca: Documentació RDoc per a tramesa

source: Generate rpm specfiles from gems
ca: Genera fitxers spec de rpm a partir de gemmes

source: Generate source rpms and rpm spec files from a Ruby Gem. The spec file tries to follow the gem as closely as possible
ca: Genera fitxers d'especificació rpms i rpm d'origen a partir d'una Gem de Ruby. El fitxer spec intenta seguir la joia el més de prop possible

source: RDoc documentation for gem2rpm
ca: Documentació RDoc per a gem2rpm

source: Use GetProcessMem to find out the amount of RAM used by any process
ca: Utilitza GetProcessMem per saber la quantitat de RAM utilitzada per qualsevol procés

source: Get memory usage of a process in Ruby .
ca: Obtenir l'ús de la memòria d'un procés a Ruby.

source: RDoc documentation for get_process_mem
ca: Documentació RDoc per a getprocessmem

source: Test suite for get_process_mem
ca: Test suite per a getprocessmem

source: Gettext is a pure Ruby libary and tools to localize messages
ca: Gettext és un bibliotecari Ruby pur i eines per localitzar missatges

source: Gettext is a GNU gettext-like program for Ruby. The catalog file(po-file) is same format with GNU gettext. So you can use GNU gettext tools for maintaining.
ca: Gettext és un programa de GNU per a Ruby. El fitxer de catàleg (po-file) té el mateix format amb GNU gettext. Per tant, podeu utilitzar les eines GNU gettext per mantenir-les.

source: RDoc documentation for gettext
ca: Documentació RDoc per al gettext

source: Test suite for gettext
ca: Prova el conjunt per al gettext

source: Simple FastGettext Rails integration
ca: Integració senzilla de FastGettext Rails

source: Simple FastGettext Rails integration.
ca: Integració senzilla de FastGettext Rails.

source: RDoc documentation for gettext_i18n_rails
ca: Documentació RDoc per a gettexti18nrails

source: Extends gettext_i18n_rails making your .po files available to client
ca: Amplia gettexti18nrails fent que els vostres fitxers .po estiguin disponibles per al client

source: It will find translations inside your .js and .coffee files, then it will create JSON versions of your .PO files and will let you serve them with the rest of your assets, thus letting you access all your translations offline from client side javascript.
ca: Trobarà traduccions dins dels vostres fitxers .js i .coffee, després crearà versions JSON dels vostres fitxers .PO i us permetrà servir-los amb la resta dels vostres actius, permetent-vos així accedir a totes les vostres traduccions fora de línia des del javascript del costat del client.

source: RDoc documentation for gettext_i18n_rails_js
ca: Documentació RDoc per a gettexti18nrailsjs

source: Test suite for gettext_i18n_rails_js
ca: Conjunt de proves per a gettexti18nrailsjs

source: Build command-suite CLI apps that are awesome
ca: Construeix aplicacions CLI de tipus command-suite que són impressionants

source: Build command-suite CLI apps that are awesome. Bootstrap your app, add commands, options and documentation while maintaining a well-tested idiomatic command-line app.
ca: Construeix aplicacions CLI de tipus command-suite que són impressionants. Arrenca la teva aplicació, afegeix ordres, opcions i documentació mentre es manté una aplicació de línia d'ordres idiomàtica ben provada.

source: RDoc documentation for gli
ca: Documentació RDoc per al gli

source: Test suite for gli
ca: Conjunt de proves per al gli

source: Refer to any model with a URI: gid://app/class/id
ca: Consulteu qualsevol model amb un URI: gid://app/class/id
