Repository: openSUSE/packages-i18n
Catalog: */po/rubygem.*.po
Languages: ca

source: Adds methods to RubyVM::DebugInspector to allow for inspection of backtrace frames. The debug_inspector C extension and API were designed and built by Koichi Sasada, this project is just a gemification of his work. This library makes use of the debug inspector API which was added to MRI 2.0.0. Only works on MRI 2 and 3. Requiring it on unsupported Rubies will result in a no-op. Recommended for use only in debugging situations. Do not use this in production apps.
ca: Afegeix mètodes a RubyVM::DebugInspector per permetre la inspecció dels fotogrames de traça inversa. L'extensió debuginspector C i API van ser dissenyats i construïts per Koichi Sasada, aquest projecte és només una gemificació del seu treball. Aquesta biblioteca fa ús de l'API de l'inspector de depuració que s'ha afegit a la IRM 2.0.0. Només funciona amb la ressonància magnètica 2 i 3. Requerir-lo en els Rubins no suportats resultarà en una no-op. Recomanat per al seu ús només en situacions de depuració. No utilitzeu això a les aplicacions de producció.

source: ActiveRecord backend for DelayedJob
ca: Dorsal ActiveRecord per a DelayedJob

source: ActiveRecord backend for Delayed::Job, originally authored by Tobias Lütke.
ca: Dorsal ActiveRecord per a Delayed::Job, originalment escrit per Tobias Lütke.

source: Diff::LCS computes the difference between two Enumerable sequences using the McIlroy-Hunt longest common subsequence (LCS) algorithm. It includes utilities to create a simple HTML diff output format and a standard diff-like tool. This is release 1.4.3, providing a simple extension that allows for Diff::LCS::Change objects to be treated implicitly as arrays and fixes a number of formatting issues. Ruby versions below 2.5 are soft-deprecated, which means that older versions are no longer part of the CI test suite. If any changes have been introduced that break those versions, bug reports and patches will be accepted, but it will be up to the reporter to verify any fixes prior to release. The next major release will completely break compatibility.
ca: Diff::LCS calcula la diferència entre dues seqüències enumerables utilitzant l'algorisme de la subseqüència comuna més llarga de McIlroy-Hunt (LCS). Inclou utilitats per crear un format de sortida de diferències HTML simple i una eina estàndard similar a les diferències. Aquest és el llançament 1.4.3, que proporciona una extensió senzilla que permet que els objectes Diff::LCS::Change siguin tractats implícitament com a matrius i soluciona una sèrie de problemes de format. Les versions Ruby per sota de 2.5 són soft-deprecated, el que significa que les versions més antigues ja no formen part del conjunt de proves CI. Si s'ha introduït algun canvi que trenqui aquestes versions, s'acceptaran informes d'errors i pedaços, però serà tasca del reporter verificar qualsevol esmena abans del llançament. El següent llançament important trencarà completament la compatibilitat.

source: Robust streaming downloads using Net::HTTP, HTTP.rb or wget
ca: Descàrregues en streaming robustes utilitzant Net::HTTP, HTTP.rb o wget

source: Robust streaming downloads using Net::HTTP, HTTP.rb or wget.
ca: Descàrregues en streaming robustes utilitzant Net::HTTP, HTTP.rb o wget.

source: A mixin to add configuration functionality to your classes
ca: Un mixin per afegir funcionalitats de configuració a les vostres classes

source: A mixin to add configuration functionality to your classes.
ca: Un mixin per afegir funcionalitats de configuració a les vostres classes.

source: A simple, configurable object container implemented in Ruby
ca: Un contenidor d'objectes simple i configurable implementat a Ruby

source: A simple, configurable object container implemented in Ruby.
ca: Un contenidor d'objectes simple i configurable implementat a Ruby.

source: A toolset of small support modules used throughout the dry-rb
ca: Un conjunt d'eines de petits mòduls de suport utilitzats al llarg del dry-rb

source: A toolset of small support modules used throughout the dry-rb ecosystem.
ca: Un conjunt d'eines de petits mòduls de suport utilitzats en tot l'ecosistema dry-rb.

source: String inflections for dry-rb
ca: Inflexions de cadena per a dry-rb

source: String inflections for dry-rb.
ca: Inflexions de corda per a la seca-rb.

source: Predicate logic with rule composition
ca: Predicar la lògica amb la composició de regles

source: Predicate logic with rule composition.
ca: Predicar la lògica amb la composició de regles.

source: Type system for Ruby supporting coercions, constraints and complex
ca: Sistema tipus per a Ruby que suporta coercions, restriccions i complexos

source: Type system for Ruby supporting coercions, constraints and complex types like structs, value objects, enums etc.
ca: Sistema tipus per a Ruby que suporta coercions, restriccions i tipus complexos com estructures, objectes de valor, enumeracions, etc.

source: Exception notification for Rails apps
ca: Notificació d'excepció per a les aplicacions Rails

source: Exception notification for Rails apps.
ca: Notificació d'excepció per a les aplicacions Rails.

source: Faraday adapter for Net::HTTP
ca: Adaptador Faraday per a Net::HTTP

source: Faraday adapter for Net::HTTP.
ca: Adaptador Faraday per a Net::HTTP.

source: Ruby FFI Rakefile generator
ca: Generador de fitxers Rake FFI de Ruby

source: Flog reports the most tortured code in an easy to read pain report
ca: Flog informa del codi més torturat en un informe de dolor fàcil de llegir

source: Flog reports the most tortured code in an easy to read pain report. The higher the score, the more pain the code is in.
ca: Flog informa del codi més torturat en un informe de dolor fàcil de llegir. Com més alta sigui la puntuació, més dolor tindrà el codi.

source: Fluentd event collector
ca: Col·leccionista d'esdeveniments fluid

source: Fluentd is an open source data collector designed to scale and simplify log management. It can collect, process and ship many kinds of data in near real-time.
ca: Fluentd és un col·leccionista de dades de codi obert dissenyat per a escalar i simplificar la gestió del registre. Pot recollir, processar i enviar molts tipus de dades en temps real.

source: A gem to ease internationalization with fast_gettext
ca: Una joia per facilitar la internacionalització amb fastgettext

source: A gem to ease i18n.
ca: Una joia per alleujar i18n.

source: Ruby binding of GPGME
ca: Vinculació Ruby del GPGME

source: Ruby-GPGME is a Ruby language binding of GPGME (GnuPG Made Easy). GnuPG Made Easy (GPGME) is a library designed to make access to GnuPG easier for applications. It provides a High-Level Crypto API for encryption, decryption, signing, signature verification and key management.
ca: El Ruby-GPGME és una unió de la llengua Ruby del GPGME (GnuPG Made Easy). GnuPG Made Easy (GPGME) és una biblioteca dissenyada per facilitar l'accés a GnuPG per a aplicacions. Proporciona una API de criptografia d'alt nivell per al xifratge, desxifratge, signatura, verificació de signatures i gestió de claus.

source: Hashdiff is a diff lib to compute the smallest difference between
ca: Hashdiff és una lib de diff per calcular la diferència més petita entre

source: Hashdiff is a diff lib to compute the smallest difference between two hashes. .
ca: Hashdiff és una lib de diff per calcular la diferència més petita entre dos hashes. .

source: Facets-bread collection of Hash-like classes
ca: Col·lecció de facetes-pa de classes semblants a Hash

source: The Hashery is a tight collection of Hash-like classes. Included among its many offerings are the auto-sorting Dictionary class, the efficient LRUHash, the flexible OpenHash and the convenient KeyHash. Nearly every class is a subclass of the CRUDHash which defines a CRUD model on top of Ruby's standard Hash making it a snap to subclass and augment to fit any specific use case.
ca: The Hashery és una col·lecció estreta de classes semblants a Hash. Entre les seves moltes ofertes s'inclouen la classe de Diccionari d'ordenació automàtica, l'eficient LRUHash, el flexible OpenHash i el convenient KeyHash. Gairebé totes les classes són una subclasse del CRUDHash que defineix un model CRUD a la part superior del Hash estàndard de Ruby fent que sigui un ajust a la subclasse i augment per adaptar-se a qualsevol cas d'ús específic.

source: A fast, high resolution timer library for recording peformance metrics. * (http://github.com/copiousfreetime/hitimes) * (http://github.com/copiousfreetime/hitimes) * email jeremy at copiousfreetime dot org * `git clone url git://github.com/copiousfreetime/hitimes.git`.
ca: Una biblioteca de temporitzador ràpida i d'alta resolució per a l'enregistrament de mètriques de peformància. * (http://github.com/copiousfreetime/hitimes) * (http://github.com/copiousfreetime/hitimes) * email jeremy at copiousfreetime dot org * .git clone url git://github.com/copiousfreetime/hitimes.git..

source: Hoe is a rake/rubygems helper for project Rakefiles
ca: Hoe és un ajudant de rake/rubygems per al projecte Rakefiles

source: Hoe is a rake/rubygems helper for project Rakefiles. It helps you manage, maintain, and release your project and includes a dynamic plug-in system allowing for easy extensibility. Hoe ships with plug-ins for all your usual project tasks including rdoc generation, testing, packaging, deployment, and announcement. See class rdoc for help. Hint: `ri Hoe` or any of the plugins listed below. For extra goodness, see: http://docs.seattlerb.org/hoe/Hoe.pdf.
ca: Hoe és un ajudant de rake/rubygems per al projecte Rakefiles. T'ajuda a gestionar, mantenir i alliberar el teu projecte i inclou un sistema de plug-in dinàmic que permet una fàcil extensibilitat. Es distribueix amb connectors per a totes les tasques habituals del projecte, incloent-hi la generació de rdoc, proves, embalatge, desplegament i anunci. Consulteu la classe rdoc per obtenir ajuda. Consell: theri Hoe. o qualsevol dels connectors que es llisten a continuació. Per a més bondat, vegeu: http://docs.seattlerb.org/hoe/Hoe.pdf.

source: HTTP should be easy
ca: HTTP hauria de ser fàcil

source: An easy-to-use client library for making requests from Ruby. It uses a simple method chaining system for building requests, similar to Python's Requests.
ca: Una biblioteca de clients fàcil d'utilitzar per fer sol·licituds de Ruby. Utilitza un sistema d'encadenat senzill per a la construcció de sol·licituds, similar a les sol·licituds de Python.

source: Utility-belt to build form data request bodies. Provides support for `application/x-www-form-urlencoded` and `multipart/form-data` types.
ca: Utility-belt per construir cossos de sol·licitud de dades de formulari. Proporciona suport per als tipus andapplication/x-www-form-urlencoded. i andmultipart/form-data..

source: Ruby bindings to https://github.com/joyent/http-parser and https://github.com/http-parser/http-parser.java.
ca: Enllaços de Ruby a https://github.com/joyent/http-parser i https://github.com/http-parser/http-parser.java.

source: INI file reader and writer
ca: Lector i escriptor de fitxers INI

source: Although made popular by Windows, INI files can be used on any system thanks to their flexibility. They allow a program to store configuration data, which can then be easily parsed and changed. Two notable systems that use the INI format are Samba and Trac. More information about INI files can be found on the [Wikipedia Page](http://en.wikipedia.org/wiki/INI_file). The basic element contained in an INI file is the property. Every property has a name and a value, delimited by an equals sign *=*. The name appears to the left of the equals sign and the value to the right. name=value Section declarations start with *[* and end with *]* as in `[section1]` and `[section2]` shown in the example below. The section declaration marks the beginning of a section. All properties after the section declaration will be associated with that section. All lines beginning with a semicolon *;* or a number sign *#* are considered to be comments. Comment lines are ignored when parsing INI files. A typical INI file might look like this: [section1] ; some comment on section1 var1 = foo var2 = doodle var3 = multiline values \ are also possible [section2] var1 = baz var2 = shoodle.
ca: Tot i que és popularitzat per Windows, els fitxers INI es poden utilitzar en qualsevol sistema gràcies a la seva flexibilitat. Permeten que un programa emmagatzemi dades de configuració, que després es poden analitzar i canviar fàcilment. Dos sistemes notables que utilitzen el format INI són Samba i Trac. Podeu trobar més informació sobre els fitxers INI a la [Pàgina de Viquipèdia](http://ca.wikipedia.org/wiki/INIfile). L'element bàsic contingut en un fitxer INI és la propietat. Cada propietat té un nom i un valor, delimitats per un signe igual *.*. El nom apareix a l'esquerra del signe igual i el valor a la dreta. nom=valor Les declaracions de secció comencen amb *[* i acaben amb *]* com a and[section1]. i and[section2]. que es mostren a l'exemple següent. La declaració de secció marca el començament d'una secció. Totes les propietats després de la declaració de la secció s'associaran amb aquesta secció. Totes les línies que comencen amb un punt i coma *;* o un signe numèric *.* es consideren comentaris. Les línies de comentari s'ignoren en analitzar fitxers INI. Un fitxer INI típic podria ser així: [section1] ; algun comentari a section1 var1 foo var2 doodle var3 valors multilínia \ també són possibles [section2] var1 . baz var2 . shoodle.

source: Ruby & C implementation of Jaro-Winkler distance algorithm which supports UTF-8 string
ca: Implementació de Ruby C de l'algorisme de distància de Jaro-Winkler que admet la cadena UTF-8

source: jaro_winkler is an implementation of Jaro-Winkler distance algorithm which is written in C extension and will fallback to pure Ruby version in platforms other than MRI/KRI like JRuby or Rubinius. Both of C and Ruby implementation support any kind of string encoding, such as UTF-8, EUC-JP, Big5, etc.
ca: Jarowinkler és una implementació de l'algorisme de distància de Jaro-Winkler que s'escriu en l'extensió C i que es revertirà en la versió pura de Ruby en plataformes diferents de MRI/KRI com JRuby o Rubinius. Tant la implementació de C com la de Ruby suporten qualsevol tipus de codificació de cadenes, com UTF-8, EUC-JP, Big5, etc.

source: A simple, blog aware, static site generator
ca: Un generador de lloc estàtic i senzill

source: Jekyll is a simple, blog aware, static site generator.
ca: Jekyll és un generador de llocs estàtic i senzill, conscient del blog.

source: A basic Sass converter for Jekyll
ca: Un convertidor Sass bàsic per a Jekyll

source: A basic Sass converter for Jekyll.
ca: Un convertidor Sass bàsic per a Jekyll.

source: This is a JSON implementation as a Ruby extension in C.
ca: Aquesta és una implementació de JSON com a extensió de Ruby en C.

source: This is a legacy project, do not use it for new projects. Ruby 2.3 and later should make this obsolete. kgio provides non-blocking I/O methods for Ruby without raising exceptions on EAGAIN and EINPROGRESS.
ca: Aquest és un projecte llegat, no l'utilitzeu per a nous projectes. Ruby 2.3 i més tard hauria de fer això obsolet. kgio proporciona mètodes d'E/S no bloquejadors per a Ruby sense aixecar excepcions en EAGAIN i EINPROGRESS.

source: kramdown-parser-gfm provides a kramdown parser for the GFM dialect
ca: kramdown-parser-gfm proporciona un analitzador kramdown per al dialecte GFM

source: kramdown-parser-gfm provides a kramdown parser for the GFM dialect of Markdown.
ca: kramdown-parser-gfm proporciona un analitzador kramdown per al dialecte GFM de Markdown.

source: Launchy is helper class for launching cross-platform applications in
ca: Launchy és una classe d'ajudant per a llançar aplicacions multiplataforma a

source: Launchy is helper class for launching cross-platform applications in a fire and forget manner. There are application concepts (browser, email client, etc) that are common across all platforms, and they may be launched differently on each platform. Launchy is here to make a common approach to launching external applications from within ruby programs.
ca: Launchy és una classe d'ajuda per llançar aplicacions multiplataforma de manera incendiària i oblidada. Hi ha conceptes d'aplicació (navegador, client de correu electrònic, etc) que són comuns a totes les plataformes, i es poden llançar de manera diferent a cada plataforma. Launchy és aquí per fer un enfocament comú per llançar aplicacions externes des de dins dels programes ruby.

source: Rake tasks providing basic workflow for libyui development
ca: Tasques de captura que proporcionen un flux de treball bàsic per al desenvolupament de libyui

source: Rake tasks that support the workflow of a libyui developer. It allows packaging a repo, sending it to the build service, creating a submit request to the target repo or running the client from the git repo. Heavily inspired by yast-rake.
ca: Tasques d'execució que suporten el flux de treball d'un desenvolupador libyui. Permet empaquetar un dipòsit, enviar-lo al servei de construcció, crear una sol·licitud de tramesa al dipòsit de destinació o executar el client des del repositori git. Molt inspirat en la serp de iast.

source: lightbox2 for Ruby on Rails
ca: caixa de llum2 per a Ruby a Rails

source: This gem for Ruby on Rails provides the lightbox2 library to Rails's asset pipeline.
ca: Aquesta joia per a Ruby on Rails proporciona la biblioteca lightbox2 al gasoducte d'actius de Rails.

source: Ruby FFI bindings for llhttp
ca: Vinculacions FFI de Ruby per a llhttp

source: Ruby FFI bindings for llhttp.
ca: Vinculacions FFI de Ruby per a llhttp.

source: Add the colors of the rainbow to your terminal a.k.a. Rainbows and Unicorns!
ca: Afegeix els colors de l'arc de Sant Martí al teu terminal a.k.a. Arcs de Sant Martí i Unicorns!

source: This is a console program that transforms text from files or stdin by adding crazy rainbow colors or even animations.
ca: Aquest és un programa de consola que transforma el text dels fitxers o stdin afegint colors de l'arc de Sant Martí boig o fins i tot animacions.

source: Adds support for man pages to rubygems
ca: Afegeix la implementació per a les pàgines «man» als rubygems

source: With this gem the rubygems command will detect man pages within gems and exposes them to the man command.
ca: Amb aquesta joia, l'ordre rubygems detectarà pàgines de man dins de gemmes i les exposarà a l'ordre man.

source: Lightweight and flexible library for writing command-line apps in
ca: Biblioteca lleugera i flexible per escriure aplicacions de línia d'ordres a

source: Lightweight and flexible library for writing command-line apps in Ruby.
ca: Biblioteca lleugera i flexible per escriure aplicacions de línia d'ordres a Ruby.

source: Minimal Finite State Machine
ca: Màquina d'estat finit mínim

source: There are many finite state machine implementations for Ruby, and they all provide a nice DSL for declaring events, exceptions, callbacks, and all kinds of niceties in general. But if all you want is a finite state machine, look no further: this has less than 50 lines of code and provides everything a finite state machine must have, and nothing more.
ca: Hi ha moltes implementacions de màquines d'estats finits per a Ruby, i totes proporcionen una DSL agradable per declarar esdeveniments, excepcions, callbacks, i tot tipus de niceties en general. Però si tot el que voleu és una màquina d'estats finits, no busqueu més: això té menys de 50 línies de codi i proporciona tot el que una màquina d'estats finits ha de tenir, i res més.

source: A library for building RFC compliant Multipurpose Internet Mail Extensions (MIME) messages. It can be used to construct standardized MIME messages for use in client/server communications, such as Internet mail or HTTP multipart/form-data transactions.
ca: Una biblioteca per a la construcció de missatges d'Extensions Multipropòsits de Correu d'Internet (MIME) compatibles amb RFC. Es pot utilitzar per construir missatges MIME estandarditzats per al seu ús en comunicacions client/servidor, com ara correu d'Internet o transaccions HTTP multipart/form-data.

source: Manipulate images with minimal use of memory via ImageMagick /
ca: Manipula les imatges amb un ús mínim de la memòria a través d'ImageMagick /

source: Manipulate images with minimal use of memory via ImageMagick / GraphicsMagick.
ca: Manipula imatges amb un ús mínim de memòria a través d'ImageMagick / GraphicsMagick.

source: The minitar library is a pure-Ruby library that provides the ability
ca: La biblioteca minitar és una biblioteca pura-Ruby que proporciona la capacitat

source: The minitar library is a pure-Ruby library that provides the ability to deal with POSIX tar(1) archive files. This is release 0.9, adding a minor feature to Minitar.unpack and Minitar::Input#extract_entry that when <tt>:fsync => false</tt> is provided, fsync will be skipped. minitar (previously called Archive::Tar::Minitar) is based heavily on code originally written by Mauricio Julio Fernández Pradier for the rpa-base project.
ca: La biblioteca minitar és una biblioteca de pura Rubia que proporciona la capacitat de tractar amb fitxers d'arxiu POSIX tar(1). Aquesta és la versió 0.9, afegint una característica menor a Minitar.unpack i Minitar::Input.extractentry que quan es proporcioni <tt>:fsync . false</tt>, s'ometrà fsync. El minitar (anteriorment anomenat Archive::Tar::Minitar) es basa en gran mesura en el codi escrit originalment per Mauricio Julio Fern thendez Pradier per al projecte rpa-base.

source: Mixes in simple per-request authentication
ca: Barreja en una autenticació senzilla per sol·licitud

source: Mixes in simple per-request authentication.
ca: Barreja en autenticació simple per sol·licitud.

source: A simple mixin for CLI interfaces, including option parsing
ca: Un mixin simple per a les interfícies CLI, incloent l'anàlisi d'opcions

source: A simple mixin for CLI interfaces, including option parsing.
ca: Un simple mixin per a les interfícies CLI, incloent l'anàlisi d'opcions.

source: A gem that provides a simple mixin for log functionality
ca: Una joia que proporciona un mixin simple per a la funcionalitat de registre

source: A gem that provides a simple mixin for log functionality.
ca: Una joia que proporciona un simple mixin per a la funcionalitat de registre.

source: Run external commands on Unix or Windows
ca: Executa ordres externes a Unix o Windows

source: Run external commands on Unix or Windows.
ca: Executeu ordres externes a Unix o Windows.

source: Mocking and stubbing library
ca: Biblioteca d'ofegament i suplantació

source: Mocking and stubbing library with JMock/SchMock syntax, which allows mocking and stubbing of methods on real (non-mock) classes.
ca: Biblioteca de Mòquei i stubbing amb sintaxi de JMock/SchMock, que permet simular i stubbing de mètodes en classes reals (no-mock).

source: A unified interface to key/value stores, including Redis, Memcached,
ca: Una interfície unificada a les botigues de clau/valor, incloent Redis, Memcached,

source: A unified interface to key/value stores.
ca: Una interfície unificada a les botigues de claus/valors.

source: Use with Net::HTTP to do multipart form postspec. IO values that have file.
ca: Utilitzeu-lo amb Net::HTTP per a fer un postspec de formulari multipart. Valors d'E/S que tenen fitxer.

source: A simple, fast Mysql library for Ruby, binding to libmysql
ca: Una biblioteca Mysql senzilla i ràpida per a Ruby, vinculant a libmysql

source: A simple, fast Mysql library for Ruby, binding to libmysql.
ca: Una biblioteca Mysql senzilla i ràpida per a Ruby, vinculant-la a libmysql.

source: Nokogiri (鋸) makes it easy and painless to work with XML and HTML
ca: Nokogiri ( and) fa que sigui fàcil i indolor treballar amb XML i HTML
