Repository: openSUSE/packages-i18n
Catalog: */po/tesseract.*.po
Languages: ca

source: Open Source OCR Engine
ca: Motor OCR de codi obert

source: A commercial quality OCR engine originally developed at HP between 1985 and 1995. In 1995, this engine was among the top 3 evaluated by UNLV. It was open-sourced by HP and UNLV in 2005. From 2007 it is developed by Google.
ca: Un motor OCR de qualitat comercial desenvolupat originalment a HP entre 1985 i 1995. El 1995, aquest motor es trobava entre els 3 primers avaluats per la UNLV. Va ser de codi obert per HP i UNLV el 2005. Des de 2007 és desenvolupat per Google.

source: First-person shooter with cooperative in-game map editing
ca: Tirador en primera persona amb edició cooperativa en el mapa del joc

source: Tesseract is a first-person shooter game focused on instagib deathmatch and capture-the-flag gameplay as well as cooperative in-game map editing. Tesseract is based on Cube2/Sauerbraten. New rendering features include fully dynamic omnidirectional shadows, global illumination, HDR lighting, deferred shading and morphological/temporal/multisample anti-aliasing.
ca: Tesseract és un joc d'acció en primera persona centrat en el matx de mort instagib i la captura de la bandera, així com l'edició cooperativa de mapes. Tesseract es basa en Cube2/Sauerbraten. Les noves característiques de renderització inclouen ombres omnidireccionals totalment dinàmiques, il·luminació global, il·luminació HDR, ombrejat ajornat i antialiàsing morfològic/temporal/multisample.

source: Data files for Tesseract
ca: Fitxers de dades per a Tesseract

source: This package provides the data files for the Tesseract game.
ca: Aquest paquet proporciona els fitxers de dades per al joc Tesseract.

source: Tesseract Open Source OCR Engine Development files
ca: Fitxers de desenvolupament de motors OCR de codi obert Tesseract

source: This package contains development files for the Tesseract Open Source OCR Engine.
ca: Aquest paquet conté fitxers de desenvolupament per al motor OCR de codi obert Tesseract.

source: Afrikaans Traineddata for Tesseract
ca: Afrikaans Traineddata per a Tesseract

source: The Afrikaans traineddata for Tesseract.
ca: Els afrikaans van entrenar les dades per a Tesseract.

source: Albanian Traineddata for Tesseract
ca: Albanès Traineddata per a Tesseract

source: The Albanian traineddata for Tesseract.
ca: L'albanès va entrenar les dades per a Tesseract.

source: Amharic Traineddata for Tesseract
ca: Amharic Traineddata per a Tesseract

source: The Amharic traineddata for Tesseract.
ca: Les dades entrenades amhàriques per a Tesseract.

source: Arabic Traineddata for Tesseract
ca: Àrab Traineddata per a Tesseract

source: The Arabic traineddata for Tesseract.
ca: L'àrab va entrenar les dades per a Tesseract.

source: Assamese Traineddata for Tesseract
ca: Assamès Traineddata per a Tesseract

source: The Assamese traineddata for Tesseract.
ca: Les dades entrenades d'Assamès per a Tesseract.

source: Azerbaijani Traineddata for Tesseract
ca: Azerbaijani Traineddata per a Tesseract

source: The Azerbaijani traineddata for Tesseract.
ca: L'Azerbaidjan va entrenar les dades per a Tesseract.

source: Azerbaijani (Cyrillic) Traineddata for Tesseract
ca: Azerbaijani (ciríl·lic) Traineddata per a Tesseract

source: The Azerbaijani (Cyrillic) traineddata for Tesseract.
ca: L'àzeri (ciríl·lic) va entrenar les dades per a Tesseract.

source: Basque Traineddata for Tesseract
ca: Dades d'entrenament de basc per a Tesseract

source: The Basque traineddata for Tesseract.
ca: El basc va entrenar les dades per a Tesseract.

source: Belarusian Traineddata for Tesseract
ca: Bielorús Traineddata per a Tesseract

source: The Belarusian traineddata for Tesseract.
ca: El bielorús va entrenar les dades per a Tesseract.

source: Bengali Traineddata for Tesseract
ca: Bengalí Traineddata per a Tesseract

source: The Bengali traineddata for Tesseract.
ca: Les dades bengalí entrenades per a Tesseract.

source: Bosnian Traineddata for Tesseract
ca: Bosnian Traineddata per a Tesseract

source: The Bosnian traineddata for Tesseract.
ca: El bosnià va entrenar les dades per a Tesseract.

source: Bulgarian Traineddata for Tesseract
ca: Búlgara Traineddata per a Tesseract

source: The Bulgarian traineddata for Tesseract.
ca: Les dades de formació búlgares per a Tesseract.

source: Burmese Traineddata for Tesseract
ca: Dades entrenades birmanes per a Tesseract

source: The Burmese traineddata for Tesseract.
ca: Les dades birmanes entrenades per a Tesseract.

source: Catalan Traineddata for Tesseract
ca: Catalan Traineddata per a Tesseract

source: The Catalan traineddata for Tesseract.
ca: Les dades entrenades en català per a Tesseract.

source: Cebuano Traineddata for Tesseract
ca: Cebuano Traineddata per a Tesseract

source: The Cebuano traineddata for Tesseract.
ca: Les dades entrenades de Cebuano per a Tesseract.

source: Cherokee Traineddata for Tesseract
ca: Cherokee Traineddata per a Tesseract

source: The Cherokee traineddata for Tesseract.
ca: Els Cherokee van entrenar les dades per a Tesseract.

source: Chinese (Simplified) Traineddata for Tesseract
ca: Xinés (Simplificat) Traineddata per a Tesseract

source: The Chinese (Simplified) traineddata for Tesseract.
ca: Els xinesos (simplificats) van entrenar les dades per a Tesseract.

source: Chinese (Traditional) Traineddata for Tesseract
ca: Dades entrenades xineses (Tradicionals) per a Tesseract

source: The Chinese (Traditional) traineddata for Tesseract.
ca: Els xinesos (tradicionals) van entrenar les dades per a Tesseract.

source: Croatian Traineddata for Tesseract
ca: Dades entrenades croates per a Tesseract

source: The Croatian traineddata for Tesseract.
ca: Les dades entrenades croates per a Tesseract.

source: Czech Traineddata for Tesseract
ca: Czech Traineddata per a Tesseract

source: The Czech traineddata for Tesseract.
ca: El txec va entrenar les dades per a Tesseract.

source: Danish and Danish (Fraktur) Traineddata for Tesseract
ca: Danès i danès (Fraktur) Traineddata per a Tesseract

source: The Danish and Danish (Fraktur) traineddata for Tesseract.
ca: El danès i el danès (Fraktur) van entrenar les dades per a Tesseract.

source: Dutch Traineddata for Tesseract
ca: Dutch Traineddata per a Tesseract

source: The Dutch traineddata for Tesseract.
ca: Les dades entrenades holandeses per a Tesseract.

source: Dzongkha Traineddata for Tesseract
ca: Dzongkha Traineddata per a Tesseract

source: The Dzongkha traineddata for Tesseract.
ca: El Dzongkha va entrenar les dades per a Tesseract.

source: English Traineddata for Tesseract
ca: Dades d'entrenament d'anglès per a Tesseract

source: The English traineddata for Tesseract.
ca: Les dades d'entrenament d'anglès per a Tesseract.

source: Middle English (1100-1500) Traineddata for Tesseract
ca: Anglès mitjà (1100-1500) Traineddata per a Tesseract

source: The Middle English (1100-1500) traineddata for Tesseract.
ca: L'anglès mitjà (1100-1500) va entrenar dades per a Tesseract.

source: Esperanto Traineddata for Tesseract
ca: Esperanto Traineddata per a Tesseract

source: The Esperanto traineddata for Tesseract.
ca: L'esperanto va entrenar dades per a Tesseract.

source: Estonian Traineddata for Tesseract
ca: Dades entrenades en estonià per a Tesseract

source: The Estonian traineddata for Tesseract.
ca: L'estonià va entrenar les dades per a Tesseract.

source: Finnish Traineddata for Tesseract
ca: Finnish Traineddata per a Tesseract

source: The Finnish traineddata for Tesseract.
ca: Les dades entrenades fineses per a Tesseract.

source: Frankish Traineddata for Tesseract
ca: Frankish Traineddata per a Tesseract

source: The Frankish traineddata for Tesseract.
ca: Els francs van entrenar les dades per a Tesseract.

source: French Traineddata for Tesseract
ca: Dades d'entrenament de francès per a Tesseract

source: The French traineddata for Tesseract.
ca: Les dades entrenades franceses per a Tesseract.

source: Middle French (ca. 1400-1600) Traineddata for Tesseract
ca: Francès mitjà (ca. 1400-1600) Traineddata per a Tesseract

source: The Middle French (ca. 1400-1600) traineddata for Tesseract.
ca: El francès mitjà (ca. 1400-1600) va entrenar dades per a Tesseract.

source: Galician Traineddata for Tesseract
ca: Galleca Traineddata per a Tesseract

source: The Galician traineddata for Tesseract.
ca: El gallec va entrenar les dades per a Tesseract.

source: Georgian Traineddata for Tesseract
ca: Georgian Traineddata per a Tesseract

source: The Georgian traineddata for Tesseract.
ca: Les dades georgianes entrenades per a Tesseract.

source: Georgian (Old) Traineddata for Tesseract
ca: Georgian (Old) Traineddata per a Tesseract

source: The Georgian (Old) traineddata for Tesseract.
ca: El georgià (antic) va entrenar les dades per a Tesseract.

source: German and German (Fraktur) Traineddata for Tesseract
ca: Alemany i alemany (Fraktur) Traineddata per a Tesseract

source: The German and German (Fraktur) traineddata for Tesseract.
ca: L'alemany i l'alemany (Fraktur) van entrenar dades per a Tesseract.

source: Greek Traineddata for Tesseract
ca: grec Traineddata per a Tesseract

source: The Greek traineddata for Tesseract.
ca: Les dades entrenades gregues per a Tesseract.

source: Ancient Greek Traineddata for Tesseract
ca: Dades de formació en grec antic per a Tesseract

source: The Ancient Greek traineddata for Tesseract.
ca: L'antic grec va formar dades per a Tesseract.

source: Gujarati Traineddata for Tesseract
ca: Gujarati Traineddata per a Tesseract

source: The Gujarati traineddata for Tesseract.
ca: El Gujarati va entrenar les dades per a Tesseract.

source: Haitian Traineddata for Tesseract
ca: Haitian Traineddata per a Tesseract

source: The Haitian traineddata for Tesseract.
ca: El haitià va entrenar les dades per a Tesseract.

source: Hebrew Traineddata for Tesseract
ca: Hebreu Traineddata per a Tesseract

source: The Hebrew traineddata for Tesseract.
ca: Les dades entrenades en hebreu per a Tesseract.

source: Hindi Traineddata for Tesseract
ca: Hindi Traineddata per a Tesseract

source: The Hindi traineddata for Tesseract.
ca: L'hindi va entrenar les dades per a Tesseract.

source: Hungarian Traineddata for Tesseract
ca: Hongarès Traineddata per a Tesseract

source: The Hungarian traineddata for Tesseract.
ca: Les dades entrenades hongareses per a Tesseract.

source: Icelandic Traineddata for Tesseract
ca: Dades d'entrenament d'islandès per a Tesseract

source: The Icelandic traineddata for Tesseract.
ca: Les dades entrenades islandeses per a Tesseract.

source: Indonese Traineddata for Tesseract
ca: Dades entrenades indoneses per a Tesseract

source: The Indonese traineddata for Tesseract.
ca: Les dades entrenades per l'indonèsia per a Tesseract.

source: Inuktitut Traineddata for Tesseract
ca: Inuktitut Traineddata per a Tesseract

source: The Inuktitut traineddata for Tesseract.
ca: L'Inuktitut va entrenar les dades per a Tesseract.

source: Irish Traineddata for Tesseract
ca: Irish Traineddata per a Tesseract

source: The Irish traineddata for Tesseract.
ca: Les dades entrenades irlandeses per a Tesseract.

source: Italian Traineddata for Tesseract
ca: Dades d'entrenament d'italià per a Tesseract

source: The Italian traineddata for Tesseract.
ca: L'italià va entrenar les dades per a Tesseract.

source: Italian (Old) Traineddata for Tesseract
ca: Italian (Old) Traineddata per a Tesseract

source: The Italian (Old) traineddata for Tesseract.
ca: L'italià (antic) va entrenar les dades per a Tesseract.

source: Japanese Traineddata for Tesseract
ca: Japonès Traineddata per a Tesseract

source: The Japanese traineddata for Tesseract.
ca: Les dades japoneses entrenades per a Tesseract.

source: Javanese Traineddata for Tesseract
ca: Javanès Traineddata per Tesseract

source: The Javanese traineddata for Tesseract.
ca: Les dades entrenades en javanès per a Tesseract.

source: Kannada Traineddata for Tesseract
ca: Kannada Traineddata per a Tesseract

source: The Kannada traineddata for Tesseract.
ca: El Kannada va entrenar les dades per a Tesseract.

source: Kazakh Traineddata for Tesseract
ca: Dades d'entrenament de kazakh per a Tesseract

source: The Kazakh traineddata for Tesseract.
ca: El Kazakhstan va entrenar les dades per a Tesseract.

source: Khmer Traineddata for Tesseract
ca: Khmer Traineddata per a Tesseract

source: The Khmer traineddata for Tesseract.
ca: Els Khmer van entrenar les dades per a Tesseract.

source: Korean Traineddata for Tesseract
ca: Dades entrenades coreanes per a Tesseract

source: The Korean traineddata for Tesseract.
ca: Dades d'entrenament de coreà per a Tesseract.

source: Kurdish Traineddata for Tesseract
ca: Kurd Traineddata per a Tesseract

source: The Kurdish traineddata for Tesseract.
ca: Les dades entrenades kurdes per a Tesseract.

source: Kyrgyz Traineddata for Tesseract
ca: Kyrgyz Traineddata per a Tesseract

source: The Kyrgyz traineddata for Tesseract.
ca: El Kirguizistan va entrenar les dades per a Tesseract.

source: Lao Traineddata for Tesseract
ca: Lao Traineddata per a Tesseract

source: The Lao traineddata for Tesseract.
ca: Laos va entrenardata per a Tesseract.

source: Latin Traineddata for Tesseract
ca: Dades d'entrenament de llatí per a Tesseract

source: The Latin traineddata for Tesseract.
ca: El llatí traineddata per a Tesseract.

source: Latvian Traineddata for Tesseract
ca: Letó Traineddata per a Tesseract

source: The Latvian traineddata for Tesseract.
ca: El letó va entrenar les dades per a Tesseract.

source: Lithuanian Traineddata for Tesseract
ca: Lituà Traineddata per a Tesseract

source: The Lithuanian traineddata for Tesseract.
ca: Les dades entrenades lituanes per a Tesseract.

source: Macedonian Traineddata for Tesseract
ca: Dades d'entrenament de macedoni per a Tesseract

source: The Macedonian traineddata for Tesseract.
ca: El macedoni va entrenar les dades per a Tesseract.

source: Malay Traineddata for Tesseract
ca: Malai Traineddata per Tesseract

source: The Malay traineddata for Tesseract.
ca: Els malais van entrenar les dades per a Tesseract.

source: Malayalam Traineddata for Tesseract
ca: Malayalam Traineddata per Tesseract

source: The Malayalam traineddata for Tesseract.
ca: El Malayalam va entrenar les dades per a Tesseract.

source: Maltese Traineddata for Tesseract
ca: Dades formades en maltès per a Tesseract

source: The Maltese traineddata for Tesseract.
ca: Les dades entrenades de Malta per a Tesseract.

source: Marathi Traineddata for Tesseract
ca: Marathi Traineddata per a Tesseract

source: The Marathi traineddata for Tesseract.
ca: El Marathi va entrenar les dades per a Tesseract.

source: Math / Equation Detection Module Traineddata for Tesseract
ca: Mòdul de Detecció de Matemàtiques / Equació Traineddata per a Tesseract

source: The Math / Equation Detection Module traineddata for Tesseract.
ca: El Mòdul de Detecció de Matemàtiques / Equació va entrenar dades per a Tesseract.

source: Nepali Traineddata for Tesseract
ca: Nepali Traineddata per a Tesseract

source: The Nepali traineddata for Tesseract.
ca: El nepalès va entrenar les dades per a Tesseract.

source: Norwegian Traineddata for Tesseract
ca: Dades d'entrenament de noruec per a Tesseract

source: The Norwegian traineddata for Tesseract.
ca: El noruec va entrenar les dades per a Tesseract.

source: Orientation & Script Detection Enabler Traineddata for Tesseract
ca: Activador de detecció de scripts d'orientació Traineddata per a Tesseract

source: The Orientation & Script Detection Enabler traineddata for Tesseract.
ca: El Activador de detecció de scripts d'orientació va entrenar les dades per a Tesseract.

source: Oriya Traineddata for Tesseract
ca: Oriya Traineddata per a Tesseract

source: The Oriya traineddata for Tesseract.
ca: L'Oriya va entrenar les dades per a Tesseract.

source: Pashto Traineddata for Tesseract
ca: Pashto Traineddata per a Tesseract

source: The Pashto traineddata for Tesseract.
ca: El Pashto va entrenar les dades per a Tesseract.

source: Persian Traineddata for Tesseract
ca: Persa Traineddata per a Tesseract

source: The Persian traineddata for Tesseract.
ca: Les dades perses entrenades per Tesseract.

source: Polish Traineddata for Tesseract
ca: Polonesos Traineddata per a Tesseract

source: The Polish traineddata for Tesseract.
ca: Les dades entrenades poloneses per a Tesseract.

source: Portuguese Traineddata for Tesseract
ca: Portuguès Traineddata per a Tesseract

source: The Portuguese traineddata for Tesseract.
ca: Les dades entrenades pels portuguesos per a Tesseract.

source: Punjabi Traineddata for Tesseract
ca: Punjabi Traineddata per a Tesseract

source: The Punjabi traineddata for Tesseract.
ca: El Panjabi va entrenar les dades per a Tesseract.

source: Romanian Traineddata for Tesseract
ca: Romanès Traineddata per a Tesseract

source: The Romanian traineddata for Tesseract.
ca: Les dades romaneses entrenades per a Tesseract.

source: Russian Traineddata for Tesseract
ca: Rus Traineddata per a Tesseract

source: The Russian traineddata for Tesseract.
ca: Les dades entrenades russes per a Tesseract.

source: Sanskrit Traineddata for Tesseract
ca: Dades entrenades en sànscrit per a Tesseract

source: The Sanskrit traineddata for Tesseract.
ca: El sànscrit va entrenar les dades per a Tesseract.

source: Serbian Traineddata for Tesseract
ca: Serbi Traineddata per a Tesseract

source: The Serbian traineddata for Tesseract.
ca: Les dades entrenades sèrbies per a Tesseract.

source: Serbian (Latin) Traineddata for Tesseract
ca: Serbi (llatí) Traineddata per a Tesseract

source: The Serbian (Latin) traineddata for Tesseract.
ca: El serbi (llatí) va entrenar les dades per a Tesseract.

source: Sinhala Traineddata for Tesseract
ca: Sinhala Traineddata per a Tesseract

source: The Sinhala traineddata for Tesseract.
ca: El Sinhala va entrenar les dades per a Tesseract.

source: Slovak and Slovak (Fraktur) Traineddata for Tesseract
ca: Eslovac i eslovac (Fraktur) Traineddata per a Tesseract

source: The Slovak and Slovak (Fraktur) traineddata for Tesseract.
ca: L'eslovac i l'eslovac (Fraktur) van entrenar dades per a Tesseract.

source: Slovenian Traineddata for Tesseract
ca: Eslovè Traineddata per a Tesseract

source: The Slovenian traineddata for Tesseract.
ca: L'eslovè va entrenar dades per a Tesseract.

source: Spanish Traineddata for Tesseract
ca: Dades d'entrenament de castellà per a Tesseract

source: The Spanish traineddata for Tesseract.
ca: Les dades entrenades pels espanyols per a Tesseract.

source: Spanish (Old) Traineddata for Tesseract
ca: Dades entrenades en castellà (antic) per a Tesseract

source: The Spanish (Old) traineddata for Tesseract.
ca: L'espanyol (antic) va entrenar les dades per a Tesseract.

source: Swahili Traineddata for Tesseract
ca: Swahili Traineddata per a Tesseract

source: The Swahili traineddata for Tesseract.
ca: El suahili va entrenar les dades per a Tesseract.

source: Swedish Traineddata for Tesseract
ca: Suec Traineddata per a Tesseract

source: The Swedish traineddata for Tesseract.
ca: Les dades entrenades sueques per a Tesseract.

source: Syriac Traineddata for Tesseract
ca: Syriac Traineddata per a Tesseract

source: The Syriac traineddata for Tesseract.
ca: Les dades entrenades siríaques per a Tesseract.

source: Tagalog Traineddata for Tesseract
ca: Tagalog Traineddata per a Tesseract

source: The Tagalog traineddata for Tesseract.
ca: El Tagalog traineddata per a Tesseract.

source: Tajik Traineddata for Tesseract
ca: Tajik Traineddata per a Tesseract

source: The Tajik traineddata for Tesseract.
ca: El Tajik va entrenar les dades per a Tesseract.

source: Tamil Traineddata for Tesseract
ca: Tamil Traineddata per a Tesseract

source: The Tamil traineddata for Tesseract.
ca: Dades d'entrenament de tamil per a Tesseract.

source: Telugu Traineddata for Tesseract
ca: Telugu Traineddata per a Tesseract

source: The Telugu traineddata for Tesseract.
ca: El Telugu va entrenar les dades per a Tesseract.

source: Thai Traineddata for Tesseract
ca: Thai Traineddata per a Tesseract

source: The Thai traineddata for Tesseract.
ca: Dades d'entrenament de tailandès per a Tesseract.

source: Tibetan Standard Traineddata for Tesseract
ca: Dades d'entrenament de tibetà per a Tesseract

source: The Tibetan Standard traineddata for Tesseract.
ca: L'estàndard tibetà va entrenar les dades per a Tesseract.

source: Tigrinya Traineddata for Tesseract
ca: Tigrinya Traineddata per a Tesseract

source: The Tigrinya traineddata for Tesseract.
ca: El Tigrinya va entrenar les dades per a Tesseract.

source: Turkish Traineddata for Tesseract
ca: Turkish Traineddata per a Tesseract

source: The Turkish traineddata for Tesseract.
ca: Les dades entrenades en turc per a Tesseract.

source: Ukrainian Traineddata for Tesseract
ca: Dades entrenades ucraïneses per a Tesseract

source: The Ukrainian traineddata for Tesseract.
ca: Les dades entrenades ucraïneses per a Tesseract.

source: Urdu Traineddata for Tesseract
ca: Urdu Traineddata per a Tesseract

source: The Urdu traineddata for Tesseract.
ca: Les dades entrenades de l'urdú per a Tesseract.

source: Uyghur Traineddata for Tesseract
ca: Uyghur Traineddata per a Tesseract

source: The Uyghur traineddata for Tesseract.
ca: Els Uyghur van entrenar les dades per a Tesseract.

source: Uzbek Traineddata for Tesseract
ca: Uzbek Traineddata per a Tesseract

source: The Uzbek traineddata for Tesseract.
ca: L'Uzbekistan va entrenar les dades per a Tesseract.

source: Uzbek (Cyrillic) Traineddata for Tesseract
ca: Uzbek (ciríl·lic) Traineddata per a Tesseract

source: The Uzbek (Cyrillic) traineddata for Tesseract.
ca: L'Uzbekistan (ciríl·lic) va entrenar les dades per a Tesseract.

source: Vietnamese Traineddata for Tesseract
ca: Vietnamita Traineddata per a Tesseract

source: The Vietnamese traineddata for Tesseract.
ca: Les dades entrenades pels vietnamites per a Tesseract.

source: Welsh Traineddata for Tesseract
ca: Welsh Traineddata per a Tesseract

source: The Welsh traineddata for Tesseract.
ca: Els gal·lesos van entrenar les dades per a Tesseract.

source: Yiddish Traineddata for Tesseract
ca: Dades de Yiddish Traineddata per a Tesseract

source: The Yiddish traineddata for Tesseract.
ca: Els ídixs van entrenar les dades per a Tesseract.

source: Tesseract standalone server
ca: Servidor independent Tesseract

source: This package provides the server files for the Tesseract game.
ca: Aquest paquet proporciona els fitxers del servidor per al joc Tesseract.
