Repository: openSUSE/packages-i18n
Catalog: */po/texlive.*.po
Languages: ca, fr

source: Kpathsea is a library and utility programs which provide path searching facilities for TeX file types, including the self- locating feature required for movable installations, layered on top of a general search mechanism. It is not distributed separately, but rather is released and maintained as part of the TeX-live sources.
ca: El Kpathsea és una biblioteca i programes d'utilitat que proporcionen facilitats de cerca de camins per als tipus de fitxers TeX, inclosa la característica d'autolocalització requerida per a les instal·lacions mòbils, en capes sobre un mecanisme de cerca general. No es distribueix per separat, sinó que s'allibera i es manté com a part de les fonts de TeX-live.
fr: Kpathsea est constitué d'une bibliothèque et de programmes utilitaires qui fournissent des fonctions de recherche de chemin pour les types de fichiers TEX, y compris la fonction d'auto-localisation requise pour les installations mobiles, superposée à un mécanisme de recherche général. Elle n'est pas distribuée séparément, mais est publiée et maintenue dans le cadre des sources de TEX Live.

source: Libraries of Kanji code convert library for pTeX
ca: Biblioteques de la biblioteca de conversió de codi Kanji per a pTeX
fr: Bibliothèque de conversion de bibliothèques de code Kanji pour pTeX

source: The ptexenc is a useful library for Japanese pTeX (which stands for publishing TeX, and is an extension of TeX by ASCII Co.) and its surrounding tools.
ca: El ptexenc és una biblioteca útil per al pTeX japonès (que significa publicar TeX, i és una extensió de TeX per ASCII Co.) i les seves eines circumdants.
fr: La bibliothèque ptexenc est utile pour le pTeX japonais (publishing TeX, une extension de TeX par ASCII Co.) et les outils connexes.

source: Libraries of The Synchronization TeXnology
ca: Biblioteques de la Sincronització TeXnologia
fr: Bibliothèques de The Synchronization TeXnology

source: The Synchronization TeXnology by Jérôme Laurens is a new feature of recent TeX engines. It allows to synchronize between input and output, which means to navigate from the source document to the typeset material and vice versa.
ca: La Sincronització TeXnologia de Jérmeme Laurens és una nova característica dels motors TeX recents. Permet sincronitzar entre entrada i sortida, el que significa navegar des del document d'origen fins al material gravat i viceversa.
fr: The Synchronization TeXnology de Jérôme Laurens est une nouvelle fonctionnalité des moteurs TeX récents. Elle permet de synchroniser l'entrée et la sortie, c'est-à-dire de naviguer entre le document source et le document typographié et inversement.

source: Libraries of an extended version of pdfTeX using Lua
ca: Biblioteques d'una versió estesa de pdfTeX utilitzant Lua
fr: Bibliothèques d'une version étendue de pdfTeX utilisant Lua

source: LuaTeX is an extended version of pdfTeX using Lua as an embedded scripting language
ca: LuaTeX és una versió estesa de pdfTeX que utilitza Lua com a llenguatge de script incrustat
fr: LuaTeX est une version étendue de pdfTeX utilisant Lua comme langage de script intégré

source: Libraries of Just-In-Time compiler for Lua
ca: Biblioteques del compilador Just-In-Time per a Lua
fr: Bibliothèques du compilateur Just-In-Time pour Lua

source: LuaJIT is a Just-In-Time (JIT) compiler for the Lua programming language
ca: LuaJIT és un compilador Just-In-Time (JIT) per al llenguatge de programació Lua
fr: LuaJIT est un compilateur Just-In-Time (JIT) pour le langage de programmation Lua

source: Library files of Biber a BibTeX replacement
ca: Arxius de la biblioteca de Biber a BibTeX substitut
fr: Fichiers de la bibliothèque de Biber une alternative à BibTeX

source: Perl library files of Biber a BibTeX replacement for users of BibLaTeX. This package is required by the package texlive-biber-bin.
ca: Fitxers de la biblioteca Perl de Biber a BibTeX substitut per als usuaris de BibLaTeX. Aquest paquet és requerit pel paquet texlive-biber-bin.
fr: Fichiers de la bibliothèque Perl de Biber, une alternative à BibTeX pour les utilisateurs de BibLaTeX. Ce paquetage est requis par le paquetage texlive-biber-bin.

source: The TeXLive Formatting System
ca: El sistema de formatació TeXLive
fr: Le système de typographie assistée par ordinateur TeXLive

source: After installing texlive and the package texlive-latex, find a large selection of documentation for TeX, LaTeX, and various layout styles in /usr/share/texmf/doc. TeX (pronounced tech) is an interpreter for text formatting and was developed by Donald E. Knuth. It works with control and macro commands on a text file. Working with TeX is similar to typesetting methods. LaTeX is a complex macro package that removes the cryptical TeX interface and does most of the work for the user. TeX uses special fonts produced by the MetaFont program. Various printer drivers and an X11 viewer are also included in this package. The teTeX package is based on the standard TeX package of Karl Berry, which makes configuration much easier. It is also possible to use PostScript fonts. A real PostScript printer is required, however. If the ghostscript (gs) package is installed, all drivers for printing and viewing can use these fonts. Note, however, that the fonts included in the ghostscript package are not identical to Adobe's PostScript fonts. The copyright prohibids us to include them on the CD. Besides these features, the programs MakeIndex (for producing indexes) and BibTeX (for literature data processing) exist. The texlive package includes a full texmf tree, many programs like tex, dvips, etc., shell script configuration, and a big collection of documentations. This package is easily configured by the script texconfig and has multilanguage options.
ca: Després d'instal·lar texlive i el paquet texlive-latex, trobeu una gran selecció de documentació per a TeX, LaTeX i diversos estils de disposició a /usr/share/texmf/doc. TeX (pronounced tech) és un intèrpret per a formatació de text i va ser desenvolupat per Donald E. Knuth. Funciona amb ordres de control i macro en un fitxer de text. Treballar amb TeX és similar als mètodes de composició tipogràfica. LaTeX és un complex paquet de macros que elimina la interfície criptical TeX i fa la major part del treball per a l'usuari. TeX utilitza fonts especials produïdes pel programa MetaFont. Diversos controladors d'impressora i un visor X11 també s'inclouen en aquest paquet. El paquet teTeX es basa en el paquet estàndard TeX de Karl Berry, que fa la configuració molt més fàcil. També és possible utilitzar fonts PostScript. Tanmateix, es requereix una impressora PostScript real. Si el paquet ghostscript (gs) està instal·lat, tots els controladors per a la impressió i visualització poden utilitzar aquests tipus de lletra. Tingueu en compte, però, que els tipus de lletra inclosos en el paquet ghostscript no són idèntics als tipus de lletra PostScript d'Adobe. Els drets d'autor ens prohibeixen incloure'ls en el CD. A més d'aquestes característiques, existeixen els programes MakeIndex (per a la producció d'índexs) i BibTeX (per al processament de dades de literatura). El paquet texlive inclou un arbre texmf complet, molts programes com tex, dvips, etc., la configuració de l'script shell, i una gran col·lecció de documentació. Aquest paquet es configura fàcilment amb l'script texconfig i té opcions multiidioma.
fr: Après avoir installé texlive et le paquet texlive-latex, vous trouverez une large sélection de documentation pour TeX, LaTeX et divers styles de mise en page dans /usr/share/texmf/doc. TeX (prononcé tech) est un interpréteur de formatage de texte développé par Donald E. Knuth. Il fonctionne avec des commandes de contrôle et des macro-commandes sur un fichier texte. Le travail avec TeX est similaire aux méthodes de composition. LaTeX est un ensemble complexe de macros qui supprime l'interface cryptique de TeX et effectue la majeure partie du travail pour l'utilisateur. TeX utilise des polices spéciales produites par le programme MetaFont. Divers pilotes d'imprimante et une visionneuse X11 sont également inclus dans ce paquet. Le paquet teTeX est basé sur le paquetage TeX standard de Karl Berry, ce qui facilite grandement la configuration. Il est également possible d'utiliser des polices PostScript. Une véritable imprimante PostScript est toutefois nécessaire. Si le paquet ghostscript (gs) est installé, tous les pilotes d'impression et de visualisation peuvent utiliser ces polices. Notez cependant que les polices incluses dans le paquetage ghostscript ne sont pas identiques aux polices PostScript d'Adobe. Le copyright nous interdit de les inclure sur le CD. Outre ces fonctionnalités, il existe les programmes MakeIndex (pour la production d'index) et BibTeX (pour le traitement des données bibliographiques). Le paquet texlive comprend une arborescence texmf complète, de nombreux programmes comme tex, dvips, etc., la configuration de scripts shell, et une grande collection de documentations. Ce paquet est facilement configuré par le script texconfig et dispose d'options multilingues.

source: Binary files of a2ping
ca: Fitxers binaris d'a2ping
fr: Fichiers binaires de a2ping

source: Binary files of accfonts
ca: Fitxers binaris de tipus de lletra acc
fr: Fichiers binaires de accfonts

source: Binary files of adhocfilelist
ca: Fitxers binaris de l'addhocfilelist
fr: Fichiers binaires de adhocfilelist

source: Binary files of afm2pl
ca: Fitxers binaris d'afm2pl
fr: Fichiers binaires de afm2pl

source: Binary files of aleph
ca: Fitxers binaris d'aleph
fr: Fichiers binaires de aleph

source: Binary files of amstex
ca: Fitxers binaris d'amstex
fr: Fichiers binaires de amstex

source: Binary files of arara
ca: Fitxers binaris d'arara
fr: Fichiers binaires de arara

source: Binary files of asymptote
ca: Fitxers binaris d'asymptote
fr: Fichiers binaires de asymptote

source: Binary files of authorindex
ca: Fitxers binaris de l'índexautor
fr: Fichiers binaires de authorindex

source: Binary files of autosp
ca: Fitxers binaris d'autosp
fr: Fichiers binaires de autosp

source: Binary files of biber
ca: Fitxers binaris de biber
fr: Fichiers binaires de biber

source: Binary files of bibexport
ca: Fitxers binaris de bibexport
fr: Fichiers binaires de bibexport

source: Binary files of bibtex
ca: Fitxers binaris de bibtex
fr: Fichiers binaires de bibtex

source: Binary files of bibtex8
ca: Fitxers binaris de bibtex8
fr: Fichiers binaires de bibtex8

source: Binary files of bibtexu
ca: Fitxers binaris de bibtexu
fr: Fichiers binaires de bibtexu

source: Basic development packages for TeXLive
ca: Paquets bàsics de desenvolupament per a TeXLive
fr: Paquet de développement de base pour TeXLive

source: This package will cause the installation of several development packages for TeXLive.
ca: Aquest paquet causarà la instal·lació de diversos paquets de desenvolupament per a TeXLive.
fr: Ce paquet déclenche l'installation de plusieurs paquets de développement pour TeXLive.

source: Binary files of bundledoc
ca: Fitxers binaris de bundledoc
fr: Fichiers binaires de bundledoc

source: Binary files of cachepic
ca: Fitxers binaris de cachepic
fr: Fichiers binaires de cachepic

source: Binary files of checkcites
ca: Fitxers binaris de checkcites
fr: Fichiers binaires de checkcites

source: Binary files of checklistings
ca: Fitxers binaris de llistes de verificació
fr: Fichiers binaires de checklistings

source: Binary files of chktex
ca: Fitxers binaris de chktex
fr: Fichiers binaires de chktex

source: Binary files of cjk-gs-integrate
ca: Fitxers binaris de cjk-gs-integrate
fr: Fichiers binaires de cjk-gs-integrate

source: Extra fonts and scripts for CJK LaTeX
ca: Tipus de lletra i scripts addicionals per al CJK LaTeX
fr: Polices et scripts supplémentaires pour CJK LaTeX

source: This package contains some extra font setup files and scripts to automatically generate fonts and setup files to use with CJK LaTeX.
ca: Aquest paquet conté alguns fitxers i scripts de configuració de tipus de lletra addicionals per a generar automàticament els tipus de lletra i els fitxers de configuració a utilitzar amb CJK LaTeX.
fr: Ce paquet contient des fichiers de configuration de polices supplémentaires et des scripts pour générer automatiquement des polices et des fichiers de configuration à utiliser avec CJK LaTeX.

source: Binary files of cjkutils
ca: Fitxers binaris de cjkutils
fr: Fichiers binaires de cjkutils

source: Essential programs and files
ca: Programes i fitxers essencials
fr: Logiciels et fichiers essentiels

source: These files are regarded as basic for any TeX system, covering plain TeX macros, Computer Modern fonts, and configuration for common drivers; no LaTeX.
ca: Aquests fitxers es consideren bàsics per a qualsevol sistema TeX, cobrint macros TeX simples, fonts modernes d'ordinador i configuració per als controladors comuns; no LaTeX.
fr: Ces fichiers sont considérés comme des fichiers de base pour tout système TeX, couvrant les macros TeX simples, les polices Computer Modern et la configuration des pilotes courants ; pas de LaTeX.

source: BibTeX additional styles
ca: Estils addicionals de BibTeX
fr: Styles additionnels pour BibTeX

source: Additional BibTeX styles and bibliography data(bases), notably including BibLaTeX.
ca: Estils addicionals de BibTeX i dades bibliogràfiques (bases), incloent-hi BibLaTeX.
fr: Styles BibTeX et données bibliographiques supplémentaires (bases), comprenant notamment BibLaTeX.

source: TeX auxiliary programs
ca: Programes auxiliars de TeX
fr: Programmes auxiliaires TeX

source: Various useful, but non-essential, support programs. Includes programs and macros for DVI file manipulation, literate programming, patgen, and the TeX Works Editor.
ca: Diversos programes de suport útils, però no essencials. Inclou programes i macros per a la manipulació de fitxers DVI, la programació alfabetitzada, patgen i l'editor TeX Works.
fr: Divers programmes d'assistance utiles, mais non essentiels. Comprend des programmes et des macros pour la manipulation de fichiers DVI, la programmation lettrée, le paquet patgen et l'éditeur TeX Works.

source: ConTeXt and packages
ca: ConTeXt i paquets
fr: ConTeXt et paquets

source: Hans Hagen's powerful ConTeXt system, http://pragma-ade.com. Also includes third-party ConTeXt packages.
ca: El potent sistema ConTeXt de Hans Hagen, http://pragma-ade.com. També inclou paquets ConTeXt de tercers.
fr: Le puissant système ConTeXt de Hans Hagen, http://pragma-ade.com. Comprend également des paquets ConTeXt de tiers.

source: Additional fonts
ca: Lletres tipogràfiques addicionals
fr: Polices additionnelles

source: The collection-fontsextra package
ca: El paquet collection-fontsextra
fr: Le paquet collection-fontsextra

source: Recommended fonts
ca: Lletres tipogràfiques recomanades
fr: Polices recommandées

source: Recommended fonts, including the base 35 PostScript fonts, Latin Modern, TeX Gyre, and T1 and other encoding support for Computer Modern, in outline form.
ca: Tipus de lletra recomanats, inclosos els tipus de lletra base 35 PostScript, Latin Modern, TeX Gyre, i T1 i altres suports de codificació per a Computer Modern, en forma d'esquema.
fr: Polices recommandées, y compris les 35 polices PostScript de base, Latin Modern, TeX Gyre, et T1 et autre support d'encodage pour Computer Modern, sous forme de schéma.

source: Graphics and font utilities
ca: Gràfics i fonts d'utilitat
fr: Utilitaires graphiques et polices de caractères

source: Programs for conversion between font formats, testing fonts, virtual fonts, .gf and .pk manipulation, mft, fontinst, etc. Manipulating OpenType, TrueType, Type 1,and for manipulation of PostScript and other image formats.
ca: Programes de conversió entre formats de tipus de lletra, proves de tipus de lletra, tipus de lletra virtuals, manipulació .gf i .pk, mft, fontinst, etc. Manipulant OpenType, TrueType, Type 1, i per a la manipulació de PostScript i altres formats d'imatge.
fr: Programmes de conversion entre formats de polices, polices de test, polices virtuelles, manipulation des fichiers .gf et .pk, mft, fontinst, etc. Manipulation des formats OpenType, TrueType, Type 1, et manipulation de PostScript et d'autres formats d'images.

source: Additional formats
ca: Formats addicionals
fr: Formats additionnels

source: Collected TeX `formats', i.e., large-scale macro packages designed to be dumped into .fmt files -- excluding the most common ones, such as latex and context, which have their own package(s). It also includes the Aleph engine and related Omega formats and packages.
ca: Recull TeX ).formats', és a dir, paquets de macros a gran escala dissenyats per a ser abocats en fitxers .fmt -- excloent els més comuns, com latex i context, que tenen els seus propis paquets. També inclou el motor Aleph i els formats i paquets Omega relacionats.
fr: Rassemble les « formats » TeX, c'est-à-dire les paquets de macros à grande échelle conçus pour être déversés dans des fichiers .fmt -- à l'exclusion des plus courants, tels que latex et context, qui ont leur(s) propre(s) paquet(s). Il inclut également le moteur Aleph et les formats et paquets Omega associés.

source: Games typesetting
ca: Jocs de composició tipogràfica
fr: Composition de jeux

source: Setups for typesetting various games, including chess.
ca: Configuració per a gravar diversos jocs, inclosos els escacs.
fr: Configurations pour la composition de divers jeux, y compris les échecs.

source: Humanities packages
ca: Paquets d'Humanitats
fr: Paquets humanités

source: Packages for law, linguistics, social sciences, humanities, etc.
ca: Paquets de dret, lingüística, ciències socials, humanitats, etc.
fr: Paquets pour le droit, la linguistique, les sciences sociales, les sciences humaines, etc.

source: Arabic
ca: Àrab
fr: Arabe

source: Support for Arabic and Persian.
ca: Suport a l'àrab i el persa.
fr: Prise en charge de l'arabe et du persan.

source: Chinese
ca: Xinès
fr: Chinois

source: Support for Chinese; additional packages in collection-langcjk.
ca: Suport per al xinès; paquets addicionals a collection-langcjk.
fr: Prise en charge du chinois ; paquets supplémentaires dans collection-langcjk.

source: Chinese/Japanese/Korean (base)
ca: Xinès/japonès/coreà (base)
fr: Chinois/Japonais/Coréen (base)

source: Packages supporting a combination of Chinese, Japanese, Korean, including macros, fonts, documentation. Also Thai in the c90 encoding, since there is some overlap in those fonts; standard Thai support is in collection-langother. Additional packages for CJK are in their individual language collections.
ca: Paquets que donen suport a una combinació de xinès, japonès, coreà, incloent macros, fonts, documentació. També el tailandès en la codificació c90, ja que hi ha alguna superposició en aquestes fonts; el suport estàndard tailandès està en col·lecció-langother. Els paquets addicionals per al CJK es troben a les seves col·leccions d'idiomes individuals.
fr: Paquets prenant en charge une combinaison de chinois, japonais et coréen, y compris les macros, les polices, la documentation. Egalement le thaï dans l'encodage c90, puisqu'il y a un certain chevauchement dans ces polices ; le support standard du thaï est dans la collection-langother. Des paquets supplémentaires pour le CJK se trouvent dans leurs collections de langues individuelles.

source: Cyrillic
ca: Ciríl·lic
fr: Cyrillique

source: Support for Cyrillic scripts (Bulgarian, Russian, Serbian, Ukrainian), even if Latin alphabets may also be used.
ca: Suport per a les escriptures ciríl·liques (búlgar, rus, serbi, ucraïnès), fins i tot si també es poden utilitzar alfabets llatins.
fr: Prise en charge des caractères cyrilliques (bulgare, russe, serbe, ukrainien), même si les alphabets latins peuvent également être utilisés.

source: Czech/Slovak
ca: Txec/eslovac
fr: Tchèque/Slovaque

source: Support for Czech/Slovak.
ca: Suport per a txec/eslovac.
fr: Prise en charge du tchèque/slovaque.

source: US and UK English
ca: Anglès americà i britànic
fr: Anglais américain et britannique

source: Support for, and documentation in, English.
ca: Suport i documentació en anglès.
fr: Prise en charge et documentation en anglais.

source: Other European languages
ca: Altres llengües europees
fr: Autres langues européennes

source: Support for a number of European languages; others (Greek, German, French, ...) have their own collections, depending simply on the size of the support.
ca: Suport a una sèrie de llengües europees; altres (grec, alemany, francès, ...) tenen les seves pròpies col·leccions, depenent simplement de la mida del suport.
fr: Prise en charge d'un certain nombre de langues européennes ; d'autres (grec, allemand, français, ...) ont leurs propres collections, qui dépendent simplement de la taille du support.

source: French
ca: Francès
fr: Français

source: Support for French and Basque.
ca: Suport al francès i al basc.
fr: Prise en charge du français et du basque.

source: German
ca: Alemany
fr: Allemand

source: Support for German.
ca: Suport a l'alemany.
fr: Prise en charge de l'allemand.

source: Greek
ca: Grec
fr: Grec

source: Support for Greek.
ca: Suport al grec.
fr: Prise en charge du grec.

source: Italian
ca: italià
fr: Italien

source: Support for Italian.
ca: Suport a l'italià.
fr: Prise en charge de l'italien.

source: Japanese
ca: Japonès
fr: Prise en charge du japonais

source: Support for Japanese; additional packages in collection-langcjk.
ca: Suport per al japonès; paquets addicionals a collection-langcjk.
fr: Prise en charge du japonais ; paquets supplémentaires dans collection-langcjk.

source: Korean
ca: Coreà
fr: Coréen

source: Support for Korean; additional packages in collection-langcjk.
ca: Suport per als paquets addicionals del Korean; a collection-langcjk.
fr: Prise en charge du coréen ; paquets supplémentaires dans collection-langcjk.

source: Other languages
ca: Altres llengües
fr: Autres langues

source: Support for languages not otherwise listed, including Indic, Thai, Vietnamese, Hebrew, Indonesian, African languages, and plenty more. The split is made simply on the basis of the size of the support, to keep both collection sizes and the number of collections reasonable.
ca: Suport per a llengües no llistades d'una altra manera, inclosos l'índic, el tailandès, el vietnamita, l'hebreu, l'indonesi, les llengües africanes i moltes més. L'escissió es fa simplement sobre la base de la mida del suport, per mantenir tant la mida de la col·lecció com el nombre de col·leccions raonables.
fr: Prise en charge de langues non répertoriées ailleurs, notamment l'indien, le thaï, le vietnamien, l'hébreu, l'indonésien, les langues africaines et bien d'autres encore. La répartition se fait simplement sur la base de la taille du support, afin que la taille des collections et le nombre de collections restent raisonnables.

source: Polish
ca: Polonès
fr: Polonais

source: Support for Polish.
ca: Suport al polonès.
fr: Prise en charge du polonais.

source: Portuguese
ca: Portuguès
fr: Portugais

source: Support for Portuguese.
ca: Suport al portuguès.
fr: Prise en charge du portugais.

source: Spanish
ca: Espanyol
fr: Espagnol

source: Support for Spanish.
ca: Suport a l'espanyol.
fr: Prise en charge de l'espagnol.

source: LaTeX fundamental packages
ca: Paquets fonamentals LaTeX
fr: Paquets fondamentaux de LaTeX

source: These packages are either mandated by the core LaTeX team, or very widely used and strongly recommended in practice.
ca: Aquests paquets estan ordenats per l'equip de LaTeX, o són molt utilitzats i molt recomanats a la pràctica.
fr: Ces paquets sont soit imposés par l'équipe principale de LaTeX, soit très largement utilisés et fortement recommandés dans la pratique.

source: LaTeX additional packages
ca: Paquets addicionals LaTeX
fr: Paquets supplémentaires pour LaTeX
