Repository: openSUSE/packages-i18n
Catalog: */po/texlive.*.po
Languages: ca, fr

source: This package includes the synctex development files. The Synchronization TeXnology by Jérôme Laurens is a new feature of recent TeX engines. It allows to synchronize between input and output, which means to navigate from the source document to the typeset material and vice versa.
ca: Aquest paquet inclou els fitxers de desenvolupament de synctex. La Sincronització TeXnologia de Jérmeme Laurens és una nova característica dels motors TeX recents. Permet sincronitzar entre entrada i sortida, el que significa navegar des del document d'origen fins al material gravat i viceversa.
fr: Ce paquet comprend les fichiers de développement synctex. La TeXnologie de synchronisation de Jérôme Laurens est une nouvelle fonctionnalité des moteurs TeX récents. Elle permet de synchroniser l'entrée et la sortie, c'est-à-dire de naviguer entre le document source et le document typographié et inversement.

source: Binary files of tetex
ca: Fitxers binaris de tetex
fr: Fichiers binaires de tetex

source: Binary files of tex
ca: Fitxers binaris de tex
fr: Fichiers binaires de tex

source: Binary files of tex4ebook
ca: Fitxers binaris del tex4ebook
fr: Fichiers binaires de tex4ebook

source: Binary files of tex4ht
ca: Fitxers binaris de tex4ht
fr: Fichiers binaires de tex4ht

source: Binary files of texconfig
ca: Fitxers binaris de texconfig
fr: Fichiers binaires de texconfig

source: Binary files of texcount
ca: Fitxers binaris de texcount
fr: Fichiers binaires de texcount

source: Binary files of texdef
ca: Fitxers binaris de texdef
fr: Fichiers binaires de texdef

source: Binary files of texdiff
ca: Fitxers binaris de texdiff
fr: Fichiers binaires de texdiff

source: Binary files of texdirflatten
ca: Fitxers binaris de texdirflatten
fr: Fichiers binaires de texdirflatten

source: Binary files of texdoc
ca: Fitxers binaris de texdoc
fr: Fichiers binaires de texdoc

source: Binary files of texfot
ca: Fitxers binaris de texfot
fr: Fichiers binaires de texfot

source: Binary files of texliveonfly
ca: Fitxers binaris de texliveonfly
fr: Fichiers binaires de texliveonly

source: Binary files of texloganalyser
ca: Fitxers binaris de texloganalyser
fr: Fichiers binaires de texloganalyser

source: This package includes the luatex development files. LuaTeX is an extended version of pdfTeX using Lua as an embedded scripting language
ca: Aquest paquet inclou els fitxers de desenvolupament de luatex. LuaTeX és una versió estesa de pdfTeX que utilitza Lua com a llenguatge de script incrustat
fr: Ce paquet comprend les fichiers de développement luatex. LuaTeX est une version étendue de pdfTeX utilisant Lua comme langage de script intégré.

source: This package includes the LuaJIT development files. LuaJIT is a Just-In-Time (JIT) compiler for the Lua programming language
ca: Aquest paquet inclou els fitxers de desenvolupament de LuaJIT. LuaJIT és un compilador Just-In-Time (JIT) per al llenguatge de programació Lua
fr: Ce paquet comprend les fichiers de développement LuaJIT. LuaJIT est un compilateur Just-In-Time (JIT) pour le langage de programmation Lua

source: Binary files of texosquery
ca: Fitxers binaris de texosquery
fr: Fichiers binaires de texosquery

source: Binary files of texsis
ca: Fitxers binaris de texsis
fr: Fichiers binaires de texsis

source: Binary files of texware
ca: Fitxers binaris de texware
fr: Fichiers binaires de texware

source: Binary files of thumbpdf
ca: Fitxers binaris de thumbpdf
fr: Fichiers binaires de thumbpdf

source: Binary files of tie
ca: Fitxers binaris de la lligadura d'unió
fr: Fichiers binaires de tie

source: Binary files of tpic2pdftex
ca: Fitxers binaris de tpic2pdftex
fr: Fichiers binaires de tpic2pdftex

source: Binary files of ttfutils
ca: Fitxers binaris de ttfutils
fr: Fichiers binaires de ttfutils

source: Binary files of typeoutfileinfo
ca: Fitxers binaris de typeoutfileinfo
fr: Fichiers binaires de typeoutfileinfo

source: Binary files of ulqda
ca: Fitxers binaris d'ulqda
fr: Fichiers binaires deulqda

source: Binary files of uplatex
ca: Fitxers binaris d'uplatex
fr: Fichiers binaires de uplatex

source: Binary files of uptex
ca: Fitxers binaris d'uptex
fr: Fichiers binaires de uptex

source: Binary files of urlbst
ca: Fitxers binaris de urlbst
fr: Fichiers binaires de urlbst

source: Binary files of velthuis
ca: Fitxers binaris de velthuis
fr: Fichiers binaires de velthuis

source: Binary files of vlna
ca: Fitxers binaris de vlna
fr: Fichiers binaires de vlna

source: Binary files of vpe
ca: Fitxers binaris de vpe
fr: Fichiers binaires de vpe

source: Binary files of web
ca: Fitxers binaris del web
fr: Fichiers binaires de web

source: Binary files of xdvi
ca: Fitxers binaris de xdvi
fr: Fichiers binaires de xdvi

source: Binary files of xetex
ca: Fitxers binaris de xetex
fr: Fichiers binaires de xetex

source: Binary files of xmltex
ca: Fitxers binaris de xmltex
fr: Fichiers binaires de xmltex

source: Binary files of yplan
ca: Fitxers binaris de yplan
fr: Fichiers binaires de yplan

source: Binary files of albatross
ca: Fitxers binaris d'albatross
fr: Fichiers binaires de albatross

source: Binary files of attachfile2
ca: Fitxers binaris del fitxer adjunt2
fr: Fichiers binaires de attachfile2

source: Binary files of axodraw2
ca: Fitxers binaris d'axodraw2
fr: Fichiers binaires de axodraw2

source: Binary files of bib2gls
ca: Fitxers binaris de bib2gls
fr: Fichiers binaires de bib2gls

source: Binary files of chklref
ca: Fitxers binaris de chklref
fr: Fichiers binaires de chklref

source: Binary files of clojure-pamphlet
ca: Fitxers binaris de clojure-pamphlet
fr: Fichiers binaires de clojure-pamphlet

source: Binary files of cluttex
ca: Fitxers binaris de cluttex
fr: Fichiers binaires de cluttex

source: Myriad additional TeX-related support programs. Includes programs and macros for DVI file manipulation, literate programming, patgen, and plenty more.
ca: Myriad programes addicionals de suport relacionats amb TeX. Inclou programes i macros per a la manipulació de fitxers DVI, programació alfabetitzada, patgen i molt més.
fr: Une myriade de programmes d'aide supplémentaires liés à TeX. Comprend des programmes et des macros pour la manipulation de fichiers DVI, la programmation lettrée, le patgen, et bien d'autres choses encore.

source: Packages supporting a combination of Chinese, Japanese, Korean, including macros, fonts, documentation. Also Thai in the c90 encoding, since there is some overlap in those fonts; standard Thai support is in collection-langother. Additional packages for CJK are in their individual language collections.
ca: Paquets que donen suport a una combinació de xinès, japonès, coreà, incloent macros, fonts, documentació. També el tailandès en la codificació c90, ja que hi ha alguna superposició en aquestes fonts; el suport estàndard tailandès està en col·lecció-langother. Els paquets addicionals per al CJK es troben a les seves col·leccions d'idiomes individuals.
fr: Paquets prenant en charge une combinaison de chinois, japonais et coréen, y compris les macros, les polices, la documentation. Egalement le thaï dans l'encodage c90, puisqu'il y a un certain chevauchement dans ces polices ; le support standard du thaï est dans la collection-langother. Des paquets supplémentaires pour le CJK se trouvent dans leurs collections de langues individuelles.

source: Support for Japanese; additional packages are in collection-langcjk.
ca: Suport per al japonès; els paquets addicionals es troben a collection-langcjk.
fr: Prise en charge du japonais ; les paquets supplémentaires se trouvent dans la collection-langcjk.

source: Support for languages not otherwise listed, including Indic, Thai, Vietnamese, Hebrew, Indonesian, African languages, and plenty more. The split is made simply on the basis of the size of the support, to keep both collection sizes and the number of collections reasonable.
ca: Suport per a llengües no llistades d'una altra manera, inclosos l'índic, el tailandès, el vietnamita, l'hebreu, l'indonesi, les llengües africanes i moltes més. L'escissió es fa simplement sobre la base de la mida del suport, per mantenir tant la mida de la col·lecció com el nombre de col·leccions raonables.
fr: Prise en charge de langues non répertoriées ailleurs, notamment l'indien, le thaï, le vietnamien, l'hébreu, l'indonésien, les langues africaines et bien d'autres encore. La répartition se fait simplement sur la base de la taille du support, afin que la taille des collections et le nombre de collections restent raisonnables.

source: A collection of recommended add-on packages for LaTeX which have widespread use, and the release candidate formats latex-dev, etc.
ca: Una col·lecció de paquets de complements recomanats per a LaTeX que tenen un ús generalitzat, i els formats candidats de llançament latex-dev, etc.
fr: Une collection de paquets complémentaires recommandés pour LaTeX qui sont largement utilisés, et les formats candidats à la publication latex-dev, etc.

source: Mathematics, natural sciences, computer science packages
ca: Matemàtiques, ciències naturals, paquets d'informàtica
fr: Paquets pour les mathématiques, les sciences naturelles et l'informatique

source: Binary files of ctan-o-mat
ca: Fitxers binaris de ctan-o-mat
fr: Fichiers binaires de ctan-o-mat

source: Binary files of ctanbib
ca: Fitxers binaris del ctanbib
fr: Fichiers binaires de ctanbib

source: Binary files of dviout-util
ca: Fitxers binaris de dviout-util
fr: Fichiers binaires de dviout-util

source: Binary files of git-latexdiff
ca: Fitxers binaris de git-latexdiff
fr: Fichiers binaires de git-latexdiff

source: Binary files of hyperxmp
ca: Fitxers binaris d'hiperxmp
fr: Fichiers binaires de hyperxmp

source: Binary files of jfmutil
ca: Fitxers binaris de jfmutil
fr: Fichiers binaires de jfmutil

source: Binary files of ketcindy
ca: Fitxers binaris de ketcindy
fr: Fichiers binaires de ketcindy

source: Binary files of l3build
ca: Fitxers binaris de l3build
fr: Fichiers binaires de l3build

source: Binary files of latex-bin-dev
ca: Fitxers binaris de latex-bin-dev
fr: Fichiers binaires de latex-bin-dev

source: Binary files of light-latex-make
ca: Fitxers binaris de light-latex-make
fr: Fichiers binaires de light-latex-make

source: Binary files of luahbtex
ca: Fitxers binaris de luahbtex
fr: Fichiers binaires de luahbtex

source: Binary files of luajittex
ca: Fitxers binaris de luajittex
fr: Fichiers binaires de luajittex

source: Binary files of optex
ca: Fitxers binaris d'optex
fr: Fichiers binaires de optex

source: Binary files of pdftex-quiet
ca: Fitxers binaris de pdftex-quiet
fr: Fichiers binaires de pdftex-quiet

source: Binary files of pdftosrc
ca: Fitxers binaris de pdftosrc
fr: Fichiers binaires de pdftosrc

source: Binary files of ps2eps
ca: Fitxers binaris de ps2eps
fr: Fichiers binaires de ps2eps

source: This is the basic TeX Live scheme: it is a small set of files sufficient to typeset plain TeX or LaTeX documents in PostScript or PDF, using the Computer Modern fonts. This scheme corresponds to collection-basic and collection-latex.
ca: Aquest és l'esquema bàsic de TeX Live: és un petit conjunt de fitxers suficients per a gravar documents TeX o LaTeX en PostScript o PDF, utilitzant els tipus de lletra Computer Modern. Aquest esquema correspon a collection-basic i collection-latex.
fr: Il s'agit du schéma TeX Live de base : il s'agit d'un petit ensemble de fichiers suffisants pour composer des documents TeX ou LaTeX simples en PostScript ou PDF, en utilisant les polices Computer Modern. Ce schéma correspond à collection-basic et collection-latex.

source: This is the TeX Live scheme for infrastructure only, with no TeX engines at all. It is useful for automated testing, where the actual programs and packages to be tested are installed separately afterwards, with tlmgr install.
ca: Aquest és l'esquema TeX Live només per a infraestructura, sense cap motor TeX. És útil per a proves automatitzades, on els programes i paquets reals que s'han de provar s'instal·len per separat després, amb la instal·lació de tlmgr.
fr: Il s'agit du schéma TeX Live pour l'infrastructure uniquement, sans aucun moteur TeX.Il est utile pour les tests automatisés, où les programmes et les paquets à tester sont installés séparément par la suite, avec tlmgr install.

source: This is the minimal TeX Live scheme, with support for only plain TeX. (No LaTeX macros.) LuaTeX is included because Lua scripts are used in TeX Live infrastructure. This scheme corresponds exactly to collection-basic.
ca: Aquest és l'esquema mínim de TeX Live, amb suport només per a TeX pla. (Sense macros LaTeX.) LuaTeX s'inclou perquè els scripts Lua s'utilitzen a la infraestructura de TeX Live. Aquest esquema correspon exactament al fons de la col·lecció.
fr: Il s'agit du schéma minimal de TeX Live, qui ne prend en charge que le TeX simple (pas de macros LaTeX). LuaTeX est inclus car les scripts Lua sont utilisés dans l'infrastructure de TeX Live. Ce schéma correspond exactement à collection-basic.

source: This is a small TeX Live scheme, corresponding to MacTeX's BasicTeX variant. It adds XeTeX, MetaPost, various hyphenations, and some recommended packages to scheme-basic.
ca: Aquest és un petit esquema de TeX Live, corresponent a la variant BasicTeX de MacTeX. Afegeix XeTeX, MetaPost, diverses partició de mots i alguns paquets recomanats a scheme-basic.
fr: Il s'agit d'un petit schéma TeX Live, correspondant à la variante BasicTeX de MacTeX. Il ajoute XeTeX, MetaPost, diverses césures et quelques paquets recommandés à scheme-basic.

source: Binary files of texlive-scripts
ca: Fitxers binaris de texlive-scripts
fr: Fichiers binaires de texlive-scripts

source: Binary files of texlive-scripts-extra
ca: Fitxers binaris de texlive-scripts-extra
fr: Fichiers binaires de texlive-scripts-extra

source: Binary files of spix
ca: Fitxers binaris de l'spix
fr: Fichiers binaires de spix

source: Binary files of texdoctk
ca: Fitxers binaris de texdoctk
fr: Fichiers binaires de texdoctk

source: Binary files of texplate
ca: Fitxers binaris de texplate
fr: Fichiers binaires de texplate

source: Binary files of tikztosvg
ca: Fitxers binaris de tikztosvg
fr: Fichiers binaires de tikztosvg

source: Auto-generated font map files
ca: Fitxers de mapa de tipus de lletra generats automàticament
fr: Fichiers de polices générés automatiquement

source: These map files are regenerated every time a new font is added. There is no need to rebuild formats or update binaries because of such updates, hence this separate package.
ca: Aquests fitxers de mapa es regeneren cada vegada que s'afegeix un nou tipus de lletra. No hi ha necessitat de reconstruir formats o actualitzar binaris a causa d'aquestes actualitzacions, d'aquí aquest paquet separat.
fr: Ces fichiers sont régénérés à chaque fois qu'une nouvelle police est ajoutée. Il n'est pas nécessaire de reconstruire les formats ou de mettre à jour les binaires à cause de ces mises à jour, d'où l'existence de ce paquet séparé.

source: Binary files of webquiz
ca: Fitxers binaris de webquiz
fr: Fichiers binaires de webquiz

source: Binary files of wordcount
ca: Fitxers binaris de wordcount
fr: Fichiers binaires de wordcount

source: Binary files of xelatex-dev
ca: Fitxers binaris de xelatex-dev
fr: Fichiers binaires de xelatex-dev

source: Binary files of xindex
ca: Fitxers binaris de xindex
fr: Fichiers binaires de xindex

source: Binary files of xml2pmx
ca: Fitxers binaris de xml2pmx
fr: Fichiers binaires de xml2pmx

source: Binary files of xpdfopen
ca: Fitxers binaris de xpdfopen
fr: Fichiers binaires de xpdfopen
