Repository: openSUSE/packages-i18n
Catalog: */po/texlive.*.po
Languages: ca, fr

source: A very large collection of add-on packages for LaTeX.
ca: Una col·lecció molt gran de paquets de complements per a LaTeX.
fr: Une très grande collection de paquets complémentaires pour LaTeX.

source: LaTeX recommended packages
ca: Paquets recomanats LaTeX
fr: Paquets LaTeX recommandés

source: A collection of recommended add-on packages for LaTeX which have widespread use.
ca: Una col·lecció de paquets de complements recomanats per a LaTeX que tenen un ús generalitzat.
fr: Une collection de paquets complémentaires recommandés pour LaTeX qui sont largement utilisés.

source: LuaTeX packages
ca: Paquets LuaTeX
fr: Paquets LuaTeX

source: Packages for LuaTeX, a Unicode-aware extension of pdfTeX, using Lua as an embedded scripting and extension language. http://luatex.org/
ca: Paquets per a LuaTeX, una extensió amb coneixement Unicode de pdfTeX, utilitzant Lua com a llenguatge de script i extensió incrustat. http://luatex.org/
fr: Paquets pour LuaTeX, une extension Unicode de pdfTeX, utilisant Lua comme langage de script et d'extension intégré. http://luatex.org/

source: Mathematics and science packages
ca: Paquets de matemàtiques i ciència
fr: Paquets pour les mathématiques et les sciences

source: The collection-mathscience package
ca: El paquet collection-mathscience
fr: Le paquet collection-mathscience

source: MetaPost and Metafont packages
ca: Paquets MetaPost i Metafont
fr: Paquets MetaPost et Metafont

source: The collection-metapost package
ca: El paquet collection-metapost
fr: Le paquet collection-metapost

source: Music packages
ca: Paquets de música
fr: Paquets pour la musique

source: Music-related fonts and packages.
ca: Tipus de lletra i paquets relacionats amb la música.
fr: Polices et paquets liés à la musique.

source: Graphics, pictures, diagrams
ca: Gràfics, imatges, diagrames
fr: Graphiques, images et diagrammes

source: Including TikZ, pict, etc., but MetaPost and PStricks are separate.
ca: Incloent TikZ, pict, etc., però MetaPost i PStricks estan separats.
fr: Y compris TikZ, pict, etc., mais MetaPost et PStricks sont distincts.

source: Plain (La)TeX packages
ca: Paquets Plain (La)TeX
fr: Paquets (La)TeX simples

source: Add-on packages and macros that work with plain TeX, often LaTeX, and occasionally other formats.
ca: Paquets de complements i macros que funcionen amb TeX pla, sovint LaTeX, i ocasionalment altres formats.
fr: Paquets d'extension et macros qui fonctionnent avec TeX, souvent LaTeX, et occasionnellement d'autres formats.

source: PSTricks core and all add-on packages.
ca: El nucli de PSTricks i tots els paquets de complements.
fr: PSTricks core et tous les modules complémentaires.

source: Publisher styles, theses, etcetera
ca: Estils d'editorial, tesis, etc.
fr: Modèles d'édition, thèses, etc

source: The collection-publishers package
ca: El paquet «collage-publishers»
fr: Le paquet collection-éditeurs

source: XeTeX and packages
ca: XeTeX i paquets
fr: XeTeX et paquets

source: Packages for XeTeX, the Unicode/OpenType-enabled TeX by Jonathan Kew, http://tug.org/xetex.
ca: Paquets per a XeTeX, l'Unicode/OpenType-enabled TeX per Jonathan Kew, http://tug.org/xetex.
fr: Paquets pour XeTeX, le TeX compatible Unicode/OpenType de Jonathan Kew, http://tug.org/xetex.

source: Binary files of context
ca: Fitxers binaris de context
fr: Fichiers binaires de context

source: Binary files of convbkmk
ca: Fitxers binaris de convbkmk
fr: Fichiers binaires de convbkmk

source: Binary files of crossrefware
ca: Fitxers binaris de crossrefware
fr: Fichiers binaires de crossrefware

source: Binary files of cslatex
ca: Fitxers binaris de cslatex
fr: Fichiers binaires de cslatex

source: Binary files of csplain
ca: Fitxers binaris del csplain
fr: Fichiers binaires de csplain

source: Binary files of ctanify
ca: Fitxers binaris de ctanify
fr: Fichiers binaires de ctanify

source: Binary files of ctanupload
ca: Fitxers binaris de ctanupload
fr: Fichiers binaires de ctanupload

source: Binary files of ctie
ca: Fitxers binaris de ctie
fr: Fichiers binaires de ctie

source: Binary files of cweb
ca: Fitxers binaris de cweb
fr: Fichiers binaires de cweb

source: Binary files of cyrillic-bin
ca: Fitxers binaris de cyrillic-bin
fr: Fichiers binaires de cyrillic-bin

source: Binary files of de-macro
ca: Fitxers binaris de de-macro
fr: Fichiers binaires de de-macro

source: Binary files of detex
ca: Fitxers binaris de detex
fr: Fichiers binaires de detex

source: Binary files of diadia
ca: Fitxers binaris de diadia
fr: Fichiers binaires de diadia

source: Binary files of dosepsbin
ca: Fitxers binaris de dosepsbin
fr: Fichiers binaires de dosepsbin

source: Binary files of dtl
ca: Fitxers binaris de dtl
fr: Fichiers binaires de dtl

source: Binary files of dtxgen
ca: Fitxers binaris de dtxgen
fr: Fichiers binaires de dtxgen

source: Binary files of dviasm
ca: Fitxers binaris de dviasm
fr: Fichiers binaires de dviasm

source: Binary files of dvicopy
ca: Fitxers binaris de dvicopy
fr: Fichiers binaires de dvicopy

source: Binary files of dvidvi
ca: Fitxers binaris de dvidvi
fr: Fichiers binaires de dvidvi

source: Binary files of dviinfox
ca: Fitxers binaris de dviinfox
fr: Fichiers binaires de dviinfox

source: Binary files of dviljk
ca: Fitxers binaris de dviljk
fr: Fichiers binaires de dviljk

source: Binary files of dvipdfmx
ca: Fitxers binaris de dvipdfmx
fr: Fichiers binaires de dvipdfmx

source: Binary files of dvipng
ca: Fitxers binaris de dvipng
fr: Fichiers binaires de dvipng

source: Binary files of dvipos
ca: Fitxers binaris de dvipos
fr: Fichiers binaires de dvipos

source: Binary files of dvips
ca: Fitxers binaris de dvips
fr: Fichiers binaires de dvips

source: Binary files of dvisvgm
ca: Fitxers binaris de dvisvgm
fr: Fichiers binaires de dvisvgm

source: Binary files of ebong
ca: Fitxers binaris d'ebong
fr: Fichiers binaires de ebong

source: Binary files of eplain
ca: Fitxers binaris d'eplain
fr: Fichiers binaires de eplain

source: Binary files of epspdf
ca: Fitxers binaris d'epspdf
fr: Fichiers binaires de epspdf

source: Binary files of epstopdf
ca: Fitxers binaris d'epstopdf
fr: Fichiers binaires de epstopdf

source: Binary files of exceltex
ca: Fitxers binaris d'exceltex
fr: Fichiers binaires de exceltex

source: Utilities like DviToDvi, PSToPS, and LaCheck
ca: Utilitats com DviToDvi, PSToPS i LaCheck
fr: Utilitaires tels que DviToDvi, PSToPS et LaCheck

source: The LaCheck utility is a syntax checker for LaTeX documents. The DviToDvi utilities are dvibook rearranges pages into book signatures, adds blank pages as needed dviselect selects pages and page ranges dvitodvi performs general page rearrangement of selected pages dviconcat concatenation of DVI files Three simple scripts for scaling DIN A4 pages and rearranging two by two onto a DIN A4 page (a4toa5) are included. The number of pages must be even (which can be done by odd2even or dvibook).
ca: La utilitat LaCheck és un corrector de sintaxi per a documents LaTeX. Les utilitats de DviToDvi són dvibook reorganitza les pàgines en signatures de llibres, afegeix pàgines en blanc segons sigui necessari dviselect selecciona pàgines i intervals de pàgines dvitodvi realitza la reordenació general de pàgines seleccionades dviconcat concatenació de fitxers DVI S'inclouen tres scripts simples per escalar pàgines DIN A4 i reorganitzar de dues en dues sobre una pàgina DIN A4 (a4toa5). El nombre de pàgines ha de ser parell (que es pot fer amb odd2even o dvibook).
fr: L'utilitaire LaCheck est un vérificateur de syntaxe pour les documents LaTeX. Les utilitaires DviToDvi sont les suivants dvibook réarrange les pages en cahiers, ajoute des pages vierges si nécessaire dviselect sélectionne des pages et des plages de pages dvitodvi effectue un réarrangement général des pages sélectionnées dviconcat concaténation de fichiers DVI Trois scripts simples permettant de mettre à l'échelle des pages DIN A4 et de les réorganiser deux par deux sur une page DIN A4 (a4toa5) sont inclus. Le nombre de pages doit être pair (ce qui peut être fait par odd2even ou dvibook).

source: Binary files of fig4latex
ca: Fitxers binaris de fig4latex
fr: Fichiers binaires de fig4latex

source: Basic file system of TeX Live
ca: Sistema de fitxers bàsic de TeX Live
fr: Le système de fichiers de base de TeX Live

source: The basic file system layout for TeX Live installation.
ca: La disposició bàsica del sistema de fitxers per a la instal·lació de TeX Live.
fr: Configuration de base du système de fichiers pour l'installation de TeX Live.

source: Binary files of findhyph
ca: Fitxers binaris de findhyph
fr: Fichiers binaires de findhyph

source: Binary files of fontinst
ca: Fitxers binaris de fontinst
fr: Fichiers binaires de fontinst

source: Binary files of fontools
ca: Fitxers binaris de fontools
fr: Fichiers binaires de fontools

source: Binary files of fontware
ca: Fitxers binaris de fontware
fr: Fichiers binaires de fontware

source: Binary files of fragmaster
ca: Fitxers binaris de fragmaster
fr: Fichiers binaires de fragmaster

source: Binary files of getmap
ca: Fitxers binaris de getmap
fr: Fichiers binaires de getmap

source: Binary files of glossaries
ca: Fitxers binaris de glossaris
fr: Fichiers binaires de glossaries

source: Binary files of gregoriotex
ca: Fitxers binaris de gregoriotex
fr: Fichiers binaires de gregoriotex

source: Binary files of gsftopk
ca: Fitxers binaris de gsftopk
fr: Fichiers binaires de gsftopk

source: Binary files of jadetex
ca: Fitxers binaris de jadetex
fr: Fichiers binaires de jadetex

source: Binary files of kotex-utils
ca: Fitxers binaris de kotex-utils
fr: Fichiers binaires de kotex-utils

source: Binary files of kpathsea
ca: Fitxers binaris del kpathsea
fr: Fichiers binaires de kpathsea

source: Binary files of lacheck
ca: Fitxers binaris de lacheck
fr: Fichiers binaires de lacheck

source: Binary files of latex-bin
ca: Fitxers binaris de latex-bin
fr: Fichiers binaires de latex-bin

source: Binary files of latex-git-log
ca: Fitxers binaris de latex-git-log
fr: Fichiers binaires de latex-git-log

source: Binary files of latex-papersize
ca: Fitxers binaris de latex-papersize
fr: Fichiers binaires de latex-papersize

source: Binary files of latex2man
ca: Fitxers binaris de latex2man
fr: Fichiers binaires de latex2man

source: Binary files of latex2nemeth
ca: Fitxers binaris de latex2nemeth
fr: Fichiers binaires de latex2nemeth

source: Binary files of latexdiff
ca: Fitxers binaris de latexdiff
fr: Fichiers binaires de latexdiff

source: Binary files of latexfileversion
ca: Fitxers binaris de latexfileversion
fr: Fichiers binaires de latexfileversion

source: Binary files of latexindent
ca: Fitxers binaris de latexindent
fr: Fichiers binaires de latexindent

source: Binary files of latexmk
ca: Fitxers binaris de latexmk
fr: Fichiers binaires de latexmk

source: Binary files of latexpand
ca: Fitxers binaris de latexpand
fr: Fichiers binaires de latexpand

source: Binary files of lcdftypetools
ca: Fitxers binaris de lcdftypetools
fr: Fichiers binaires de lcdftypetools

source: Binary files of lilyglyphs
ca: Fitxers binaris de liliglifs
fr: Fichiers binaires de lilyglyphs

source: Binary files of listbib
ca: Fitxers binaris de listbib
fr: Fichiers binaires de listbib

source: Binary files of listings-ext
ca: Fitxers binaris de listings-ext
fr: Fichiers binaires de listings-ext

source: Binary files of lollipop
ca: Fitxers binaris del lollipop
fr: Fichiers binaires de lollipop

source: Binary files of ltxfileinfo
ca: Fitxers binaris de ltxfileinfo
fr: Fichiers binaires de ltxfileinfo

source: Binary files of ltximg
ca: Fitxers binaris de ltximg
fr: Fichiers binaires de ltximg

source: Binary files of lua2dox
ca: Fitxers binaris de lua2dox
fr: Fichiers binaires de lua2dox

source: Binary files of luaotfload
ca: Fitxers binaris de luaotfload
fr: Fichiers binaires de luaotfload

source: Binary files of luatex
ca: Fitxers binaris de luatex
fr: Fichiers binaires de luatex

source: Binary files of lwarp
ca: Fitxers binaris de lwarp
fr: Fichiers binaires de lwarp

source: Binary files of m-tx
ca: Fitxers binaris de m-tx
fr: Fichiers binaires de m-tx

source: Binary files of make4ht
ca: Fitxers binaris del make4ht
fr: Fichiers binaires de make4ht

source: Binary files of makedtx
ca: Fitxers binaris de makedtx
fr: Fichiers binaires de makedtx

source: Binary files of makeindex
ca: Fitxers binaris de makeindex
fr: Fichiers binaires de makeindex

source: Binary files of match_parens
ca: Fitxers binaris de matchparens
fr: Fichiers binaires de match_parens

source: Binary files of mathspic
ca: Fitxers binaris de mathspic
fr: Fichiers binaires de mathspic

source: Binary files of metafont
ca: Fitxers binaris de metafont
fr: Fichiers binaires de metafont

source: Binary files of metapost
ca: Fitxers binaris de metapost
fr: Fichiers binaires de metapost

source: Binary files of mex
ca: Fitxers binaris de mex
fr: Fichiers binaires de mex

source: Binary files of mf2pt1
ca: Fitxers binaris de mf2pt1
fr: Fichiers binaires de mf2pt1

source: Binary files of mflua
ca: Fitxers binaris de mflua
fr: Fichiers binaires de mflua

source: Binary files of mfware
ca: Fitxers binaris de mfware
fr: Fichiers binaires de mfware

source: Binary files of mkgrkindex
ca: Fitxers binaris de mkgrkindex
fr: Fichiers binaires de mkgrkindex

source: Binary files of mkjobtexmf
ca: Fitxers binaris de mkjobtexmf
fr: Fichiers binaires de mkjobtexmf

source: Binary files of mkpic
ca: Fitxers binaris del mkpic
fr: Fichiers binaires de mkpic

source: Binary files of mltex
ca: Fitxers binaris de mltex
fr: Fichiers binaires de mltex

source: Binary files of mptopdf
ca: Fitxers binaris de mptopdf
fr: Fichiers binaires de mptopdf

source: Binary files of multibibliography
ca: Fitxers binaris de multibibliografia
fr: Fichiers binaires de multibibliography

source: Binary files of musixtex
ca: Fitxers binaris de musixtex
fr: Fichiers binaires de musixtex

source: Binary files of musixtnt
ca: Fitxers binaris de musixtnt
fr: Fichiers binaires de musixtnt

source: Binary files of omegaware
ca: Fitxers binaris d'omegaware
fr: Fichiers binaires de omegaware

source: Binary files of patgen
ca: Fitxers binaris de patgen
fr: Fichiers binaires de patgen

source: Binary files of pax
ca: Fitxers binaris de pax
fr: Fichiers binaires de pax

source: Binary files of pdfbook2
ca: Fitxers binaris del pdfbook2
fr: Fichiers binaires de pdfbook2

source: Binary files of pdfcrop
ca: Fitxers binaris del pdfcrop
fr: Fichiers binaires de pdfcrop

source: Binary files of pdfjam
ca: Fitxers binaris de pdfjam
fr: Fichiers binaires de pdfjam

source: Binary files of pdflatexpicscale
ca: Fitxers binaris de pdflatexpicscale
fr: Fichiers binaires de pdflatexpicscale

source: Binary files of pdftex
ca: Fitxers binaris de pdftex
fr: Fichiers binaires de pdftex

source: Binary files of pdftools
ca: Fitxers binaris de pdftools
fr: Fichiers binaires de pdftools

source: Binary files of pdfxup
ca: Fitxers binaris de pdfxup
fr: Fichiers binaires de pdfxup

source: Binary files of pedigree-perl
ca: Fitxers binaris de pedigree-perl
fr: Fichiers binaires de pedigree-perl

source: Binary files of perltex
ca: Fitxers binaris de perltex
fr: Fichiers binaires de perltex

source: Binary files of petri-nets
ca: Fitxers binaris de petri-nets
fr: Fichiers binaires de petri-nets

source: Binary files of pfarrei
ca: Fitxers binaris de pfarrei
fr: Fichiers binaires de pfarrei

source: Binary files of pkfix
ca: Fitxers binaris de pkfix
fr: Fichiers binaires de pkfix

source: Binary files of pkfix-helper
ca: Fitxers binaris de pkfix-helper
fr: Fichiers binaires de pkfix-helper

source: Binary files of platex
ca: Fitxers binaris de platex
fr: Fichiers binaires de platex

source: Binary files of pmx
ca: Fitxers binaris de pmx
fr: Fichiers binaires de pmx

source: Binary files of pmxchords
ca: Fitxers binaris de pmxchords
fr: Fichiers binaires de pmxchords

source: Binary files of ps2pk
ca: Fitxers binaris de ps2pk
fr: Fichiers binaires de ps2pk

source: Binary files of pst-pdf
ca: Fitxers binaris de pst-pdf
fr: Fichiers binaires de pst-pdf

source: Binary files of pst2pdf
ca: Fitxers binaris de pst2pdf
fr: Fichiers binaires de pst2pdf

source: Binary files of pstools
ca: Fitxers binaris de pstools
fr: Fichiers binaires de pstools

source: Binary files of ptex
ca: Fitxers binaris de ptex
fr: Fichiers binaires de ptex

source: Binary files of ptex-fontmaps
ca: Fitxers binaris de ptex-fontmaps
fr: Fichiers binaires de ptex-fontmaps

source: Binary files of ptex2pdf
ca: Fitxers binaris de ptex2pdf
fr: Fichiers binaires de ptex2pdf

source: This package includes the ptexenc development files. The ptexenc is a useful library for Japanese pTeX (which stands for publishing TeX, and is an extension of TeX by ASCII Co.) and its surrounding tools.
ca: Aquest paquet inclou els fitxers de desenvolupament ptexenc. El ptexenc és una biblioteca útil per al pTeX japonès (que significa publicar TeX, i és una extensió de TeX per ASCII Co.) i les seves eines circumdants.
fr: Ce paquet comprend les fichiers de développement de ptexenc. Le ptexenc est une bibliothèque utile pour le pTeX japonais (qui signifie publishing TeX, et est une extension de TeX par ASCII Co.) et les outils qui l'entourent.

source: Binary files of purifyeps
ca: Fitxers binaris de purifyeps
fr: Fichiers binaires de purifyeps

source: Binary files of pygmentex
ca: Fitxers binaris de pygmentex
fr: Fichiers binaires de pygmentex

source: Binary files of pythontex
ca: Fitxers binaris de pythontex
fr: Fichiers binaires de pythontex

source: Binary files of rubik
ca: Fitxers binaris del rubik
fr: Fichiers binaires de rubik

source: Basic scheme (plain and latex)
ca: Esquema bàsic (pla i làtex)
fr: Schéma de base (simple et latex)

source: This is the basic TeX Live scheme: it is a small set of files sufficient to typeset plain TeX or LaTeX documents in PostScript or PDF, using the Computer Modern fonts. This scheme corresponds to collection-basic and collection-latex.
ca: Aquest és l'esquema bàsic de TeX Live: és un petit conjunt de fitxers suficients per a gravar documents TeX o LaTeX en PostScript o PDF, utilitzant els tipus de lletra Computer Modern. Aquest esquema correspon a collection-basic i collection-latex.
fr: Il s'agit du schéma TeX Live de base : il s'agit d'un petit ensemble de fichiers suffisants pour composer des documents TeX ou LaTeX simples en PostScript ou PDF, en utilisant les polices Computer Modern. Ce schéma correspond à collection-basic et collection-latex.

source: ConTeXt scheme
ca: Esquema de ConTeXt
fr: Schéma ConTeXt

source: This is the TeX Live scheme for installing ConTeXt.
ca: Aquest és l'esquema TeX Live per instal·lar ConTeXt.
fr: Il s'agit du schéma TeX Live pour l'installation de ConTeXt.

source: Full scheme (everything)
ca: Esquema complet (tot)
fr: Schéma complet (tout)

source: This is the full TeX Live scheme: it installs everything available.
ca: Aquest és l'esquema complet de TeX Live: instal·la tot el disponible.
fr: C'est le schéma complet de TeX Live : il installe tout ce qui est disponible.

source: GUST TeX Live scheme
ca: Esquema GUST TeX Live
fr: SchémaGUST TeX Live

source: This is the GUST TeX Live scheme: it is a set of files sufficient to typeset Polish plain TeX, LaTeX and ConTeXt documents in PostScript or PDF.
ca: Aquest és l'esquema GUST TeX Live: és un conjunt de fitxers suficients per gravar documents polonesos TeX, LaTeX i ConTeXt en PostScript o PDF.
fr: Il s'agit du schéma GUST TeX Live : c'est un ensemble de fichiers suffisants pour composer des documents TeX, LaTeX et ConTeXt polonais en PostScript ou PDF.

source: Infrastructure-only scheme (no TeX at all)
ca: Esquema de només infraestructura (sense TeX en absolut)
fr: Schéma d'infrastructure uniquement (pas de TeX du tout)

source: This is the TeX Live scheme for infrastructure only, with no TeX engines at all. It is useful for automated testing, where the actual programs and packages to be tested are installed separately afterwards, with tlmgr install.
ca: Aquest és l'esquema TeX Live només per a infraestructura, sense cap motor TeX. És útil per a proves automatitzades, on els programes i paquets reals que s'han de provar s'instal·len per separat després, amb la instal·lació de tlmgr.
fr: Ceci est le schéma TeX Live pour l'infrastructure uniquement, sans aucun moteur TeX. Il est utile pour les tests automatisés, où les programmes et les paquets à tester sont installés séparément par la suite, avec tlmgr install.

source: Medium scheme (small + more packages and languages)
ca: Esquema mitjà (petit + més paquets i idiomes)
fr: Schéma intermédiaire (petit + plus de paquets et de langues)

source: This is the medium TeX Live collection: it contains plain TeX, LaTeX, many recommended packages, and support for most European languages.
ca: Aquesta és la col·lecció medium TeX Live: conté TeX pla, LaTeX, molts paquets recomanats i suport per a la majoria de llengües europees.
fr: Ceci est la collection TeX Live moyenne : elle contient TeX simple, LaTeX, de nombreux paquets recommandés, et le support de la plupart des langues européennes.

source: Minimal scheme (plain only)
ca: Esquema mínim (només pla)
fr: Schéma minimal (simple)

source: This is the minimal TeX Live scheme, with support for only plain TeX. (No LaTeX macros.) LuaTeX is included because Lua scripts are used in TeX Live infrastructure. This scheme corresponds exactly to collection-basic.
ca: Aquest és l'esquema mínim de TeX Live, amb suport només per a TeX pla. (Sense macros LaTeX.) LuaTeX s'inclou perquè els scripts Lua s'utilitzen a la infraestructura de TeX Live. Aquest esquema correspon exactament al fons de la col·lecció.
fr: Il s'agit du schéma minimal de TeX Live, qui ne prend en charge que le TeX simple (pas de macros LaTeX). LuaTeX est inclus car les scripts Lua sont utilisés dans l'infrastructure de TeX Live. Ce schéma correspond exactement à collection-basic.

source: Small scheme (basic + xetex, metapost, a few languages)
ca: Esquema petit (bàsic + xetex, metapost, alguns idiomes)
fr: Petit schéma (basic + xetex, metapost, quelques langues)

source: This is a small TeX Live scheme, corresponding to MacTeX's BasicTeX variant. It adds XeTeX, MetaPost, various hyphenations, and some recommended packages to scheme-basic.
ca: Aquest és un petit esquema de TeX Live, corresponent a la variant BasicTeX de MacTeX. Afegeix XeTeX, MetaPost, diverses partició de mots i alguns paquets recomanats a scheme-basic.
fr: Il s'agit d'un petit schéma TeX Live, correspondant à la variante BasicTeX de MacTeX. Il ajoute XeTeX, MetaPost, diverses césures et quelques paquets recommandés à scheme-basic.

source: TeTeX scheme (more than medium, but nowhere near full)
ca: Esquema TeTeX (més que el suport, però enlloc gairebé complet)
fr: Schéma TeTeX (plus que moyen, mais loin d'être complet)

source: TeX Live scheme nearly equivalent to the teTeX distribution that was maintained by Thomas Esser.
ca: TeX Live esquema gairebé equivalent a la distribució teTeX que va ser mantinguda per Thomas Esser.
fr: Schéma TeTeX (plus que moyen, mais loin d'être complet)

source: Binary files of seetexk
ca: Fitxers binaris de seetexk
fr: Fichiers binaires de seetexk

source: Binary files of splitindex
ca: Fitxers binaris de splitindex
fr: Fichiers binaires de splitindex

source: Binary files of srcredact
ca: Fitxers binaris de srcredact
fr: Fichiers binaires de srcredact

source: Binary files of sty2dtx
ca: Fitxers binaris de sty2dtx
fr: Fichiers binaires desty2dtx

source: Binary files of svn-multi
ca: Fitxers binaris de svn-multi
fr: Fichiers binaires desvn-multi

source: Binary files of synctex
ca: Fitxers binaris de synctex
fr: Fichiers binaires de synctex
