Repository: openSUSE/packages-i18n
Catalog: */po/xfce4.*.po
Languages: ca

source: openSUSE Branding of libgarcon
ca: openSUSE Branding de libgarcon

source: This package provides the openSUSE look and feel for Garcon.
ca: Aquest paquet proporciona l'aspecte i comportament d'openSUSE per a Garcon.

source: Xfce Panel Shared Library
ca: Biblioteca compartida del plafó de Xfce

source: This package contains GTK 3 variant of the xfce4-panel shared library.
ca: Aquest paquet conté la variant GTK 3 de la biblioteca compartida xfce4-panel.

source: openSUSE Branding of libxfce4ui
ca: openSUSE Branding de libxfce4ui

source: This package provides the openSUSE look and feel for the libxfce4ui library.
ca: Aquest paquet proporciona l'aspecte i comportament de l'openSUSE per a la biblioteca libxfce4ui.

source: openSUSE Branding of thunar-volman
ca: openSUSE Branding de thunar-volman

source: This package provides the openSUSE look and feel for the Thunar Volume Manager.
ca: Aquest paquet proporciona l'aspecte i comportament d'openSUSE per al gestor de volums Thunar.

source: GObject introspection bindings for Xfce Panel
ca: Vinculacions d'introspecció GObject per al plafó Xfce

source: Application Finder for the Xfce Desktop Environment
ca: Cercador d'aplicacions per a l'entorn d'escriptori Xfce

source: xfce4-appfinder is an application finder for the Xfce desktop environment. It is a useful program that allows you to find applications on the system and launch them. It provides easy keyboard navigation and can be used as a replacement for xfrun4.
ca: xfce4-appfinder és un cercador d'aplicacions per a l'entorn d'escriptori Xfce. És un programa útil que permet trobar aplicacions en el sistema i llançar-les. Proporciona una navegació fàcil pel teclat i es pot utilitzar com a substitut de xfrun4.

source: Translations for package xfce4-appfinder
ca: Traduccions per al paquet xfce4-appfinder

source: Provides translations for the "xfce4-appfinder" package.
ca: Proporciona traduccions per al paquet «xfce4-appfinder».

source: Battery Monitoring Plugin for the Xfce Panel
ca: Connector de monitoratge de bateria per al plafó Xfce

source: The Battery plugin allows to monitor battery levels and can execute actions on low and critical levels.
ca: El connector Battery permet monitoritzar els nivells de bateria i pot executar accions en nivells baixos i crítics.

source: Translations for package xfce4-battery-plugin
ca: Traduccions per al paquet xfce4-battery-plugin

source: Provides translations for the "xfce4-battery-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-battery-plugin».

source: Calculator plugin for the Xfce4 panel
ca: Connector de calculadora per al plafó Xfce4

source: xfce4-calculator-plugin is a calculator plugin for the Xfce4 panel.
ca: xfce4-calculator-plugin és un connector de calculadora per al plafó Xfce4.

source: Translations for package xfce4-calculator-plugin
ca: Traduccions per al paquet xfce4-calculator-plugin

source: Provides translations for the "xfce4-calculator-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-calculator-plugin».

source: Clipboard Manager Plugin for the Xfce Panel
ca: Connector del gestor de porta-retalls per al plafó Xfce

source: This is a clipboard manager which comes with a plugin for the Xfce Panel. It stores the X selection (primary and clipboard) contents even after an application has quit and is able to handle text and image data. Furthermore, it can be configured to execute arbitrary actions when the selection content matches specific regular expressions.
ca: Aquest és un gestor del porta-retalls que ve amb un connector per al plafó Xfce. Emmagatzema el contingut de la selecció X (primària i porta-retalls) fins i tot després que una aplicació hagi sortit i sigui capaç de manejar text i dades d'imatge. A més, es pot configurar per executar accions arbitràries quan el contingut de la selecció coincideixi amb expressions regulars específiques.

source: Translations for package xfce4-clipman-plugin
ca: Traduccions per al paquet xfce4-clipman-plugin

source: Provides translations for the "xfce4-clipman-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-clipman-plugin».

source: CPU Frequency Scaling Monitor Plugin for the Xfce Panel
ca: Connector del monitor d'escalat de la freqüència de la CPU per al plafó Xfce

source: The CpuFreq scaling monitor plugin can be used to monitor the current CPU frequency and currently active governor.
ca: El connector del monitor d'escalat CpuFreq es pot utilitzar per monitorar la freqüència actual de la CPU i el governador actiu.

source: Translations for package xfce4-cpufreq-plugin
ca: Traduccions per al paquet xfce4-cpufreq-plugin

source: Provides translations for the "xfce4-cpufreq-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-cpufreq-plugin».

source: CPU Graph Plugin for the Xfce Panel
ca: Connector gràfic de la CPU per al plafó Xfce

source: The CPU Graph plugin diplays a customizable graph of the CPU load of either a specific CPU or all CPUs combined.
ca: El connector CPU Graph diplays un graf personalitzable de la càrrega de CPU d'una CPU específica o de totes les CPU combinades.

source: Translations for package xfce4-cpugraph-plugin
ca: Traduccions per al paquet xfce4-cpugraph-plugin

source: Provides translations for the "xfce4-cpugraph-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-cpugraph-plugin».

source: Date And Time Plugin for the Xfce Panel
ca: Connector de data i hora per al plafó Xfce

source: The date and time plugin displays the current date and time on the panel and can open a calendar when clicked.
ca: El connector data i hora mostra la data i l'hora actuals al plafó i pot obrir un calendari quan feu clic.

source: Translations for package xfce4-datetime-plugin
ca: Traduccions per al paquet xfce4-datetime-plugin

source: Provides translations for the "xfce4-datetime-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-datetime-plugin».

source: Xfce Development Tools
ca: Eines de desenvolupament de Xfce

source: The Xfce development tools are a collection of tools and macros for Xfce developers and people that want to build unreleased development versions of Xfce.
ca: Les eines de desenvolupament de Xfce són una col·lecció d'eines i macros per a desenvolupadors de Xfce i persones que volen construir versions de desenvolupament no publicades de Xfce.

source: Xfce Dictionary Client Application
ca: Aplicació de client de diccionari Xfce

source: xfce4-dict allows you to search different kinds of dictionary services for words or phrases and shows you the result. Currently you can query a Dict server (RFC 2229), any online dictionary service by opening a web browser or search for words using the aspell/ispell program.
ca: xfce4-dict us permet cercar diferents tipus de serveis de diccionari per a paraules o frases i us mostra el resultat. Actualment podeu consultar un servidor Dict (RFC 2229), qualsevol servei de diccionari en línia obrint un navegador web o cercant paraules utilitzant el programa aspell/ispell.

source: Translations for package xfce4-dict
ca: Traduccions per al paquet xfce4-dict

source: Provides translations for the "xfce4-dict" package.
ca: Proporciona traduccions per al paquet «xfce4-dict».

source: Disk Performance Plugin for the Xfce Panel
ca: Connector de rendiment del disc per al plafó Xfce

source: The DiskPerf plugin displays the disk/partition performance as trasferred data per second.
ca: El connector DiskPerf mostra el rendiment del disc/partició com a dades trasferides per segon.

source: Translations for package xfce4-diskperf-plugin
ca: Traduccions per al paquet xfce4-diskperf-plugin

source: Provides translations for the "xfce4-diskperf-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-diskperf-plugin».

source: Eyes Plugin for the Xfce Panel
ca: Connector Ulls per al plafó Xfce

source: The Eyes plugin adds moving eyes to the panel which watch your activities.
ca: El connector Ulls afegeix els ulls en moviment al plafó que vigila les vostres activitats.

source: Translations for package xfce4-eyes-plugin
ca: Traduccions per al paquet xfce4-eyes-plugin

source: Provides translations for the "xfce4-eyes-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-eyes-plugin».

source: Filesystem Space Monitoring Plugin for the Xfce Panel
ca: Connector de monitoratge d'espais del sistema de fitxers per al plafó Xfce

source: The FSGuard plugin constantly monitors free space of a given mountpoint and displays it as an icon in the panel.
ca: El connector FSGuard monitoritza constantment l'espai lliure d'un punt de muntatge determinat i el mostra com una icona al plafó.

source: Translations for package xfce4-fsguard-plugin
ca: Traduccions per al paquet xfce4-fsguard-plugin

source: Provides translations for the "xfce4-fsguard-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-fsguard-plugin».

source: Generic Monitoring Plugin for the Xfce Panel
ca: Connector de monitoratge genèric per al plafó Xfce

source: The Generic Monitor plugin is intended for custom monitoring tasks and periodically spawns a given application, captures its output and displays the result in form of an image, a bar, a button and a personalized tooltip in the panel.
ca: El connector Monitor genèric està pensat per a tasques de seguiment personalitzades i genera periòdicament una aplicació determinada, captura la seva sortida i mostra el resultat en forma d'imatge, una barra, un botó i un consell d'eina personalitzat al plafó.

source: Translations for package xfce4-genmon-plugin
ca: Traduccions per al paquet xfce4-genmon-plugin

source: Provides translations for the "xfce4-genmon-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-genmon-plugin».

source: Versatile Mail Checking Plugin for the Xfce Panel
ca: Connector Versatile Mail Checking per al plafó Xfce

source: The Mailwatch plugin is a multi-protocol, multi-mailbox mail checking tool which supports a variety of protocols and local mailbox formats. It can check multiple locations and execute custom actions when it finds new mail.
ca: El connector Mailwatch és una eina de comprovació de correu multiprotocol i multibústia que admet una varietat de protocols i formats de bústia local. Pot comprovar múltiples ubicacions i executar accions personalitzades quan trobi correu nou.

source: Translations for package xfce4-mailwatch-plugin
ca: Traduccions per al paquet xfce4-mailwatch-plugin

source: Provides translations for the "xfce4-mailwatch-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-mailwatch-plugin».

source: Filesystem Mounting Plugin for the Xfce Panel
ca: Connector de muntatge del sistema de fitxers per al plafó Xfce

source: The Mount plugin allows to mount and unmount filesystems from the panel.
ca: El connector Munta permet muntar i desmuntar sistemes de fitxers des del plafó.

source: Translations for package xfce4-mount-plugin
ca: Traduccions per al paquet xfce4-mount-plugin

source: Provides translations for the "xfce4-mount-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-mount-plugin».

source: MPD Client Plugin for the Xfce Panel
ca: Connector de client MPD per al plafó Xfce

source: The Mpc plugin is a simple Music Player Daemon client which can control playback and show the currently playing song.
ca: El connector Mpc és un senzill client de Music Player Daemon que pot controlar la reproducció i mostrar la cançó que s'està reproduint.

source: Translations for package xfce4-mpc-plugin
ca: Traduccions per al paquet xfce4-mpc-plugin

source: Provides translations for the "xfce4-mpc-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-mpc-plugin».

source: Network Load Monitoring Plugin for the Xfce Panel
ca: Connector de monitorització de càrrega de xarxa per al plafó Xfce

source: The Netload plugin allows to monitor the netowrk load of a given network interface.
ca: El connector Netload permet monitoritzar la càrrega de netowrk d'una interfície de xarxa determinada.

source: Translations for package xfce4-netload-plugin
ca: Traduccions per al paquet xfce4-netload-plugin

source: Provides translations for the "xfce4-netload-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-netload-plugin».

source: Note-taking Plugin for the Xfce Panel
ca: Connector de presa de notes per al plafó Xfce

source: The Notes plugin provides the equivalent to post-it notes on the Xfce desktop and allows to quickly take and store small notes.
ca: El connector Notes proporciona l'equivalent a les notes post-it a l'escriptori Xfce i permet prendre i emmagatzemar ràpidament notes petites.

source: Translations for package xfce4-notes-plugin
ca: Traduccions per al paquet xfce4-notes-plugin

source: Provides translations for the "xfce4-notes-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-notes-plugin».

source: Simple Notification Daemon for Xfce
ca: Dimoni de notificació simple per a Xfce

source: Xfce4-notifyd is a simple, visually-appealing notification daemon for Xfce that implements the Freedesktop.org Desktop Notifications Specification.
ca: Xfce4-notifyd és un dimoni de notificació senzill i visualment atractiu per a Xfce que implementa l'especificació de notificacions d'escriptori Freedesktop.org.

source: openSUSE Branding of xfce4-notifyd
ca: openSUSE Branding de xfce4-notifyd

source: This package provides the openSUSE look and feel for the Xfce Notification Daemon.
ca: Aquest paquet proporciona l'aspecte i comportament d'openSUSE per al dimoni de notificacions de Xfce.

source: Upstream Branding of xfce4-notifyd
ca: Marcatge d'alta velocitat de xfce4-notifyd

source: This package provides the upstream look and feel for the Xfce Notification Daemon.
ca: Aquest paquet proporciona l'aspecte i comportament del dimoni de notificació de Xfce.

source: Translations for package xfce4-notifyd
ca: Traduccions per al paquet xfce4-notifyd

source: Provides translations for the "xfce4-notifyd" package.
ca: Proporciona traduccions per al paquet «xfce4-notifyd».

source: Panel for the Xfce Desktop Environment
ca: Plafó per a l'entorn d'escriptori Xfce

source: xfce4-panel is the panel for the Xfce desktop environment.
ca: xfce4-panel és el plafó per a l'entorn d'escriptori Xfce.

source: openSUSE Branding of xfce4-panel
ca: openSUSE Branding de xfce4-panel

source: This package provides the openSUSE look and feel for the Xfce Panel.
ca: Aquest paquet proporciona l'aspecte i comportament d'openSUSE per al plafó Xfce.

source: Upstream Branding for xfce4-panel
ca: Branding Upstream per a xfce4-panel

source: This package provides the upstream look and feel for xfce4-panel.
ca: Aquest paquet proporciona l'aspecte i comportament de la font de xfce4-panel.

source: Development Files for xfce4-panel
ca: Fitxers de desenvolupament per al panell xfce4

source: The xfce4-panel-devel package contains development files needed to to develop panel plugins.
ca: El paquet xfce4-panel-devel conté els fitxers de desenvolupament necessaris per a desenvolupar connectors de plafó.

source: Translations for package xfce4-panel
ca: Traduccions per al paquet xfce4-panel

source: Provides translations for the "xfce4-panel" package.
ca: Proporciona traduccions per al paquet «xfce4-panel».

source: Dictionary Plugin for the Xfce Panel
ca: Connector de diccionari per al plafó Xfce

source: This package contains the xfce4-dict dictionary plugin for the Xfce panel.
ca: Aquest paquet conté el connector de diccionari xfce4-dict per al plafó Xfce.

source: Simple application to manage Xfce panel layouts
ca: Aplicació senzilla per a gestionar les disposicions del plafó Xfce

source: Simple application to manage Xfce panel layouts. This tool makes it possible to backup, restore, import, and export panel layouts.
ca: Aplicació senzilla per a gestionar les disposicions del panell Xfce. Aquesta eina permet fer còpies de seguretat, restaurar, importar i exportar les disposicions del plafó.

source: Script to restore Xfce Panel Defaults
ca: Script per a restaurar els valors predeterminats del plafó Xfce

source: This package provides a script /usr/bin/xfce4-panel-restore-defaults which calls allows to restore the Xfce Panel factory defaults. A desktop file and application launcher is provided.
ca: Aquest paquet proporciona un script /usr/bin/xfce4-panel-restore-defaults que crida permet restaurar els valors per defecte de la fàbrica Xfce Panel. Es proporciona un fitxer d'escriptori i un llançador d'aplicacions.

source: Places Menu Plugin for the Xfce Panel
ca: Connector de menú de llocs per al plafó Xfce

source: The Places plugin provides a menu with quick access to folders, documents, and removable media.
ca: El connector Llocs proporciona un menú amb accés ràpid a carpetes, documents i mitjans extraïbles.

source: Translations for package xfce4-places-plugin
ca: Traduccions per al paquet xfce4-places-plugin

source: Provides translations for the "xfce4-places-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-places-plugin».

source: Power Management for the Xfce Desktop Environment
ca: Gestió d'energia per a l'entorn d'escriptori Xfce

source: The Xfce Power Manager is a tool for the Xfce desktop environment for managing profiles of policies which affect power consumption, such as the display brightness level, display sleep times, or CPU frequency scaling. It can also trigger actions on certain events such as closing the lid or reaching low battery levels and provides a set of interfaces to inform other applications about current power level so that they can adjust their power consumption. Furthermore, it provides a standardized inhibit interface which allows applications to prevent automatic sleep actions via the power manager.
ca: El Gestor d'energia de Xfce és una eina per a l'entorn d'escriptori Xfce per a la gestió de perfils de polítiques que afecten el consum d'energia, com ara el nivell de brillantor de la pantalla, els temps de son de la pantalla o l'escalat de la freqüència de la CPU. També pot desencadenar accions en certs esdeveniments com tancar la tapa o arribar a nivells de bateria baixos i proporciona un conjunt d'interfícies per informar altres aplicacions sobre el nivell de potència actual perquè puguin ajustar el seu consum d'energia. A més, proporciona una interfície d'inhibició estandarditzada que permet a les aplicacions evitar accions de son automàtiques a través del gestor d'energia.

source: openSUSE Branding of xfce4-power-manager
ca: openSUSE Branding de xfce4-power-manager

source: This package provides the openSUSE look and feel for the Xfce Power Manager.
ca: Aquest paquet proporciona l'aspecte i comportament d'openSUSE per al Xfce Power Manager.

source: Upstream Branding of xfce4-power-manager
ca: Branding Upstream de xfce4-power-manager

source: Translations for package xfce4-power-manager
ca: Traduccions per al paquet xfce4-power-manager

source: Provides translations for the "xfce4-power-manager" package.
ca: Proporciona traduccions per al paquet «xfce4-power-manager».

source: Xfce Panel Plugin for Monitoring Batteries and Changing the Display Brightness
ca: Connector del plafó Xfce per a monitoritzar les bateries i canviar la brillantor de la pantalla

source: This package provides a plugin for the Xfce panel for monitoring battery and device charge levels and to regulate display brightness.
ca: Aquest paquet proporciona un connector per al panell Xfce per monitoritzar els nivells de càrrega de la bateria i el dispositiu i per regular la brillantor de la pantalla.

source: Pulseaudio Volume Control Plugin for the Xfce Panel
ca: Connector de control de volum Pulseaudio per al plafó Xfce

source: Xfce4-pulseaudio-plugin is a panel plugin for controlling an audio output volume of the PulseAudio mixer. The volume can be adjusted using keyboard shortcuts, mouse wheel, a slider in a popup menu, or via a linked external audio mixer tool.
ca: Xfce4-pulseaudio-plugin és un connector de plafó per controlar un volum de sortida d'àudio del mesclador PulseAudio. El volum es pot ajustar utilitzant dreceres de teclat, roda del ratolí, un control lliscant en un menú emergent o mitjançant una eina de mescla d'àudio externa enllaçada.

source: Translations for package xfce4-pulseaudio-plugin
ca: Traduccions per al paquet xfce4-pulseaudio-plugin

source: Provides translations for the "xfce4-pulseaudio-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-pulseaudio-plugin».

source: Screensaver and locker for Xfce
ca: Estalvi de pantalla i taquilla per a Xfce

source: xfce4-screensaver is a screen saver and locker that integrates with the Xfce desktop. This software is not ready for production machines yet. Please use with caution. Add xfce4-screensaver-command -l to xflock4 script for it to work properly.
ca: xfce4-screensaver és un estalvi de pantalla i taquilla que s'integra amb l'escriptori Xfce. Aquest programari encara no està preparat per a màquines de producció. Utilitzeu-lo amb precaució. Afegeix «xfce4-screensaver-command -l» a l'script «xflock4» perquè funcioni correctament.

source: Screenshot Tool for the Xfce Desktop
ca: Eina de captura de pantalla per a l'escriptori Xfce

source: Xfce4 Screenshooter is a tool for taking screenshots, it can capture the entire screen, the active window or a selected region. Screenshots may be taken with a user-specified delay and the resulting images can be saved to a PNG file, copied it to the clipboard, opened with another application, or uploaded to ZimageZ, a free online image hosting service.
ca: Xfce4 Screenshooter és una eina per a prendre captures de pantalla, pot capturar tota la pantalla, la finestra activa o una regió seleccionada. Les captures de pantalla es poden prendre amb un retard especificat per l'usuari i les imatges resultants es poden desar en un fitxer PNG, copiar-lo al porta-retalls, obrir-lo amb una altra aplicació o pujar a ZimageZ, un servei gratuït d'allotjament d'imatges en línia.

source: Translations for package xfce4-screenshooter
ca: Traduccions per al paquet xfce4-screenshooter

source: Provides translations for the "xfce4-screenshooter" package.
ca: Proporciona traduccions per al paquet «xfce4-screenshooter».

source: Screenshot Plugin for the Xfce Panel
ca: Connector de captura de pantalla per al plafó Xfce

source: This package contains the xfce4-screenshooter Xfce panel plugin.
ca: Aquest paquet conté el connector del plafó Xfce4-screenshooter.

source: Hardware Sensor Plugin for the Xfce Panel
ca: Connector de sensors de maquinari per al plafó Xfce

source: The Sensors plugin and standalone application allow to monitor various hardware sensors supported by libsensors.
ca: El connector Sensors i l'aplicació independent permeten monitoritzar diversos sensors de maquinari suportats per libsensors.

source: Development Files for xfce4-sensors-plugin
ca: Fitxers de desenvolupament per a «xfce4-sensors-plugin»

source: This package contains the development files needed to develop applications based on libxfce4sensors.
ca: Aquest paquet conté els fitxers de desenvolupament necessaris per a desenvolupar aplicacions basades en libxfce4sensors.

source: Translations for package xfce4-sensors-plugin
ca: Traduccions per al paquet xfce4-sensors-plugin

source: Provides translations for the "xfce4-sensors-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-sensors-plugin».

source: Xfce Session Manager
ca: Gestor de sessions Xfce

source: xfce4-session is the session manager for the Xfce desktop environment.
ca: xfce4-session és el gestor de sessions per a l'entorn d'escriptori Xfce.

source: openSUSE Branding of xfce4-session
ca: openSUSE Branding de xfce4-session
