Repository: openSUSE/packages-i18n
Catalog: */po/xfce4.*.po
Languages: ca

source: This package provides the openSUSE look and feel for the Xfce Session Manager.
ca: Aquest paquet proporciona l'aspecte i comportament d'openSUSE per al gestor de sessions de Xfce.

source: Upstream Branding of xfce4-session
ca: Upstream Branding de la sessió xfce4

source: This package provides the upstream look and feel for the Xfce Session Manager.
ca: Aquest paquet proporciona l'aspecte i comportament del gestor de sessions Xfce.

source: Translations for package xfce4-session
ca: Traduccions per al paquet xfce4-session

source: Provides translations for the "xfce4-session" package.
ca: Proporciona traduccions per al paquet «xfce4-session».

source: Tools for Managing Xfce Settings
ca: Eines per a gestionar la configuració de Xfce

source: This package provides a number of tools for managing settings in the Xfce desktop environment.
ca: Aquest paquet proporciona una sèrie d'eines per a gestionar la configuració a l'entorn d'escriptori Xfce.

source: openSUSE Branding of xfce4-settings
ca: openSUSE Branding de xfce4-settings

source: This package provides the openSUSE look and feel for Xfce.
ca: Aquest paquet proporciona l'aspecte i comportament d'openSUSE per a Xfce.

source: Upstream Branding of xfce4-settings
ca: Marcatge descendent de xfce4-settings

source: This package provides the upstream look and feel for xfce4-settings.
ca: Aquest paquet proporciona l'aspecte i comportament de la font per als ajustaments de xfce4.

source: Translations for package xfce4-settings
ca: Traduccions per al paquet xfce4-settings

source: Provides translations for the "xfce4-settings" package.
ca: Proporciona traduccions per al paquet «xfce4-settings».

source: Smart Bookmark Plugin for the Xfce Panel
ca: Connector d'adreces d'interès intel·ligent per al plafó Xfce

source: The Smartbookmark plugin follows the smart bookmark concept and allows users to send requests to websites through default browser.
ca: El connector Smartbookmark segueix el concepte de marcador intel·ligent i permet als usuaris enviar sol·licituds a llocs web a través del navegador predeterminat.

source: Translations for package xfce4-smartbookmark-plugin
ca: Traduccions per al paquet xfce4-smartbookmark-plugin

source: Provides translations for the "xfce4-smartbookmark-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-smartbookmark-plugin».

source: A panel plugin to keep track of elapsed time
ca: Un connector del plafó per a fer un seguiment del temps transcorregut

source: Translations for package xfce4-stopwatch-plugin
ca: Traduccions per al paquet xfce4-stopwatch-plugin

source: Provides translations for the "xfce4-stopwatch-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-stopwatch-plugin».

source: System Load Monitoring Plugin for the Xfce Panel
ca: Connector de monitorització de la càrrega del sistema per al plafó Xfce

source: The Systemload plugin can display the current CPU load, used memory and swap space as well as the system uptime in the panel.
ca: El connector de càrrega del sistema pot mostrar la càrrega actual de la CPU, la memòria utilitzada i l'espai d'intercanvi, així com el temps d'espera del sistema al plafó.

source: Translations for package xfce4-systemload-plugin
ca: Traduccions per al paquet xfce4-systemload-plugin

source: Provides translations for the "xfce4-systemload-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-systemload-plugin».

source: Simple Taskmanager for the Xfce Desktop Environment
ca: Gestor de tasques simple per a l'entorn d'escriptori Xfce

source: xfce4-taskmanager is a simple taskmanager for the Xfce desktop environment. It can display window and icon names in a tree view, columns can be reordered, and CPU and memory usage are displayed as a graph.
ca: xfce4-taskmanager és un gestor de tasques senzill per a l'entorn d'escriptori Xfce. Pot mostrar noms de finestres i d'icones en una vista en arbre, les columnes es poden reordenar, i l'ús de CPU i memòria es mostra com un gràfic.

source: Translations for package xfce4-taskmanager
ca: Traduccions per al paquet xfce4-taskmanager

source: Provides translations for the "xfce4-taskmanager" package.
ca: Proporciona traduccions per al paquet «xfce4-taskmanager».

source: Terminal Emulator for the Xfce Desktop Environment
ca: Emulador de terminal per a l'entorn d'escriptori Xfce

source: xfce4-terminal is a lightweight and easy to use terminal emulator for the Xfce desktop environment. Its major features include a simple configuration interface, the ability to use multiple tabs with terminals within a single window, the possibility to have a pseudo-transparent terminal background, and a compact mode where both the menubar and the window decorations are hidden which helps to save space on the desktop.
ca: xfce4-terminal és un emulador de terminal lleuger i fàcil d'utilitzar per a l'entorn d'escriptori Xfce. Les seves principals característiques inclouen una interfície de configuració senzilla, la possibilitat d'utilitzar múltiples pestanyes amb terminals dins d'una sola finestra, la possibilitat de tenir un fons de terminal pseudo-transparent, i un mode compacte on tant la barra de menús com les decoracions de les finestres estan ocultes que ajuden a estalviar espai a l'escriptori.

source: Translations for package xfce4-terminal
ca: Traduccions per al paquet xfce4-terminal

source: Provides translations for the "xfce4-terminal" package.
ca: Proporciona traduccions per al paquet «xfce4-terminal».

source: Time-out Plugin for the Xfce Panel
ca: Connector de temps d'espera per al plafó Xfce

source: The Time-out plugin allows to take breaks from computer work in configurable, periodical intervals and will provide a notification and lock the screen each the break time has been reached.
ca: El connector Time-out permet prendre descansos del treball de l'ordinador en intervals configurables i periòdics i proporcionarà una notificació i bloquejarà la pantalla cada vegada que s'hagi arribat al temps de descans.

source: Translations for package xfce4-time-out-plugin
ca: Traduccions per al paquet xfce4-time-out-plugin

source: Provides translations for the "xfce4-time-out-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-time-out-plugin».

source: Alarm Clock Plugin for the Xfce Panel
ca: Connector Rellotge d'alarma per al plafó Xfce

source: The Timer plugin provides the functionality of an alarm clock and will run an alarm at a specified time or at the end of a specified countdown period.
ca: El connector Temporitzador proporciona la funcionalitat d'un rellotge d'alarma i executarà una alarma en un moment especificat o al final d'un període de compte enrere especificat.

source: Translations for package xfce4-timer-plugin
ca: Traduccions per al paquet xfce4-timer-plugin

source: Provides translations for the "xfce4-timer-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-timer-plugin».

source: Vala Bindings to Xfce Libraries
ca: Vinculacions de Vala a les biblioteques Xfce

source: This package provides Vala bindings to Xfce Libraries.
ca: Aquest paquet proporciona enllaços Vala a les biblioteques Xfce.

source: Command Line Plugin for the Xfce Panel
ca: Connector de línia d'ordres per al plafó Xfce

source: The Verve panel plugin is a command line plugin for the Xfce panel which supports a command history, auto-completion, keyboard-shortcut focus grabbing and opening URLs.
ca: El connector del plafó Verve és un connector de línia d'ordres per al plafó Xfce que admet un historial d'ordres, compleció automàtica, captura de focus amb drecera de teclat i obertura d'URL.

source: Translations for package xfce4-verve-plugin
ca: Traduccions per al paquet xfce4-verve-plugin

source: Provides translations for the "xfce4-verve-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-verve-plugin».

source: WLAN Monitoring Plugin for the Xfce Panel
ca: Connector de monitoratge WLAN per al plafó Xfce

source: The WaveLAN plugin can monitor a wireless LAN interface and display signal state, quality and the network name (SSID).
ca: El connector WaveLAN pot monitoritzar una interfície LAN sense fil i mostrar l'estat del senyal, la qualitat i el nom de la xarxa (SSID).

source: Translations for package xfce4-wavelan-plugin
ca: Traduccions per al paquet xfce4-wavelan-plugin

source: Provides translations for the "xfce4-wavelan-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-wavelan-plugin».

source: Weather Condition Monitoring Plugin for the Xfce Panel
ca: Connector de seguiment de la condició meteorològica per al plafó Xfce

source: The Weather plugin shows short- and long-term weather forecasts.
ca: El connector Temps mostra les previsions meteorològiques a curt i llarg termini.

source: Translations for package xfce4-weather-plugin
ca: Traduccions per al paquet xfce4-weather-plugin

source: Provides translations for the "xfce4-weather-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-weather-plugin».

source: Alternate Xfce Menu
ca: Menú alternatiu de Xfce

source: Whisker Menu is an alternate application launcher for Xfce. When opened, it shows a list of applications marked as favorites. Installed applications can be browsed by clicking on the category buttons on the side. Whisker Menu keeps a list of most recent used applications launched from it.
ca: Whisker Menu és un llançador d'aplicacions alternatiu per a Xfce. Quan s'obre, mostra una llista d'aplicacions marcades com a favorites. Les aplicacions instal·lades es poden navegar fent clic als botons de la categoria que hi ha al costat. El menú Whisker manté una llista de les aplicacions utilitzades més recents llançades des d'ella.

source: Translations for package xfce4-whiskermenu-plugin
ca: Traduccions per al paquet xfce4-whiskermenu-plugin

source: Provides translations for the "xfce4-whiskermenu-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-whiskermenu-plugin».

source: XKB Layout Switcher Plugin for the Xfce Panel
ca: Connector del commutador XKB Layout per al plafó Xfce

source: The XKB plugin allows to setup and switch between multiple XKB keyboard layouts.
ca: El connector XKB permet configurar i canviar entre múltiples disposicions de teclat XKB.

source: Translations for package xfce4-xkb-plugin
ca: Traduccions per al paquet xfce4-xkb-plugin

source: Provides translations for the "xfce4-xkb-plugin" package.
ca: Proporciona traduccions per al paquet «xfce4-xkb-plugin».

source: openSUSE Branding of xfdesktop
ca: openSUSE Branding de xfdesktop

source: This package provides the openSUSE look and feel for the Xfce Desktop Manager.
ca: Aquest paquet proporciona l'aspecte i comportament d'openSUSE per al Xfce Desktop Manager.

source: openSUSE Branding of xfwm4
ca: openSUSE Branding de xfwm4

source: This package provides the openSUSE look and feel for the xfwm4 window manager.
ca: Aquest paquet proporciona l'aspecte i comportament d'openSUSE per al gestor de finestres xfwm4.

source: Plugin to display information from applications in the Xfce panel
ca: Connector per a mostrar informació de les aplicacions al plafó Xfce

source: A small plugin to display information from various applications consistently in the Xfce panel as described in Ubuntu's MessagingMenu design specification.
ca: Un petit connector per a mostrar informació de diverses aplicacions de manera coherent en el plafó Xfce tal com es descriu a l'especificació de disseny MessagingMenu d'Ubuntu.

source: Translations for package xfce4-panel-plugin-indicator
ca: Traduccions per al paquet xfce4-panel-plugin-indicator

source: Provides translations for the "xfce4-panel-plugin-indicator" package.
ca: Proporciona traduccions per al paquet «xfce4-panel-plugin-indicator».

source: Subpackage providing xfce4-color-settings
ca: Subpaquet que proporciona «xfce4-color-settings»

source: The Xfce Color Profile settings tool is a front-end to set up color management for printers, scanners, and displays.
ca: L'eina de configuració del perfil de color de Xfce és un frontal per a configurar la gestió del color per a impressores, escàners i pantalles.
