Repository: openSUSE/packages-i18n
Catalog: */po/yast2.*.po
Languages: ca, de, fi, it, uk

source: The package contains statistic files (one file per language). With the help of these statistics Yast warns you if you select a language for installation which is unsufficiently translated.
ca: El paquet conté fitxers estadístics (un fitxer per idioma). Amb l'ajuda d'aquestes estadístiques, el Yast us avisa si seleccioneu un idioma per a la instal·lació que no està prou traduït.
de: Das Paket enthält Statistik-Dateien (eine Datei pro Sprache). Mit der Hilfe dieser Statistiken warnt Yast Sie, wenn Sie eine Sprache zur Installation auswählen, die nicht ausreichend übersetzt ist.
fi: Tämä paketti sisältää tilastotiedostot (tiedosto kustakin kielestä). Näiden tilastojen avulla YaST varoittaa, jos valitaan kieli, jonka käännös on keskeneräinen.
it: Il pacchetto contiene i file statistici (un file per lingua). Con l'aiuto di queste statistiche YaST avvisa se si è selezionato di installare una lingua che non è sufficientemente tradotta.
uk: Цей пакунок містить файли статистики (по одному файлу на мову). За допомогою цих даних Yast може попередити, якщо переклад на обрану мову не повний.

source: YaST2 - Swedish Translations
ca: YaST2 - Traduccions al suec
de: YaST2 - Schwedische Übersetzungen
fi: YaST2 – Ruotsinkieliset käännökset
it: YaST2 - traduzioni svedesi
uk: YaST2 - шведські переклади

source: YaST2 - Translations for Swedish.
ca: YaST2 - Traduccions per al suec.
de: YaST2 - Übersetzungen für Schweden.
fi: YaST2 – Käännökset ruotsiksi.
it: YaST2 - traduzioni in svedese.
uk: YaST2 - переклади на шведську мову.

source: YaST2 - Swahili Translations
ca: YaST2 - Traduccions del suahili
de: YaST2 - Suahelische Übersetzungen
fi: YaST2 – Suahilinkieliset käännökset
it: YaST2 - traduzioni swahili
uk: YaST2 - переклади мовою суахілі

source: YaST2 - Translations for Swahili.
ca: YaST2 - Traduccions per al suahili.
de: YaST2 - Übersetzungen für Suaheli.
fi: YaST2 – Käännökset suahiliksi.
it: YaST2 - traduzioni in swahili.
uk: YaST2 - переклади на мову суахілі.

source: YaST2 - Tamil Translations
ca: YaST2 - Traduccions en tàmil
de: YaST2 - Tamilische Übersetzungen
fi: YaST2 – Tamilinkieliset käännökset
it: YaST2 - traduzioni tamil
uk: YaST2 - тамільські переклади

source: YaST2 - Tamil translations.
ca: YaST2 - Traduccions en tàmil.
de: YaST2 - Tamilische Übersetzungen.
fi: YaST2 – Käännökset tamiliksi.
it: YaST2 - traduzioni in tamil.
uk: YaST2 - переклади на тамільську мову.

source: YaST2 - Tajik Translations
ca: YaST2 - Traduccions del tadjik
de: YaST2 - Tadschikische Übersetzungen
fi: YaST2 – Tadžikinkieliset käännökset
it: YaST2 - traduzioni tagike
uk: YaST2 - таджицькі переклади

source: YaST2 - Tajik translations.
ca: YaST2 - Traduccions al tadjikistan.
de: YaST2 - Tadschikische Übersetzungen.
fi: YaST2 – Käännökset tadžikiksi.
it: YaST2 - traduzioni tagike.
uk: YaST2 - переклади на таджицьку мову.

source: YaST2 - Thai Translations
ca: YaST2 - Traduccions tailandeses
de: YaST2 - Thailändische Übersetzungen
fi: YaST2 – Thainkieliset käännökset
it: YaST2 - traduzioni thai
uk: YaST2 - тайські переклади

source: YaST2 - Thai translations.
ca: YaST2 - Traduccions tailandeses.
de: YaST2 - Thailändische Übersetzungen.
fi: YaST2 – Käännökset thaiksi.
it: YaST2 - traduzioni thai.
uk: YaST2 - переклади на тайську мову.

source: YaST2 - Turkmen Translations
ca: YaST2 - Traduccions de turcmans
uk: YaST2 - туркменські переклади

source: YaST2 - Translations for Turkmen.
ca: YaST2 - Traduccions per a turcmans.
uk: YaST2 - переклади на туркменську мову.

source: YaST2 - Turkish Translations
ca: YaST2 - Traduccions en turc
de: YaST2 - Türkische Übersetzungen
fi: YaST2 – Turkinkieliset käännökset
it: YaST2 - traduzioni turche
uk: YaST2 - турецькі переклади

source: YaST2 - Translations for Turkish.
ca: YaST2 - Traduccions per al turc.
de: YaST2 - Übersetzungen für Türken.
fi: YaST2 – Käännökset turkiksi.
it: YaST2 - traduzioni in turco.
uk: YaST2 - переклади на турецьку мову.

source: YaST2 - Ukrainian Translations
ca: YaST2 - Traduccions ucraïneses
de: YaST2 - Ukrainische Übersetzungen
fi: YaST2 – Ukrainankieliset käännökset
it: YaST2 - traduzioni ucraine
uk: YaST2 - українські переклади

source: YaST2 - Translations for Ukrainian.
ca: YaST2 - Traduccions per a l'ucraïnès.
de: YaST2 - Übersetzungen für Ukrainer.
fi: YaST2 – Käännökset ukrainaksi.
it: YaST2 - traduzioni in ucraino.
uk: YaST2 - переклади на українську мову.

source: YaST2 - Vietnamese Translations
ca: YaST2 - Traduccions vietnamites
de: YaST2 - Vietnamesische Übersetzungen
fi: YaST2 – Vietnaminkieliset käännökset
it: YaST2 - traduzioni vietnamite
uk: YaST2 - в'єтнамські переклади

source: YaST2 - Translations for Vietnamese.
ca: YaST2 - Traduccions per al Vietnam.
de: YaST2 - Übersetzungen für Vietnamesen.
fi: YaST2 – Käännökset vietnamiksi.
it: YaST2 - traduzioni in vietnamita.
uk: YaST2 - переклади на в'єтнамську мову.

source: YaST2 - Walloon Translations
ca: YaST2 - Traduccions valones
de: YaST2 - Wallonische Übersetzungen
fi: YaST2 – Valloninkieliset käännökset
it: YaST2 - traduzioni valloni
uk: YaST2 - валлонські переклади

source: YaST2 - Translations for Walloon.
ca: YaST2 - Traduccions per al Való.
de: YaST2 - Übersetzungen für Wallonen.
fi: YaST2 – Käännökset valloniksi.
it: YaST2 - traduzioni in vallone.
uk: YaST2 - переклади на валлонську мову.

source: YaST2 - Xhosa Translations
ca: YaST2 - Traduccions de Xhosa
de: YaST2 - Xhosa Übersetzungen
fi: YaST2 – Xhosankieliset käännökset
it: YaST2 - traduzioni xhosa
uk: YaST2 - переклади мовою хоса

source: YaST2 - Translations for Xhosa.
ca: YaST2 - Traduccions per a Xhosa.
de: YaST2 - Übersetzungen für Xhosa.
fi: YaST2 – Käännökset xhosaksi.
it: YaST2 - traduzioni in xhosa.
uk: YaST2 - переклади на мову хоса.

source: YaST2 - Simplified Chinese Translations
ca: YaST2 - Traduccions simplificades del xinès
de: YaST2 - Chinesische Übersetzungen (vereinfacht)
fi: YaST2 – Kiinankieliset käännökset (yksinkertaistettu)
it: YaST2 - traduzioni cinesi semplificate
uk: YaST2 - переклади спрощеною китайською

source: YaST2 - Simplified Chinese translations.
ca: YaST2 - Traduccions simplificades del xinès.
de: YaST2 - Chinesische Übersetzungen (vereinfacht).
fi: YaST2 – Käännökset yksinkertaistetuksi kiinaksi.
it: YaST2 - traduzioni in cinese semplificato.
uk: YaST2 - переклади на спрощену китайську мову.

source: YaST2 - Traditional Chinese Translations
ca: YaST2 - Traduccions tradicionals del xinès
de: YaST2 - Chinesische Übersetzungen (traditionell)
fi: YaST2 – Kiinannokset (perinteinen)
it: YaST2 - traduzioni cinesi tradizionali
uk: YaST2 - переклади традиційною китайською

source: YaST2 - Translations for Traditional Chinese.
ca: YaST2 - Traduccions per al xinès tradicional.
de: YaST2 - Übersetzungen für Chinesen (traditionell).
fi: YaST2 – Käännökset perinteiseksi kiinaksi.
it: YaST2 - traduzioni in cinese tradizionale.
uk: YaST2 - переклади на традиційну китайську мову.

source: YaST2 - Zulu Translations
ca: YaST2 - Traduccions Zulu
de: YaST2 - Zulu Übersetzungen
fi: YaST2 – Zulunkieliset käännökset
it: YaST2 - traduzioni zulu
uk: YaST2 - переклади мовою зулу

source: YaST2 - Translations for Zulu.
ca: YaST2 - Traduccions per al Zulu.
de: YaST2 - Übersetzungen für Zulu.
fi: YaST2 – Käännökset zuluksi.
it: YaST2 - traduzioni in zulu.
uk: YaST2 - переклади на мову зулу.

source: YaST2 - Agent for Various Transfer Protocols
ca: YaST2 - Agent de diversos protocols de transferència
de: YaST2-Agent für verschiedene Netzwerkprotokolle
fi: YaST2 – Eri siirtoyhteyskäytäntöjen agentti
it: YaST2 - agente per vari protocolli di trasferimento
uk: YaST2 - Агент для різноманітних протоколів передачі

source: A YaST2 Agent for various Transfer Protocols: FTP, HTTP, and TFTP.
ca: Agent YaST2 per a diversos protocols de transferència: FTP, HTTP i TFTP.
de: YaST2-Agent für verschiedene Übertragungsprotokolle wie HTTP, FTP und TFTP.
fi: YaST2-asiakas eri siirtoyhteyskäytännöille: FTP:lle, HTTP:lle ja TFTP:lle.
it: Un agente YaST2 per vari protocolli di trasferimento: FTP, HTTP e TFTP.
uk: Агент YaST2 для різних протоколів передачі: FTP, HTTP і TFTP.

source: YaST2 - Hardware Tuning
ca: YaST2 - Afinament de maquinari
de: YaST2 - Komponente zur Hardware Konfiguration
fi: YaST – Laitteiston hienosäätö
it: YaST2 - regolazione dell'hardware
uk: YaST2 - Налаштування обладнання

source: This package contains the YaST2 component for hardware configuration.
ca: Aquest paquet conté el component YaST2 per a la configuració del maquinari.
de: Dieses Paket enthält die YaST2 Komponente zur Konfiguration der Hardware.
fi: Tämä paketti sisältää YaST-osan laitteiston määritykseen.
it: Questo pacchetto contiene il componente YaST2 per la configurazione dell'hardware.
uk: Цей пакунок містить компоненти YaST2 для налаштування обладнання.

source: YaST2 - Update
ca: YaST2 - Actualització
fi: YaST2 – Päivitys
it: YaST2 - aggiornamento
uk: YaST2 — Оновлення

source: Use this component if you wish to update your system.
ca: Utilitzeu aquest component si voleu actualitzar el sistema.
de: Benutzen Sie diese Komponente, wenn Sie Ihr System aktualisieren möchten.
fi: Päivitä järjestelmä tämän osan avulla.
it: Usare questo componente se si vuole aggiornare il sistema.
uk: Використовуйте цей компонент якщо ви хочете оновити систему.

source: YaST2 component for usbauth configuration
ca: Component YaST2 per a la configuració d'usbauth
de: Die YaST2-Komponente für die Konfiguration von usbauth
fi: YaST2-osa usbauthin määritykseen
it: Il componente di YaST2 per la configurazione usbauth
uk: Компонент YaST2 для конфігурації usbauth

source: YaST module that helps to create an usbauth firewall config file
ca: Mòdul YaST que ajuda a crear un fitxer de configuració del tallafoc usbauth
de: YaST Modul welches bei der Erstellung einer usbauth-Firewall-Konfigurationsdatei hilft
fi: YaST-osa usbauthin palomuurimääritystiedoston luomisen avuksi
it: Modulo di YaST che aiuta a creare un file di configurazione del firewall usbauth
uk: Модуль YaST, який допомагає створити файл налаштувань брандмауера usbauth

source: YaST2 - User and Group Configuration
ca: YaST2 - Configuració d'usuari i grup
de: YaST2 - Konfiguration der Benutzer und Gruppen
fi: YaST2 – Käyttäjien ja ryhmien määritys
it: YaST2 - configurazione di utenti e gruppi
uk: YaST2 - Налаштування користувачів і груп

source: This package provides GUI for maintenance of linux users and groups.
ca: Aquest paquet proporciona una interfície gràfica per al manteniment d'usuaris i grups linux.
de: Dieses Paket enthält die die GUI zur Pflege der Linux-Benutzer und Gruppen.
fi: Tämä paketti tarjoaa Linux-käyttäjien ja -ryhmien hallinnan käyttöliittymän.
it: Questo pacchetto fornisce la GUI per il mantenimento degli utenti e gruppi linux.
uk: Цей пакунок надає GUI(графічний інтерфейс користувача) для роботи з користувачами і групами користувачів в linux.

source: Configure Hypervisor and Tools for Xen and KVM
ca: Configura l'hipervisor i les eines per a Xen i KVM
de: Hypervisor und Werkzeuge für Xen und KVM einrichten
fi: Määritä hypervisiiri sekä Xen- ja KVM-työkalut
it: Configura Hypervisor e strumenti per Xen e KVM
uk: Налаштування гіпервізора та інструментів для Xen і KVM

source: This YaST module installs the tools necessary for creating VMs with Xen or KVM.
ca: Aquest mòdul YaST instal·la les eines necessàries per crear VMs amb Xen o KVM.
de: Dieses YaST-Modul installiert die Tools zwangsläufig vor der Erstellung von VMs mit Xen oder KVM.
fi: Tämä YaST-osa asentaa tarpeelliset työkalut virtuaalikoneiden luomiseksi Xenillä tai KVM:llä.
it: Questo modulo YaST installa gli strumenti necessari per creare VM con Xen o KVM.
uk: Цей модуль YaST встановлює засоби, необхідні для створення віртуальних машин із Xen або KVM.

source: A YaST module for configuring VPN gateway and clients
ca: Un mòdul YaST per configurar la passarel·la VPN i els clients
de: Ein YaST-Modul zur Konfiguration von VPN-Gateways und Clients
fi: YaST-osa VPN-yhdyskäytävän ja -asiakkaiden määrittämiseksi
it: Un modulo YaST per configurare gateway e client VPN
uk: Модуль YaST для налаштування клієнтів та VPN-шлюзу

source: A YaST module for managing VPN gateway and client connections to secure site-to-site communication via IPSec VPN.
ca: Un mòdul YaST per gestionar la passarel·la VPN i les connexions de clients per assegurar la comunicació site-to-site a través de VPN IPSec.
de: Ein YaST-Modul zur Verwaltung von VPN-Gateway- und Client-Verbindungen für eine sichere site-to-site-Kommunikation via IPSec VPN.
fi: YaST-osa VPN-yhdyskäytävän ja -asiakasyhteyksien hallintaan IPSec VPN:llä tapahtuvaa salattua koneelta koneelle -viestintää varten.
it: Un modulo YaST per gestire gateway VPN e connessioni client per rendere sicura la comunicazione da-sito-a-sito attraverso VPN IPSec.
uk: Модуль YaST для керування VPN-шлюзом та клієнтськими з'єднаннями для безпечного зв'язку «сайт-сайт» через IPSec VPN.

source: YaST2 - widget demo
ca: YaST2 - demostració de ginys
uk: YaST2 — демонстрація віджету

source: A YaST2 module to demonstrate the UI widgets and for style sheet testing
ca: Un mòdul YaST2 per a demostrar els ginys de la interfície d'usuari i per a les proves del full d'estil
uk: YaST2 модуль для демонстрації оболонки віджетів та для тестування стилів таблиць

source: YaST2 - X11 support
ca: Implementació del YaST2 - X11
de: YaST2 - X11-Unterstützung
fi: YaST2 – X11-tuki
it: YaST2 - supporto X11
uk: YaST2 — Підтримка X11

source: This package contains the programs and files for YaST2 X11 support.
ca: Aquest paquet conté els programes i fitxers per al suport YaST2 X11.
de: Dieses Paket enthält die Programme und Dateien für die Unterstützung von YaST2 X11.
fi: Tämä paketti sisältää YaST2:n X11-tuen ohjelmat ja tiedostot.
it: Questo pacchetto contiene i programmi e i file per il supporto X11 di YaST2.
uk: Цей пакунок містить програми та файли для підтримки X11 в YaST2.

source: YaST2 - XML Agent
ca: YaST2 - Agent XML
fi: YaST2 – XML-agentti
it: YaST2 - agente XML
uk: YaST2 — XML-агент

source: The YaST2 XML agent
ca: L'agent XML del YaST2
de: XML Agent für YaST2
fi: YaST2:n XML-agentti
it: L'agente XML di YaST2
uk: YaST2 XML агент

source: YaST2 - YCP Bindings for the YaST2 User Interface Engine
ca: YaST2 - Vinculacions YCP per al motor d'interfície d'usuari YaST2
de: YaST2 - YCP-Bindings für die YaST2-Benutzerschnittstellen-Engine
fi: YaST2 – YaST2:n käyttöliittymämoottorin YCP-sidokset
it: YaST2 - binding YCP per il motore dell'interfaccia grafica di YaST2
uk: YaST2 - Прив'язки рушія користувацького інтерфейсу YaST2 до YCP

source: This package makes the generic YaST2 user interface engine available for YCP applications (YCP is the scripting language in which most YaST2 modules are written).
ca: Aquest paquet fa disponible el motor d'interfície d'usuari YaST2 genèric per a aplicacions YCP (YCP és el llenguatge de scripting en el qual s'escriuen la majoria dels mòduls YaST2).
de: Dieses Paket stellt eine generische YaST2-Benutzerschnittstellen-Engine für YCP-Anwendungen (YCP ist die Skriptsprache, in der die meisten YaST2-Module geschrieben sind) zur Verfügung.
fi: Tämä paketti saattaa YaST2:n yleisen käyttöliittymämoottorin YCP-sovellusten käyttöön (missä YCP on skriptikieli, jolla useimmat YaST2-osat on kirjoitettu).
it: Questo pacchetto rende il motore della generica interfaccia utente di YaST2 disponibile per le applicazioni YCP (YCP è il linguaggio di script in cui sono scritti molti moduli YaST2).
uk: Цей пакунок робить рушій інтерфейсу користувача YaST2 доступним для YCP-програм (YCP - це скриптова мова, якою написано більшість модулів YaST2).

source: This is the development package that makes the generic YaST2 user interface engine available for YCP applications (YCP is the scripting language in which most YaST2 modules are written).
ca: Aquest és el paquet de desenvolupament que fa disponible el motor d'interfície d'usuari YaST2 genèric per a aplicacions YCP (YCP és el llenguatge de scripting en el qual s'escriuen la majoria dels mòduls YaST2).
de: Das ist das Entwicklungs-Paket, das die generische YaST2-Benutzerschnittstellen-Engine für YCP-Anwendungen (YCP ist die Skriptsprache, in der die meisten YaST2-Module geschrieben sind) zur Verfügung stellt.
fi: Tämä on kehityspaketti, jonka avulla YaST2:n käyttöliittymämoottori saadaan YCP-sovellusten käyttöön (missä YCP on skriptikieli, jolla useimmat YaST2-osat on kirjoitettu).
it: Questo è il pacchetto di sviluppo che pacchetto rende il motore della generica interfaccia utente di YaST2 disponibile per le applicazioni YCP (YCP è il linguaggio di script in cui sono scritti molti moduli YaST2).
uk: Цей пакет для розробника, який робить рушій інтерфейсу користувача YaST2 доступним для YCP-додатків (YCP — це скриптова мова, якою написано більшість модулів YaST2).

source: YaST2 - Fonts Configuration
ca: YaST2 - Configuració dels tipus de lletra
de: YaST2 - Schrift-Konfiguration
fi: YaST2 – Fonttien määritys
it: YaST2 - configurazione dei tipi di carattere
uk: YaST2 — Налаштування шрифтів

source: Module for configuring X11 fonts able to select preferred font families as well as set rendering algorithms to be used.
ca: Mòdul per a configurar els tipus de lletra X11 capaços de seleccionar les famílies de tipus de lletra preferides, així com establir els algorismes de renderització que s'utilitzaran.
de: Modul zur Konfiguration der X11-Schriften, das in der Lage ist die bevorzugten Schrift-Familien auszuwählen und die verwendeten Rendering-Algorithmen zu setzen.
fi: Osa X11-fonttien määrittämiseksi valitsemalla suositut fonttiperheet ja käytettävät hahmonnusalgoritmit.
it: Modulo per configurare i tipi di carattere X11 che permette di selezionare le famiglie di caratteri preferite così come gli algoritmi di resa grafica da usare.
uk: Модуль для налаштування шрифтів X11, за допомогою якого можна вибирати бажані гарнітури шрифтів і використовувані алгоритми візуалізації.

source: This package contains the YaST2 component to configure samba as an Active Directory Domain Controller.
ca: Aquest paquet conté el component YaST2 per a configurar samba com a controlador de domini de directori actiu.
fi: Tämä paketti sisältää YaST2-osan, jolla Samban voi määrittää Active Directory -toimialueen ohjauskoneeksi.
it: Questo pacchetto contiene il componente di YaST2 per la configurazione di samba come Active Directory Domain Controller.
uk: Цей пакунок містить компонент YaST2 для налаштування samba як контролера домену Active Directory.

source: Collection of yast2-schema autoyast XML definitions of released distributions
ca: Col·lecció de definicions XML autoyast yast2-schema de distribucions llançades
uk: Колекція yast2-schema autoyast XML визначень випущених дистрибутивів

source: Contains a collection of yast2-schema autoyast XML definitions of released distributions. Those are needed to be able to validate autoyast XML files you might want to use for auto installations
ca: Conté una col·lecció de definicions XML autoyast yast2-schema de distribucions llançades. Aquests són necessaris per a poder validar fitxers XML autoyast que potser voleu utilitzar per a instal·lacions automàtiques
uk: Містить колекцію yast2-schema autoyast XML визначень випущених дистрибутивів. Вони потрібні щоб мати можливість перевірити autoyast XML файли, які ви можете захотіти для використання автоматичних інсталяцій

source: YaST2 - Main Package
de: YaST2 - Hauptpaket

source: Yast2 forms and components for the management of AppArmor profiles.
de: YaST2-Formulare und Komponenten für die Verwaltung von AppArmor-Profilen.

source: Collecting YAST information
de: Sammlung von YAST Informationen

source: Python bindings for the YaST platform
de: Python-Bindings für die YaST-Plattform
it: Binding Python per la piattaforma YaST

source: YaST2 - sudo configuration
de: YaST2 - sudo-Konfiguration

source: YaST2 - English Translations
de: YaST2 - Englische Übersetzungen
it: YaST2 - traduzioni inglesi

source: YaST2 - English Translations.
de: YaST2 - Englische Übersetzungen.
it: YaST2 - traduzioni in inglese.

source: YaST2 - Translations
de: YaST2 - Übersetzungen
it: YaST2 - traduzioni

source: YaST2 - Translations for American English.
de: YaST2 - Übersetzungen ins Amerikanische Englisch.
it: YaST2 - traduzioni per inglese americano.

source: ADSI Edit for YaST
de: ADSI Edit für YaST
