Repository: openSUSE/packages-i18n
Catalog: */po/yast2.*.po
Languages: ca, de, fi, it, uk

source: YaST2 - German Translations
ca: YaST2 - Traduccions en alemany
de: YaST2 - Deutsche Übersetzungen
fi: YaST2 – Saksankieliset käännökset
it: YaST2 - traduzioni tedesche
uk: YaST2 - німецькі переклади

source: YaST2 - German translations.
ca: YaST2 - Traduccions a l'alemany.
de: YaST2 - Deutsche Übersetzungen.
fi: YaST2 – käännökset saksaksi.
it: YaST2 - traduzioni tedesche.
uk: YaST2 - переклади на німецьку мову.

source: YaST2 - Greek Translations
ca: YaST2 - Traduccions gregues
de: YaST2 - Griechische Übersetzungen
fi: YaST2 – Kreikankieliset käännökset
it: YaST2 - traduzioni greche
uk: YaST2 - грецькі переклади

source: YaST2 - Translations for Greek.
ca: YaST2 - Traduccions per al grec.
de: YaST2 - Übersetzungen für Griechen.
fi: YaST2 – Käännökset kreikaksi.
it: YaST2 - traduzioni in greco.
uk: YaST2 - переклади на грецьку мову.

source: YaST2 - British English Translations
ca: YaST2 - Traduccions a l'anglès britànic
de: YaST2 - Übersetzungen ins Britische Englisch
fi: YaST2 – Brittienglanninnokset
it: YaST2 - traduzioni inglesi britanniche
uk: YaST2 - переклади британською англійською

source: YaST2 - Translations for British English.
ca: YaST2 - Traduccions per a anglès britànic.
de: YaST2 - Übersetzungen ins britische Englisch.
fi: YaST2 – Käännökset brittienglanniksi.
it: YaST2 - traduzioni in inglese britannico.
uk: YaST2 - переклади на британську англійську мову.

source: YaST2 - Esperanto Translations
ca: YaST2 - Traduccions en esperanto
de: YaST2 - Übersetzungen in Esperanto
fi: YaST2 – Esperantonnokset
it: YaST2 - traduzioni esperanto
uk: YaST2 - переклади есперанто

source: YaST2 - Esperanto Translations.
ca: YaST2 - Traduccions d'esperanto.
de: YaST2 - Übersetzungen in Esperanto.
fi: YaST2 – Käännökset esperantoksi.
it: YaST2 - traduzioni in esperanto.
uk: YaST2 - переклади мовою есперанто.

source: YaST2 - Spanish Translations
ca: YaST2 - Traduccions al castellà
de: YaST2 - Spanische Übersetzungen
fi: YaST2 – Espanjankieliset käännökset
it: YaST2 - traduzioni spagnole
uk: YaST2 - іспанські переклади

source: YaST2 - Spanish Translations.
ca: YaST2 - Traduccions en castellà.
de: YaST2 - Spanische Übersetzungen.
fi: YaST2 – Käännökset espanjaksi.
it: YaST2 - traduzioni in spagnolo.
uk: YaST2 - переклади на іспанську мову.

source: YaST2 - Spanish (Argentina) Translations
ca: YaST2 - Espanyol (Argentina) Traduccions
de: YaST2 - Spanische (Argentinische) Übersetzungen
fi: YaST2 – (Argentiinan)espanjannokset
it: YaST2 - traduzioni spagnole (Argentina)
uk: YaST2 - іспанські переклади (Аргентина)

source: YaST2 - Spanish (Argentina) Translations.
ca: YaST2 - Traduccions en castellà (Argentina).
de: YaST2 - Spanische (Argentinische) Übersetzungen.
fi: YaST2 – Käännökset (argentiinan)espanjaksi.
it: YaST2 - traduzioni in spagnolo (Argentina).
uk: YaST2 - переклади на іспанську мову (Аргентина).

source: YaST2 - Estonian Translations
ca: YaST2 - Traduccions en estonià
de: YaST2 - Estische Übersetzungen
fi: YaST2 – Vironkieliset käännökset
it: YaST2 - traduzioni in estone
uk: YaST2 - естонські переклади

source: YaST2 - Translations for Estonian.
ca: YaST2 - Traduccions per a estonià.
de: YaST2 - Übersetzungen für Esten.
fi: YaST2 – Käännökset viroksi.
it: YaST2 - traduzioni in estone.
uk: YaST2 - переклади на естонську мову.

source: YaST2 - Translations for Esperanto.
ca: YaST2 - Traduccions per a esperanto.
de: YaST2 - Übersetzungen für Esperanto.
fi: YaST2 – Käännökset esperantoksi.
it: YaST2 - traduzioni in esperanto.
uk: YaST2 - переклади для есперанто.

source: YaST2 - Persian Translations
ca: YaST2 - Traduccions perses
de: YaST2 - Persische Übersetzungen
fi: YaST2 – Farsinkieliset käännökset
it: YaST2 - traduzioni persiane
uk: YaST2 - перські переклади

source: YaST2 - Persian Translations.
ca: YaST2 - Traduccions perses.
de: YaST2 - Persische Übersetzungen.
fi: YaST2 – Käännökset farsiksi.
it: YaST2 - traduzioni in persiano.
uk: YaST2 - переклади на перську мову.

source: YaST2 - Finnish Translations
ca: YaST2 - Traduccions al finès
de: YaST2 - Finnische Übersetzungen
fi: YaST2 – Suomennokset
it: YaST2 - traduzioni finlandesi
uk: YaST2 - фінські переклади

source: YaST2 - Finnish translations.
ca: YaST2 - Traduccions al finès.
de: YaST2 - Finnische Übersetzungen.
fi: YaST2 – Käännökset suomeksi.
it: YaST2 - traduzioni in finlandese.
uk: YaST2 - переклади на фінську мову.

source: YaST2 - French Translations
ca: YaST2 - Traduccions al francès
de: YaST2 - Französische Übersetzungen
fi: YaST2 – Ranskankieliset käännökset
it: YaST2 - traduzioni francesi
uk: YaST2 - французькі переклади

source: YaST2 - Translations for French.
ca: YaST2 - Traduccions per al francès.
de: YaST2 - Übersetzungen für Franzosen.
fi: YaST2 – Käännökset ranskaksi.
it: YaST2 - traduzioni in francese.
uk: YaST2 - переклади на французьку мову.

source: YaST2 - Galician Translations
ca: YaST2 - Traduccions en gallec
de: YaST2 - Galizische Übersetzungen
fi: YaST2 – Galiciankieliset käännökset
it: YaST2 - traduzioni galiziane
uk: YaST2 - галицькі переклади

source: YaST2 - Galician translations.
ca: YaST2 - Traduccions en gallec.
de: YaST2 - Galizische Übersetzungen.
fi: YaST2 – Käännökset galiciaksi.
it: YaST2 - traduzioni in galiziano.
uk: YaST2 - переклади на галицьку мову.

source: YaST2 - Gujarati Translations
ca: YaST2 - Traduccions del Gujarati
de: YaST2 - Gudscharatische Übersetzungen
fi: YaST2 – Gudžaratinkieliset käännökset
it: YaST2 - traduzioni gujarati
uk: YaST2 - переклади мовою гуджараті

source: YaST2 - Translations for Gujarati.
ca: YaST2 - Traduccions per a Gujarati.
de: YaST2 - Übersetzungen für Gudscharati.
fi: YaST2 – Käännökset gudžaratiksi.
it: YaST2 - traduzioni in gujarati.
uk: YaST2 - переклади на мову гуджараті.

source: YaST2 - Hebrew Translations
ca: YaST2 - Traduccions hebrees
de: YaST2 - Hebräische Übersetzungen
fi: YaST2 – Hepreankieliset käännökset
it: YaST2 - traduzioni ebraiche
uk: YaST2 - переклади на іврит

source: YaST2 - Translations for Hebrew.
ca: YaST2 - Traduccions per a hebreu.
de: YaST2 - Übersetzungen für Hebräer.
fi: YaST2 – Käännökset hepreaksi.
it: YaST2 - traduzioni in ebraico.
uk: YaST2 - переклади на іврит.

source: YaST2 - Hindi Translations
ca: YaST2 - Traduccions en hindi
de: YaST2 - Hindische Übersetzungen
fi: YaST2 – Hindinkieliset käännökset
it: YaST2 - traduzioni hindi
uk: YaST2 - переклади мовою хінді

source: YaST2 - Translations for Hindi.
ca: YaST2 - Traduccions per a l'hindi.
de: YaST2 - Übersetzungen für Hindi.
fi: YaST2 – Käännökset hindiksi.
it: YaST2 - traduzioni in hindi.
uk: YaST2 - переклади на мову хінді.

source: YaST2 - Croatian Translations
ca: YaST2 - Traduccions en croat
de: YaST2 - Kroatische Übersetzungen
fi: YaST2 – Kroatiankieliset käännökset
it: YaST2 - traduzioni croate
uk: YaST2 - хорватські переклади

source: YaST2 - Croatian Translations.
ca: YaST2 - Traduccions croates.
de: YaST2 - Kroatische Übersetzungen.
fi: YaST2 – Käännökset kroatiaksi.
it: YaST2 - traduzioni in croato.
uk: YaST2 - переклади на хорватську мову.

source: YaST2 - Hungarian Translations
ca: YaST2 - Traduccions hongareses
de: YaST2 - Ungarische Übersetzungen
fi: YaST2 – Unkarinkieliset käännökset
it: YaST2 - traduzioni ungheresi
uk: YaST2 - угорські переклади

source: YaST2 - Hungarian translations.
ca: YaST2 - Traduccions a l'hongarès.
de: YaST2 - Ungarische Übersetzungen.
fi: YaST2 – Käännökset unkariksi.
it: YaST2 - traduzioni in ungherese.
uk: YaST2 - переклади на угорську мову.

source: YaST2 - Indonesian Translations
ca: YaST2 - Traduccions indonèsies
de: YaST2 - Indonesische Übersetzungen
fi: YaST2 – Indonesiankieliset käännökset
it: YaST2 - traduzioni indonesiane
uk: YaST2 - індонезійські переклади

source: YaST2 - Indonesian Translations.
ca: YaST2 - Traduccions indonèsies.
de: YaST2 - Indonesische Übersetzungen.
fi: YaST2 – Käännökset indonesiaksi.
it: YaST2 - traduzioni in indonesiano.
uk: YaST2 - переклади на індонезійську мову.

source: YaST2 - Italian Translations
ca: YaST2 - Traduccions italianes
de: YaST2 - Italienische Übersetzungen
fi: YaST2 – Italiankieliset käännökset
it: YaST2 - traduzioni italiane
uk: YaST2 - італійські переклади

source: YaST2 - translations for Italian.
ca: YaST2 - traduccions per a italià.
de: YaST2 - Übersetzungen für Italiener.
fi: YaST2 – Käännökset italiaksi.
it: YaST2 - traduzioni in italiano.
uk: YaST2 - переклади на італійську мову.

source: YaST2 - Japanese Translations
ca: YaST2 - Traduccions japoneses
de: YaST2 - Japanische Übersetzungen
fi: YaST2 – Japaninkieliset käännökset
it: YaST2 - traduzioni giapponesi
uk: YaST2 - японські переклади

source: YaST2 - Japanese translations.
ca: YaST2 - Traduccions japoneses.
de: YaST2 - Japanische Übersetzungen.
fi: YaST2 – Käännökset japaniksi.
it: YaST2 - traduzioni in giapponese.
uk: YaST2 - переклади на японську мову.

source: YaST2 - Javanese Translations
ca: YaST2 - Traduccions en javanès
de: YaST2 - Javanische Übersetzungen
fi: YaST2 – Jaavankieliset käännökset
it: YaST2 - traduzioni giavanesi
uk: YaST2 - яванські переклади

source: YaST2 - Translations for Javanese.
ca: YaST2 - Traduccions per al javanès.
de: YaST2 - Übersetzungen für Javaner.
fi: YaST2 – Käännökset jaavaksi.
it: YaST2 - traduzioni in giavanese.
uk: YaST2 - переклади на яванську мову.

source: YaST2 - Georgian Translations
ca: YaST2 - Traduccions georgianes
de: YaST2 - Georgische Übersetzungen
fi: YaST2 – Georgiankieliset käännökset
it: YaST2 - traduzioni georgiane
uk: YaST2 - грузинські переклади

source: YaST2 - Translations for Georgian.
ca: YaST2 - Traduccions per al georgià.
de: YaST2 - Übersetzungen für Georgier.
fi: YaST2 – Käännökset georgiaksi.
it: YaST2 - traduzioni in georgiano.
uk: YaST2 - переклади на грузинську мову.

source: YaST2 - Kabyle Translations
ca: YaST2 - Traduccions de kabyle
de: YaST2 - Kabylische Übersetzungen
fi: YaST2 – Kabilinkieliset käännökset
it: YaST2 - traduzioni kabyle
uk: YaST2 - кабільські переклади

source: YaST2 - Translations for Kabyle.
ca: YaST2 - Traduccions per al kabile.
de: YaST2 - Übersetzungen für Kabylen.
fi: YaST2 – Käännökset kabiliksi.
it: YaST2 - traduzioni in kabyle.
uk: YaST2 - переклади на кабільську мову.

source: YaST2 - Khmer Translations
ca: Traduccions YaST2 - Khmer
de: YaST2 - Khmerische Übersetzungen
fi: YaST2 – Khmerinkieliset käännökset
it: YaST2 - traduzioni khmer
uk: YaST2 - кхмерські переклади

source: YaST2 - Translations for Khmer.
ca: YaST2 - Traduccions per a Khmer.
de: YaST2 - Übersetzungen für Kambodschaner.
fi: YaST2 – Käännökset khmeriksi.
it: YaST2 - traduzioni in khmer.
uk: YaST2 - переклади на кхмерську мову.

source: YaST2 - Kannada Translations
ca: YaST2 - Traduccions en kanarès
de: YaST2 - Kannadische Übersetzungen
fi: YaST2 – Kannadankieliset käännökset
it: YaST2 - traduzioni kannada
uk: YaST2 - переклади мовою каннада

source: YaST2 - Translations for Kannada.
ca: YaST2 - Traduccions per al kanarès.
de: YaST2 - Übersetzungen für Kannadier.
fi: YaST2 – Käännökset kannadaksi.
it: YaST2 - traduzioni in kannada.
uk: YaST2 - переклади на Мову каннада.

source: YaST2 - Korean Translations
ca: YaST2 - Traduccions coreanes
de: YaST2 - Koreanische Übersetzungen
fi: YaST2 – Koreankieliset käännökset
it: YaST2 - traduzioni coreane
uk: YaST2 - корейські переклади

source: YaST2 - Translations for Korean.
ca: YaST2 - Traduccions per al coreà.
de: YaST2 - Übersetzungen für Koreaner.
fi: YaST2 – Käännökset koreaksi.
it: YaST2 - traduzioni in coreano.
uk: YaST2 - переклади на корейську мову.

source: YaST2 - Kurdish Translations
ca: YaST2 - Traduccions kurdes
de: YaST2 - Kurdische Übersetzungen
fi: YaST2 – Kurdinkieliset käännökset
it: YaST2 - traduzioni curde
uk: YaST2 - курдські переклади

source: YaST2 - Kurdish Translations.
ca: YaST2 - Traduccions kurdes.
de: YaST2 - Kurdische Übersetzungen.
fi: YaST2 – Käännökset kurdiksi.
it: YaST2 - traduzioni in curdo.
uk: YaST2 - переклади на курдську мову.

source: YaST2 - Lao Translations
ca: YaST2 - Traduccions de Lao
de: YaST2 - Laotische Übersetzungen
fi: YaST2 – Laonkieliset käännökset
it: YaST2 - traduzioni lao
uk: YaST2 - лаоські переклади

source: YaST2 - Translations for Lao.
ca: YaST2 - Traduccions per a Lao.
de: YaST2 - Übersetzungen für Laoten.
fi: YaST2 – Käännökset laoksi.
it: YaST2 - traduzioni in lao.
uk: YaST2 - переклади на лаоську мову.

source: YaST2 - Lithuanian Translations
ca: YaST2 - Traduccions en lituà
de: YaST2 - Litauische Übersetzungen
fi: YaST2 – Liettuankieliset käännökset
it: YaST2 - traduzioni lituane
uk: YaST2 - литовські переклади

source: YaST2 - Translations for Lithuanian.
ca: YaST2 - Traduccions per al lituà.
de: YaST2 - Übersetzungen für Litauen.
fi: YaST2 – Käännökset liettuaksi.
it: YaST2 - traduzioni in lituano.
uk: YaST2 - переклади на литовську мову.

source: YaST2 - Latvian Translations
ca: YaST2 - Traduccions al letó
de: YaST2 - Lettische Übersetzungen
fi: YaST2 – Latviankieliset käännökset
it: YaST2 - traduzioni lettoni
uk: YaST2 - латвійські переклади

source: YaST2 - Translations for Latvian.
ca: YaST2 - Traduccions per al letó.
de: YaST2 - Übersetzungen für Letten.
fi: YaST2 – käännökset latviaksi.
it: YaST2 - traduzioni in lettone.
uk: YaST2 - переклади на латвійську мову.

source: YaST2 - Macedonian Translations
ca: YaST2 - Traduccions macedònies
de: YaST2 - Makedonische Übersetzungen
fi: YaST2 – Makedoniankieliset käännökset
it: YaST2 - traduzioni macedoni
uk: YaST2 - македонські переклади

source: YaST2 - Translations for Macedonian.
ca: YaST2 - Traduccions per al macedoni.
de: YaST2 - Übersetzungen für Makedonier.
fi: YaST2 – Käännökset makedoniaksi.
it: YaST2 - traduzioni in macedone.
uk: YaST2 - переклади на македонську мову.

source: YaST2 - Marathi Translations
ca: YaST2 - Traduccions del marathi
de: YaST2 - Marathische Übersetzungen
fi: YaST2 – Marathinkieliset käännökset
it: YaST2 - traduzioni marathi
uk: YaST2 - переклади на мову маратхі

source: YaST2 - Translations for Marathi.
ca: YaST2 - Traduccions per al marathi.
de: YaST2 - Übersetzungen für Marathi.
fi: YaST2 – Käännökset marathiksi.
it: YaST2 - traduzioni in marathi.
uk: YaST2 - переклади на мові маратхі.

source: YaST2 - Malay Translations
ca: YaST2 - Traduccions malaies
uk: YaST2 - переклади малайською

source: YaST2 - Translations for Malay.
ca: YaST2 - Traduccions per al malai.
uk: YaST2 - переклади на малайську мову.

source: YaST2 - Burmese Translations
ca: YaST2 - Traduccions birmanes
uk: YaST2 - переклади бірманською

source: YaST2 - Translations for Burmese.
ca: YaST2 - Traduccions per al birmà.
uk: YaST2 - переклади на бірменську мову.

source: YaST2 - Norwegian Bokmål Translations
ca: YaST2 - Traduccions del Bokmsl noruec
de: YaST2 - Norwegisch Bokmål Übersetzungen
fi: YaST2 – Norjankieliset käännökset (bokmål)
it: YaST2 - traduzioni norvegesi Bokmål
uk: YaST2 - переклади норвезькою мовою букмол

source: YaST2 - Translations for Norwegian Bokmål.
ca: YaST2 - Traduccions per al noruec Bokm.l.
de: YaST2 - Übersetzungen für Norweger Bokmål.
fi: YaST2 – Käännökset norjaksi (bokmål).
it: YaST2 - traduzioni in norvegese Bokmål.
uk: YaST2 - переклади на норвезьку мову букмол.

source: YaST2 - Low Saxonian Translations
ca: YaST2 - Traduccions baix saxones
de: YaST2 - Niedersächsische Übersetzungen
fi: YaST2 – Alasaksinkieliset käännökset
it: YaST2 - traduzioni basso sassoni
uk: YaST2 - нижньосаксонські переклади

source: YaST2 - Translations for Low Saxonian.
ca: YaST2 - Traduccions per al baix saxó.
de: YaST2 - Übersetzungen für Niedersachsen.
fi: YaST2 – Käännökset alasaksiksi.
it: YaST2 - traduzioni in basso sassone.
uk: YaST2 - переклади на нижньосаксонську мову.

source: YaST2 - Nepali Translations
ca: YaST2 - Traduccions nepaleses
de: YaST2 - Nepalische Übersetzungen
fi: YaST2 – Nepalinkieliset käännökset
it: YaST2 - traduzioni nepalesi
uk: YaST2 - непальські переклади

source: YaST2 - Translations for Nepali.
ca: YaST2 - Traduccions per al nepalès.
de: YaST2 - Übersetzungen für Nepalen.
fi: YaST2 – Käännökset nepaliksi.
it: YaST2 - traduzioni in nepalese.
uk: YaST2 - переклади на непальську мову.

source: YaST2 - Dutch Translations
ca: YaST2 - Traduccions en neerlandès
de: YaST2 - Holländische Übersetzungen
fi: YaST2 – Hollanninkieliset käännökset
it: YaST2 - traduzioni olandesi
uk: YaST2 - голландські переклади

source: YaST2 - Translations for Dutch.
ca: YaST2 - Traduccions per al neerlandès.
de: YaST2 - Übersetzungen für Holländer.
fi: YaST2 – Käännökset hollanniksi.
it: YaST2 - traduzioni in olandese.
uk: YaST2 - переклади на голландську мову.

source: YaST2 - Norwegian Nynorsk
ca: YaST2 - Nynorsk noruec
de: YaST2 - Norwegisch Nynorsk
fi: YaST2 – Norjankieliset käännökset (nynorsk)
it: YaST2 - norvegese nynorsk
uk: YaST2 - переклади норвезькою нюнорською мовою

source: YaST2 - Translations for Norwegian Nynorsk.
ca: YaST2 - Traduccions per al noruec Nynorsk.
de: YaST2 - Übersetzungen für Norweger Nynorsk.
fi: YaST2 – Käännökset norjaksi (nynorsk).
it: YaST2 - traduzioni in norvegese nynorsk.
uk: YaST2 - переклади на норвезьку нюнорську мову.

source: YaST2 - Punjabi Translations
ca: YaST2 - Traduccions del panjabi
de: YaST2 - Pandschabische Übersetzungen
fi: YaST2 – Pandžabinkieliset käännökset
it: YaST2 - traduzioni punjabi
uk: YaST2 - переклади мовою пенджабі

source: Translations for Punjabi.
ca: Traduccions per al panjabi.
de: Übersetzungen für Pandschabi.
fi: Käännökset pandžabiksi.
it: YaST2 - traduzioni in punjabi.
uk: YaST2 - переклади на мову пенджабі.

source: YaST2 - Polish Translations
ca: YaST2 - Traduccions poloneses
de: YaST2 - Polnische Übersetzungen
fi: YaST2 – Puolankieliset käännökset
it: YaST2 - traduzioni polacche
uk: YaST2 - польські переклади

source: YaST2 - Translations for Polish.
ca: YaST2 - Traduccions per al polonès.
de: YaST2 - Übersetzungen für Polen.
fi: YaST2 – Käännökset puolaksi.
it: YaST2 - traduzioni in polacco.
uk: YaST2 - переклади на польську мову.

source: YaST2 - Pashto Translations
ca: YaST2 - Traduccions de Pashto
de: YaST2 - Paschtunische Übersetzungen
fi: YaST2 – Paštunkieliset käännökset
it: YaST2 - traduzioni pashto
uk: YaST2 - пуштунські переклади

source: YaST2 - Translations for Pashto.
ca: YaST2 - Traduccions per a Pashto.
de: YaST2 - Übersetzungen für Paschtunen.
fi: YaST2 – Käännökset paštuksi.
it: YaST2 - traduzioni in pashto.
uk: YaST2 - переклади на мову пушту.

source: YaST2 - Portuguese Translations
ca: YaST2 - Traduccions en portuguès
de: YaST2 -Portugiesische Übersetzungen
fi: YaST2 – Portugalinkieliset käännökset
it: YaST2 - traduzioni portoghesi
uk: YaST2 - португальські переклади

source: YaST2 - Translations for Portuguese.
ca: YaST2 - Traduccions per al portuguès.
de: YaST2 - Übersetzungen ins Portugiesische.
fi: YaST2 – Käännökset portugaliksi.
it: YaST2 - traduzioni in portoghese.
uk: YaST2 - переклади на португальську мову.

source: YaST2 - Brazilian Portuguese Translations
ca: YaST2 - Traduccions al portuguès brasiler
de: YaST2 - Übersetzungen ins Brasilianische Portugiesisch
fi: YaST2 – Brasilianportugalinnokset
it: YaST2 - traduzioni portoghesi brasiliane
uk: YaST2 - португальські переклади (Бразилія)

source: YaST2 - Translations for Brazilian Portuguese.
ca: YaST2 - Traduccions per al portuguès brasiler.
de: YaST2 - Übersetzungen ins brasilianische Portugiesisch.
fi: YaST2 – Käännökset brasilianportugaliksi.
it: YaST2 - traduzioni in portoghese brasiliano.
uk: YaST2 - переклади на португальську мову (Бразилія).

source: YaST2 - Romanian Translations
ca: YaST2 - Traduccions romaneses
de: YaST2 - Rumänische Übersetzungen
fi: YaST2 – Romaniankieliset käännökset
it: YaST2 - traduzioni romene
uk: YaST2 - румунські переклади

source: YaST2 - Translations for Romanian.
ca: YaST2 - Traduccions per al romanès.
de: YaST2 - Rumänische Übersetzungen.
fi: YaST2 – Käännökset romaniaksi.
it: YaST2 - traduzioni in romeno.
uk: YaST2 - переклади на румунську мову.

source: YaST2 - Russian Translations
ca: YaST2 - Traduccions en rus
de: YaST2 - Russische Übersetzungen
fi: YaST2 – Venäjänkieliset käännökset
it: YaST2 - traduzione russa
uk: YaST2 - переклади російською

source: YaST2 - Translations for Russian.
ca: YaST2 - Traduccions per al rus.
de: YaST2 - Übersetzungen für Russen.
fi: YaST2 – Käännökset venäjäksi.
it: YaST2 - traduzioni in russo.
uk: YaST2 - переклади на російську мову.

source: YaST2 - Sinhala Translations
ca: YaST2 - Traduccions del singalès
de: YaST2 - Singhalesische Übersetzungen
fi: YaST2 – Sinhalankieliset käännökset
it: YaST2 - traduzioni sinhala
uk: YaST2 - сингальські переклади

source: YaST2 - Translations for Sinhala.
ca: YaST2 - Traduccions per al singalès.
de: YaST2 - Übersetzungen für Singhalesen.
fi: YaST2 – Käännökset sinhalaksi.
it: YaST2 - traduzioni in sinhala.
uk: YaST2 - переклади на сингальську мову.

source: YaST2 - Slovak Translations
ca: YaST2 - Traduccions en eslovac
de: YaST2 - Slowakische Übersetzungen
fi: YaST2 – Slovakinkieliset käännökset
it: YaST2 - traduzioni slovacche
uk: YaST2 - словацькі переклади

source: YaST2 - Slovak Translations.
ca: YaST2 - Traduccions eslovaques.
de: YaST2 - Slowakische Übersetzungen.
fi: YaST2 – Käännökset slovakiksi.
it: YaST2 - traduzioni in slovacco.
uk: YaST2 - переклади на словацьку мову.

source: YaST2 - Slovene Translations
ca: YaST2 - Traduccions en eslovè
de: YaST2 - Slowenische Übersetzungen
fi: YaST2 – Sloveeninkieliset käännökset
it: YaST2 - traduzioni slovene
uk: YaST2 - словенські переклади

source: YaST2 - Translations for Slovene.
ca: YaST2 - Traduccions per a l'eslovè.
de: YaST2 - Übersetzungen für Slowenen.
fi: YaST2 – Käännökset sloveeniksi.
it: YaST2 - traduzioni in sloveno.
uk: YaST2 - переклади на словенську мову.

source: YaST2 - Albanian Translations
ca: YaST2 - Traduccions albaneses
de: YaST2 - Albanische Übersetzungen
fi: YaST2 – Albaniankieliset käännökset
it: YaST2 - traduzioni albanesi
uk: YaST2 - албанські переклади

source: YaST2 - Translations for Albanian.
ca: YaST2 - Traduccions per a l'albanès.
de: YaST2 - Übersetzungen für Albaner.
fi: YaST2 – Käännökset albaniaksi.
it: YaST2 - traduzioni in albanese.
uk: YaST2 - переклади на албанську мову.

source: YaST2 - Serbian Translations
ca: YaST2 - Traduccions sèrbies
de: YaST2 - Serbische Übersetzungen
fi: YaST2 – Serbiankieliset käännökset
it: YaST2 - traduzioni serbe
uk: YaST2 - сербські переклади

source: YaST2 - Translations for Serbian.
ca: YaST2 - Traduccions per al serbi.
de: YaST2 - Übersetzungen für Serben.
fi: YaST2 – Käännökset serbiaksi.
it: YaST2 - traduzioni in serbo.
uk: YaST2 - переклади на сербську мову.

source: YaST2 - Serbian (Latin) Translations
ca: Traducció al serbi (llatí) YaST2
de: YaST2 - Serbische (Latein) Übersetzungen
fi: YaST2 – Serbiankieliset käännökset (latinalainen)
it: YaST2 - traduzioni serbe (latino)
uk: YaST2 - сербські переклади (латиницею)

source: YaST2 - Translations for Serbian (Latin).
ca: YaST2 - Traduccions per al serbi (llatí).
de: YaST2 - Übersetzungen für Serben (Latein).
fi: YaST2 – Käännökset serbiaksi (latinalainen).
it: YaST2 - traduzioni in serbo (latino).
uk: YaST2 - переклади на сербську мову (латиницею).

source: YaST2 - Translation Statistics
ca: YaST2 - Estadístiques de traducció
de: YaST2 - Übersetzungsstatistiken
fi: YaST2 – Käännöstilastot
it: YaST2 - statistiche di traduzione
uk: YaST2 - Статистика перекладів
