Repository: openSUSE/packages-i18n
Catalog: */po/yast2.*.po
Languages: ca, de, fi, it, uk

source: Common data for the NFS client and server modules
ca: Dades comunes per als mòduls de client i servidor NFS
fi: NFS-asiakas- ja palvelinmoduulien yleiset tiedot
it: Dati comuni dei moduli client e server NFS
uk: Загальні дані для клієнтських і серверних модулів NFS

source: YaST2 - NFS Server Configuration
ca: YaST2 - Configuració del servidor NFS
de: YaST2 - NFS Server-Konfiguration
fi: YaST2 - NFS-palvelimen määritys
it: YaST2 - configurazione del server NFS
uk: YaST2 - Конфігурація сервера NFS

source: The YaST2 component for configuration of an NFS server. NFS stands for network file system access. It allows access to files on remote machines.
ca: El component YaST2 per a la configuració d'un servidor NFS. NFS significa accés al sistema de fitxers de xarxa. Permet l'accés a fitxers en màquines remotes.
de: Die YaST2-Komponente für die Konfiguration des NFS. NFS (Network File System) ist das Standard-Dateisystem für Fileserver unter UNIX und im Internet. Dieses Paket ermöglicht den Zugriff auf Dateien entfernter Computer.
fi: YaST2-osa NFS-palvelimen määrittämiseen. NFS tulee sanoista "network file system", verkkotiedostojärjestelmä. Se mahdollistaa tiedostojen käyttämisen etäkoneilta.
it: Il componente YaST2 per la configurazione di un server NFS. NFS è un acronimo dell'accesso al sistema dei file di rete. Permette di accedere ai file su macchine remote.
uk: Компонент YaST2 для налаштування сервера NFS. NFS призначений для доступу до мережевої файлової системи. Дозволяє отримати доступ до файлів на віддалених машинах.

source: YaST2 - Network Information Services (NIS, YP) Configuration
ca: YaST2 - Configuració dels serveis d'informació de xarxa (NIS, YP)
de: YaST2 - Konfiguration des Network Information Services (NIS,YP)
fi: YaST2 - Verkon tietopalveluiden (NIS, YP) määritys
it: YaST2 - configurazione dei servizi di informazione di rete (NIS, YP)
uk: YaST2 - Налаштування мережевих інформаційних служб (NIS, YP)

source: The YaST2 component for NIS configuration. NIS is a service similar to yellow pages.
ca: El component YaST2 per a la configuració NIS. NIS és un servei similar a les pàgines grogues.
de: Die YaST2-Komponente zur NIS-Konfiguration. NIS ist ein Dienst ähnlich wie Yellow Pages.
fi: NIS-kokoonpanon YaST2-komponentti. NIS on keltaisia sivuja muistuttava palvelu.
it: Il componente YaST2 per la configurazione di NIS. NIS è un servizio simile a yellow pages.
uk: Компонент YaST2 для налаштування NIS. NIS - це служба схожа на жовті сторінки.

source: YaST2 - Network Information Services (NIS) Server Configuration
ca: YaST2 - Configuració del servidor de serveis d'informació de xarxa (NIS)
de: YaST2 - Server-Konfiguration des Network Information Services (NIS)
fi: YaST2 - Verkon tietopalvelupalvelimen (NIS) määritys
it: YaST2 - configurazione del server NIS (servizi di informazione di rete)
uk: YaST2 - Налаштування сервера мережевих інформаційних служб (NIS)

source: The YaST2 component for NIS server configuration. NIS is a service similar to yellow pages.
ca: El component YaST2 per a la configuració del servidor NIS. NIS és un servei similar a les pàgines grogues.
de: Die YaST2-Komponente für die NIS-Server Konfiguration. Mit diesem Modul wird ein NIS (Network Information Service) eingerichtet, der eine zentrale Benutzerverwaltung erlaubt.
fi: YaST2-komponentti NIS-palvelimen määrityksille. NIS on keltaisia sivuja muistuttava palvelu.
it: Il componente YaST2 per la configurazione del server NIS. NIS è un servizio simile a yellow pages.
uk: Компонент YaST2 для налаштування сервера NIS. NIS - це служба, схожа на жовті сторінки.

source: YaST2 - NTP Client Configuration
ca: YaST2 - Configuració del client NTP
de: YaST2 - NTP-Client-Konfiguration
fi: YaST2 - NTP-asiakkaan määritys
it: YaST2 - configurazione del client NTP
uk: YaST2 - Налаштування клієнта NTP

source: This package contains the YaST2 component for NTP client configuration.
ca: Aquest paquet conté el component YaST2 per a la configuració del client NTP.
de: Dieses Paket enthält die YaST2-Komponente zur NTP-Client-Konfiguration.
fi: Tämä paketti sisältää YaST2-osan NTP-asiakkaan määrittämiseen.
it: Questo pacchetto contiene il componente YaST2 per la configurazione di client NTP.
uk: Цей пакунок містить компонент YaST2 для налаштування клієнта NTP.

source: YaST2 - Online Update (YOU)
ca: YaST2 - Actualització en línia (VOSTÈ)
de: YaST2 - Online Update (YOU) Aktualisierungsprogramm
fi: YaST2 - Verkkopäivitys (YOU)
it: YaST2 - Aggiornamento in linea (YOU)
uk: YaST2 - Мережеве оновлення (YOU)

source: YaST Online Update (YOU) provides a convenient way to download and install security and other system updates. By default it uses the official SUSE mirrors as the update sources, but it can also use local patch repositories or patch CDs. This package provides the graphical user interface for YOU which can be used with or without the X Window System. It can be started from the YaST control center.
ca: YaST Online Update (YOU) proporciona una manera còmoda de descarregar i instal·lar actualitzacions de seguretat i altres actualitzacions del sistema. Per defecte utilitza les rèpliques SUSE oficials com a fonts d'actualització, però també pot utilitzar repositoris de patch locals o CD de patch. Aquest paquet proporciona la interfície gràfica d'usuari per a YOU que es pot utilitzar amb o sense el sistema de finestres X. Es pot començar des del centre de control YaST.
de: Das YaST Online Update (YOU) Aktualisierungsprogramm bietet eine komfortable Möglichkeit für das Herunterladen und die Installation von Sicherheits- und anderen Systemaktualisierungen. Standardmäßig werden als Quelle für die Aktualisierungen die gespiegelten offiziellen SuSE-Archive benutzt; es können aber auch lokale Patch-Repositories oder Patch-CDs benutzt werden. Dieses Paket enthält eine grafische Benutzerschnittstelle für YOU, die mit oder ohne X-Window-System lauffähig ist. Es kann aus dem YaST-Kontrollzentrum heraus gestartet werden.
fi: YaST verkkopäivitys (YOU) tarjoaa kätevän tavan ladata ja asentaa tietoturva- ja muita järjestelmäpäivityksiä. Oletuksena se käyttää virallisia SUSE peilipalvelimia päivityslähteinä, mutta se voi myös käyttää paikallisia arkistoja korjauksiin tai CD-levyjä. Tämä paketti tarjoaa graafisen käyttöliittymän YOU:lle, jota voidaan käyttää X Window ikkunoinnin kanssa tai ilman. Se voidaan käynnistää YaST-ohjauspaneelista.
it: L'aggiornamento in linea di YaST (detto anche YOU, YaST Online Update) fornisce un modo pratico di scaricare e installare aggiornamenti di sicurezza o di altra fattispecie. Per impostazione predefinita usa i mirror ufficiali di SUSE come risorse per gli aggiornamenti, ma può usare anche repository locali o CD per la correzione dei problemi. Questo pacchetto fornisce l'interfaccia grafica per YOU che può essere utilizzata con o senza X Window System. Può essere avviato dal centro di controllo di YaST.
uk: YaST Online Update (YOU) забезпечує зручний спосіб завантаження та встановлення оновлень безпеки та інших системних оновлень. Типово, в якості джерел оновлення використовуються офіційні дзеркала SUSE, але також можна використовувати локальні сховища виправлень або CD-диски із виправленнями. Цей пакунок надає YOU користувацький графічний інтерфейс, який можна використовувати з/без системи X Window. Його можна запустити з центру керування YaST.

source: Configuration of Online Update
ca: Configuració de l'actualització en línia
de: Konfiguration vom Online-Update
fi: Verkkopäivityksen määritykset
it: Configurazione dell'aggiornamento in linea
uk: Налаштування мережевого оновлення

source: Allows to configure automatic online update.
ca: Permet configurar l'actualització automàtica en línia.
de: Erlaubt die Konfiguration automatischer Online-Updates.
fi: Mahdollistaa automaattisen verkkopäivityksen määrittämisen.
it: Permette di configurare gli aggiornamenti in linea automatici.
uk: Дозволяє налаштувати автоматичне мережеве оновлення.

source: Desktop files for YaST2 online update
ca: Fitxers d'escriptori per a l'actualització en línia del YaST2
de: Desktop-Dateien für YaST2 Online Update
fi: Työpöydän tiedostojen YaST2 verkkopäivitys
it: File desktop per l'aggiornamento in linea di YaST
uk: Стільничні файли для мережевого модуля оновлення YaST2

source: YaST2 - Package Library
ca: YaST2 - Biblioteca de paquets
de: YaST2 - Paketbibliothek
fi: YaST2 - Pakettikirjasto
it: YaST2 - libreria dei pacchetti
uk: YaST2 — Бібліотека пакунків

source: This package contains the libraries and modules for software management.
ca: Aquest paquet conté les biblioteques i mòduls per a la gestió de programari.
de: Dieses Paket beinhaltet die Bibliotheken und Module zur Softwareverwaltung.
fi: Tämä paketti sisältää kirjastot ja moduulit ohjelmiston hallintaan.
it: Questo pacchetto contiene le librerie e i moduli per la gestione dei programmi.
uk: Цей пакунок містить бібліотеки та модулі для управління програмним забезпеченням.

source: YaST2 - PAM Agent
ca: YaST2 - Agent PAM
fi: YaST2 – PAM-agentti
it: YaST2 - agente PAM
uk: YaST2 — PAM-агент

source: This agent is used by YaST2 to modify the PAM configuration files
ca: Aquest agent és utilitzat per YaST2 per a modificar els fitxers de configuració del PAM
de: Dieser Agent wird von YaST2 benutzt um PAM Konfigurationsdateien zu modifizieren
fi: YaST2 käyttää tätä agenttia muokatakseen PAM-määritystiedostoja
it: Questo agente viene usato da YaST2 per modificare i file di configurazione di PAM
uk: Цей агент використовується YaST2 для внесення змін в конфігураційні файли PAM

source: YaST2 - Perl Bindings
ca: YaST2 - Vinculacions perl
fi: YaST2 – Perl-sidokset
it: YaST2 - binding Perl
uk: YaST2 — Прив'язки до Perl

source: This adds an embedded Perl interpreter to YaST2 as a plug-in (in other words it will be loaded only if required). This is a very efficient way of calling Perl from within YaST2 YCP scripts.
ca: Això afegeix un intèrpret de Perl incrustat al YaST2 com a connector (en altres paraules, només es carregarà si es requereix). Aquesta és una manera molt eficient de cridar Perl des de dins dels scripts YCP de YaST2.
de: Hiermit wird ein eingebetteter Perl-Interpreter für YaST2 als Plugin (d.h., er wird nur bei Bedarf geladen) zur Verfügung gestellt. Damit wird der Aufruf von Perl aus YaST2-YCP-Skripte sehr effizient.
fi: Tämä lisää upotetun Perl-tulkin YaST2:een laajennuksena (toisin sanoen se ladataan vain tarvittaessa). Tämä on erittäin tehokas tapa kutsua Perl-palvelua YaST2 YCP -komennoilla.
it: Questo aggiunge un interprete Perl a YaST2 come plugin (in altre parole verrà caricato solo se richiesto). Questo è un modo veramente efficiente di chiamare Perl da dentro gli script YCP di YaST2.
uk: Додає до YaST2 модуль інтерпретатора Perl (іншими словами, він буде завантажуватися лише за необхідності). Це надзвичайно ефективний спосіб виклику Perl з YCP-скриптів YaST2.

source: YaST2 - Package Manager Access
ca: YaST2 - Accés al gestor de paquets
de: YaST2 - Zugang zur Paketverwaltung
fi: YaST2 – Paketinhallinnan käyttö
it: YaST2 - accesso al gestore dei pacchetti
uk: YaST2 - Доступ до менеджера пакунків

source: This package contains a name space for accessing the package manager library in YaST2.
ca: Aquest paquet conté un espai de nom per a accedir a la biblioteca del gestor de paquets al YaST2.
de: Dieses Paket enthält den Namensraum um den Zugriff auf die Paketmanager-Bibliothek in YasST2 zu erhalten.
fi: Tämä paketti sisältää nimiavaruuden YaST2:n paketinhallintakirjastoon pääsemiseksi.
it: Questo pacchetto contiene uno spazio dei nomi per accedere alla libreria del gestore dei pacchetti in YaST2.
uk: Цей пакунок містить простір імен для доступу до бібліотеки менеджеру пакунків у YaST2.

source: YaST2 - Documentation for yast2-pkg-bindings package
ca: YaST2 - Documentació per al paquet yast2-pkg-bindings
de: YaST2 - Dokumentation für das Paket yast2-pkg-bindings
fi: YaST2 – yast2-pkg-bindings-paketin ohjeet
it: YaST2 - documentazione per il pacchetto yast2-pkg-bindings
uk: YaST2 - Документація пакунку yast2-pkg-bindings

source: This documenation package describes the package manager API (Pkg:: namespace) used in YaST scripts. The documentation is autogenerated from the pkg-bindings sources.
ca: Aquest paquet de documenació descriu l'API del gestor de paquets (Pkg:: espai de noms) utilitzada en scripts YaST. La documentació es genera automàticament a partir de les fonts d'enllaços de pkg.
de: Dieses Dokumentationspaket beschreibt die Paket-Manager-API (Pkg:: namespace), die in YaST-Skripten verwendet wird. Die Dokumentation ist automatisch von den pkg-bindings-Quellen generiert worden.
fi: Tämä ohjeistus kuvaa YaST-komennoissa käytettyä paketinhallinta-APIn (Pkg:: namespace). Ohjeet luodaan automaattisesti pkg-bindingsin lähteistä.
it: Questo pacchetto di documentazione descrive l'API del gestore dei pacchetti (Pkg:: namespace) usata negli script di YaST. La documentazione è generata automaticamente a partire dai sorgenti di pkg-bindings.
uk: Цей пакет документації описує API менеджера пакунків (Pkg:: namespace), який використовується в сценаріях YaST. Документація генерується автоматично із джерельного кода pkg-bindings.

source: YaST2 - Printer Configuration
ca: YaST2 - Configuració de la impressora
de: YaST2 - Druckerkonfiguration
fi: YaST2 – Tulostinasetus
it: YaST2 - configurazione della stampante
uk: YaST2 — Налаштування друку

source: This package contains the YaST2 component for printer configuration.
ca: Aquest paquet conté el component YaST2 per a la configuració de la impressora.
de: Dieses Paket enthält die YaST2 Komponente zur Druckerkonfiguration.
fi: Tässä paketissa on YaST2-osa tulostimen asettamiseen.
it: Questo pacchetto contiene il componente YaST2 per la configurazione della stampante.
uk: Цей пакунок містить компоненти YaST2 для налаштування друку.

source: YaST2 - Proxy Configuration
ca: YaST2 - Configuració del servidor intermediari
de: YaST2 - Proxy-Konfiguration
fi: YaST2 – Välityspalvelinasetus
it: YaST2 - configurazione proxy
uk: YaST2 — Налаштування проксі

source: This package contains the YaST2 component for proxy configuration.
ca: Aquest paquet conté el component YaST2 per a la configuració del servidor intermediari.
de: Dieses Paket enthält die YaST2-Komponente zur Proxy-Konfiguration.
fi: Tämä paketti sisältää YaST2 komponentin välityspalvelimen määrityksiä varten.
it: Questo pacchetto contiene il componente YaST2 per la configurazione del proxy.
uk: Цей пакунок містить компонент YaST2 для налаштування проксі.

source: Python3 bindings for the YaST platform
ca: Vinculacions Python3 per a la plataforma YaST
de: Python3-Bindings für die YaST-Plattform
fi: YaST-alustan Python3-sidokset
it: Binding Python3 per la piattaforma YaST
uk: Прив'язки Python3 для платформи YaST

source: The bindings allow YaST modules to be written using the Python language and also Python scripts can use YaST agents, APIs and modules.
ca: Les vinculacions permeten que els mòduls del YaST s'escriguin utilitzant el llenguatge Python i també els scripts del Python poden utilitzar agents del YaST, APIs i mòduls.
de: Die Bindings erlauben die Erstellung von YaST-Modulen in der Sprache Python, und dass Python Skripte YaST-Agenten, APIs und Module verwenden.
fi: Sidokset mahdollistavat YaST-moduulien kirjoittamisen Python-kielellä sekä Python-skriptien käyttävän YaST-agenttia, -APIa ja -moduuleja.
it: I binding permettono ai moduli YaST di essere scritti nel linguaggio Python e anche gli script Python possono usare gli agenti, le API e i moduli di YaST.
uk: Прив'язки дозволяють писати модулі YaST на мові Python, а також використовувати в скриптах на Python агенти, API і модулі YaST.

source: Setup Remote Desktop Protocol service for remote administration
ca: Configura el servei de protocol d'escriptori remot per a l'administració remota
de: Einrichtung des Dienstes Remote Desktop Protokoll zur Remote-Administration
fi: Asenna etähallintaa varten RDP-palvelu
it: Imposta il servizio Remote Desktop Protocol (protocollo per desktop remoto) per l'amministrazione remota
uk: Налаштування служби протоколу віддаленої стільниці для віддаленого адміністрування

source: Configure RDP (remote desktop protocol) daemon to allow remote system administration.
ca: Configureu el dimoni RDP (remote desktop protocol) per a permetre l'administració remota del sistema.
de: Konfiguration vom RDP (Remote Desktop Protokoll) Daemon um Remote-Systemadministration zu erlauben.
fi: Määritä RDP-taustapalvelu sallimaan järjestelmän etähallinta.
it: Configura il demone RDP (protocollo di desktop remoto) per consentire l'amministrazione remota del sistema.
uk: Налаштовує службу RDP (протокол віддаленої стільниці) для віддаленого адміністрування системи.

source: YaST2 - Rear - Relax and Recover
ca: YaST2 - Posterior - Relax i recuperació
fi: YaST2 – Rear – Rentoudu ja palauta
uk: YaST2 - Rear - відпочивайте та відновлюйте (Relax and Recover)

source: The YaST2 component for configuring Rear - Relax and Recover Backup
ca: El component YaST2 per configurar Rear - Relax i Recuperar Backup
de: Die YaST2-Komponente zur Konfiguration von Rear - Relax and Recover Backup
fi: YaST2 komponentti taustaosan määritykseen - Relax and Recover Backup
it: Il componente YaST2 per configurare Rear - Relax and Recover Backup
uk: Компонент YaST2 для налаштування Rear - Relax та Recover Backup

source: YaST2 - Registration Module
ca: YaST2 - Mòdul de registre
de: YaST2 - Registrierungsmodul
fi: YaST2 – Rekisteröintimoduuli
it: YaST2 - modulo di registrazione
uk: YaST2 - модуль реєстрації

source: The registration module to register products and/or to fetch an update source (mirror) automatically.
ca: El mòdul de registre per registrar productes i/o per obtenir automàticament una font d'actualització (mirall).
de: Das Registrierungsmodul zur Registrierung von Produkten und/oder zum automatischen Abruf einer Update-Quelle (Mirror).
fi: Rekisteröintimoduuli, jolla rekisteröidään tuotteet ja/tai haetaan päivityslähde (peilipalvelin) automaattisesti.
it: Il modulo di registrazione per registrare i prodotti e/o recuperare una fonte di aggiornamento (mirror) automaticamente.
uk: Модуль реєстрації для реєстрації продуктів та/або для автоматичного отримання джерела оновлення (дзеркала).

source: YaST2 - IPL loader
ca: YaST2 - Carregador IPL
fi: YaST2 – IPL-latain
uk: YaST2 - IPL завантажувач

source: Module for loading IPL from running system on S/390
ca: Mòdul per carregar IPL des del sistema en execució a S/390
fi: Moduuli IPL:n lataamiseksi käynnissä olevasta järjestelmästä S/390:ssä
uk: Модуль для завантаження IPL із запущеної системи S/390

source: YaST2 - Module to configure RMT
ca: YaST2 - Mòdul per configurar RMT
de: YaST2 - Modul zur Konfiguration von RMT
fi: YaST2 – RMT-asetusmoduuli
it: YaST2 - Modulo per configurare RMT
uk: YaST2 - Модуль для налаштування RMT

source: Provides the YaST module to configure the Repository Mirroring Tool (RMT) Server.
ca: Proporciona el mòdul YaST per a configurar el servidor de l'eina de rèplica del repositori (RMT).
de: Bietet das YaST-Modul zur Konfiguration des Repository Mirroring Tool (RMT) Servers.
fi: Tarjoaa YaST-moduulin RMT-palvelimen (Repository Mirroring Tool) määrittämiseen.
it: Fornisce il modulo YaST per la configurazione di un server Repository Mirroring Tool (RMT).
uk: Надає модуль YaST для налаштування сервера Repository Mirroring Tool (RMT).

source: Ruby bindings for the YaST platform
ca: Vinculacions Ruby per a la plataforma YaST
de: Ruby-Bindings für die YaST-Plattform
fi: Ruby-sidokset YaST-alustalle
it: Binding Ruby per la piattaforma YaST
uk: Прив'язки Ruby для платформи YaST

source: The bindings allow YaST modules to be written using the Ruby language and also Ruby scripts can use YaST agents, APIs and modules.
ca: Les vinculacions permeten que els mòduls YaST s'escriguin utilitzant el llenguatge Ruby i també els scripts de Ruby poden utilitzar agents YaST, APIs i mòduls.
de: Die Bindings erlauben die Erstellung von YaST-Modulen in der Sprache Ruby, und dass Ruby Skripte YaST-Agenten, APIs und Module verwenden.
fi: Sidokset mahdollistavat YaST-moduulien kirjoittamisen Ruby-kielellä ja Ruby-komentojen voivan käyttää YaST-agentteja, -APIa ja -moduuleja.
it: I binding permettono ai moduli YaST di essere scritti nel linguaggio Ruby e anche gli script Ruby possono usare gli agenti, le API e i moduli di YaST.
uk: Прив'язки дозволяють YaST модулям бути записаним за допомогою мови Ruby. Крім того, скрипти Ruby можуть використовувати агенти, API і модулі YaST.

source: YaST2 - S/390 Specific Features Configuration
ca: YaST2 - Configuració de característiques específiques S/390
fi: YaST2 – S/390-kohtaisten ominaisuuksien asetus
uk: YaST2 - S/390 Конфігурація особливих можливостей

source: This package contains the YaST component for configuration of S/390-specific features.
ca: Aquest paquet conté el component YaST per a la configuració de les característiques específiques de S/390.
fi: Tämä paketti sisältää YaST-komponentin S/390-kohtaisten asetusten määritykseen.
uk: Цей пакунок містить компонент YaST для налаштування особливих можливостей S/390.

source: YaST2 - Samba Client Configuration
ca: YaST2 - Configuració del client de Samba
de: YaST2 - Samba-Client-Konfiguration
fi: YaST2 – Samba-asiakasasetus
it: YaST2 - configurazione del client Samba
uk: YaST2 - Налаштування клієнта Samba

source: This package contains the YaST2 component for configuration of an SMB workgroup/domain and authentication against an SMB domain.
ca: Aquest paquet conté el component YaST2 per a la configuració d'un grup de treball/domini SMB i l'autenticació contra un domini SMB.
de: Dieses Paket enthält die YaST2-Komponente zur Konfiguration einer SMB-Workgroup/Domain und Authentifizierung gegenüber einer SMB-Domain.
fi: Tämä paketti sisältää YaST2-osan SMB-työryhmän tai -toimialueen määrittämiseen ja SMB-verkkotunnustodennukseen.
it: Questo pacchetto contiene il componente YaST2 per la configurazione di un dominio/gruppo di lavoro SMB e l'autenticazione verso un dominio SMB.
uk: Цей пакунок містить компонент YaST2 для налаштування робочої групи/домену SMB і аутентифікації в домені SMB.

source: YaST2 - Samba AD DC provision
ca: YaST2 - Disposició Samba AD DC
de: YaST2 - Samba AD DC Bereitstellung
fi: YaST2 – Samban AD DC -säännöt
it: YaST2 - messa a punto di un Samba AD DC
uk: YaST2 - Налаштування контроллера AD-домену Samba

source: This package contains the YaST2 component to configure samba as an Active Directory (TM) Domain Controller.
ca: Aquest paquet conté el component YaST2 per configurar samba com a controlador de domini Active Directory (TM).
de: Dieses Paket enthält die YaST2 Komponente um samba als Active Directory (TM) Domain Controller zu konfigurieren.
fi: Tämä paketti sisältää YaST2-osan, jonka avulla Samban voi määrittää Active Directory™ -toimialueohjaimeksi.
it: Questo pacchetto contiene il componente YaST2 per la configurazione di samba come Active Directory (TM) Domain Controller.
uk: Цей пакунок містить компонент YaST2 для налаштування samba як контролера домену Active Directory (TM).

source: YaST2 - Samba Server Configuration
ca: YaST2 - Configuració del servidor Samba
de: YaST2 - Konfiguration des Samba Servers
fi: YaST2 – Samba-palvelinasetus
it: YaST2 - configurazione del server Samba
uk: YaST2 - Налаштування сервера Samba

source: This package contains the YaST2 component for Samba server configuration.
ca: Aquest paquet conté el component YaST2 per a la configuració del servidor Samba.
de: Dieses Paket enthält die YaST2-Komponente für die Samba-Server-Konfiguration.
fi: Tämä paketti sisältää YaST2-osan Samba-palvelimen määritykseen.
it: Questo pacchetto contiene il componente YaST2 per la configurazione di un server Samba.
uk: Цей пакунок містить компонент YaST2 для налаштування сервера Samba.
