Repository: openSUSE/packages-i18n
Catalog: */po/yast2.*.po
Languages: ca, de, fi, it, uk

source: YaST2 Main Package
ca: Paquet principal del YaST2
de: YaST2 - Hauptpaket
fi: YaST2 pääpaketti
it: YaST2 - pacchetto principale
uk: Основний пакунок YaST2

source: This package contains scripts and data needed for SUSE Linux installation with YaST2
ca: Aquest paquet conté scripts i dades necessàries per a la instal·lació de SUSE Linux amb YaST2
de: Dieses Paket beinhaltet Skripte und Daten, die für die Installation von SUSE Linux mit YaST2 notwendig sind
fi: Paketti sisältää skriptejä ja tietoja, joita tarvitaan YaST2:n SUSE Linux -asennuksiin
it: Questo pacchetto contiene gli script e i dati necessari per l'installazione di SUSE Linux con YaST2
uk: Цей пакунок містить сценарії і дані, необхідні для установки SUSE Linux в YaST2

source: Common code for the yast python ad modules
ca: Codi comú per als mòduls d'anuncis yast python
de: Gemeinsamer Code für die yast python ad Module
fi: Yast- ja python-moduulien yhteinen koodi
uk: Загальний код для модулів yast python ad

source: Common code shared by the yast2-aduc, yast2-adsi, and yast2-gpmc modules.
ca: Codi comú compartit pels mòduls yast2-aduc, yast2-adsi i yast2-gpmc.
de: Gemeinsamer Code, der von den yast2-aduc, yast2-adsi und yast2-gpmc Modulen geteilt wird.
fi: Yast2-aduc-, yast2-adsi- ja yast2-gpmc -moduulien yhteinen koodi.
uk: Загальний код, який спільно використовують модулі yast2-aduc, yast2-adsi та yast2-gpmc.

source: YaST2 - Add-On media installation code
ca: YaST2 - Codi d'instal·lació multimèdia de complements
de: YaST2 - Add-On Medien-Installationscode
fi: YaST2 - Lisätietovälineen asennuskoodi
it: YaST2 - codice di installazione dei supporti dei componenti aggiuntivi
uk: YaST2 - Код встановлення носіїв з доповненнями

source: This package contains YaST Add-On media installation code.
ca: Aquest paquet conté el codi d'instal·lació multimèdia YaST Add-On.
de: Dieses Paket enthält YaST Add-On Medien-Installationscode.
fi: Tämä paketti sisältää YaSTin lisätietovälineen asennuskoodin.
it: Questo pacchetto contiene il codice di installazione dei supporti dei componenti aggiuntivi.
uk: Цей пакунок містить код встановлення носіїв з доповненнями для YaST.

source: Active Directory Compatible Service Interfaces Editor
ca: Editor d'interfícies de serveis compatibles amb el directori actiu
fi: Active Directory -yhteensopivien palveluliittymien editori
uk: Редактор сервісних інтерфейсів, сумісний з Active Directory

source: The ADSI Edit for YaST module provides tools for viewing and modifying an LDAP tree.
ca: El mòdul d'edició ADSI per a YaST proporciona eines per veure i modificar un arbre LDAP.
de: Das ADSI Edit für YaST Modul bietet Werkzeuge zum Betrachen und Ändern eines LDAP-Baums.
fi: ADSI Edit for YaST -moduuli tarjoaa työkaluja LDAP-puun tarkastelemiseen ja muokkaamiseen.
uk: ADSI Edit для модуля YaST надає інструменти для перегляду та зміни дерева LDAP.

source: Active Directory Users and Computers for YaST
ca: Usuaris i ordinadors de directori actiu per al YaST
de: Active Directory Benutzer und Rechner für YaST
fi: Toimialueen (AD) -käyttäjät ja tietokoneet YaST:lle
uk: Користувачі та комп’ютери Active Directory для YaST

source: The Active Directory Users and Computers for YaST module provides tools for creating and modifying Users, Groups, and Computer objects in Active Directory.
ca: El mòdul Active Directory Users and Computers for YaST proporciona eines per crear i modificar els usuaris, grups i objectes d'ordinador en Active Directory.
de: Das Modul Active Directory Benutzer und Rechner für YaST bietet Werkzeuge zur Erstellung und Änderung von Benutzern, Gruppen und Rechner-Objekten in Active Directory.
fi: YaST-moduulin toimialueen käyttäjät ja tietokoneet -työkalu tarjoaa välineitä käyttäjien, ryhmien ja tietokoneobjektien luomiseen ja muokkaamiseen toimialueella (AD).
uk: Модуль Користувачі та комп’ютери Active Directory для YaST надає інструменти для створення та зміни об’єктів користувачів, груп та комп’ютерів у Active Directory.

source: YaST2 - Manage Update-alternatives switching
ca: YaST2 - Gestiona la commutació d'actualitzacions-alternatives
de: YaST2 - Verwaltung von Wechseln zwischen Aktualisierungs-Alternativen
fi: YaST2 - Hallitsee päivitysvaihtoehtojen vaihtoa
it: YaST2 - gestione delle preferenze di update-alternatives
uk: YaST2 - Управління перемиканням альтернативних оновлень

source: A YaST2 module to manage update alternatives switching
ca: Un mòdul YaST2 per gestionar la commutació d'alternatives d'actualització
de: Ein YaST2-Modul zur Verwaltung von Wechseln zwischen Update-Alternativen
fi: YaST2-moduuli päivitysvaihtoehtojen kytkennän hallintaan
it: Un modulo YaST2 per gestire le preferenze di update-alternatives
uk: Модуль YaST2 для управління перемиканням альтернативних оновлень

source: YaST2 - Plugins for AppArmor Profile Management
ca: YaST2 - Connectors per a la gestió del perfil d'AppArmor
de: YaST2 - Plugins für die AppArmor-Profilverwaltung
fi: YaST2 - laajennus AppArmor -profiilien hallintaan
it: YaST2 - plugin per la gestione dei profili AppArmor
uk: YaST2 - Модулі управління профілями AppArmor

source: YaST2 forms and components for the management of AppArmor profiles.
ca: Formes i components YaST2 per a la gestió de perfils AppArmor.
fi: Yast2 lomakkeet ja komponentit AppArmor -profiilien hallintaan.
uk: Форми та компоненти YaST2 для керування профілями AppArmor.

source: YaST2 - Configuration of Linux Auditing (LAF)
ca: YaST2 - Configuració de Linux Auditing (LAF)
de: YaST2 - Konfiguration von Linux Auditing (LAF)
fi: YaST2 Linux-tilin tarkastuksen määritys (LAF)
it: YaST2 - configurazione di Linux Auditing (LAF)
uk: YaST2 — Налаштування аудиту Linux (LAF)

source: This module allows the configuration of the audit daemon as well as to add rules for the audit subsystem.
ca: Aquest mòdul permet la configuració del dimoni d'auditoria, així com afegir regles per al subsistema d'auditoria.
de: Dieses Modul erlaubt die Konfiguration des Audit-Daemons ebenso wie das Hinzufügen von Regeln für das Audit-Subsystem.
fi: Tämä moduuli mahdollistaa auditointi järjestelmän määrittämisen sekä lisää sääntöjä auditointi-alijärjestelmään.
it: Questo modulo consente la configurazione del demone audit così come l'aggiunta di regole per il sottosistema di audit.
uk: Цей модуль дозволяє вам налаштовувати фонову службу аудиту, а також додавати правила в підсистему аудиту.

source: YaST2 - Centralised System Authentication Configuration
ca: YaST2 - Configuració centralitzada d'autenticació del sistema
de: YaST2 - Zentralisierte Konfiguration der System-Authentifizierung
fi: YaST2 - Keskitetty järjestelmän todennuksen määritys
it: YaST2 - configurazione dell'autenticazione centralizzata del sistema
uk: YaST2 - Налаштування централізованого системного розпізнавання

source: With this YaST2 module you may configure centralised system authentication, on a single or multipe network domains.
ca: Amb aquest mòdul YaST2 podreu configurar l'autenticació centralitzada del sistema, en un únic domini de xarxa o multipe.
de: Mit diesem YaST2 Modul können sie eine zentralisierte System-Authentifizierung konfigurieren, auf einer einzigen oder mehreren Netzwerk-Domains.
fi: Tällä YaST2 moduulilla voit määrittää keskitetyn järjestelmän todennuksen yhdelle tai useammalle verkkotunnukselle.
it: Con questo modulo di YaST2 può essere configurata l'autenticazione centralizzata del sistema, su domini di rete singoli o multipli.
uk: У цьому модулі YaST2 ви можете налаштувати централізоване розпізнавання на одному або декількох мережевих доменах.

source: A tool for creating identity management server instances
ca: Una eina per a crear instàncies del servidor de gestió d'identitats
de: Ein Werkzeug zum Erstellen von Identitätsmanagement-Serverinstanzen
fi: Työkalu luomaan identiteetit hallintapalvelimen esimerkein
it: Uno strumento per creare istanze di un server di gestione delle identità
uk: Інструмент для створення екземплярів сервера керування ідентифікацією

source: The program assists system administrators to create new directory server and Kerberos server instances that help to maintain centralised user identity database for a network.
ca: El programa ajuda als administradors del sistema a crear nous servidors de directoris i instàncies de servidor Kerberos que ajuden a mantenir una base de dades d'identitat d'usuari centralitzada per a una xarxa.
de: Das Programm unterstützt Systemadministratoren bei der Erstellung neuer Verzeichnis-Server und Kerberos-Server-Instanzen, die helfen zentrale Benutzeridentitäts-Datenbanken für ein Netzwerk zu pflegen.
fi: Ohjelma auttaa järjestelmänvalvojia luomaan uusia hakemisto- ja Kerberos-palvelimia esimerkein, jotka auttavat ylläpitämään keskitetyjä henkilötietokantaa verkolle.
it: Il programma assiste gli amministratori di sistema per creare istanze di un nuovo directory server e di un server Kerberos che aiutano a mantenere un database centralizzato di identità utente per una rete.
uk: Застосунок допомагає системним адміністраторам створювати новий сервер директорій та екземпляри сервера Kerberos, які допомагають підтримувати централізовану базу даних ідентифікаційних даних користувачів для мережі.

source: YaST2 - Network Booting and Wake-On-Lan Configuration
ca: YaST2 - Configuració d'arrencada i desactivació en cadena
de: YaST2 - Netzwerk-Booten und Wake-on-LAN-Konfiguration
fi: YaST2 - Verkon käynnistys ja Wake-On-Lan määritykset
it: YaST2 - configurazione del boot da rete e del Wake-on-LAN
uk: YaST2 - налаштування завантаження через мережу та Wake-On-Lan

source: YaST2 module for network booting and Wake-On-Lan.
ca: Mòdul YaST2 per a l'arrencada en xarxa i Wake-On-Lan.
de: YaST2-Modul zum Netzwerk-Booten und Wake-On-LAN.
fi: YaST2 moduuli verkon yli käynnistämistä varten, eli Wake-On-Lan -toiminnolle.
it: Modulo YaST2 per il boot da rete e del Wake-on-LAN.
uk: Модуль YaST2 для завантаження через мережу та Wake-On-Lan.

source: YaST2 - Bootloader Configuration
ca: YaST2 - Configuració del carregador d'arrencada
de: YaST2 - Bootloader-Konfiguration
fi: YaST2 - Käynnistyslataimen määritys
it: YaST2 - configurazione del boot loader
uk: YaST2 — Конфігурація завантажувача

source: This package contains the YaST2 component for bootloader configuration.
ca: Aquest paquet conté el component YaST2 per a la configuració del carregador d'arrencada.
de: Dieses Paket enthält die YaST2-Komponente zur Konfiguration des Bootloaders.
fi: Tämä paketti sisältää YaST2 komponentin käynnistyslataimen määrittämiseen.
it: Questo pacchetto contiene il componente YaST2 per la configurazione del bootloader.
uk: Цей пакунок містить компонент YaST2 для установки завантажувача.

source: Minimal set of tools needed to build yast module
ca: Conjunt mínim d'eines necessàries per a construir el mòdul yast
de: Minimaler Werkzeugsatz benötigt zum Bau des Yast-Moduls
fi: YaST-moduulin koostamiseen tarvittavat vähimmäistyökalut
it: Insieme minimo di strumenti necessari per generare moduli yast
uk: Мінімальний набір інструментів для складання модулів yast

source: Scripts and templates required for rebuilding the existing YaST2 modules and components (both ruby and C++).
ca: Scripts i plantilles necessaris per a reconstruir els mòduls i components YaST2 existents (tant ruby com C++).
de: Skripte und Vorlagen werden zum Neubau von existierenden YaST2-Modulen und -Komponenten (beides Ruby und C++) benötigt.
fi: Skriptit ja mallit, joita tarvitaan nykyisten YaST2 moduulien ja komponenttien (sekä Ruby ja C++) jälleenrakentamiseen.
it: Script e modelli richiesti per rigenerare i moduli e i componenti YaST2 esistenti (sia ruby che C++).
uk: Скрипти і шаблони, необхідні для повторного збирання наявних модулів і компонентів YaST2 (на ruby та на C++).

source: YaST2 - CaaSP Module
ca: YaST2 - Mòdul CaaSP
de: YaST2 - CaaSP-Modul
fi: YaST2 – CaaSP-osa
it: YaST2 - modulo CaaSP
uk: YaST2 - модуль CaaSP

source: Containers as a Service Platform (CaaSP) and openSUSE Kubic specific module.
ca: Contenidors com a Plataforma de Servei (CaaSP) i mòdul específic openSUSE Kubic.
de: Spezifisches Modul für die Containers as a Service Plattform (CaaSP) und openSUSE Kubic.
fi: CaaSP (Containers as a Service Platform) ja openSUSEn Kubic-spesifi osa.
it: Modulo specifico per Containers as a Service Platform (CaaSP) e per openSUSE Kubic.
uk: Контейнери як сервісна платформа (CaaSP) та спеціальний модуль openSUSE Kubic.

source: YaST2 - IO Channel management
ca: YaST2 - Gestió del canal IO
fi: YaST2 – IO-kanavanhallinta
uk: YaST2 - керування каналами IO

source: Provides interface for blacklisting and unblocking IO channels
ca: Proporciona interfície per a llista negra i desbloqueig de canals d'E/S
fi: Tarjoaa käyttöliittymän IO-kanavien estämiseen ja eston purkamiseen
uk: Забезпечує інтерфейс для внесення в чорний список та розблокування каналів введення-виведення

source: Configuration of cluster
ca: Configuració del clúster
de: Konfiguration eines Clusters
fi: Klusterin määritys
it: Configurazione di cluster
uk: Налаштування кластера

source: YaST2 - YaST Configuration Management
ca: YaST2 - Gestió de la configuració del YaST
de: YaST2 - YaST-Konfigurationsverwaltung
fi: YaST2 - YaST määritysten hallinta
it: YaST2 - gestione di configurazioni di YAST
uk: YaST2 — Управління конфігурацією YaST2

source: This package contains the YaST2 component for Configuration Management Provisioning.
ca: Aquest paquet conté el component YaST2 per a la provisió de gestió de la configuració.
de: Dieses Paket enthält die YaST2-Komponente zum Provisioning der Konfigurationsverwaltung.
fi: Tämä paketti sisältää YaST2 komponentin hallinan määritystä varten.
it: Questo pacchetto contiene il componente YaST2 per la dotazione della gestione di configurazioni.
uk: Цей пакунок містить компонент YaST2 для налаштування управління конфігурацією.

source: YaST2 - Control Center
ca: YaST2 - Centre de Control
de: YaST2 - Kontrollzetrum
fi: YaST2 - Ohjauskeskus
it: YaST2 - centro di controllo
uk: YaST2 — Центр керування

source: This package contains the menu selection component for YaST2.
ca: Aquest paquet conté el component de selecció del menú per al YaST2.
de: Dieses Paket enthält die Menüauswahlkomponente für YaST2.
fi: Tämä paketti sisältää YaST2:n valikonvalintaosan.
it: Questo pacchetto contiene il componente di selezione del menu di YaST2.
uk: Цей пакунок містить компонент меню вибору для YaST2.

source: YaST2 - Control Center (Qt Version)
ca: YaST2 - Centre de Control (Versió Qt)
de: YaST2 - Kontrollzentrum (Qt-Version)
fi: YaST2 - Ohjauskeskus (Qt-versio)
it: YaST2 - centro di controllo (versione Qt)
uk: YaST2 — Центр управління (Qt-версія)

source: This package contains the menu selection component for YaST2 using the Qt toolkit.
ca: Aquest paquet conté el component de selecció de menú per al YaST2 utilitzant el joc d'eines de les Qt.
de: Dieses Paket enthält die Menüauswahlkomponente für YaST2, wobei das Qt-Toolkit verwendet wird.
fi: Tämä paketti sisältää YaST2:n valikonvalintaosan Qt-työkalupakilla toteutettuna.
it: Questo pacchetto contiene il componente di selezione del menu per YaST2 usando l'insieme di strumenti Qt.
uk: Цей пакунок містить компонент меню вибору для YaST2 за допомогою набору засобів Qt.

source: YaST2 - Core Libraries
ca: YaST2 - Biblioteques bàsiques
de: YaST2 - Kernbibliotheken
fi: YaST2 - Keskeiset kirjastot
it: YaST2 - librerie principali
uk: YaST2 — Основні бібліотеки

source: This package contains the scanner, parser, and interpreter runtime library for the YCP scripting language used in YaST2.
ca: Aquest paquet conté la biblioteca d'execució de l'escàner, l'analitzador i l'intèrpret per al llenguatge de script YCP utilitzat al YaST2.
de: Dieses Paket enthält den Scanner/Parser und Interpreter für die YCP Skriptsprache von YaST2 als Laufzeitbibliothek.
fi: Tämä paketti sisältää ajonaikaiset tekstin luku-, jäsennys- ja tulkkikirjastot YaST2:ssa käytettyyn YCP-skriptikieleen.
it: Questo pacchetto contiene la libreria di esecuzione di scanner, analizzatore e interprete per il linguaggio di script YCP usato in YaST2.
uk: Цей пакунок містить бібліотеку часу виконання сканера, синтаксичного аналізатора і інтерпретатора для мови скриптів YCP, які використовуються YaST2.

source: This package contains include and documentation files for developing applications using the YaST2 YCP interpreter.
ca: Aquest paquet conté fitxers d'inclusió i documentació per al desenvolupament d'aplicacions utilitzant l'intèrpret YCP YaST2.
de: Dieses Paket enthält Include-Dateien und die Dokumentation für die Entwicklung von Programmen mit Hilfe des YCP-Interpreters von YaST2.
fi: Tämä paketti sisältää sisällys- ja dokumenttitiedostot sovellusten kehittämiseen YaST2 YCP-tulkin avulla.
it: Questo pacchetto contiene i file di inclusione e la documentazione per sviluppare applicazioni che usano l'interprete YCP di YaST2.
uk: Цей пакунок містить документацію і спільні компоненти для розробки додатків з використанням інтерпретатора YaST2 YCP.

source: YaST2 - Country Settings (Language, Keyboard, and Timezone)
ca: YaST2 - Configuració del país (Llengua, teclat i zona horària)
de: YaST2 - länderspezifische Einstellungen (Sprache, Tastatur und Zeitzone)
fi: YaST2 - maakohtaiset asetukset (kieli, näppäimistö ja aikavyöhyke)
it: YaST2 - impostazioni della nazione (lingua, tastiera e fuso orario)
uk: YaST2 - Параметри країни (мова, клавіатура і часові пояси)

source: Country specific data and configuration modules (language, keyboard, timezone) for yast2.
ca: Mòduls de configuració i dades específiques del país (idioma, teclat, zona horària) per al yast2.
de: Module für landesspezifische Einstellungen (Sprache, Tastatur, Zeitzone) für YaST2.
fi: Maakohtaiset data- ja määritysmoduulit (kieli, näppäimistö, aikavyöhyke) yast2:lle.
it: Moduli di dati e configurazioni specifici per la nazione (lingua, tastiera, fuso orario) per yast2.
uk: Модулі налаштування специфічних для країни налаштувань (мова, клавіатура, годинні пояси) для yast2.

source: YaST2 - Data files for Country settings
ca: YaST2 - Fitxers de dades per a la configuració del país
de: YaST2 - Daten-Dateien für Länder-Einstellungen
fi: YaST2 - Maa-asetusten datatiedostot
it: YaST2 - file di dati per le impostazioni della nazione
uk: YaST2 - Файли даних для параметрів країни

source: Data files for yast2-country together with the most often used API functions (Language module)
ca: Fitxers de dades per a yast2-country juntament amb les funcions API més utilitzades (Mòdul d'idioma)
de: Daten-Dateien für yast2-country zusammen mit den meistgenutzten API-Funktionen (Sprach-Module)
fi: Maatietotiedostot yhdessä yleisimmin käytettyjen API-toimintojen kanssa yast2 (kielimoduuli)
it: File di dati per yast2-country insieme con le funzioni API più frequentemente usate (modulo della lingua)
uk: Файли даних для yast2-country разом з найбільш часто використовуваними функціями мовного API (мовний модуль)

source: YaST2 - Development Tools
ca: YaST2 - Eines de desenvolupament
de: YaST2 - Entwicklungswerkzeuge
fi: YaST2 - Kehitystyökalut
it: YaST2 - strumenti di sviluppo
uk: YaST2 - Засоби розробки

source: Scripts and templates for developing YaST2 modules and components.
ca: Scripts i plantilles per al desenvolupament de mòduls i components YaST2.
de: Skripte und Vorlagen zur Entwicklung von YaST2-Modulen und -Komponenten.
fi: Skriptit ja mallit YaST2-moduulien ja -komponenttien kehittämiseen.
it: Script e modelli per sviluppare moduli YaST2 e componenti.
uk: Сценарії і шаблони для розробки модулів і компонентів YaST2.

source: YaST2 - DHCP Server Configuration
ca: YaST2 - Configuració del servidor DHCP
de: YaST2 - Konfiguration des DHCP-Servers
fi: YaST2 - DHCP-palvelimen määritys
it: YaST2 - configurazione del server DHCP
uk: YaST2 — Налаштування сервера DHCP

source: This package contains the YaST2 component for DHCP server configuration.
ca: Aquest paquet conté el component YaST2 per a la configuració del servidor DHCP.
de: Die YaST2-Komponente für die Konfiguration des DHCP-Servers.
fi: Tämä paketti sisältää YaST-osan DHCP-palvelimen määritykseen.
it: Questo pacchetto contiene il componente YaST2 per la configurazione del server DHCP.
uk: Цей пакунок містить компонент YaST2 для налаштування сервера DHCP.

source: Samba Internal DNS Manager
ca: Gestor intern de DNS de Samba
fi: Samba sisäinen DNS-hallinta
uk: Менеджер Samba Internal DNS

source: DNS Manager for the Internal Samba Active Directory Domain Controller DNS server.
ca: Gestor de DNS per al servidor DNS intern Samba Active Directory Controller.
fi: DNS-hallinta sisäisen Samba Active Directory -toimialueohjaimen DNS-palvelimelle.
uk: Менеджер DNS для внутрішнього DNS-сервера контролера домену Samba Active Directory.

source: YaST2 - DNS Server Configuration
ca: YaST2 - Configuració del servidor DNS
de: YaST2 - DNS-Server Konfiguration
fi: YaST2 - DNS-palvelimen määritys
it: YaST2 - configurazione del server DNS
uk: YaST2 — Налаштування сервера DNS

source: This package contains the YaST2 component for DNS server configuration.
ca: Aquest paquet conté el component YaST2 per a la configuració del servidor DNS.
de: Die YaST2-Komponente für die Konfiguration des DNS-Servers.
fi: Tämä paketti sisältää YaST-osan DNS-palvelimen määritykseen.
it: Questo pacchetto contiene il componente YaST2 per la configurazione del server DNS.
uk: Цей пакунок містить компонент YaST2 для налаштування DNS-сервера.

source: YaST2 - GUI for docker management
ca: YaST2 - IGU per a la gestió de l'acoblador
de: YaST2 - GUI zur Verwaltung von docker
fi: YaST2 - GUI docker hallinta
it: YaST2 - interfaccia grafica per la gestione di docker
uk: YaST2 — GUI для управління docker

source: Provides easy to use GUI for running docker containers.
ca: Proporciona una interfície gràfica d'usuari fàcil d'utilitzar per a executar contenidors docker.
de: Bietet eine einfach verwendbare GUI zum laufen von docker-Containern.
fi: Tarjoaa helppokäyttöisen GUI-käyttöliittymän docker-konttien suorittamiseen.
it: Fornisce un'interfaccia grafica facile da usare per gestire i contenitori docker.
uk: Надає простий у використанні GUI для запуску контейнерів docker.

source: YaST2 - DRBD Configuration
ca: YaST2 - Configuració DRBD
de: YaST2 - DRBD-Konfiguration
fi: YaST2 - DRBD-määritys
it: YaST2 - configurazione di DRBD
uk: YaST2 — Налаштування DRBD

source: YaST2 - Configuration of Distributed Replicated Block Devices. With this module you can configure a distributed storage system, frequently used on high availability (HA) clusters.
ca: YaST2 - Configuració de dispositius de blocs distribuïts replicats. Amb aquest mòdul es pot configurar un sistema d'emmagatzematge distribuït, utilitzat freqüentment en clústers d'alta disponibilitat (HA).
de: YaST2 - Konfiguration von Distributed Replicated Block Devices. Mit diesem Modul können Sie ein verteiltes Storage-System konfigurieren, das oft auf Hochverfügbarkeits-Clustern (HA) verwendet wird.
fi: YaST2 - Hajautettujen replikoitujen laitteiden määritys. Tämän moduulin avulla voit määrittää hajautetun tallennus järjestelmän, jota käytetään usein suuren käytettävyyden (HA) klustereissa.
it: YaST2 - configurazione dei dispositivi a blocchi replicati distribuiti. Con questo modulo è possibile configurare un sistema di memorizzazione distribuito, usato frequentemente nei cluster HA, ad alta disponibilità.
uk: YaST2 — Налагодження розподілених копійованих блочних пристроїв (DRBD, Distributed Replicated Block Devices). За допомогою цього модуля ви можете налаштувати розподілену систему зберігання, часто вживану в кластерах високої доступності.
