Repository: openSUSE/packages-i18n
Catalog: */po/yast2.*.po
Languages: ca, de, fi, it, uk

source: YaST2 - Scanner Configuration
ca: YaST2 - Configuració de l'escàner
de: YaST2 - Scanner Konfiguration
fi: YaST2 – Kuvanlukijan asetus
it: YaST2 - configurazione dello scanner
uk: YaST2 — Налаштування сканування

source: This package provides support for the configuration of USB scanners, SCSI scanners, scanners in HP all-in-one devices, and scanning via network (i.e. use a remote scanner via another host in the network). Parallel port scanners and network scanners (i.e. a scanner which is directly accessible in the network) cannot be configured with this tool, except for such scanners in HP all-in-one devices. Usually those devices must be configured manually. For more information see http://www.sane-project.org/ and the documentation in the package "sane-backends".
ca: Aquest paquet proporciona suport per a la configuració d'escàners USB, escàners SCSI, escàners en dispositius HP tot en un, i escàners via xarxa (és a dir, utilitzar un escàner remot a través d'un altre amfitrió de la xarxa). Els escàners de ports paral·lels i els escàners de xarxa (és a dir, un escàner que és directament accessible a la xarxa) no es poden configurar amb aquesta eina, excepte aquests escàners en dispositius HP tot en un. Normalment, aquests dispositius s'han de configurar manualment. Per a més informació consulteu http://www.sane-project.org/ i la documentació al paquet "sane-backends".
de: Dieses Paket enthält die Unterstützung für die Konfiguration von USB-Scannern, SCSI-Scannern, Scannern in HP "all-in-one"-Schnittstellen, und das Scannen über das Netzwerk (d.h. Verwendung eines Remote-Scanners über einen anderen Host im Netzwerk). Parallel-Port-Scanner und Netzwerk-Scanner (d.h. Scanner, auf die man direkt im Netzwerk zugreifen kann) können nicht mit diesem Tool konfiguriert werden, mit Ausnahme von solchen Scannern in HP "all-in-one"-Schnittstellen. Normalerweise müssen solche Schnittstellen manuell konfiguriert werden. Für mehr Informationen siehe http://www.sane-project.org/ und die Dokumentation im Paket "sane-backends".
fi: Tämä paketti tarjoaa tuen USB-, SCSI- ja HP:n all-in-one-laitteiden kuvanlukijoiden ja verkon yli tapahtuvan kuvanluvun (ts. etälaitteen käytön toisen verkon olevan koneen kautta) määritykseen. Rinnakkaisportti- ja verkkokuvanlukijoita (eli suoraan lähiverkossa käytettävissä olevaa kuvanlukijoita) ei tällä työkalulla voi määrittää lukuun ottamatta HP:n all-in-one-laitteissa olevia. Yleensä nämä laitteet on määritettävä käsin. Katso lisätiedot osoitteesta http://www.sane-project.org/ ja paketin ”sane-backends” ohjeista.
it: Questo pacchetto fornisce il supporto per la configurazione di scanner USB e SCSI, nei dispositivi multifunzione HP e la scansione via rete (ad esempio usare uno scanner remoto attraverso un altro host nella rete). Gli scanner su porta parallela e di rete (cioè uno scanner che è accessibile direttamente dalla rete) non possono essere configurati con questo strumento, ad eccezione per quegli scanner nei dispositivi multifunzione HP. Di solito questi dispositivi devono essere configurati manualmente. Per maggiori informazioni si veda http://www.sane-project.org/ e la documentazione nel pacchetto "sane-backends".
uk: Цей пакунок забезпечує підтримку налаштування сканерів USB, SCSI, та пристроїв HP серії „Усе в одному“, а також сканування через мережу (тобто використання віддаленого сканера через інший вузол у мережі). Сканери із паралельного порту та мережеві сканери (тобто сканери, які напряму мають доступ до мережі) не можна налаштувати цим засобом, крім сканерів із серії пристроїв HP „Усе в одному“. Здебільшого ці пристрої можна налаштувати вручну. Докладнішу інформацію можна знайти на http://www.sane-project.org/ та документації у пакунку "sane-backends".

source: YaST2 - AutoYaST Schema
ca: YaST2 - Esquema AutoYaST
fi: YaST2 – AutoYaST-skeema
it: YaST2 - schema AutoYaST
uk: YaST2 — Схема AutoYaST

source: AutoYaST Syntax Schema
ca: Esquema automàtic de sintaxi del YaST
fi: AutoYaST-syntaksiskeema
it: Schema della sintassi di AutoYaST
uk: Схема синтаксису AutoYaST

source: YaST2 - AutoYaST Schema for Micro
ca: YaST2 - Esquema AutoYaST per a Micro
uk: YaST2 — Схема AutoYaST для Micro

source: AutoYaST Syntax Schema for Micro product
ca: Esquema de sintaxi AutoYaST per al producte Micro
uk: Схема синтаксису AutoYaST для продукту Micro

source: YaST2 - Security Configuration
ca: YaST2 - Configuració de seguretat
de: YaST2 - Konfiguration der Systemsicherheit
fi: YaST2 – Tietoturva-asetukset
it: YaST2 - configurazione della sicurezza
uk: YaST2 — Налаштування безпеки

source: The YaST2 component for security settings configuration.
ca: El component YaST2 per a la configuració de la configuració de seguretat.
de: Die YaST2-Komponente für die Konfiguration der Sicherheitseinstellungen.
fi: YaST2-osa tietoturva-asetusten määritykseen.
it: Il componente YaST2 per la configurazione delle impostazioni di sicurezza.
uk: Компонент YaST2 для налаштування параметрів безпеки.

source: YaST2 - Services Manager
ca: YaST2 - Gestor de serveis
de: YaST2 - Dienste Manager
fi: YaST2 – Palveluhallinta
it: YaST2 - gestore dei servizi
uk: YaST2 — Диспетчер служб

source: Provides user interface and libraries to configure systemd services and targets.
ca: Proporciona interfície d'usuari i biblioteques per configurar serveis i objectius del systemd.
de: Bietet eine Benutzeroberfläche und Bibliotheken zur Konfiguration von systemd-Diensten und Targets.
fi: Tarjoaa käyttöliittymän ja kirjastot järjestelmän palveluiden ja kohteiden määrittämiseen.
it: Fornisce interfaccia utente e librerie per configurare i servizi e i target systemd.
uk: Забезпечує інтерфейс користувача та бібліотеки для налаштування служб systemd та цілей.

source: Slide show displayed during package installation with YaST
ca: Presentació de diapositives mostrada durant la instal·lació de paquets amb el YaST
uk: Слайд-шоу показане під час інсталяції пакунку з YaST

source: The slide show displayed during package installation with YaST.
ca: La presentació de diapositives mostrada durant la instal·lació de paquets amb el YaST.
uk: Слайд-шоу, яке показується під час інсталяції пакунку з YaST.

source: YaST2 - SLP Agent and Library
ca: YaST2 - Agent i biblioteca SLP
de: YaST2 - SLP Agent und Bibliothek
fi: YaST2 – SLP-agentti ja -kirjasto
it: YaST2 - agente e libreria SLP
uk: YaST2 - Агент і бібліотека SLP

source: This package provides YaST modules to lookup/advertise services with SLP.
ca: Aquest paquet proporciona mòduls YaST per a serveis de cerca/publicitat amb SLP.
de: Dieses Paket enthält YaST-Module zur Umsetzung/Ankündigung von Diensten mit SLP.
fi: Tämä paketti tarjoaa YaST-moduuleja lookup/advertise palveluihin SLP:n avulla.
it: Questo pacchetto fornisce i moduli YaST per ricercare/segnalare servizi con SLP.
uk: Цей пакунок забезпечує модулі YaST для пошуку/реклами служб із SLP.

source: YaST2 SLP Daemon Server Configuration
ca: Configuració del servidor YaST2 SLP Daemon
de: YaST2-SLP-Daemon-Server-Konfiguration
fi: YaST2 – SLP-palvelumääritys
it: YaST2 - configurazione del server demone SLP
uk: Налаштування сервера служби YaST2 SLP

source: This package contains the YaST2 component for the configuration of an SLP daemon.
ca: Aquest paquet conté el component YaST2 per a la configuració d'un dimoni SLP.
de: Dieses Paket enthält die YaST2 Komponente zur Konfiguration eines SLP-Daemons.
fi: Tämä paketti sisältää SLP-palvelun YaST2-määritysosan.
it: Questo pacchetto contiene il componente YaST2 per la configurazione di un demone SLP.
uk: Цей пакунок містить компонент YaST2 для налаштування служби SLP.

source: YaST - file system snapshots review
ca: YaST - revisió de les instantànies de sistemes de fitxers
de: YaST - Überprüfung von Dateisystem-Snaphots
fi: YaST – tiedostojärjestelmän tilannekuvien tarkistelu
it: YaST - revisione delle istantanee del file system
uk: YaST - перегляд знімків файлової системи

source: YaST module for accessing and managing file-system snapshots
ca: Mòdul del YaSt per accedir i gestionar instantànies de sistemes de fitxers
de: YasT-Modul für den Zugriff und der Organisation von Dateisystem-Snapshots
fi: YaST moduuli tiedostojärjestelmän tilannekuvien käyttämistä ja hallintaa varten
it: Modulo YaST per l'accesso alle istantanee del file system e la gestione delle stesse
uk: Модуль YaST для доступу і управління знімками файлової системи

source: YaST2 - Sound Configuration
ca: YaST2 - Configuració de so
de: YaST2 - Soundkarten Konfiguration
fi: YaST2 – Ääniasetus
it: YaST2 - configurazione audio
uk: YaST2 — Налаштування звуку

source: This package contains the YaST2 component for sound card configuration.
ca: Aquest paquet conté el component YaST2 per a la configuració de la targeta de so.
de: Dieses Paket enthält die YaST2 Komponente zur Konfiguration einer Soundkarte.
fi: Tämä paketti sisältää YaST2-osan äänikortin määritykseen.
it: Questo pacchetto contiene il componente YaST2 per la configurazione della scheda audio.
uk: Цей пакунок містить компоненти YaST2 для налаштування звукової карти.

source: Configuration of squid
ca: Configuració del calamar
de: Konfiguration von Squid
fi: squid-asetus
it: Configurazione di squid
uk: Налаштування squid

source: YaST2 - Storage Configuration
ca: YaST2 - Configuració d'emmagatzematge
de: YaST2 Festplattenkonfiguration
fi: YaST2 – Talletustilan asetus
it: YaST2 - configurazione della memorizzazione
uk: YaST2 - Налаштування носія

source: This package contains the files for YaST2 that handle access to disk devices during installation and on an installed system. This YaST2 module uses libstorage-ng.
ca: Aquest paquet conté els fitxers per a YaST2 que gestionen l'accés als dispositius de disc durant la instal·lació i en un sistema instal·lat. Aquest mòdul YaST2 utilitza libstorage-ng.
de: Dieses Paket enthält alle YaST2-Dateien, die mit der Konfiguration von Festplatten während der Installation und im installierten System zu tun haben. Dieses YaST2-Modul verwendet libstorage-ng.
fi: Tämä paketti sisältää YaST2:n asennuksen aikaisen ja asennetun järjestelmän kiintolevyjen käytön tarjoavat tiedostot. Tämä YaST2-moduuli käyttää libstorage-ng:tä.
it: Questo pacchetto contiene i file per YaST2 che gestiscono l'accesso ai dischi durante l'installazione e su un sistema installato. Questo modulo YaST2 usa libstorage-ng.
uk: Цей пакунок містить файли для YaST2, які керують доступом до дискових пристроїв під час установки і на встановленій системі. Цей модуль YaST2 використовує libstorage-ng.

source: YaST2 - Sudo configuration
ca: YaST2 - Configuració Sudo
fi: YaST2 – Sudo-asetus
it: YaST2 - configurazione di sudo
uk: YaST2 - Налаштування Sudo

source: The YaST2 component for sudo configuration. It configures capabilities of users to run commands as root or other user.
ca: El component YaST2 per a la configuració del sudo. Configura les capacitats dels usuaris per executar ordres com a root o un altre usuari.
de: Die YaST2-Komponente zur sudo-Konfiguration. Es konfiguriert die Benutzer-Fähigkeiten Befehle als root oder einen anderen Benutzer auszuführen.
fi: YaST2-osa sudon määritykseen. Tarjoaa käyttäjätunnuksille mahdollisuuden suorittaa komentoja pää- tai muuna käyttäjänä.
it: Il componente YaST2 per la configurazione di sudo. Configura le capacità degli utenti di eseguire comandi come root o altro utente.
uk: Компонент YaST2 для налаштування sudo. Налаштовує можливості користувачів запуску команд від імені root або іншого користувача.

source: YaST2 - Support Inquiries
ca: YaST2 - Consultes de suport
de: YaST2 - Supportanfragen
fi: YaST2 – Tukikyselyt
it: YaST2 - support alle interrogazioni del sistema
uk: YaST2 - Запити в службу підтримки

source: This module allows you to collect system information for installation support in a standardized format.
ca: Aquest mòdul permet recollir informació del sistema per al suport d'instal·lació en un format estandarditzat.
de: Dieses Modul erlaubt es Systeminformationen für Installations-Support in einem standardisierten Format zu sammeln.
fi: Tällä moduulilla voi kerätä järjestelmätiedot vakioidussa muodossa asennustukea varten.
it: Questo modulo consente di raccogliere le informazioni sul sistema in un formato standardizzato per il supporto sull'installazione.
uk: Цей модуль дозволяє вам зібрати системну інформацію в стандартизованому форматі для служби підтримки встановлення.

source: YaST2 - Sysconfig Editor
ca: YaST2 - Editor de Sysconfig
fi: YaST2 – Sysconfig editori
it: YaST2 - editor di sysconfig
uk: YaST2 — Редактор sysconfig

source: A graphical /etc/sysconfig/* editor with integrated search and context information.
ca: Un editor gràfic /etc/sysconfig/* amb informació integrada de cerca i context.
de: Grafischer sysconfig-Editor mit integrierter Suche und Kontextinformationen.
fi: Graafinen /etc/sysconfig/* editori, jossa on integroidut haku- ja taustatiedot.
it: Un edito grafico di /etc/sysconfig/* con ricerca integrata e informazione di contesto.
uk: Графічний редактор /etc/sysconfig/* з інтегрованим пошуком і контекстною інформацією.

source: YaST2 - Testsuite
fi: YaST2 – Testipaketti
it: YaST2 - collezione di programmi per i test
uk: YaST2 - Набір тестів

source: This is a package for the YaST2 modules testsuite preparation and execution.
ca: Aquest és un paquet per a la preparació i execució dels testsuite dels mòduls YaST2.
de: Das ist ein Paket für die Vorbereitung und Ausführung der YaST2-Modul-Testsuite.
fi: Tämä on paketti YaST2-moduulien testipakettivalmisteluun ja -suorittamiseen.
it: Questo è un pacchetto per la preparazione e l'esecuzione di test sui moduli YaST2.
uk: Це пакунок для підготовки та виконання набору тестів модулів YaST2.

source: YaST2 - TFTP Server Configuration
ca: YaST2 - Configuració del servidor TFTP
de: YaST2 - Konfiguration des TFTP-Servers
fi: YaST2 – TFTP-palvelinasetus
it: YaST2 - configurazione del server TFTP
uk: YaST2 - Налаштування сервера TFTP

source: The YaST2 component for configuring a TFTP server. TFTP stands for Trivial File Transfer Protocol. It is used for booting over the network.
ca: El component YaST2 per configurar un servidor TFTP. TFTP significa Trivial File Transfer Protocol. S'utilitza per arrencar per la xarxa.
de: Die YaST2-Komponente zur Konfiguration eines TFTP-Servers. TFTP ist die Abkürzung von Trivial File Transfer Protocol. Es wird zum Booten über das Netzwerk benutzt.
fi: YaST2-osa TFTP-palvelimen (Trivial File Transfer Protocol) määrittämiseen. Palvelinta käytetään verkon yli käynnistämiseen.
it: Il componente YaST2 per la configurazione di un server TFTP. TFTP è un acronimo per protocollo di trasferimento di file triviale. Viene usato per l'avvio dei computer su rete.
uk: Компонент YaST2 для налаштування сервера TFTP. TFTP - це Trivial File Transfer Protocol. Використовується для завантаження через мережу.

source: YaST2 - Theme
ca: YaST2 - Tema
de: YaST2 - Thema
fi: YaST2 – Teema
it: YaST2 - Temi
uk: YaST2 - Тема

source: Contains necessary theming resources to use YaST2.
ca: Conté els recursos de tematització necessaris per utilitzar el YaST2.
de: Beinhaltet notwenigen Themenressourcen zur Nutzung von YaST2.
fi: Sisältää tarvittavat teemat YaST2:n käyttöön.
it: Contiene le risorse tematiche necessarie per utilizzare YaST2.
uk: Містить необхідні тематичні ресурси щодо використання YaST2.

source: YaST2 - Breeze icon theme
ca: YaST2 - Tema d'icones Brisa
de: YaST2 - Breeze Icon-Thema
fi: YaST2 – Breeze-kuvaketeema
it: YaST2 - Tema di icone Brezza
uk: YaST2 - тема піктограм Breeze

source: Contains icons in KDE Breeze style (from KDE Plasma 5).
ca: Conté icones a l'estil Brisa del KDE (des del Plasma 5 del KDE).
de: Beinhaltet Icons mit Stile von KDE Breeze (aus KDE Plasma 5).
fi: Sisältää KDE Breeze -tyylisiä kuvakkeita (KDE Plasma 5).
it: Contiene le icone di KDE in stile Brezza (di KDE Plasma 5).
uk: Містить піктограми в стилі KDE Breeze (з KDE Plasma 5).

source: YaST2 - Oxygen icon theme
ca: YaST2 - Tema d'icones de l'Oxygen
de: YaST2 - Oxygen-Icon-Thema
fi: YaST2 – Oxygen-kuvaketeema
it: YaST2 - Tema di icone Oxygen
uk: YaST2 - тема піктограм Oxygen

source: Contains icons in KDE Oxygen style (from KDE Plasma 4).
ca: Conté icones a l'estil Oxygen del KDE (des del Plasma 4 del KDE).
de: Beinhaltet Icons im Stile von KDE Oxygen (aus KDE Plasma 4).
fi: Sisältää KDE Oxygen -tyylisiä kuvakkeita (KDE Plasma 4).
it: Contiene le icone di KDE in stile Oxygen (di KDE Plasma 4).
uk: Містить піктограми в стилі KDE Oxygen (з KDE Plasma 4).

source: YaST2 - Translation Container Package
ca: YaST2 - Paquet de contenidor de traducció
de: YaST2 - Übersetzungs-Container-Paket
fi: YaST2 – Käännöspaketti
it: YaST2 - pacchetto contenitore delle traduzioni
uk: YaST2 - Пакунок контейнеру перекладів

source: This is a container package. Its only purpose is to build the yast2-trans-LL, yast2-trans-LLL, and yast2-trans-LL_CC packages as subpackages.
ca: Aquest és un paquet de contenidors. El seu únic propòsit és construir els paquets yast2-trans-LL, yast2-trans-LLL, i yast2-trans-LLCC com a subpaquets.
de: Das ist ein Container-Paket. Es hat nur den Sinn die Pakete yast2-trans-LL, yast2-trans-LLL, und yast2-trans-LL_CC als Sub-Pakete zu bauen.
fi: Tämä on säilöpaketti, jonka ainoa tarkoitus on koostaa alipaketeiksi yast2-trans-LL, yast2-trans-LLL ja yast2-trans-LL_CC.
it: Questo è un pacchetto contenitore. Il suo unico scopo è quello di generare i pacchetti yast2-trans-LL, yast2-trans-LLL e yast2-trans-LL_CC come sottopacchetti.
uk: Це контейнерний пакунок. Його мета - створення пакунків yast2-trans-LL, yast2-trans-LLL та yast2-trans-LL_CC як підпакунків.

source: YaST2 - Afrikaans Translations
ca: YaST2 - Traduccions afrikaans
de: YaST2 - Afrikanische Übersetzungen
fi: YaST2 – Afrikaansinkieliset käännökset
it: YaST2 - traduzioni afrikaans
uk: YaST2 - переклади африкаанс

source: YaST2 - Translations for Afrikaans.
ca: YaST2 - Traduccions per a afrikaans.
de: YaST2 - Übersetzungen für Afrikaner.
fi: YaST2:n afrikaansinkieliset käännökset.
it: YaST2 - traduzioni in afrikaans.
uk: YaST2 - переклади на мову африкаанс.

source: Internal: Require all YaST Translation Packages (Empty)
ca: Intern: requereix tots els paquets de traducció del YaST (Buit)
de: Intern: Benötigt alle YaST-Übersetzungspakete (Leer)
fi: Sisäinen: Vaadi kaikki YaST-käännöspaketit (tyhjä)
it: Interno: richiede tutti i pacchetti di traduzione di YaST (vuoto)
uk: Для внутрішнього використання: вимагає всі пакунки перекладів YaST (типово - порожній)

source: The package requires all YaST translation packages (yast2-trans-{??,??_??}). Otherwise it is empty. For internal use only.
ca: El paquet requereix tots els paquets de traducció del YaST (yast2-trans-{??,????}). En cas contrari, estarà buit. Només per a ús intern.
de: Das Paket benötigt all YaST-Übersetzungspakete (yast2-trans-{??,??_??}). Ansonsten ist es leer. Nur für interne Verwendung.
fi: Paketti vaatii YaSTin kaikki käännöspaketit (yast2-trans{??,??_??}). Muuten se on tyhjä. Vain sisäiseen käyttöön.
it: Il pacchetto richiede tutti i pacchetti di traduzione di YaST (yast2-trans-{??,??_??}). A parte questo, è vuoto. Per uso esclusivamente interno.
uk: Пакунок вимагає всі пакунки перекладів YaST (yast2-trans-{??,??_??}). Інакше - порожній. Тільки для внутрішнього використання.

source: YaST2 - Amharic Translations
ca: YaST2 - Traduccions amhàriques
uk: YaST2 - амхарські переклади

source: YaST2 - Translations for Amharic.
ca: YaST2 - Traduccions per a l'amhàric.
uk: YaST2 - переклади на амхарську мову.

source: YaST2 - Arabic Translations
ca: YaST2 - Traduccions en àrab
de: YaST2 - Arabische Übersetzungen
fi: YaST2 – Arabiankieliset käännökset
it: YaST2 - traduzioni arabe
uk: YaST2 - арабські переклади

source: YaST2 - Translations for Arabic.
ca: YaST2 - Traduccions per a l'àrab.
de: YaST2 - Übersetzungen für Araber.
fi: YaST2 – Käännökset arabiaksi.
it: YaST2 - traduzioni in arabo.
uk: YaST2 - переклади на арабську мову.

source: YaST2 - Asturian Translations
ca: YaST2 - Traduccions asturianes
de: YaST2 - Assurische Übersetzungen
fi: YaST2 – Asturiankieliset käännökset
it: YaST2 - traduzioni asturiane
uk: YaST2 - астурійські переклади

source: YaST2 - Translations for Asturian.
ca: YaST2 - Traduccions per a l'asturià.
de: YaST2 - Übersetzungen für Asturier.
fi: YaST2 – Käännökset asturiaksi.
it: YaST2 - traduzioni in asturiano.
uk: YaST2 - переклади на астурійську мову.

source: YaST2 - Byelorussian Translations
ca: YaST2 - Traduccions bielorusses
uk: YaST2 - переклади білоруською

source: YaST2 - Translations for Byelorussian (Belarusian).
ca: YaST2 - Traduccions per a bielorús (Belarús).
uk: YaST2 - переклади білоруською.

source: YaST2 - Bulgarian Translations
ca: YaST2 - Traduccions búlgares
de: YaST2 - Bulgarische Übersetzungen
fi: YaST2 – Bulgariankieliset käännökset
it: YaST2 - traduzioni bulgare
uk: YaST2 - болгарські переклади

source: YaST2 - Translations for Bulgarian.
ca: YaST2 - Traduccions per al búlgar.
de: YaST2 - Übersetzungen für Bulgaren.
fi: YaST2 - Käännökset bulgariaksi.
it: YaST2 - traduzioni in bulgaro.
uk: YaST2 - переклади на болгарську мову.

source: YaST2 - Bengali Translations
ca: YaST2 - Traduccions bengalí
de: YaST2 - Bengalische Übersetzungen
fi: YaST2 – Bengalinkieliset käännökset
it: YaST2 - traduzioni bengalesi
uk: YaST2 - бенгальські переклади

source: YaST2 - Translations for Bengali.
ca: YaST2 - Traduccions per al bengalí.
de: YaST2 - Übersetzungen für Bengalier.
fi: YaST2 – Käännökset bengaliksi.
it: YaST2 - traduzioni in bengali.
uk: YaST2 - переклади на бенгальську мову.

source: YaST2 - Bosnian Translations
ca: YaST2 - Traduccions bosnianes
de: YaST2 - Bosnische Übersetzungen
fi: YaST2 – Bosniankieliset käännökset
it: YaST2 - traduzioni bosniache
uk: YaST2 - боснійські переклади

source: YaST2 - Translations for Bosnian.
ca: YaST2 - Traduccions per al bosnià.
de: YaST2 - Übersetzungen für Bosnier.
fi: YaST2 – Käännökset bosniaksi.
it: YaST2 - traduzioni in bosniaco.
uk: YaST2 - переклади на боснійську мову.

source: YaST2 - Catalan Translations
ca: YaST2 - Traduccions en català
de: YaST2 - Katalanische Übersetzungen
fi: YaST2 – Katalaaninkieliset käännökset
it: YaST2 - traduzioni catalane
uk: YaST2 - каталонські переклади

source: YaST2 - Catalan translations.
ca: YaST2 - Traduccions en català.
de: YaST2 - Katalanische Übersetzungen.
fi: YaST2 – Käännökset katalaaniksi.
it: YaST2 - traduzioni in catalano.
uk: YaST2 - переклади на каталонську мову.

source: YaST2 - Czech Translations
ca: YaST2 - Traduccions en txec
de: YaST2 - Tschechische Übersetzungen
fi: YaST2 – Tšekinkieliset käännökset
it: YaST2 - traduzioni ceche
uk: YaST2 - чеські переклади

source: YaST2 - Czech translations.
ca: YaST2 - Traduccions en txec.
de: YaST2 - Tschechische Übersetzungen.
fi: YaST2 – Käännökset tšekiksi.
it: YaST2 - traduzioni in ceco.
uk: YaST2 - переклади на чеську мову.

source: YaST2 - Welsh Translations
ca: YaST2 - Traduccions en gal·lès
de: YaST2 - Walisische Übersetzungen
fi: YaST2 – Kymrinkieliset käännökset
it: YaST2 - traduzioni scozzesi
uk: YaST2 - валлійські переклади

source: YaST2 - Welsh translations.
ca: YaST2 - Traduccions al gal·lès.
de: YaST2 - Walisische Übersetzungen.
fi: YaST2 – Käännökset kymriksi.
it: YaST2 - traduzioni in scozzese.
uk: YaST2 - переклади на валлійську мову.

source: YaST2 - Danish Translations
ca: YaST2 - Traduccions daneses
de: YaST2 - Dänische Übersetzungen
fi: YaST2 – Tanskankieliset käännökset
it: YaST2 - traduzioni danesi
uk: YaST2 - датські переклади

source: YaST2 - Translations for Danish.
ca: YaST2 - Traduccions per al danès.
de: YaST2 - Übersetzungen für Dänen.
fi: YaST2 - Käännökset tanskaksi.
it: YaST2 - traduzioni in danese.
uk: YaST2 - переклади на датську мову.
