Repository: openSUSE/packages-i18n
Catalog: */po/yast2.*.po
Languages: ca, de, fi, it, uk

source: YaST2 - Configuration of Fibre Channel over Ethernet
ca: YaST2 - Configuració del canal de fibra sobre Ethernet
de: YaST2 - Konfiguration von Fibre Channel over Ethernet
fi: YaST2 - kuitukanavan määritys lähiverkon kautta
it: YaST2 - configurazione di Fibre Channel over Ethernet
uk: YaST2 - налаштування оптоволоконного каналу у локальній мережі

source: This package contains the YaST2 component for the Fibre Channel over Ethernet (FCoE) configuration.
ca: Aquest paquet conté el component YaST2 per a la configuració de Fibre Channel over Ethernet (FCoE).
de: Dieses Paket enthält die YaST2-Komponente für die Konfiguration von Fibre Channel over Ethernet (FCoE).
fi: Tämä paketti sisältää YaST2-komponentin kuitukanavan määritykseen lähiverkon kautta (FCoE).
it: Questo pacchetto contiene il componente YaST2 per la configurazione di Fibre Channel over Ethernet (FCoE).
uk: Цей пакунок містить компонент YaST2 для налаштування оптоволоконного каналу у локальній мережі (FCoE).

source: YaST2 - Firewall Configuration
ca: YaST2 - Configuració del tallafoc
de: YaST2 - Firewall-Konfiguration
fi: YaST2 - Palomuurin määritys
it: YaST2 - configurazione del firewall
uk: YaST2 — Налаштування мережного екрану

source: A YaST2 module to be used for configuring a firewall.
ca: Un mòdul YaST2 que s'utilitzarà per a configurar un tallafoc.
de: Ein YaST2-Modul zur Konfiguration einer Firewall.
fi: YaST-moduuli palomuurin määrittämiseen.
it: Un modulo YaST2 da usare per configurare un firewall.
uk: Модуль YaST2, що використовується для налаштування мережного екрану.

source: YaST2 - Initial System Configuration
ca: YaST2 - Configuració inicial del sistema
de: YaST2 - Erste Systemkonfiguration
fi: YaST2 - Järjestelmän ensimääritys
it: YaST2 - configurazione del sistema iniziale
uk: YaST2 — Початкове налаштування системи

source: The YaST firstboot utility runs after installation is completed. It guides the user through a series of steps that allows for easier configuration of the machine. YaST firstboot does not run by default and has to be configured to run by the user or the system administrator. It is useful for image deployments where the system in the image is completely configured, however some last steps like root password and user logins have to be created to personalize the system.
ca: La utilitat YaST firstboot s'executa després de completar la instal·lació. Orienta a l'usuari a través d'una sèrie de passos que permeten una configuració més fàcil de la màquina. El YaST firstboot no s'executa de manera predeterminada i ha de ser configurat per a executar-lo l'usuari o l'administrador del sistema. És útil per a desplegaments d'imatges on el sistema en la imatge està completament configurat, però s'han de crear alguns últims passos com la contrasenya de root i els inicis de sessió d'usuari per personalitzar el sistema.
de: Das YaST firstboot-Programm läuft nach Abschluss der Installation. Es führt den Benutzer durch eine Reihe von Schritten, die eine einfachere Konfiguration der Maschine ermöglichen. YaST firstboot läuft nicht standardmäßig und muss so konfiguriert werden, dass es vom Benutzer oder vom Systemadministrator ausgeführt wird. Es ist nützlich für Image-Deployments, bei denen das System im Abbild vollständig konfiguriert ist, aber einige letzte Schritte wie Root-Passwort und Benutzer-Logins erstellt werden müssen, um das System zu personalisieren.
fi: YaSTin ensikäynnistystyökalu suoritetaan asennuksen valmistuttua. Se helpottaa tietokoneen määrittämistä ohjaamalla käyttäjää vaihe vaiheelta. YaSTin ensikäynnistystä ei suoriteta oletuksena, vaan käyttäjän tai järjestelmän ylläpitäjän pitää määrittää se. Siitä on apua levykuvakäyttöönotoissa, jolloin levykuvalla oleva järjestelmä on täysin määritetty joitakin viimeistelyvaiheita kuten root-tunnuksen salasanaa ja muiden tunnusten luontia lukuun ottamatta.
it: Il programma di utilità di Yast firstboot viene eseguito dopo che l'installazione è stata completata. Guida l'utente attraverso una serie di passaggi che permettono una più semplice configurazione della macchina. Firstboot di YaST non viene eseguito in modo predefinito e deve essere configurato per essere eseguito dall'utente o dall'amministratore di sistema. È utile per l'installazione tramite immagini dove il sistema nell'immagine è completamente configurato, per quanto alcuni passi tipo la password di root e i login degli utenti devono essere creati per personalizzare il sistema.
uk: Застосунок YaST firstboot запускається після завершення встановлення. Він спрямовує користувача через низку кроків, які полегшують налаштування машини. Типово YaST firstboot не запускається і має бути налаштований для запуску користувачем або системним адміністратором. Це корисно для розгортання образів, коли система в образі повністю налаштована, однак для персоналізації системи необхідно створити деякі останні кроки, як-от пароль root та реєстрація облікових записів користувачів.

source: YaST2 firstboot settings for WSL images
ca: Configuració de la primera arrencada del YaST2 per a les imatges WSL
fi: YaST2:n ensikäynnistysasetukset WSL-kuville
uk: Налаштування YaST2 firstboot для образів WSL

source: YaST2 - FTP configuration
ca: YaST2 - Configuració FTP
de: YaST2 - FTP-Konfiguration
fi: YaST2 - FTP:n määritys
it: YaST2 - configurazione di FTP
uk: YaST2 - конфігурація FTP

source: This package contains the YaST2 component for FTP configuration. It can configure vsftpd.
ca: Aquest paquet conté el component YaST2 per a la configuració FTP. Pot configurar vsftpd.
de: Dieses Paket enthält die YaST2-Komponente zur FTP-Konfiguration. Es kann vsftpd konfigurieren.
fi: Tämä paketti sisältää YaST2-komponentin FTP-määritystä varten. Se voi myös määrittää vsftpd.
it: Questo pacchetto contiene il componente YaST2 per la configurazione del server FTP. Può configurare vsftpd.
uk: Цей пакунок містить компонент YaST2 для конфігурації FTP. Він може налаштувати vsftpd.

source: Configuration of booth
ca: Configuració del booth
de: Konfiguration von booth
fi: Booth-määritys
it: Configurazione di booth
uk: Налаштування booth

source: Group Policy Management Console for YaST
ca: Consola de gestió de polítiques de grup per al YaST
de: Gruppenrichtlinien-Verwaltungskonsole für YaST
fi: Ryhmäkäytäntöjen hallintakonsoli YaST:lle
uk: Консоль керування груповою політикою для YaST

source: The Group Policy Management console for YaST provides tools for creating and modifying Group Policy Objects in Active Directory.
ca: La consola de gestió de polítiques de grup per a YaST proporciona eines per crear i modificar objectes de política de grup en el directori actiu.
de: Die Gruppenrichtlinien-Verwaltungskonsole für YaST bietet Werkzeuge zur Erstellung und Modifizierung von Gruppenrichtlinien-Objekten in Active Directory.
fi: YaST hallintakonsoli tarjoaa työkaluja ryhmäkäytäntöjen luomiseen ja muokkaamiseen toimialueen (AD) hakemistopalvelussa.
uk: Консоль керування груповою політикою для YaST надає інструменти для створення та зміни об’єктів групової політики в Active Directory.

source: YaST2 - Hardware Detection Interface
ca: YaST2 - Interfície de detecció de maquinari
de: YaST2 - Interface der Hardware-Erkennung
fi: YaST2 - Laitetunnistusliityntä
it: YaST2 - interfaccia di rilevamento dell'hardware
uk: YaST2 - Інтерфейс визначення обладнання

source: This package contains the hardware detection library for YaST2.
ca: Aquest paquet conté la biblioteca de detecció de maquinari per al YaST2.
de: Dieses Paket enthält die Bibliothek der Hardware-Erkennung für YaST2.
fi: Tämä paketti sisältää YaST2:n laitetunnistuskirjaston.
it: Questo pacchetto contiene la libreria di rilevamento dell'hardware per YaST2.
uk: Цей пакунок містить бібліотеку YaST2 для визначення обладнання.

source: YaST2 - HTTP Server Configuration
ca: YaST2 - Configuració del servidor HTTP
de: YaST2 - HTTP-Server-Konfiguration
fi: YaST2 - HTTP-palvelimen määritys
it: YaST2 - configurazione del server HTTP
uk: YaST2 - Налаштування сервера HTTP

source: This package contains the YaST2 component for HTTP server (Apache2) configuration.
ca: Aquest paquet conté el component YaST2 per a la configuració del servidor HTTP (Apache2).
de: Dieses Paket enthält die YaST2-Komponente zur Konfiguration eines HTTP-Servers (Apache2).
fi: Tämä paketti sisältää YaST2-komponentin HTTP-palvelimen (Apache2) määrityksiin.
it: Questo pacchetto contiene il componente YaST2 per la configurazione del server HTTP (Apache2).
uk: Цей пакунок містить складову YaST2 для конфігурації сервера HTTP (Apache2).

source: YaST2 - Installation Parts
ca: YaST2 - Parts d'instal·lació
de: YaST2 - Installationsteile
fi: YaST2 - asennusosat
it: YaST2 - parti di installazione
uk: YaST2 — Модулі встановлення

source: System installation code as present on installation media.
ca: Codi d'instal·lació del sistema tal com està present en el mitjà d'instal·lació.
de: Entspricht dem Systeminstallations-Code auf dem Installations-Medium.
fi: Järjestelmän asennuskoodi sellaisena kuin se on asennusvälineessä.
it: Codice di installazione del sistema come presente nei supporti di installazione.
uk: Код системної установки, що міститься на інсталяційному носії.

source: YaST2 - RNG schema for installation control files
ca: YaST2 - Esquema RNG per als fitxers de control d'instal·lació
de: YaST2 - RNG-Schema für Installations-Steuerdateien
fi: YaST2 - RNG-kaavio asennuksen ohjaustiedostoille
it: YaST2 - schema RNG per i file di controllo dell'installazione
uk: YaST2 - схема RNG для файлів керування встановленням

source: This package contains RNG schema for validating the installation control files.
ca: Aquest paquet conté l'esquema RNG per a validar els fitxers de control d'instal·lació.
de: Dieses Paket enthält RNG-Schema zur Validierung der Installations-Steuerdateien.
fi: Tämä paketti sisältää RNG-kaavion asennuksen ohjaustiedostojen vahvistamiseen.
it: Questo pacchetto contiene lo schema RNG per la convalida dei file di controllo dell'installazione.
uk: Цей пакунок містить схему RNG для перевірки файлів керування встановленням.

source: YaST2 - Installation Server Configuration and Management
ca: YaST2 - Configuració i gestió del servidor d'instal·lació
de: YaST2 - Installations-Serverkonfiguration und -Verwaltung
fi: YaST2 - Asennuspalvelimen määritys ja hallinta
it: YaST2 - configurazione e gestione del server di installazione
uk: YaST2 - налаштування та керування сервером встановлення

source: This package allows you to configure an installation server suitable for installaing SUSE Linux over the network. Currently FTP, HTTP and NFS sources are supported.
ca: Aquest paquet permet configurar un servidor d'instal·lació adequat per instal·lar SUSE Linux a la xarxa. Actualment s'admeten fonts FTP, HTTP i NFS.
de: Mit diesem Paket können Sie einen Installationsserver konfigurieren, der die Installation von SUSE Linux über das Netzwerk ermöglicht. Derzeit werden FTP-, HTTP- und NFS-Quellen unterstützt.
fi: Tämä paketti sallii sinun määrittää asennuspalvelimen, jolla asentaa SUSE Linuxia verkossa. Tällä hetkellä tuetaan FTP-, HTTP- ja NFS-lähteitä.
it: Questo pacchetto permette di configurare un server di installazione adatto per installare SuSE Linux su rete. Al momento sono supportate le sorgenti FTP, HTTP e NFS.
uk: Цей пакунок дозволяє налаштувати сервер встановлення, придатний для встановлення SUSE Linux через мережу. На даний момент підтримуються джерела FTP, HTTP і NFS.

source: Configuration of iplb
ca: Configuració de l'iplb
de: Konfiguration von iplb
fi: Määritykset iplb
it: Configurazione di iplb
uk: Налаштування iplb

source: YaST2 - Configuration of IP load balance.With this module you can configure a IP load balance system, frequently used on high availability (HA) clusters.
ca: YaST2 - Configuració del balanç de càrrega IP.Amb aquest mòdul es pot configurar un sistema de balanç de càrrega IP, utilitzat freqüentment en clústers d'alta disponibilitat (HA).
de: YaST2 - Konfiguration der IP-Lastverteilung.Mit diesem Modul können Sie ein IP-Loadbalancer-System konfigurieren, was häufig auf Hochverfügbarkeits-Clustern (HA) verwendet wird.
fi: YaST2 - IP-kuormituksen tasapainon määritys. Tämän moduulin avulla voit määrittää IP-kuormituksen tasapainon, jota käytetään usein korkean käytettävyyden (HA) klustereissa.
it: YaST2 - configurazione del bilanciamento del carico IP. Con questo modulo è possibile configurare un sistema di bilanciamento del carico IP, usato frequentemente nei cluster HA, ad alta disponibilità.
uk: YaST2 - Налаштування балансування IP навантаження. За допомогою цього модуля ви можете налаштувати систему балансування IP навантаження, яка часто використовується в кластерах високої доступності (HA).

source: YaST2 - iSCSI Client Configuration
ca: YaST2 - Configuració del client iSCSI
de: YaST2 - iSCSI-Client-Konfiguration
fi: YaST2 - iSCSI-asiakkaan määritys
it: YaST2 - configurazione del client iSCSI
uk: YaST2 - Налаштування клієнта iSCSI

source: This package contains the YaST2 component for configuration of an iSCSI client.
ca: Aquest paquet conté el component YaST2 per a la configuració d'un client iSCSI.
de: Dieses Paket enthält die YaST2 Komponente zur Konfiguration eines iSCSI-Clients.
fi: Tämä paketti sisältää YaST2-komponentin iSCSI-asiakkaan määritystä varten.
it: Questo pacchetto contiene il componente YaST2 per la configurazione di un client iSCSI.
uk: Цей пакунок містить компонент YaST2 для налаштування клієнта iSCSI.

source: Configuration of iSCSI LIO target
ca: Configuració de l'objectiu iSCSI LIO
de: Konfiguration des iSCSI-LIO-Targets
fi: ISCSI LIO -kohteen määritys
it: Configurazione della destinazione iSCSI LIO
uk: Налаштування цільових iSCSI LIO

source: This package contains configuration of iSCSI LIO target
ca: Aquest paquet conté la configuració de l'objectiu iSCSI LIO
de: Dieses Paket enthält die Konfiguration des iSCSI-LIO-Targets
fi: Tämä paketti sisältää iSCSI LIO -kohteen määritykset
it: Questo pacchetto contiene il componente YaST2 per la configurazione della destinazione iSCSI LIO
uk: Цей пакунок містить налаштування цільових iSCSI LIO

source: Configuration of isns
ca: Configuració de l'ISS
de: Konfiguration von isns
fi: Määritys isns:lle
it: YaST2 - configurazione di isns
uk: Налаштування isns

source: YaST2 - Reading of systemd journal
ca: YaST2 - Lectura de la revista systemd
de: YaST2 - Lesen des systemd-Journals
fi: YaST2 - systemd-lokin tarkastelu
it: YaST2 - consultazione del journal di systemd
uk: YaST2 - Читання системного журналу systemd

source: A YaST2 module to read the systemd journal in a convenient and user-friendly way.
ca: Un mòdul YaST2 per llegir el diari systemd d'una manera còmoda i fàcil d'utilitzar.
de: Ein YaST2-Modul zum lesen des systemd-Journals auf einem praktischen und benutzerfreundlichen Weg.
fi: YaST2-moduuli systemd-lokin tarkastelemiseksi on kätevä ja käyttäjäystävällinen.
it: Un modulo YaST2 per consultare il journal di systemd in modo pratico e facile da usare.
uk: Модуль YaST2 для комфортного та зручного читання системного журналу systemd.

source: Configuration of kdump
ca: Configuració del kdump
de: Konfiguration von kdump
fi: Kdump-määritys
it: Configurazione di kdump
uk: Налаштування kdump

source: YaST2 - LDAP Agent
ca: YaST2 - Agent LDAP
fi: YaST2 - LDAP-asiakas
it: YaST2 - agente LDAP
uk: YaST2 — Агент LDAP

source: This agent is used by various YaST2 modules to work with LDAP. It enables searching the LDAP tree and adding/deleting/modifying items on an LDAP server.
ca: Aquest agent és utilitzat per diversos mòduls YaST2 per treballar amb LDAP. Permet cercar l'arbre LDAP i afegir/suprimir/modificar elements en un servidor LDAP.
de: Dieser Agent wird von verschiedenen YaST2-Modulen zur Zusammenarbeit mit LDAP benutzt. Damit kann man den LDAP-Baum durchsuchen und Einträge auf einem LDAP-Server hinzufügen/löschen/modifizieren.
fi: Tätä agenttia käytetään eri YaST2-moduuleissa LDAP:n kanssa. Se mahdollistaa LDAP-puun etsimisen ja LDAP-palvelimen kohteiden lisäämisen/poistamisen/muokkaamisen.
it: Questo agente viene usato da vari moduli YaST2 per lavorare con LDAP. Abilita la ricerca dell'albero LDAP e l'aggiunta/rimozione/modifica degli elementi su un server LDAP.
uk: Цей агент використовується різними модулями YaST2 для роботи з LDAP. Він дозволяє здійснювати пошук по дереву LDAP і додавати/видаляти/змінювати записи на сервері LDAP.

source: Scripts for handling YAST logs
ca: Scripts per a gestionar els registres YAST
de: Skripte zur Handhabung von YAST-Logdateien
fi: Skriptit YAST-lokien käsittelemiseksi
it: Script per gestire i log di YAST
uk: Сценарії для роботи з системними журналами YAST

source: This package contains scripts for handling YAST logs.
ca: Aquest paquet conté scripts per a gestionar els registres YAST.
de: Dieses Paket enthält Skripte zur Handhabung von YAST-Logdateien.
fi: Tämä paketti sisältää YAST-lokien käsittelyyn käytettäviä komentosarjoja.
it: Questo pacchetto contiene gli script per gestire i log di YAST.
uk: Цей пакунок містить сценарії для обробки системних журналів YAST.

source: YaST2 - Mail Configuration
ca: YaST2 - Configuració de correu
de: YaST2 - Mail-Konfiguration
fi: YaST2 - Sähköpostin määritys
it: YaST2 - configurazione della posta
uk: YaST2 — Налаштування пошти

source: The YaST2 component for mail configuration. It handles Postfix, Cyrus, Amavis and Fetchmail.
ca: El component YaST2 per a la configuració del correu. Gestiona Postfix, Cyrus, Amavis i Fetchmail.
de: Die YaST2-Komponente zur Mail-Konfiguration. Sie beherrscht Postfix, Cyrus, Amavis und Fetchmail.
fi: YaST2-osa sähköpostin määrittämiseen. Se hallitsee Postfixin, Cyrusin, Amavisin ja Fetchmailin.
it: Il componente YaST2 per la configurazione della posta. Gestisce Postfix, Cyrus, Amavis e Fetchmail.
uk: Компонент YaST2 для налаштування пошти. Підтримує Postfix, Cyrus, Amavis і Fetchmail.

source: YaST2 - Easy Installation of Add-on RPMs using Metapackages
ca: YaST2 - Fàcil instal·lació de RPMs de complements mitjançant Metapackages
de: YaST2 - Einfache Installation von Add-On RPMs mittels Metapaketen
fi: YaST2 - Helppo lisä-RPM:ien asennus metapaketteja käyttäen
it: YaST2 - installazione semplice di RPM aggiuntivi usando i meta-pacchetti
uk: YaST2 - Проста установка пакунків доповнень з використанням метапакунків

source: With this technology users can install packages and add repositories with a simple click on a link in a website.
ca: Amb aquesta tecnologia els usuaris poden instal·lar paquets i afegir repositoris amb un simple clic en un enllaç d'un lloc web.
de: Mit dieser Technologie können Benutzer mit einem einfachen Klick auf einer Webseite Pakete installieren und Repositorys hinzufügen.
fi: Tällä tekniikalla käyttäjät voivat asentaa paketteja ja lisätä ohjelmalähteitä yksinkertaisesti napsauttamalla verkkosivuston linkkejä.
it: Con questa tecnologia gli utenti possono installare i pacchetti e aggiungere i repository con un semplice clic su un collegamento su un sito web.
uk: За допомогою цієї технології користувачі можуть встановлювати пакети і додавати сховища простим натисканням мишки на web-сайті.

source: YaST2 - Online migration
ca: YaST2 - Migració en línia
fi: YaST2 reaaliaikainen muutos
uk: YaST2 - Онлайн міграція

source: This package contains the YaST2 component for online migration.
ca: Aquest paquet conté el component YaST2 per a la migració en línia.
de: Dieses Paket enthält die YaST2 Komponente zur Onlinemigration.
fi: Tämä paketti sisältää YaST2-komponentin verkkosiirtoa varten.
uk: Цей пакунок містить компонент YaST2 для онлайн міграції.

source: YaST2 - Multipath Configuration
ca: YaST2 - Configuració de multicamí
de: YaST2 - Multipfad-Konfiguration
fi: YaST2 - Multipath määritys
it: YaST2 - configurazione di multipath
uk: YaST2 - налаштування multipath

source: Multipath I/O is a fault tolerance technique whereby there is more than one physical path between the CPU in a computer system and its mass storage devices through the buses, controllers, switches, and bridge devices connecting them. You can configure your multipathed devices with this module.
ca: Multipath I/O és una tècnica de tolerància a fallades per la qual hi ha més d'un camí físic entre la CPU en un sistema informàtic i els seus dispositius d'emmagatzematge massiu a través dels autobusos, controladors, interruptors i dispositius pont que els connecten. Podeu configurar els vostres dispositius multicamí amb aquest mòdul.
de: Multipfad I/O ist eine übertriebene Toleranz-Technik, wobei es hier mehr als einen physikalischen Pfad zwischen der CPU in einem Computersystem und seinen Massenspeichereinheiten über die Bussysteme, Controller, Switche, und Bridge-Schnittstellen, die miteinander verbunden sind, gibt.
fi: Multipath I/O on vikasietotekniikka, jossa tietokoneen suorittimen ja sen massamuistilaitteiden välillä on useampi kuin yksi fyysinen polku, joka yhdistää ne väyliin, ohjaimiin, kytkimiin ja siltauksiin. Voit määrittää monipolkuisia laitteita tällä moduulilla.
it: L'I/O multipath è una tecnica di resistenza agli errori dove c'è più di un percorso fisico tra la CPU in un sistema e i suoi dispositivi di memorizzazione di massa attraverso bus, controllori, switch e dispositivi bridge che li collegano. Con questo modulo si possono configurare i dispositivi multipath.
uk: Multipath I/O – це метод відмовостійкості, при якому існує більше одного фізичного шляху між центральним процесором в комп’ютерній системі та його пристроями збереження інформації через шини, контролери, комутатори та мостові пристрої, що з’єднують їх. За допомогою цього модуля можна налаштувати свої multipath-пристрої.

source: YaST2 - Network Configuration
ca: YaST2 - Configuració de xarxa
de: YaST2 - Netzwerk Konfiguration
fi: YaST2 - Verkon määritys
it: YaST2 - configurazione di rete
uk: YaST2 — Налаштування мережі

source: This package contains the YaST2 component for network configuration.
ca: Aquest paquet conté el component YaST2 per a la configuració de la xarxa.
de: Dieses Paket enthält die YaST2 Komponente zur Netzwerkskonfiguration.
fi: Tämä paketti sisältää YaST2-osan verkon määrittämiseen.
it: Questo pacchetto contiene il componente YaST2 per la configurazione di rete.
uk: Цей пакунок містить компонент YaST2 для налаштування мережі.

source: YaST2 - NFS Configuration
ca: YaST2 - Configuració NFS
de: YaST2 - NFS- Konfiguration
fi: YaST2 - NFS:n määritys
it: YaST2 - configurazione di NFS
uk: YaST2 — Налаштування NFS

source: The YaST2 component for configuration of NFS. NFS stands for network file system access. It allows access to files on remote machines.
ca: El component YaST2 per a la configuració de NFS. NFS significa accés al sistema de fitxers de xarxa. Permet l'accés a fitxers en màquines remotes.
de: Die YaST2-Komponente für die Konfiguration des NFS. NFS (Network File System) ist das Standard-Dateisystem für Fileserver unter UNIX und im Internet. Dieses Paket ermöglicht den Zugriff auf Dateien entfernter Computer.
fi: YaST2-osa NFS:n määrittämiseen. NFS tulee sanoista "network file system", verkkotiedostojärjestelmä. Se mahdollistaa tiedostojen käyttämisen etäkoneilta.
it: Il componente YaST2 per la configurazione di NFS che indica l'accesso a file system di rete. Permette di accedere ai file su macchine remote.
uk: Компонент YaST2 для налаштування NFS. NFS означає «network file system», мережева файлова система. Дозволяє здійснювати доступ до файлів на віддалених машинах.

source: Configuration of NFS, common parts
ca: Configuració de NFS, parts comunes
de: Einrichtung von NFS, allgemeine Teile
fi: NFS:n määritys, yhteiset osat
it: Configurazione di NFS, parti comuni
uk: Конфігурація NFS, загальна частина
